{
  "url": "https://www.singaporetech.edu.sg/10th-anniversary/our-story",
  "title": "Our Story | SIT 10th Anniversary",
  "meta": {
    "description": null,
    "keywords": null
  },
  "text_lines": [
    "JavaScript is off. Please enable to view full site.",
    "JavaScript is off. Please enable to view full site.",
    "Home",
    "our story",
    "celebrations",
    "Contact",
    "Home",
    "our story",
    "celebrations",
    "Contact",
    "Journey to",
    "Punggol",
    "2024 is, in fact, a doubly special year for SIT. We celebrate our 10th anniversary as an Autonomous University, as well as move into our new home in the Punggol Digital District (PDD) — a campus integrated with industry and community to provide a vibrant, applied learning environment for students.",
    "But its history transcends the last 10 years. To fully appreciate the University's transformation, take a step back further in history to 2008. Here is a look at the memorable moments that have led SIT to where it is today.",
    "Let's Go",
    "2008",
    "A plan to create more university places",
    "Singapore's government aimed to increase the percentage of students entering government-funded universities (cohort participation rate) to 30% by 2015. To achieve this, they expanded the Poly-FSI scheme where polytechnics partner with overseas universities to offer wider degree options to diploma graduates, while maintaining high standards through careful planning and selection of reputable universities.",
    "2009",
    "SIT is formed",
    "Incorporated in September 2009, the Singapore Institute of Applied Technology (SIAT) aimed to provide more education pathways for Singaporeans to obtain university education. It was later renamed the ‘Singapore Institute of Technology (SIT)’ to offer reputable foreign university degrees locally, expanding on the Polytechnic-Foreign Specialised Institute (Poly-FSI) initiative.",
    "2010",
    "Enrolment begins in SIT",
    "By March 2010, SIT was ready to start admitting students — a year ahead of schedule.",
    "We would offer 8 degree programmes from 5 overseas universities. They were the Culinary Institute of America (CIA); Washington's DigiPen Institute of Technology; University of Nevada, Las Vegas (UNLV); the Technical University of Munich in Germany; and the Newcastle University in the United Kingdom.",
    "2011",
    "Places for A-Level holders, too",
    "Soon, word about SIT's intense admissions process — rigorous interview sessions, portfolio review and assessment of candidates' aptitude and prior work experience — got around. This piqued the interest of A-level graduates too.",
    "In 2011, in response to growing demand, SIT expanded our admissions criteria to include A-level holders.",
    "2012",
    "A New, Best-In-Class SIT",
    "To further increase the university cohort participation rate (CPR) to 40%, The Committee on University Education Pathways Beyond 2015 recommended developing SIT into an Autonomous University with a focus on applied learning and industry collaboration. This would distinguish SIT from existing universities and offer students a wider range of options. SIT aimed to become a full-fledged university by 2014 and planned our programmes based on future industry needs by partnering with industry leaders.",
    "2013",
    "Professor Tan Thiam Soon Appointed as the Second President of SIT",
    "In 2013, Professor Tan Thiam Soon became President of SIT, taking over the reins from founding President, Professor Tan Chin Tiong. He emphasised that university education is a journey of lifelong learning that builds skills rather than pursuing paper qualifications. The saying \"Once a SITizen, Always a SITizen\" describes SIT's students' lifelong learning journey.",
    "2014",
    "Meet SIT, Singapore's 5th Autonomous University",
    "The Singapore Institute of Technology (SIT) was set up in 2009, operating out of the 5 polytechnics in Singapore — providing high-quality degree programmes offered by our Overseas University partners.",
    "On March 28, 2014, we became Singapore's fifth Autonomous University and established our headquarters at 10 Dover Drive. We then began offering degree programmes in our own name. SIT pioneered a unique education model in Singapore, combining strong theoretical foundations with real-world applications.",
    "Read more",
    "2014",
    "Meet SIT, Singapore's 5th Autonomous University",
    "SIT was markedly different from other Autonomous Universities which had a strong research focus. At SIT, the emphasis was on applied learning and a practice-oriented education.",
    "Academic knowledge and skills had to be combined with real-world application, and learning paired with industry and community needs.To succeed, SIT needed to build close ties with industry partnersand identify growth areas of the economy.",
    "This was a fairly ambitious task that no university here had attemptedon a large scale. But SIT accepted the challenge. After all, the University had accumulated five years of experience working withOverseas University partners to design programmes aimed at plugging the gaps in different industries.",
    "Presenting the SIT Bill for it to become an Autonomous University in Parliament, Deputy Prime Minister Heng Swee Keat, who was then the Minister for Education, told the House: ‘By fostering a strong nexus with industry, it will enable our graduates to seize new and diverse job opportunities…By integrating a strong theoretical foundation with real-life applications, and by combining hard skills and a range of soft skills such as communications, problem solving and teamwork, graduates from the applied degree pathway can distinguish themselves.",
    "’For SIT, the passing of the Bill was a pivotal landmark. Then-SIT President Professor Tan Thiam Soon said: ‘This is an epochal moment for SIT and Singapore's higher education landscape. The establishment of SIT as Singapore's fifth Autonomous University will enable us to better serve our students and ultimately contribute more to our economy and nation.’",
    "2014",
    "Degrees At SIT, By SIT",
    "The new academic year also marked the start of the first three degree programmes awarded by SIT. Prior to this, SIT worked with overseas universities to offer degree programmes in Singapore. The three new programmes in Sustainable Infrastructure Engineering (Land), Information and Communications Technology (Software Engineering) and Accountancy aimed to plug gaps in the industry.",
    "2014",
    "Satellite Campuses At Polytechnics Ready For Class",
    "The satellite campuses across the five polytechnics were ready in end-2014. We welcomed our first students the following year in 2015.",
    "Read more",
    "2014",
    "Satellite Campuses At PolytechnicsReady For Class",
    "SIT was able to get up and running so quickly because of one key decision: Decentralisation. In the early days, it operated from satellite campuses across the five polytechnics in Singapore. At the start, SIT ran its lessons from the polytechnics, using facilities such as lecture theatres and laboratories.",
    "But as the number of offerings and students grew, SIT needed its own building to house its programmes. And so in each polytechnic sprang a brand-new SIT building, complete with specialised facilities targeted at specific programmes. At the satellite campus in Temasek Polytechnic, for instance, students in the Food Business Management programme have culinary demonstrations and wine and beverage training in a 30,000 sq ft facility that includes three professional teaching kitchens.",
    "2015",
    "IWSP Students Make Their Mark On Industry",
    "A core component of SIT's applied learning pedagogy, the IWSP allowed students to augment their theoretical knowledge with practical industry experience. The pioneer batch of IWSP students included 63 from the Accountancy programme, who kicked off their stint in January after going through a competitive recruitment process held by industry partners.",
    "2016",
    "Joint Nursing Degree To Offer Best Of Both Worlds",
    "Seven new applied degree programmes were introduced that year, including the Bachelor of Science with Honours in Nursing. Offered jointly by SIT and the University of Glasgow, the two-year programme's curriculum was co-created and designed with input from health practitioners across the care continuum and the Ministry of Health. All seven degree programmes also featured SIT's signature IWSP, which was launched in 2015 so our students could apply classroom knowledge in a real work environment.",
    "2016",
    "Launch Of Career Nexus To Open Doors For SITizens",
    "SIT kicked off our inaugural career fair by offering SITizens networking opportunities with over 100 industry partners. These included companies in the engineering and tech sectors, as well as ministries and statutory boards.",
    "2017",
    "SIT Confers Its First Degrees",
    "SIT's pioneer cohorts graduated in 2017 and 2018 from various degree programmes, with over 90% employed within six months of graduation. Over the years, the Graduate Employment Survey (GES) has shown positive results, confirming the success of SIT's model of applied learning.",
    "2017",
    "Bringing Lifelong Learning To More Working Adults",
    "In the age of disruption to industry, upskilling is more important than ever for working professionals who wish to stay relevant. To help more working adults access higher education, SIT launched our lifelong learning division, SITLEARN Professional Development, in April 2017.",
    "Read more",
    "2017",
    "Bringing Lifelong Learning To More Working Adults",
    "SITLEARN offers courses and certificates for working adults looking to upgrade, as well as customised training courses for companies seeking to retrain their workforce. Courses are co-taught by SIT faculty and industry experts. By 2023, more than 16,000 participants from over 1,000 companies have benefited from SITLEARN's offerings.",
    "These include over:",
    "- 240 courses in five key domains, ranging from Business, Communication and Design to Infocomm Technology.",
    "- 16,000 participants",
    "- 1,000 companies",
    "- 240 courses",
    "2017",
    "Microgrid, Macro Aspirations",
    "SIT's upcoming campus in Punggol will break ground in more than one way. Apart from being co-located with industry partners in the PDD, it will also be the first campus in Singapore — and the region — to be equipped with a Multi-Energy Microgrid (MEMG). When completed in 2024, it will be Singapore's largest private microgrid.",
    "2018",
    "A Bridge Between Industry And Academia",
    "A model of the upcoming PDD was unveiled to thepublic for the first time on January 21, 2018. Visitors to the exhibition at Waterway Point were able to feast their eyes on gleaming miniature buildings nestled among lush green spaces. Among them were buildings belonging to SIT, whose new centralised campus would spring up on the site by 2024.",
    "2019",
    "Breaking New Ground at Punggol",
    "SIT's groundbreaking ceremony for our Punggol Campus on September 10, 2019 marked the beginning of an exciting chapter for our University.",
    "The Punggol Campus is nearly twice the combined capacity of SIT's current campuses, and sits on two plots of land about the size of 17 football fields. Green technologies will be integrated with the buildings to improve energy efficiency and reduce the University's carbon footprint. The MEMG will draw from multiple energy sources, including solar photovoltaic (PV) panels. Up to 10,000 sqm of PV panels will be arranged on building rooftops. Once fully operational, it could generate enough energy to power 1,000 four-room flats annually.",
    "Read more",
    "2019",
    "Breaking New Ground at Punggol",
    "Prime Minister Lee Hsien Loong officiated at the groundbreaking ceremony of SIT's new campus on September 10, 2019, where he congratulated the University on yet another milestone.",
    "Ten years after its founding and five years after its establishment as an Autonomous University, SIT was set to move to a new campus at PDD.",
    "Due to be ready in 2024, the campus will be home to Southeast Asia's first Multi-Energy Microgrid, which will aid Singapore's transition to a low-carbon energy future.",
    "This tie-up between SIT and SP Group underscores the University's mission to keep abreast of industry developments through applied learning.",
    "2020",
    "SIT Marks New Milestone",
    "SIT became Singapore's third-largest Autonomous University by full-time undergraduate intake, after NUS and NTU. As Singapore's only university of applied learning, we are constantly expanding our degree offerings to meet evolving industry needs. Some 8,000 students are enrolled in our 38 undergraduate courses, which range from accountancy to speech and language therapy. The robust enrolment signals growing confidence in SIT's unique pedagogy of applied learning.",
    "2021",
    "Launched The Competency-Based Workplace Learning Pathway at SkillsFuture@SIT",
    "In partnership with SkillsFuture Singapore (SSG), SIT hosted SkillsFuture@SIT, a webinar centred on the theme of ‘Supporting Industry Transformation through Upskilling Singapore's Workforce’. The event also featured the launch of SIT's pilot Competency-Based Workplace Learning pathway in collaboration with Ensign InfoSecurity Pte Ltd, LTA, SBS Transit Ltd and SMRT Corporation Ltd.",
    "Read more",
    "2021",
    "Launched The Competency-Based Workplace Learning Pathway at SkillsFuture@SIT",
    "At SIT, ‘learning on the job’ means exactly that. In 2021, it inked two Memoranda of Understanding (MoU) with industry partners, cementing its pilot CBWL pathway.",
    "Targeted at workplace learners, the pathway provides more opportunities for working adults to pursue a degree while working.",
    "It also takes into account learners' existing competencies.",
    "The push for workers to upskill was a timely one. At the signing of the MoU, Minister for Education Chan Chun Sing emphasised that the biggest challenge faced by economies was to produce graduates with relevant skills, given rapidly evolving industries.",
    "Four industry partners from the cybersecurity and transport sectors signed the MoU. Soon after, two pilot programmes were launched.",
    "They were the Bachelor of Engineering with Honours in Information and Communications Technology (Information Security) and the Master of Engineering Technology and Bachelor of Engineering with Honours in Sustainable Infrastructure Engineering (Land).",
    "2022",
    "Passing The Baton",
    "From becoming an Autonomous University to getting the green light for a new permanent campus, SIT hit many milestones under the watch of its second President, Professor Tan Thiam Soon. After 9 years, it was time to pass the baton. On 1 January 2022, Professor Chua Kee Chaing stepped into the role. As SIT's third President, he would steer the University towards the next phase of growth, deepening applied learning and applied research initiatives to produce work-ready graduates and postgraduates.",
    "Read more",
    "2022",
    "Passing The Baton",
    "Professor Tan, who joined SIT in early 2013, remains part of its leadership as Institute Professor, supporting the new President and mentoring the University's younger leaders.",
    "As SIT's second President, Professor Tan helped push for the Institute to become an Autonomous University in March 2014.",
    "Later, he led efforts to secure approval and funding for a new centralised campus in Punggol. He also launched the IWSP, SIT's flagship programme that has become the cornerstone of its applied learning pedagogy. ‘Increasingly, the future is not going to be defined by a paper qualification. It is going to be defined by real skill sets,’ he had said in an interview.",
    "Professor Chua has built on his predecessor's efforts, rolling out new initiatives to burnish SIT's standing as Singapore's first university of applied learning.",
    "For instance, he oversaw the launch of Singapore's first Competency‑based Stackable Micro-credential (CSM) pathway for working adults, which offers targeted and bite-sized learning to arm them with specific skills that add up to a degree — in line with their career aspirations and industry demand.",
    "SIT's mission statement was tweaked in 2022 to reflect greater efforts towards applied learning: ‘To maximise the potential of our learners and to innovate with industry, through an integrated applied learning and research approach, so as to contribute to the economy and society.’",
    "‘I am deeply honoured to be given the opportunity to lead SIT into its next phase of growth, and I look forward to working with all stakeholders of SIT to further strengthen our mission as Singapore's premier University of Applied Learning,’ said Professor Chua.",
    "2022",
    "Changing Of The Guard",
    "The University also welcomed a new Chairman to our Board of Trustees in March — Mr Bill Chang, who took over the reins from Dr Ng Yat Chung. Dr Ng was conferred an Honorary Degree of Doctor of Lettersin recognition of his leadership in developing SIT's applied learning focus.",
    "Read more",
    "2022",
    "Changing Of The Guard",
    "2022 was looking to be a year of many changes.Following the appointment of its third President, SIT welcomed Mr Bill Chang as the second Chairman of its Board of Trustees onMarch 16, 2022.",
    "Mr Chang, Chief Executive Officer, Digital InfraCo, Singtel, succeeded Dr Ng Yat Chung, who had held the position for more than 12 years.",
    "Mr Chang said: ‘I am honoured with this appointment as Chairman of SIT at an exciting time for the University. SIT's mission to groom young talent to be work-ready professionals and lifelong learners who contribute to, and impact both industry and our society, resonates strongly with me.’",
    "2022",
    "The New Future Of Work With Stackable Micro-credentials",
    "Working adults can now brush up their skills in the information and communications technology sector via a new pathway at SIT. The pilot programme, known as the Competency-based Stackable Micro-credential (CSM) pathway, would allow them to earn qualifications in specific topics, such as cybersecurity, that can stack up to an SIT degree. The micro-credentials will be offered through SIT's Bachelor of Science with Honours in Applied Computing, and may be expanded to more degree programmes in the future.",
    "2023",
    "Never Too Old To Learn At STLA",
    "The SIT Teaching and Learning Academy (STLA) launched at SIT's fourth Applied Learning Conference, aims to enhance the University's competency-based education, focusing on skill mastery over traditional qualifications.",
    "STLA adopts Recognition of Prior Learning, a new approach allowing learners to leverage past experiences to accelerate degree completion.",
    "Minister for Education Chan Chun Sing described STLA as ‘a significant step towards building new capabilities in our adult learning and education landscape’.",
    "2023",
    "A New Home Awaits",
    "SIT's Punggol Campus reached a construction milestone with its Topping Out Ceremony. Opening in 2024, the campus will foster industry collaboration and hands-on learning through innovative spaces.",
    "Read more",
    "2023",
    "A New Home Awaits",
    "As the last structural beam at its new home fell into place, SITizens moved one step closer to coming under one roof.",
    "At the topping out ceremony held at the Punggol site on May 22, SIT President Professor Chua Kee Chaing said: ‘We are very excited about this impending move not just because this will be a beautiful new campus, but also because the whole of SIT will be together in one location for the first time.’",
    "Currently based in six separate campuses across the five polytechnics and its headquarters in Dover Drive, the SIT family will move in phases to the Punggol Campus, which can accommodate 12,000 students. Minister for Education Chan Chun Sing said at the topping out ceremony that SIT ‘will become a central part of the Punggol Digital District’.",
    "Quote - ‘I am very happy to see that it has adhered to the basic philosophy of how we want this building to be integrated with the rest of the community, with the industry, and also to allow the cross-pollination of ideas across different disciplines and different sectors.’ said Mr Chan on May 22, 2023.",
    "2024",
    "Building Tomorrow, Today",
    "After a decade of being recognised as an Autonomous University, SIT is finally getting a campus that it can truly call its own. The new Punggol Campus — built on a living lab concept — aims to deepen the authenticity of SIT's applied learning pedagogy, and catalyse projects between faculty, students, industry and the community.",
    "Located within the heart of the Punggol Digital District, the University will be a knowledge hub for Punggol and the surrounding towns.",
    "Read more",
    "2024",
    "Building Tomorrow, Today",
    "Dotted with trees and open spaces, the new centralised campus in the PDD — aptly termed ‘campus-in-a-park’ — is alive in more ways than one. Greenery adds a touch of the verdant to angular buildings; solar panels glint on the rooftops, feeding electricity back into the University's private microgrid.",
    "Its ideascapes also thrum with life. Built on a ‘living lab’ concept, the University is a test-bed for new prototypes and solutions generated at the intersection of academia and industry. This effort is aimed at transforming Singapore into a thriving innovation hub.",
    "Collaboration with industry partners has already begun. For instance, SIT is working with cyber intelligence firm Group IB to design and engineer virtual testing environments for start-ups looking to fend off cyberattacks. Group IB is part of the first batch of four international firms to set up shop in the PDD, alongside Boston Dynamics, Delta Electronics Int'l (Singapore), and Wanxiang. Such projects will only become more common as local and international firms take root in the PDD. As Singapore's first university of applied learning, SIT will benefit greatly from the surrounding industry network — and, in turn, generate solutions to benefit both its neighbours and industry-at-large.",
    "But it's not just industry partners who are making an impact — so are philanthropists like Mr Kwek Leng Beng, the property tycoon who donated $24 million to SIT in 2023. This donation was matched by the government, bringing the total SIT endowment to $60 million. ‘Through this SIT donation, I am privileged to play a part in building future generations of talent and professionals for Singapore, especially in hospitality,’ said Mr Kwek at the event to announce his donation, which also saw the unveiling of a Lego model of a new administrative building. The model was built by SIT students. In appreciation of Mr Kwek's endowed gift, SIT has named the new administrative building — which will house academic and administrative staff — the Kwek Leng Beng University Tower.",
    "Celebrating",
    "a decade of",
    "growth",
    "and",
    "innovation",
    "As the University celebrates a decade of impact, SIT has produced a commemorative book entitled 'Journey to Punggol'. The book looks back at the journey that SIT has taken as Singapore's first university of applied learning, and chronicles its key milestones in the past decade.",
    "Download the book",
    "{\"path\":{\"baseUrl\":\"\\/10th-anniversary\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/2\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"user\":{\"uid\":0,\"permissionsHash\":\"a9079e72c71dbe766c82a42d490f2eed36efcf2ac1e1543b362c0cbe222f5c9e\"}}"
  ],
  "desc_divs": [],
  "article_texts": [
    "2008\nA plan to create more university places\nSingapore's government aimed to increase the percentage of students entering government-funded universities (cohort participation rate) to 30% by 2015. To achieve this, they expanded the Poly-FSI scheme where polytechnics partner with overseas universities to offer wider degree options to diploma graduates, while maintaining high standards through careful planning and selection of reputable universities.",
    "2009\nSIT is formed\nIncorporated in September 2009, the Singapore Institute of Applied Technology (SIAT) aimed to provide more education pathways for Singaporeans to obtain university education. It was later renamed the ‘Singapore Institute of Technology (SIT)’ to offer reputable foreign university degrees locally, expanding on the Polytechnic-Foreign Specialised Institute (Poly-FSI) initiative.",
    "2010\nEnrolment begins in SIT\nBy March 2010, SIT was ready to start admitting students — a year ahead of schedule.\nWe would offer 8 degree programmes from 5 overseas universities. They were the Culinary Institute of America (CIA); Washington's DigiPen Institute of Technology; University of Nevada, Las Vegas (UNLV); the Technical University of Munich in Germany; and the Newcastle University in the United Kingdom.",
    "2011\nPlaces for A-Level holders, too\nSoon, word about SIT's intense admissions process — rigorous interview sessions, portfolio review and assessment of candidates' aptitude and prior work experience — got around. This piqued the interest of A-level graduates too.\nIn 2011, in response to growing demand, SIT expanded our admissions criteria to include A-level holders.",
    "2012\nA New, Best-In-Class SIT\nTo further increase the university cohort participation rate (CPR) to 40%, The Committee on University Education Pathways Beyond 2015 recommended developing SIT into an Autonomous University with a focus on applied learning and industry collaboration. This would distinguish SIT from existing universities and offer students a wider range of options. SIT aimed to become a full-fledged university by 2014 and planned our programmes based on future industry needs by partnering with industry leaders.",
    "2013\nProfessor Tan Thiam Soon Appointed as the Second President of SIT\nIn 2013, Professor Tan Thiam Soon became President of SIT, taking over the reins from founding President, Professor Tan Chin Tiong. He emphasised that university education is a journey of lifelong learning that builds skills rather than pursuing paper qualifications. The saying \"Once a SITizen, Always a SITizen\" describes SIT's students' lifelong learning journey.",
    "2014\nMeet SIT, Singapore's 5th Autonomous University\nThe Singapore Institute of Technology (SIT) was set up in 2009, operating out of the 5 polytechnics in Singapore — providing high-quality degree programmes offered by our Overseas University partners.\nOn March 28, 2014, we became Singapore's fifth Autonomous University and established our headquarters at 10 Dover Drive. We then began offering degree programmes in our own name. SIT pioneered a unique education model in Singapore, combining strong theoretical foundations with real-world applications.\nRead more\n2014\nMeet SIT, Singapore's 5th Autonomous University\nSIT was markedly different from other Autonomous Universities which had a strong research focus. At SIT, the emphasis was on applied learning and a practice-oriented education.\nAcademic knowledge and skills had to be combined with real-world application, and learning paired with industry and community needs.To succeed, SIT needed to build close ties with industry partnersand identify growth areas of the economy.\nThis was a fairly ambitious task that no university here had attemptedon a large scale. But SIT accepted the challenge. After all, the University had accumulated five years of experience working withOverseas University partners to design programmes aimed at plugging the gaps in different industries.\nPresenting the SIT Bill for it to become an Autonomous University in Parliament, Deputy Prime Minister Heng Swee Keat, who was then the Minister for Education, told the House: ‘By fostering a strong nexus with industry, it will enable our graduates to seize new and diverse job opportunities…By integrating a strong theoretical foundation with real-life applications, and by combining hard skills and a range of soft skills such as communications, problem solving and teamwork, graduates from the applied degree pathway can distinguish themselves.\n’For SIT, the passing of the Bill was a pivotal landmark. Then-SIT President Professor Tan Thiam Soon said: ‘This is an epochal moment for SIT and Singapore's higher education landscape. The establishment of SIT as Singapore's fifth Autonomous University will enable us to better serve our students and ultimately contribute more to our economy and nation.’",
    "2014\nDegrees At SIT, By SIT\nThe new academic year also marked the start of the first three degree programmes awarded by SIT. Prior to this, SIT worked with overseas universities to offer degree programmes in Singapore. The three new programmes in Sustainable Infrastructure Engineering (Land), Information and Communications Technology (Software Engineering) and Accountancy aimed to plug gaps in the industry.",
    "2014\nSatellite Campuses At Polytechnics Ready For Class\nThe satellite campuses across the five polytechnics were ready in end-2014. We welcomed our first students the following year in 2015.\nRead more\n2014\nSatellite Campuses At PolytechnicsReady For Class\nSIT was able to get up and running so quickly because of one key decision: Decentralisation. In the early days, it operated from satellite campuses across the five polytechnics in Singapore. At the start, SIT ran its lessons from the polytechnics, using facilities such as lecture theatres and laboratories.\nBut as the number of offerings and students grew, SIT needed its own building to house its programmes. And so in each polytechnic sprang a brand-new SIT building, complete with specialised facilities targeted at specific programmes. At the satellite campus in Temasek Polytechnic, for instance, students in the Food Business Management programme have culinary demonstrations and wine and beverage training in a 30,000 sq ft facility that includes three professional teaching kitchens.",
    "2015\nIWSP Students Make Their Mark On Industry\nA core component of SIT's applied learning pedagogy, the IWSP allowed students to augment their theoretical knowledge with practical industry experience. The pioneer batch of IWSP students included 63 from the Accountancy programme, who kicked off their stint in January after going through a competitive recruitment process held by industry partners.",
    "2016\nJoint Nursing Degree To Offer Best Of Both Worlds\nSeven new applied degree programmes were introduced that year, including the Bachelor of Science with Honours in Nursing. Offered jointly by SIT and the University of Glasgow, the two-year programme's curriculum was co-created and designed with input from health practitioners across the care continuum and the Ministry of Health. All seven degree programmes also featured SIT's signature IWSP, which was launched in 2015 so our students could apply classroom knowledge in a real work environment.",
    "2016\nLaunch Of Career Nexus To Open Doors For SITizens\nSIT kicked off our inaugural career fair by offering SITizens networking opportunities with over 100 industry partners. These included companies in the engineering and tech sectors, as well as ministries and statutory boards.",
    "2017\nSIT Confers Its First Degrees\nSIT's pioneer cohorts graduated in 2017 and 2018 from various degree programmes, with over 90% employed within six months of graduation. Over the years, the Graduate Employment Survey (GES) has shown positive results, confirming the success of SIT's model of applied learning.",
    "2017\nBringing Lifelong Learning To More Working Adults\nIn the age of disruption to industry, upskilling is more important than ever for working professionals who wish to stay relevant. To help more working adults access higher education, SIT launched our lifelong learning division, SITLEARN Professional Development, in April 2017.\nRead more\n2017\nBringing Lifelong Learning To More Working Adults\nSITLEARN offers courses and certificates for working adults looking to upgrade, as well as customised training courses for companies seeking to retrain their workforce. Courses are co-taught by SIT faculty and industry experts. By 2023, more than 16,000 participants from over 1,000 companies have benefited from SITLEARN's offerings.\nThese include over:\n- 240 courses in five key domains, ranging from Business, Communication and Design to Infocomm Technology.\n- 16,000 participants\n- 1,000 companies\n- 240 courses",
    "2017\nMicrogrid, Macro Aspirations\nSIT's upcoming campus in Punggol will break ground in more than one way. Apart from being co-located with industry partners in the PDD, it will also be the first campus in Singapore — and the region — to be equipped with a Multi-Energy Microgrid (MEMG). When completed in 2024, it will be Singapore's largest private microgrid.",
    "2018\nA Bridge Between Industry And Academia\nA model of the upcoming PDD was unveiled to thepublic for the first time on January 21, 2018. Visitors to the exhibition at Waterway Point were able to feast their eyes on gleaming miniature buildings nestled among lush green spaces. Among them were buildings belonging to SIT, whose new centralised campus would spring up on the site by 2024.",
    "2019\nBreaking New Ground at Punggol\nSIT's groundbreaking ceremony for our Punggol Campus on September 10, 2019 marked the beginning of an exciting chapter for our University.\nThe Punggol Campus is nearly twice the combined capacity of SIT's current campuses, and sits on two plots of land about the size of 17 football fields. Green technologies will be integrated with the buildings to improve energy efficiency and reduce the University's carbon footprint. The MEMG will draw from multiple energy sources, including solar photovoltaic (PV) panels. Up to 10,000 sqm of PV panels will be arranged on building rooftops. Once fully operational, it could generate enough energy to power 1,000 four-room flats annually.\nRead more\n2019\nBreaking New Ground at Punggol\nPrime Minister Lee Hsien Loong officiated at the groundbreaking ceremony of SIT's new campus on September 10, 2019, where he congratulated the University on yet another milestone.\nTen years after its founding and five years after its establishment as an Autonomous University, SIT was set to move to a new campus at PDD.\nDue to be ready in 2024, the campus will be home to Southeast Asia's first Multi-Energy Microgrid, which will aid Singapore's transition to a low-carbon energy future.\nThis tie-up between SIT and SP Group underscores the University's mission to keep abreast of industry developments through applied learning.",
    "2020\nSIT Marks New Milestone\nSIT became Singapore's third-largest Autonomous University by full-time undergraduate intake, after NUS and NTU. As Singapore's only university of applied learning, we are constantly expanding our degree offerings to meet evolving industry needs. Some 8,000 students are enrolled in our 38 undergraduate courses, which range from accountancy to speech and language therapy. The robust enrolment signals growing confidence in SIT's unique pedagogy of applied learning.",
    "2021\nLaunched The Competency-Based Workplace Learning Pathway at SkillsFuture@SIT\nIn partnership with SkillsFuture Singapore (SSG), SIT hosted SkillsFuture@SIT, a webinar centred on the theme of ‘Supporting Industry Transformation through Upskilling Singapore's Workforce’. The event also featured the launch of SIT's pilot Competency-Based Workplace Learning pathway in collaboration with Ensign InfoSecurity Pte Ltd, LTA, SBS Transit Ltd and SMRT Corporation Ltd.\nRead more\n2021\nLaunched The Competency-Based Workplace Learning Pathway at SkillsFuture@SIT\nAt SIT, ‘learning on the job’ means exactly that. In 2021, it inked two Memoranda of Understanding (MoU) with industry partners, cementing its pilot CBWL pathway.\nTargeted at workplace learners, the pathway provides more opportunities for working adults to pursue a degree while working.\nIt also takes into account learners' existing competencies.\nThe push for workers to upskill was a timely one. At the signing of the MoU, Minister for Education Chan Chun Sing emphasised that the biggest challenge faced by economies was to produce graduates with relevant skills, given rapidly evolving industries.\nFour industry partners from the cybersecurity and transport sectors signed the MoU. Soon after, two pilot programmes were launched.\nThey were the Bachelor of Engineering with Honours in Information and Communications Technology (Information Security) and the Master of Engineering Technology and Bachelor of Engineering with Honours in Sustainable Infrastructure Engineering (Land).",
    "2022\nPassing The Baton\nFrom becoming an Autonomous University to getting the green light for a new permanent campus, SIT hit many milestones under the watch of its second President, Professor Tan Thiam Soon. After 9 years, it was time to pass the baton. On 1 January 2022, Professor Chua Kee Chaing stepped into the role. As SIT's third President, he would steer the University towards the next phase of growth, deepening applied learning and applied research initiatives to produce work-ready graduates and postgraduates.\nRead more\n2022\nPassing The Baton\nProfessor Tan, who joined SIT in early 2013, remains part of its leadership as Institute Professor, supporting the new President and mentoring the University's younger leaders.\nAs SIT's second President, Professor Tan helped push for the Institute to become an Autonomous University in March 2014.\nLater, he led efforts to secure approval and funding for a new centralised campus in Punggol. He also launched the IWSP, SIT's flagship programme that has become the cornerstone of its applied learning pedagogy. ‘Increasingly, the future is not going to be defined by a paper qualification. It is going to be defined by real skill sets,’ he had said in an interview.\nProfessor Chua has built on his predecessor's efforts, rolling out new initiatives to burnish SIT's standing as Singapore's first university of applied learning.\nFor instance, he oversaw the launch of Singapore's first Competency‑based Stackable Micro-credential (CSM) pathway for working adults, which offers targeted and bite-sized learning to arm them with specific skills that add up to a degree — in line with their career aspirations and industry demand.\nSIT's mission statement was tweaked in 2022 to reflect greater efforts towards applied learning: ‘To maximise the potential of our learners and to innovate with industry, through an integrated applied learning and research approach, so as to contribute to the economy and society.’\n‘I am deeply honoured to be given the opportunity to lead SIT into its next phase of growth, and I look forward to working with all stakeholders of SIT to further strengthen our mission as Singapore's premier University of Applied Learning,’ said Professor Chua.",
    "2022\nChanging Of The Guard\nThe University also welcomed a new Chairman to our Board of Trustees in March — Mr Bill Chang, who took over the reins from Dr Ng Yat Chung. Dr Ng was conferred an Honorary Degree of Doctor of Lettersin recognition of his leadership in developing SIT's applied learning focus.\nRead more\n2022\nChanging Of The Guard\n2022 was looking to be a year of many changes.Following the appointment of its third President, SIT welcomed Mr Bill Chang as the second Chairman of its Board of Trustees onMarch 16, 2022.\nMr Chang, Chief Executive Officer, Digital InfraCo, Singtel, succeeded Dr Ng Yat Chung, who had held the position for more than 12 years.\nMr Chang said: ‘I am honoured with this appointment as Chairman of SIT at an exciting time for the University. SIT's mission to groom young talent to be work-ready professionals and lifelong learners who contribute to, and impact both industry and our society, resonates strongly with me.’",
    "2022\nThe New Future Of Work With Stackable Micro-credentials\nWorking adults can now brush up their skills in the information and communications technology sector via a new pathway at SIT. The pilot programme, known as the Competency-based Stackable Micro-credential (CSM) pathway, would allow them to earn qualifications in specific topics, such as cybersecurity, that can stack up to an SIT degree. The micro-credentials will be offered through SIT's Bachelor of Science with Honours in Applied Computing, and may be expanded to more degree programmes in the future.",
    "2023\nNever Too Old To Learn At STLA\nThe SIT Teaching and Learning Academy (STLA) launched at SIT's fourth Applied Learning Conference, aims to enhance the University's competency-based education, focusing on skill mastery over traditional qualifications.\nSTLA adopts Recognition of Prior Learning, a new approach allowing learners to leverage past experiences to accelerate degree completion.\nMinister for Education Chan Chun Sing described STLA as ‘a significant step towards building new capabilities in our adult learning and education landscape’.",
    "2023\nA New Home Awaits\nSIT's Punggol Campus reached a construction milestone with its Topping Out Ceremony. Opening in 2024, the campus will foster industry collaboration and hands-on learning through innovative spaces.\nRead more\n2023\nA New Home Awaits\nAs the last structural beam at its new home fell into place, SITizens moved one step closer to coming under one roof.\nAt the topping out ceremony held at the Punggol site on May 22, SIT President Professor Chua Kee Chaing said: ‘We are very excited about this impending move not just because this will be a beautiful new campus, but also because the whole of SIT will be together in one location for the first time.’\nCurrently based in six separate campuses across the five polytechnics and its headquarters in Dover Drive, the SIT family will move in phases to the Punggol Campus, which can accommodate 12,000 students. Minister for Education Chan Chun Sing said at the topping out ceremony that SIT ‘will become a central part of the Punggol Digital District’.\nQuote - ‘I am very happy to see that it has adhered to the basic philosophy of how we want this building to be integrated with the rest of the community, with the industry, and also to allow the cross-pollination of ideas across different disciplines and different sectors.’ said Mr Chan on May 22, 2023.",
    "2024\nBuilding Tomorrow, Today\nAfter a decade of being recognised as an Autonomous University, SIT is finally getting a campus that it can truly call its own. The new Punggol Campus — built on a living lab concept — aims to deepen the authenticity of SIT's applied learning pedagogy, and catalyse projects between faculty, students, industry and the community.\nLocated within the heart of the Punggol Digital District, the University will be a knowledge hub for Punggol and the surrounding towns.\nRead more\n2024\nBuilding Tomorrow, Today\nDotted with trees and open spaces, the new centralised campus in the PDD — aptly termed ‘campus-in-a-park’ — is alive in more ways than one. Greenery adds a touch of the verdant to angular buildings; solar panels glint on the rooftops, feeding electricity back into the University's private microgrid.\nIts ideascapes also thrum with life. Built on a ‘living lab’ concept, the University is a test-bed for new prototypes and solutions generated at the intersection of academia and industry. This effort is aimed at transforming Singapore into a thriving innovation hub.\nCollaboration with industry partners has already begun. For instance, SIT is working with cyber intelligence firm Group IB to design and engineer virtual testing environments for start-ups looking to fend off cyberattacks. Group IB is part of the first batch of four international firms to set up shop in the PDD, alongside Boston Dynamics, Delta Electronics Int'l (Singapore), and Wanxiang. Such projects will only become more common as local and international firms take root in the PDD. As Singapore's first university of applied learning, SIT will benefit greatly from the surrounding industry network — and, in turn, generate solutions to benefit both its neighbours and industry-at-large.\nBut it's not just industry partners who are making an impact — so are philanthropists like Mr Kwek Leng Beng, the property tycoon who donated $24 million to SIT in 2023. This donation was matched by the government, bringing the total SIT endowment to $60 million. ‘Through this SIT donation, I am privileged to play a part in building future generations of talent and professionals for Singapore, especially in hospitality,’ said Mr Kwek at the event to announce his donation, which also saw the unveiling of a Lego model of a new administrative building. The model was built by SIT students. In appreciation of Mr Kwek's endowed gift, SIT has named the new administrative building — which will house academic and administrative staff — the Kwek Leng Beng University Tower."
  ],
  "links": [
    "https://www.singaporetech.edu.sg/10th-anniversary/",
    "https://www.singaporetech.edu.sg/10th-anniversary/",
    "https://www.singaporetech.edu.sg/10th-anniversary/our-story",
    "https://www.singaporetech.edu.sg/10th-anniversary/celebrations",
    "https://www.singaporetech.edu.sg/10th-anniversary/get-in-touch",
    "https://www.singaporetech.edu.sg/10th-anniversary/",
    "https://www.singaporetech.edu.sg/10th-anniversary/our-story",
    "https://www.singaporetech.edu.sg/10th-anniversary/celebrations",
    "https://www.singaporetech.edu.sg/10th-anniversary/get-in-touch",
    "https://www.singaporetech.edu.sg/sites/default/files/SIT_Commemorative%20Book_Web.pdf"
  ],
  "images": [
    "/sites/anniversary/themes/custom/anniversary/assets/images/background-element-top-left.svg",
    "/sites/anniversary/themes/custom/anniversary/assets/images/background-element-top-right.svg",
    "/sites/anniversary/themes/custom/anniversary/assets/images/background-element-bottom-right.svg",
    "/sites/anniversary/themes/custom/anniversary/assets/images/background-element-bottom-left.svg",
    "/sites/anniversary/themes/custom/anniversary/sit-10-year-logo.svg",
    "/sites/anniversary/themes/custom/anniversary/assets/images/sit-logo.svg",
    "/10th-anniversary/sites/anniversary/themes/custom/anniversary/assets/images/thick-chevron.svg",
    "/10th-anniversary/sites/anniversary/themes/custom/anniversary/assets/images/milestones/2014-meet-sit-modal.jpg",
    "/10th-anniversary/sites/anniversary/themes/custom/anniversary/assets/images/milestones/2014-satellite-modal.jpg",
    "/10th-anniversary/sites/anniversary/themes/custom/anniversary/assets/images/milestones/2017-lifelong-modal.jpg",
    "/10th-anniversary/sites/anniversary/themes/custom/anniversary/assets/images/milestones/2019-punggol-modal.jpg",
    "/10th-anniversary/sites/anniversary/themes/custom/anniversary/assets/images/milestones/2021-skillsfuture-modal.jpg",
    "/10th-anniversary/sites/anniversary/themes/custom/anniversary/assets/images/milestones/2022-baton-modal.jpg",
    "/10th-anniversary/sites/anniversary/themes/custom/anniversary/assets/images/milestones/2022-guard-modal.jpg",
    "/10th-anniversary/sites/anniversary/themes/custom/anniversary/assets/images/milestones/2023-new-home-modal.jpg",
    "/10th-anniversary/sites/anniversary/themes/custom/anniversary/assets/images/milestones/2024-building-modal.jpg"
  ]
}