{
  "url": "https://www.singaporetech.edu.sg/annual_report_2021/president_message.html",
  "title": "SIT Annual Report 2021 - President message",
  "meta": {
    "description": null,
    "keywords": null
  },
  "text_lines": [
    "Cover",
    "About SIT",
    "SIT at a Glance",
    "Chairman’s Message",
    "President’s Message",
    "Senior Management",
    "Board of Trustees",
    "Key Highlights",
    "Academic Year in Review",
    "Applied Learning",
    "Industry",
    "Community",
    "Support for Students",
    "In Appreciation of Our Donors",
    "Corporate Governance",
    "Board Committees & Internal Audit",
    "Financial Statements",
    "Nurturing the Future Workforce",
    "Contact Us",
    "PRESIDENT’S MESSAGE",
    "Over the years, SIT has established itself as a thought leader in applied learning. Moving forward, we will deepen applied learning by pioneering the work-learn continuum and strengthening applied research.",
    "Professor Tan Thiam Soon",
    "President",
    "FY2020 was a year of uncertainty and unexpected disruptions. Adapting to meet this challenge requires a new level of resilience, ingenuity, and agility. For SIT, this means having to rethink how we continue to deliver applied learning through the use of technology, without losing that all-important human touch. In the face of the circumstances, I am heartened to see how our people here at SIT have risen up to the challenge.",
    "Ensuring Learning Continuity",
    "SIT had to respond swiftly when COVID-19 Circuit Breaker measures were imposed at the start of FY2020. We came together quickly and efficiently to support our students, especially in mounting full home-based learning and online examinations. 154 online examination sessions were held for over 9,000 students over the course of two weeks during April and May 2020 – the first time that online examinations were conducted on such a large scale.",
    "We launched the",
    "Student Relief Fund@SIT (COVID-19)",
    "and many of our generous donors responded to our call for financial support. We were able to procure and deliver laptops for our needy students during the Circuit Breaker. Through this fund, we were also able to provide emergency grants to students who needed financial help. More than $2.2 million has been donated towards the Fund, benefitting 690 students thus far.",
    "Another swift response was to suspend all our overseas attachments and global mobility programmes, and recall our students from abroad due to the pandemic situation worldwide. We managed to secure alternative local attachments for the affected students.",
    "Despite the restrictions on overseas travel, our students continued to have fruitful learning experiences. Leveraging on technology and online platforms, many of our SITizens could still glean useful insights from cross-border discussions and sharing. The demand from industry for graduates in niche areas remains, and SIT continued to grow our suite of specialised degree programmes. For AY2021, the",
    "Bachelor of Engineering in Robotics Systems",
    "was launched to meet strong demand for automation and development of Singapore’s service robot industry.",
    "Our",
    "Integrated Work Study Programme (IWSP)",
    "remains a salient feature of our applied learning pedagogy. Faced with challenges posed by the pandemic, we put in place the IWSP (Innovation Project), where SIT students worked on real industry projects without compromising their learning objectives. Thanks to our faculty, who reached out to industry partners in the hospitality industry, one of the hardest hit sectors, we managed to secure",
    "IWSP (Innovation Project)",
    "for 66 Hospitality Business students in FY2020.",
    "Maintaining User Experience",
    "The dynamic pandemic situation forced us to re-think how large-scale events were conducted. Many key events had to go virtual, including the",
    "SIT E-Orientation 2020, SIT Career Nexus 2021",
    ", and",
    "SIT Virtual Open House (VOH) 2021",
    ". Despite a change in the platform of delivery, these events were very well received, with over 25,000 unique visitors for the VOH as an example.",
    "We made the decision to postpone the",
    "SIT Graduation Ceremony",
    "for the Class of 2020 from October 2020 to February 2021, when we were able to hold physical ceremonies to acknowledge this group who was most impacted by the pandemic. Close to 2,200 graduates from 47 undergraduate and postgraduate programmes received their degree scrolls, including the pioneer cohorts of Allied Health and Civil Engineering students.",
    "The ceremony was a testimony to the resilience and fortitude of our SITizens, who continue to be highly sought-after by industry. In the",
    "2019 Graduate Employment Survey",
    ", 90.7% of our graduates secured a job within six months of graduation. This is a result of our industry-focused curriculum, as well as the success of the IWSP.",
    "Keeping in Touch with SITizens",
    "We continue to focus on helping our SITizens build skills and enhance their employability. For example, career coaches helped graduating students with their job search by facilitating connections with our industry partners. Our lifelong learning division, SITLEARN Professional Development, also offered four free",
    "Continuing Education and Training (CET)",
    "modules to upskill our graduates.",
    "To open even more doors of opportunity, SIT participated in the",
    "SGUnited Traineeships Programme (SGUT)",
    "as a host company. We are heartened by the strong support from within the university, as well as from our industry partners, who have scoped out traineeship roles for our graduates. A total of 61 trainees joined our SGUT programme, including 17 who were seconded to 14 industry partners.",
    "Deepening Applied Learning",
    "In the face of the pandemic, one key takeaway is the importance of learning, unlearning, and relearning throughout our working lives in order to keep up with uncertainties and changes in today’s world.",
    "Over the years, SIT has established itself as a thought leader in applied learning. Moving forward, we will deepen applied learning by pioneering the work-learn continuum and strengthening applied research. To play a more active role in meeting the needs of the labour market, SIT officially launched the",
    "National Centre of Excellence for Workplace Learning at SIT (NACE @ SIT)",
    "in November 2020, with the support of SkillsFuture Singapore. The aim is to become a university that can provide re-skilling and knowledge enhancement for those who are already in the workforce, through the facilitation of authentic learning at the workplace.",
    "NACE@SIT will bring together stakeholders in business to champion learning at the workplace, and to ensure that workers stay relevant amidst the fast-evolving landscape. Businesses can tap SIT’s expertise in applied research and education to further drive innovation and raise workplace efficiency. The frequent engagement with industry, in turn, allows SIT to stay updated on the evolving needs of the modern world.",
    "At the same time, strengthening applied research will also be our key focus in the next five years. This will enable SIT academic staff to anticipate changes in industry, and to infuse best practices back into their teaching. Applied research will also provide students a first-hand experience in solving industry problems.",
    "During the year, SIT inked several collaborations with key industry players, including",
    "DSO National Laboratories",
    "to set up a joint laboratory to spearhead applied research efforts for potential defence and commercial use;",
    "Agency for Science, Technology and Research",
    "to mentor SIT students through its Technology for Enterprise Capability Upgrading (T-Up) Programme and work on joint research projects; and",
    "Professional Engineers Board",
    "to groom prospective Professional Engineers and bridge industry knowledge gaps through a suite of CET courses. These partnerships will contribute to growing our applied research activities and enhance the value of our applied learning offerings.",
    "To support applied research and deepen linkages with industry, SIT has set up a number of Technology Innovation Centres in the past year. They include the",
    "Construction Technology Innovation Laboratory (CTIL)",
    ", set up with support from Woh Hup (Private) Limited to propel the adoption of innovative technologies in the construction industry through applied research and innovation;",
    "Community Leadership And Social Innovation Centre (CLASIC)",
    "at SIT, which supports the university’s service learning and social innovation projects related to the community; and",
    "Rapid Product Innovation and Development (RaPID) Centre",
    ", which facilitates rapid product development and prototyping aimed at supporting the local industry. These centres are pivotal in paving the way for exchange of knowledge, sharing of manpower and resources in applied research, training, and education.",
    "SIT’s Next Lap – Navigating the Era of Disruption",
    "The disruptions that we are facing are catalysing transformations in many aspects of business. It is timely that we are taking steps to strengthen our position as",
    "Singapore’s premier University of Applied Learning",
    ", especially given how increasingly volatile the world has become. As long as we stay united in purpose and continue breaking new ground, we will be well positioned to thrive in this era of disruption.",
    "Professor Tan Thiam Soon",
    "President",
    "Chairman’s Message",
    "Senior Management",
    "Copyright © 2021 Singapore Institute of Technology.",
    "All Rights Reserved.",
    "×"
  ],
  "desc_divs": [],
  "article_texts": [],
  "links": [
    "https://www.singaporetech.edu.sg/annual_report_2021/index.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/cover.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/about.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/sit_glance.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/chairman_message.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/president_message.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/senior_management.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/board_trustees.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/key_highlights.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/academic_year_review.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/applied_learning.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/industry.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/community.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/support_students.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/our_donors.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/corporate_governance.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/board_committees.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/financial_statements.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/next_lap.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/contact.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/chairman_message.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/senior_management.html",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.youtube.com/user/SingaporeTech",
    "https://twitter.com/singaporetech",
    "https://www.linkedin.com/company/singapore-institute-of-technology"
  ],
  "images": [
    "assets/imgs/SIT_logo.svg",
    "assets/imgs/members/Tan_Thiam_Soon.png"
  ]
}