{
  "url": "https://www.singaporetech.edu.sg/annual_report_2021/industry.html",
  "title": "SIT Annual Report 2021 - Industry",
  "meta": {
    "description": null,
    "keywords": null
  },
  "text_lines": [
    "Cover",
    "About SIT",
    "SIT at a Glance",
    "Chairman’s Message",
    "President’s Message",
    "Senior Management",
    "Board of Trustees",
    "Key Highlights",
    "Academic Year in Review",
    "Applied Learning",
    "Industry",
    "Community",
    "Support for Students",
    "In Appreciation of Our Donors",
    "Corporate Governance",
    "Board Committees & Internal Audit",
    "Financial Statements",
    "Nurturing the Future Workforce",
    "Contact Us",
    "INDUSTRY",
    "Despite the disruptions to the economy as a result of the pandemic, SIT’s industry partners have continued to show strong support to the university, reflecting the symbiotic and valuable relationship that SIT has forged with industry. Amid the climate, the Class of 2020 continued to be highly adaptable and employable. SIT’s strong nexus with the industry has resulted in extensive collaborations – from curriculum development to joint efforts in manpower development, work attachment opportunities, and innovative project solutions for industry.",
    "Grooming INDUSTRY-Ready Graduates",
    "The Integrated Work Study Programme (IWSP) is an integral feature of SIT’s educational experience, providing students with opportunities to integrate the knowledge they have gained in the classroom with real-world practice. The IWSP is an excellent platform for students to gain work experience, while industry partners gain access to a pool of work-ready employees.",
    "The COVID-19 pandemic affected the global economy in 2020, forcing many organisations to trim their workforce and retract their IWSP positions. Industries such as hospitality, as well as aviation and aircraft engineering, which account for some of SIT’s niche degree programmes, were significantly hit.",
    "Despite this, SIT’s Centre for Career Readiness (CCR) managed to secure more than 2,580 IWSP positions with over 460 companies for 1,051 students. 50.1% of SIT’s Class of 2020 graduates also received job offers from their IWSP companies.",
    "To mitigate the impact of fewer IWSP positions, SIT established the",
    "IWSP (Innovation Project)",
    "as an alternative option to the IWSP work attachment by engaging students to work with industry partners on real-world projects, without compromising the learning objectives of the IWSP. Faculty members from the Hospitality Business programme reached out to industry partners through this initiative and managed to secure IWSP (Innovation Project) for 66 students.",
    "Career Success Workshops",
    "The majority of SIT’s Career Success Workshops for 2020 were conducted virtually, with more than 50 SITizens attending each session. Training materials were converted to suit an online delivery, and saw the inclusion of courses like ’Mastering Digital Job Interviews’, ’Boosting Online Presence Through LinkedIn’, and ‘Creating a Winning Video Resume’, ensuring relevance to the current economy and job market. More than 50 online Career Success Workshops were conducted throughout 2020 to equip SITizens with the necessary career skills for the workforce, and to navigate the challenging employment landscape.",
    "Industry Mentorship Programme",
    "The Industry Mentorship Programme 2020, in partnership with Young NTUC, saw a participation of 93 mentees and 67 mentors. This was the third time the programme was conducted and it was extended to eleven engineering-related degree programmes. The four-month programme pairs students with an industry mentor from a relevant industry, enabling them to gain industry-specific career advice and guidance in developing their career path.",
    "Supporting Fresh Graduates in Uncertain Times",
    "The",
    "SGUnited Traineeships Programme (SGUT)",
    "is the brainchild of Workforce Singapore (WSG), with the intention to support graduates from Institutes of Higher Learning during this difficult time, by offering traineeship positions with companies across various sectors. With a duration of up to a year, these traineeships equip young locals with valuable industry experience and allow them to gain a firmer foothold in the job market when the economy recovers.",
    "To provide employment opportunities for fresh graduates, SIT participated in SGUT as a host company, with 17 divisions within the university offering traineeship positions.",
    "In addition, the university collaborated with industry partners to allow fresh graduates to be seconded to participating companies. Each trainee got to be involved in industry project work and was jointly mentored by SIT and the partner company they were attached to. At the end of FY2020, there were 61 trainees on board the SIT SGUT. This included 58 SIT graduates from 21 degree programmes, of which 17 SIT graduates were seconded to 14 industry partners.",
    "To support fresh graduates entering the workforce, SIT offered four free Continuous Education Training (CET) modules to the Class of 2020, as part of a joint effort by the Ministry of Education (MOE), SkillsFuture Singapore (SSG), and the six autonomous universities. Alumni can leverage $2,000 worth of SITizens Learning Credits (SLC) to apply for eligible CET courses in SIT. As of end March 2021, there were 168 SIT alumni who completed 176 SLC eligible courses, of which 40% are from the Class of 2020.",
    "Pioneering Workplace learning",
    "SIT continues to expand its suite of integrated industry solutions to build a strong skills ecosystem and workplace learning culture in organisations. As Singapore’s University of Applied Learning, SIT strives to champion workplace learning as an integral component of the work-learn continuum.",
    "Launch of NACE@SIT to Drive Workplace Learning",
    "The National Centre of Excellence for Workplace Learning at SIT (NACE@SIT) was officially launched on 13 November 2020 as the first workplace learning centre in an autonomous university. NACE@SIT is an extension of the NACE ecosystem to help small and medium enterprises (SMEs) build their workplace learning systems and capabilities, through delivering workplace learning projects and developing a community of learning organisations that will support these enterprises. Over the next five years, NACE@SIT aims to benefit 700 enterprises by sharing best practices and success stories, driving workplace solutions, and leveraging SIT’s SkillsFuture Work-Study Degree programmes.",
    "Queen Bee Partnerships with Kwong Wai Shiu Hospital and SMRT",
    "A Memorandum of Understanding (MOU) was inked on 13 November 2020 between Kwong Wai Shiu Hospital (KWSH), SIT, and SkillsFuture Singapore (SSG) to enhance workplace learning in the community care sector by developing work-learn pedagogies and specific programmes to drive innovation and skills development. This is the first Queen Bee partnership for the community care sector, and will help KWSH reach out to 100 enterprises to build up their capabilities over the next three years. As part of the MOU, NACE@SIT will tap on SIT’s network and experience in applied learning and best-in-class practices, to support KWSH in identifying skills gaps and provide training for the community care sector.",
    "The first run of Workplace Learning Projects under the Kaizen Queen Bee initiative with SMRT Corporation Ltd (SMRT) was conducted on 14 January 2021 for nine staff from SMRT’s value chain partners. Supported by SSG, SMRT has been positioned as the Queen Bee to promote continuous improvement and to build up training capabilities and technology transfer for the entire transport ecosystem.",
    "Forging Strategic Partnerships with Industry",
    "Robust engagement with industry through collaborative tie-ups and projects is pivotal in paving the way for the exchange of knowledge, and sharing of manpower and resources in applied research, training, and education.",
    "SIT’s role in Singapore’s 5G Ecosystem",
    "The Infocomm Media Development Authority (IMDA) and SIT inked a Memorandum of Intent (MOI) in April 2020 to jointly establish a national 5G Open Testbed (5G Lab) at SIT@Dover. IMDA has adopted a multi-pronged approach to facilitate the development of 5G in Singapore. The 5G Lab aims to spur the development of innovative 5G applications, services, and capabilities by providing a staging and exploratory environment, working actively with local industry partners to build a larger 5G ecosystem. SIT academic staff and students will have the opportunity to work on applied research projects at the 5G Lab.",
    "Joint-Lab with DSO National Laboratories",
    "Signatories of the MOU (from left): Mr Cheong Chee Hoo, Chief Executive Officer, DSO; and Prof Chua Kee Chaing, Deputy President (Academic) & Provost, SIT.",
    "A joint laboratory at SIT@Dover was established by DSO and SIT in early 2021 to spearhead applied research efforts for potential defense and commercial use. The collaboration will focus on strategic projects in the fields of robotics/unmanned systems and cyber security, involving SIT academic staff and students from the Engineering and Infocomm Technology clusters. The MOU signed with DSO cements a strong intention for DSO and SIT to collaborate in innovation projects, such as design thinking, prototyping, exchanging and developing knowledge and technical expertise, collaborations with students from work-study and industrial postgraduate programmes, student training, and the engagement of work attachments and/or student researchers.",
    "Establishing Framework for Aspiring Professional Engineers",
    "Signatories and witnesses of the MOU signing ceremony (from left): Mr Tan Kiat How, Minister of State, Prime Minister’s Office & Ministry of National Development; Er. Ho Siong Hin, President of the Board, PEB; Prof Tan Thiam Soon, President, SIT; and Prof Chua Kee Chaing, Deputy President (Academic) & Provost, SIT.",
    "Strengthening SIT’s position as an integral Institute of Higher Learning (IHL) partner in the advancement of the Professional Engineering practice, a MOU with the Professional Engineers Board (PEB) was inked on 9 December 2020 to pave the way for more collaborations on bridging courses aimed at preparing engineers for their Professional Engineers (PE) registration. The collaboration saw the launch of specialised courses for PE registration, such as the ‘Introductory Course on Fundamentals of Engineering Examination (FEE) in Civil Engineering’, ‘Introductory Course on Fundamentals of Engineering Examination (FEE) in Electrical Engineering’, and certification courses in Tunnel Engineering. A total of 90 participants attended these specialised courses from September 2020 to April 2021.",
    "Enhancing Applied Learning and Research with A*STAR",
    "SIT and A*STAR inked an MOU on 9 December 2020 to collaborate on talent pipeline development through Technology for Enterprise Capability Upgrading (T-Up), IWSP, joint research and funded projects, innovation and enterprise initiatives, continuing education and training, joint/adjunct appointments, as well as the knowledge exchange of SIT academic staff and A*STAR researchers.",
    "Applied Research to Inform Teaching and Transform Industry",
    "The Applied Research, Innovation and Enterprise (ARIE) division champions strategic engagements and collaborations with industry, focusing on applied research, innovation and enterprise (I&E) activities and establishment of Technology Innovation Centres (TICs). Since April 2020, ARIE’s role has been expanded to cover intellectual property (IP) management and community innovation.",
    "ARIE aims to bridge SIT’s research focus areas and expertise with industry and community needs to foster more extensive research collaborations. Strategic to SIT’s applied learning and research goals, while being aligned to the nation’s Industry Transformation Maps (ITMs), is the setting up of TICs. In collaboration with economic agencies and strategic industry partners, the TICs serve as focal centres for industry innovation projects, access to students as talent pipelines, as well as upskilling and reskilling of the workforce. In FY2020, three new TICs were set up.",
    "In our engagement with enterprises, SIT has adopted an industry-centric approach to ensure a sustainable applied learning education model. Tapping on the expertise of SIT’s academic staff as well as students, SIT actively engages the industry –  specifically the local SMEs – to understand their challenges and co-create innovative solutions with them. This approach ensures a higher rate of technology adoption and helps the local SMEs move up the innovation value chain.",
    "Rapid Product Innovation and Development (RaPID) Centre",
    "A one-stop facility for rapid product development and prototyping aimed at supporting the local industry in their innovation and value creation activities, the",
    "Rapid Product Innovation and Development (RaPID)",
    "Centre was launched on 1 July 2020. The centre provides core capabilities in engineering design, fabrication and systems integration in the areas of Industrial Electronics, Assistive Healthcare Devices, and Service Robots and Process Automation. Through RaPID, companies can work directly with SIT’s multi-disciplinary academic staff and students, to turn their novel ideas into innovative products through ideation, prototyping, and user-validation before scaling up for production.",
    "Since its launch, RaPID has been working closely with companies on various prototyping projects. One of them includes a collaboration with Mastermark Pte Ltd to design and develop prototypes to trap crows at coffeeshops and hawker centres.",
    "Construction Technology Innovation Laboratory (CTIL)",
    "The signing ceremony and cheque presentation that took place on 16 December 2020 was attended by key representatives (from left): Mr Eugene Yong Kon Yoon, Executive Director, Woh Hup; Mr Yong Derong, Executive Director, Woh Hup; A/Prof Ivan Lee, Vice President (Industry & Community) SIT; and Prof Tan Thiam Soon, President, SIT.",
    "SIT officially launched the",
    "Construction Technology Innovation Laboratory (CTIL)",
    "on 21 January 2021, with a $2 million fund contribution from construction and civil engineering company, Woh Hup (Private) Limited. The CTIL provides a platform for Singapore-based construction companies and SIT researchers to carry out applied research and develop innovative technologies for building structures and sub-structures with societal and economic impact. SIT students will benefit by gaining practical hands-on experience in industrial environments, and be exposed to applied research and innovation projects. The laboratory also helps industry professionals to upskill their specialist knowledge and skills through workshops and seminars.",
    "Energy Efficiency Technology Centre (EETC)",
    "The Energy Efficiency Technology Centre (EETC)",
    ", in collaboration with National Environment Agency, promotes and develops energy efficiency capabilities and new technologies in the local energy ecosystem for industrial sectors.",
    "EETC partnered the National Environment Agency (NEA) to launch an inaugural webinar, ‘Unlocking Industrial Energy Efficiency Opportunities’, on 4 February 2021. It was well-received with over 400 participants and enquiries from more than 10 companies for energy assessment. The Singapore Precision Engineering and Technology Association (SPETA) and the Singapore Food Manufacturers Association (SFMA) have also requested EETC to conduct targeted marketing and outreach activities for their members.",
    "In March 2021, EETC secured funding from the Singapore Food Agency (SFA) to measure and validate resource usage to establish a set of benchmark figures for different urban farm categories.",
    "In FY2020, EETC has conducted energy assessments for 7 companies and trained 15 students in energy efficiency in spite of the pandemic situation.",
    "Applied Learning",
    "Community",
    "Copyright © 2021 Singapore Institute of Technology.",
    "All Rights Reserved.",
    "×"
  ],
  "desc_divs": [],
  "article_texts": [],
  "links": [
    "https://www.singaporetech.edu.sg/annual_report_2021/index.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/cover.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/about.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/sit_glance.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/chairman_message.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/president_message.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/senior_management.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/board_trustees.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/key_highlights.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/academic_year_review.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/applied_learning.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/industry.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/community.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/support_students.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/our_donors.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/corporate_governance.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/board_committees.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/financial_statements.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/next_lap.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/contact.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/applied_learning.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/community.html",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.youtube.com/user/SingaporeTech",
    "https://twitter.com/singaporetech",
    "https://www.linkedin.com/company/singapore-institute-of-technology"
  ],
  "images": [
    "assets/imgs/SIT_logo.svg",
    "assets/imgs/content/industry_bg.jpg",
    "assets/imgs/content/launch_NACE.jpg",
    "assets/imgs/content/queen_bee_partnership.jpg",
    "assets/imgs/content/joint-lab_DSO.jpg",
    "assets/imgs/content/establishing_framework.jpg",
    "assets/imgs/content/CTIL.jpg"
  ]
}