{
  "url": "https://www.singaporetech.edu.sg/annual_report_2021/community.html",
  "title": "SIT Annual Report 2021 - Community",
  "meta": {
    "description": null,
    "keywords": null
  },
  "text_lines": [
    "Cover",
    "About SIT",
    "SIT at a Glance",
    "Chairman’s Message",
    "President’s Message",
    "Senior Management",
    "Board of Trustees",
    "Key Highlights",
    "Academic Year in Review",
    "Applied Learning",
    "Industry",
    "Community",
    "Support for Students",
    "In Appreciation of Our Donors",
    "Corporate Governance",
    "Board Committees & Internal Audit",
    "Financial Statements",
    "Nurturing the Future Workforce",
    "Contact Us",
    "COMMUNITY",
    "An integral part of SIT’s mission is to equip SITizens with the knowledge, skills, and ethos to serve the community around them. Students, faculty, and staff are actively involved in meaningful collaborations that benefit the social, economic or environmental aspects of the community. In a year marked by the COVID-19 pandemic, SIT students and staff banded in unity and spearheaded initiatives to help those in need. They also quickly adapted to new modes of learning and working, such as moving physical activities online, and seized opportunities to turn events into new learning areas.",
    "Community Initiatives Amid COVID-19",
    "During the COVID-19 pandemic, our SITizens and staff leveraged their skills to help members of the community. Some initiatives include:",
    "The launch of ProjectCBK (Circuit Breaker Kooks) – a volunteer initiative by a student from The Culinary Institute of America (CIA), Singapore to provide eateries with much-needed manpower.",
    "CIA students joined 20 food and beverage establishments to prepare lunch for 1,100 staff at Sengkang General Hospital – as part of World Gourmet Summit’s initiative to thank healthcare heroes for their fight against COVID-19.",
    "Two SITizens from The Glasgow School of Art (GSofA) Singapore came up with a convenient guide that lists ways for Singaporeans to contribute to those in need.",
    "Between 23 March and 3 April 2020, 42 students assisted SIT staff in an initiative by Temasek Foundation to distribute free hand sanitisers to the public at IMM.",
    "20 members of the Occupational Therapy graduating cohort volunteered their time and effort to support the COVID-19 Migrant Support Coalition (CSMC) during Circuit Breaker, when workers were confined to their dormitories. Using their expertise, they designed programmes and games for migrant workers to help reduce the anxiety they faced during this tough time.",
    "In May 2020, four Professional Officers conducted a Personal Protective Equipment (PPE) training and N95 mask-fitting session for about 20 community and home-based physiotherapists, enabling them to provide their treatment safely.",
    "In March 2021, students from the Global Citizenship project, SITintegrates, helped to collate and distribute 480 gratitude packs to foreign workers at the SIT campus worksite in Punggol.",
    "Personal Protective Equipment (PPE) training and N95 mask-fitting session.",
    "SITintegrates helped to collate and distribute 480 gratitude packs to foreign workers at the SIT campus worksite in Punggol.",
    "Supervisors from the construction companies distributing the Gratitude Packs to the workers.",
    "Mr Chan Wing Leong (third from right), Deputy President (Campus Development) & Chief Investment Officer, SIT receiving a token of appreciation from the migrant workers at the SIT campus worksite in Punggol.",
    "Community Projects and Collaborations",
    "With a mission to strengthen the SIT-DNA trait of being ‘Grounded in the Community’, the",
    "Community Leadership And Social Innovation Centre (CLASIC)",
    "at SIT was launched in October 2020 as a one-stop centre that curates, coordinates, and oversees community and social innovation projects and initiatives across the university. The objective is to make SIT an academic partner of choice amongst community and industry partners for community-related projects and initiatives.",
    "A resident of KLB shares anecdotes of life in mainland Singapore’s only remaining kampung with A/Prof Intan Azura Mokhtar.",
    "By drawing on the expertise of SIT academic staff and complemented by SITizens’ involvement across various clusters and domains, CLASIC aims to curate projects that would enhance the quality of life of identified beneficiaries. Each project will involve at least two SIT students, who will be mentored by a faculty member or a Professional Officer. Students will be exposed to community projects that enable them to be more attuned and sensitised to the needs of different segments of the community, informed of their industry practices, and motivated in the exploration of innovative solutions that seek to benefit the wider community.",
    "CLASIC has engaged in conversations with statutory boards, industry leaders, and social service agencies, including Kwong Wai Shiu Hospital, Ecosoftt Pte Ltd, and Singapore Muslim Women’s Association (PPIS), to provide academic staff and students with collaboration opportunities in different areas and sectors in Singapore.",
    "Other community projects and collaborations during FY2020 include: Project",
    "Kampung Lorong Buangkok",
    "– a team of faculty from Design and Specialised Businesses came up with the ‘Nostalgic Futures Design’ competition to preserve the heritage of the last kampung on mainland Singapore. The project involved students from the Glasgow School of Art (GSofA) Interior Design and Communication Design programmes, as well as industry and community partners, JIA Studios Pte Ltd, FXMedia Internet Pte Ltd, and Hwi Yoh Community Centre.",
    "For the second year running, SIT partnered the National Environment Agency (NEA) on the",
    "G!nnovation Challenge",
    "for schools to produce innovative solutions to local environmental challenges using design thinking skills. Two SIT staff were part of the judging panel that provided guidance and advice to seven participating school teams.",
    "SIT Community Challenge 2020",
    "– SIT partnered Greendale Secondary School and the Public Transport Council to run a challenge themed ‘A Caring Commuter Culture in the Punggol Community’. From June to December 2020, the challenge provided a platform for students to be trained in design thinking skills to ideate solutions for challenges faced by commuters.",
    "Project collaboration with Elections Department Singapore (ELD) – a polling booth, designed by faculty and students using a user-centric design methodology and funded by a Seed Grant, was successfully deployed by the ELD during the 2020 General Election.",
    "SIT partnered Yio Chu Kang Constituency on a community project,",
    "‘The Young Engineers’ Space (YES!)’",
    ". From January to March 2021, SIT student mentors trained in design thinking tools worked with secondary school students to explore possible solutions to community issues.",
    "Student Engagement & Development",
    "Complementing SIT’s community efforts is the grooming of future student leaders of SIT, known as SITizen Ambassadors, who embody the SIT-DNA traits and co-create the present and future of SIT as a premier University of Applied Learning and partner of choice for industry.",
    "The second batch of",
    "SITizen Ambassadors",
    "was formally inducted at the SITizen Ambassadors’ Investiture on 3 March 2021. They received coaching in formal business communication and social media management, and learned how SIT’s unique origins can influence the university’s position in today’s economy. SITizen Ambassadors were also given opportunities to gain a deeper understanding of SIT’s vision and mission, and strategise SIT’s future alongside members of faculty and staff.",
    "SITizen Ambassadors’ Investiture",
    "The",
    "SIT Vanguards",
    "is a group of experienced student leaders who aim to inspire and guide new student leaders. This advanced leadership programme offers stepped-up training to deepen leadership skills. With the introduction of the Peer Mentoring programme in 2021, the Vanguards can enhance their skill sets through supervised mentorship of active student leaders, while these student leaders can tap on the Vanguards for support. This ensures that each chapter of student leadership is built on the foundation of shared experiences, and constantly refined with each new generation of outstanding SITizens.",
    "SIT Vanguards",
    "The",
    "SIT Alumni Mentoring Programme",
    "brings together alumni and students to foster personal and professional growth, as well as exchange knowledge and skill sets through mentorships for a period of six months. Launched in September 2020, 52 successful mentor-mentee matchings were achieved during the first cycle. The second cycle was held in March 2021. The SIT Alumni Mentoring Programme is organised by the SIT Advancement & Alumni division and supported by Student Life division, with participation from SITizen Ambassadors. Sessions took place online and in small groups.",
    "SIT Alumni Mentoring Programme",
    "Wellness Week",
    "was launched in 2019 by the",
    "Diversity and Inclusion",
    "team of the Student Life division. It aims to build a sense of community while promoting student care and well-being at SIT. Both online and in-person activities were held to encourage students to practise self-help skills and boost social support. From 22 to 26 March 2021, students engaged in mindful activities, such as yoga and art therapy workshops. They also participated in talks conducted by industry professionals to learn about different mental health conditions, good wellness practices, methods of coping with stress, and peer support through various resources.",
    "Wellness Week",
    "Philanthropic Support for Students",
    "The Student Relief Fund@SIT (COVID-19) has helped 690 students as of at March 2021.",
    "Thanks to the prompt action from 185 donors, the",
    "Student Relief Fund@SIT (COVID-19)",
    "was established in March 2020 to support students who are facing financial and educational difficulties due to the pandemic. As at July 2021, more than $2.2 million in gifts have been made towards the fund. As at 1 March 2021, the Student Relief Fund@SIT (COVID-19) has assisted 690 students with disbursements still ongoing.",
    "SIT received new philanthropic support in FY2020, such as the",
    "Irene Tan Liang Kheng Scholarship",
    "for Nursing students and the",
    "OUE Scholarship",
    "to nurture leadership and community service. New permanent bursaries and grants were also established for financially disadvantaged SIT undergraduates, including the",
    "Octava Foundation Study Grant",
    "and the",
    "Straits Construction Bursary",
    ". There were also new support schemes made available to students in financial need. These include the",
    "GSK-EDB-HRD Bursary",
    ", the",
    "GSK-EDB-HRD Support Grant, Singapore Teochew Foundation Laptop Support Programme",
    "and",
    "The Ngee Ann Kongsi Emergency Relief Fund",
    ". The",
    "Yangzheng Foundation Community Leadership and Social Innovation Grant",
    "was established to support programmes and projects under the Community Leadership And Social Innovation Centre (CLASIC).",
    "Employee Engagement and Wellness",
    "SIT’s Employee Value Proposition (EVP) is an ecosystem of support, recognition, and values that SIT provides to its employees to achieve their potential at work and boost employee engagement.",
    "It comprises four pillars:",
    "We value and care for your well being",
    "We nurture your personal & professional growth",
    "We support an environment of empowerment where your contributions are recognised",
    "We take P.R.I.D.E in fostering a collaborative and enterprising culture",
    "In the area of staff wellness, the",
    "Employee Wellness Committee (EWC)",
    "continued to build camaraderie and team spirit within SIT by organising a myriad of staff activities and workshops virtually, ensuring the physical and mental well being of staff while they worked from home. These include online workshops, exercise classes, and even a virtual SIT Tea Party in place of the annual Staff Night. In addition, a work group has been formed to identify areas that present opportunities to better support the mental well-being of the staff.",
    "The university has taken steps to explore and enhance the ways of rewarding and recognising its employees. An example is the",
    "SIT Staff Appreciation Day",
    ", which recognises staff for their contributions to the university’s achievements and is an anchor event of the",
    "SIT Employee Recognition Framework",
    ". More than 400 staff attended the online event on 6 October 2020, where the annual Service Appreciation Award, comprising the 5- and 10-year Long Service Awards, were given to staff in recognition of their service. During the event, staff participated in a Virtual Sports Challenge and shared stories about embracing the ONE SIT culture.",
    "SIT Staff Appreciation Day",
    "Virtual Sports Challenge at SIT Staff Appreciation Day",
    "Online baking session organised by EWC",
    "Promoting Sustainability",
    "As part of our goal of ensuring a sustainable campus, the SIT Sustainability Workgroup has been planning and implementing various initiatives to conserve resources such as energy, water and paper, as well as minimise and manage waste responsibly. In 2020, SIT achieved the Green Mark Platinum re-certification of its buildings in the Polytechnics, replaced light fittings with LEDs in all its campuses for efficient energy use, and implemented secure printing to reduce paper waste.",
    "The Workgroup also organised various activities to raise awareness and adoption of sustainable practices amongst staff and students. On 5 June 2020, as part of marking World Environment Day, staff and students participated in a Bingo Challenge and shared their own sustainable actions while working from home during the COVID-19 pandemic. In January 2021, the Workgroup and our student club for sustainability, Action for Environment Conservation (AEC), held a virtual talk, “Unpacking the Packaging Waste Issue”, which focused on the impact and ways to reduce packaging waste.",
    "Industry",
    "Support for Students",
    "Copyright © 2021 Singapore Institute of Technology.",
    "All Rights Reserved.",
    "×"
  ],
  "desc_divs": [],
  "article_texts": [],
  "links": [
    "https://www.singaporetech.edu.sg/annual_report_2021/index.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/cover.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/about.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/sit_glance.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/chairman_message.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/president_message.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/senior_management.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/board_trustees.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/key_highlights.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/academic_year_review.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/applied_learning.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/industry.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/community.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/support_students.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/our_donors.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/corporate_governance.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/board_committees.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/financial_statements.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/next_lap.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/contact.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/industry.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/support_students.html",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.youtube.com/user/SingaporeTech",
    "https://twitter.com/singaporetech",
    "https://www.linkedin.com/company/singapore-institute-of-technology"
  ],
  "images": [
    "assets/imgs/SIT_logo.svg",
    "assets/imgs/content/community_bg.jpg",
    "assets/imgs/content/mask_fitting.jpg",
    "assets/imgs/content/480_gratitude_packs.jpg",
    "assets/imgs/content/gratitude_packs.jpg",
    "assets/imgs/content/SIT_campus_worksite.jpg",
    "assets/imgs/content/intan_azura_mokhtar.jpg",
    "assets/imgs/content/investiture_1.jpg",
    "assets/imgs/content/investiture_2.jpg",
    "assets/imgs/content/investiture_3.jpg",
    "assets/imgs/content/vanguards_1.jpg",
    "assets/imgs/content/ambassadors_investiture_1.jpg",
    "assets/imgs/content/ambassadors_investiture_2.jpg",
    "assets/imgs/content/ambassadors_investiture_3.jpg",
    "assets/imgs/content/wellness_week_1.jpg",
    "assets/imgs/content/wellness_week_2.jpg",
    "assets/imgs/content/student_relief_fund.jpg",
    "assets/imgs/content/engagement_1.png",
    "assets/imgs/content/engagement_2.png",
    "assets/imgs/content/engagement_3.png",
    "assets/imgs/content/engagement_4.png",
    "assets/imgs/content/SIT_Staff_Appreciation_Day.jpg",
    "assets/imgs/content/Virtual_Sports_Challenge.jpg",
    "assets/imgs/content/Online_baking_session.jpg",
    "assets/imgs/content/promoting_sustainability.png"
  ]
}