{
  "url": "https://www.singaporetech.edu.sg/annual_report_2022/key_highlights",
  "title": "Key Highlights",
  "meta": {
    "description": "2022 Annual Report for Singapore Institute of Technology",
    "keywords": null
  },
  "text_lines": [
    "KEY HIGHLIGHTS",
    "FY2021 was a year filled with a mix of virtual and physical events as Singapore made a transition towards the COVID-19 endemic phase.",
    "2021",
    "2022",
    "2021",
    "03 MAY 2021",
    "Permanent Support for Food Technology Applied Research and Scholarships at SIT from Prima Group",
    "SIT received an endowed gift of $3 million from the Prima Group to develop future talents and applied research in Food Technology. The gift, which commemorates Prima Group’s diamond anniversary, has enabled SIT to establish the Prima Group Scholarship for talented Food Technology undergraduate students, as well as the Prima Group Applied Research Grant to run innovation projects that are focused on closing technological gaps in food manufacturing and processing.",
    "04 AUGUST 2021",
    "SkillsFuture@SIT",
    "SkillsFuture@SIT, organised in partnership with SkillsFuture Singapore (SSG) and the 12 institutes of higher learning (IHLs), saw over 50 online workshops centered around the theme ‘Supporting Industry Transformation through Upskilling Singapore’s Workforce’.",
    "The event was organised by SIT with the help of SIT students and SITizen Ambassadors. It was also part of SkillsFuture Month from 8 July to 22 August. Close to 29,000 participants accessed SkillsFuture@SIT, where industry leaders and IHLs shared insights through keynote sessions and online workshops with a key focus to assist various groups, such as mid-career job seekers and fresh graduates, in enhancing their skills and employability. The event also saw the launch of SIT’s new Competency-Based Workplace Learning pathway.",
    "30 AUGUST–03 SEPTEMBER 2021",
    "Orientation 2021: SIT First Year Experience",
    "After months of planning by over 600 student organisers and facilitators, SIT welcomed more than 2,600 freshmen to the SIT First Year Experience with a series of physical and virtual activities – SIT Helix, Day Zero, Club Fair, and Virtual Platform. Helix is an induction programme and a platform for freshmen to connect with the SIT community, meet fellow freshmen from other degree programmes, and learn more about the services provided for students. This year’s SIT Helix was a two-day virtual event that featured three sessions; it was attended by close to 1,000 freshmen and 73 student organisers and facilitators.",
    "Day Zero was held over five days across six campuses, where the freshmen took the opportunity to understand the expectations for their degree programmes and gained useful studying as well as time management tips from their seniors. Day Zero was attended by 2,667 freshmen, 617 student organisers and facilitators, as well as 156 academic staff.",
    "19–22 OCTOBER 2021",
    "SIT Graduation 2021",
    "The Class of 2021 celebrated their big day across 11 sessions conducted under Safe Management Measures from 19 to 22 October 2021. Mr Chan Chun Sing, Minister for Education, graced the main session of the SIT Graduation, held at The Theatre at Mediacorp. Close to 1,600 graduates from 27 undergraduate and postgraduate degrees, conferred by SIT and joint overseas university partners, received their degree parchments. SIT Graduation 2021 marked the graduation of the pioneer cohort of 46 students from the Aircraft Systems Engineering programme – the first degree of its kind by an autonomous university in Singapore.",
    "25 NOVEMBER 2021",
    "Recognition Of Excellence 2021",
    "This key university event went online amid the pandemic, celebrating the achievements of SIT students and honouring the donors whose philanthropic support has nurtured student excellence at SIT. A total of 62 Book Prizes, Performance Awards, and Gold Medals were presented along with 44 named scholarships to 189 recipients. Most memorably, nine donors expressed their well-wishes for the students through a series of special video recordings.",
    "2022",
    "01 JANUARY 2022",
    "SIT’s Third President",
    "Prof Chua Kee Chaing assumed the role of SIT President, succeeding Prof Tan Thiam Soon who stepped down as President after nine years in the role. Prof John Thong assumed the role of Deputy President (Academic) & Provost with effect from 1 January 2022, succeeding Prof Chua. Prof Chua joined SIT in September 2019 and has led the university’s development in academic policies and curriculum, applied learning and applied research, faculty development, as well as student administration.",
    "15 JANUARY 2022",
    "Engaging Prospective Students at SIT Virtual Open House 2022",
    "A key focus of SIT Virtual Open House (VOH) 2022 was on how we could provide prospective students and their influencers quality content with the user’s experience in mind. As authenticity is key for prospective students, a new Student Ambassadors platform was integrated into the microsite, which allowed prospective students to chat directly with current undergraduates to get their real views of programme offerings and student life. Showcasing our students’ applied research projects more prominently was also a key feature this year. Programme talks were in bite-sized formats with a story-telling angle, allowing for more direct and meaningful insights provided by faculty members. This was layered with live coffee chat sessions with professors, alumni, and current students. In addition, prospective students could chat one-on-one with an admissions officer, which generated more opportunities for two-way conversations. ‘Stories of SITizens’ featured narratives and videos of our current students, scholars, and alumni. The VOH microsite attracted 80,781 page views and 5,640 unique visitors as of 15 March 2022.",
    "17–21 JANUARY 2022",
    "Career Nexus 2022",
    "Career Nexus is SIT’s largest networking event. The platform was abuzz with activities on 19 January when more than 860 industry representatives from 225 companies enjoyed a fruitful networking session with SIT students. More than 1,600 students sought full-time positions or opportunities for their Integrated Work Study Programme. The e-networking saw 43,300 unique visits in total.",
    "The ‘Xplore!’ webinars saw alumni and guest speakers from various companies reveal insights on managing and deploying disruptive technology, and share their views of work in today’s digitalisation age. Industry partners also had access to Project Showcase – a demonstration of 100 innovative projects by SITizens. The showcase gave them an idea of how a potential hire from SIT would be able to craft solutions for their organisations.",
    "20–21 JANUARY 2022",
    "Third Applied Learning Conference",
    "The Applied Learning Conference (ALC) is one of SIT’s key platforms for fostering collaboration between academia and industry to transform the education and workplace learning landscapes. The third instalment of the event was held virtually for the first time in 2022. The two-day event focused on ‘Embracing Change in an Era of Disruption’ and welcomed more than 400 local and overseas delegates. Comprising thought leaders and practitioners from around the world, the event allowed delegates to share and learn about competency-based education, interdisciplinary learning, and related areas such as lessons from COVID-19, innovative technologies, and applied learning pedagogies.",
    "26 JANUARY 2022",
    "The Chua Thian Poh Discovery Hub Made Possible at SIT’s Future Campus in Punggol",
    "A new endowed gift of $2.6 million was made possible by Dr Chua Thian Poh to support the development of SIT’s future campus in Punggol, and to nurture financially disadvantaged undergraduates through the newly established Chua Thian Poh Bursary at SIT. In recognition of this generous gift, SIT has named the Chua Thian Poh Discovery Hub at its future campus in Punggol. In the interim, before the Punggol campus is operational, the Student Activities Centre at SIT@Dover has been named the Chua Thian Poh Student Activities Centre.",
    "04 FEBRUARY 2022",
    "SIT Gets Biggest Gift from The Ngee Ann Kongsi",
    "The Ngee Ann Kongsi formalised its intention to make an endowed gift of $25 million ($2.5 million annually for 10 years) for the development of SIT’s library, as well as the establishment of The Ngee Ann Kongsi Emergence Fund to nurture emerging talents and ideas at SIT. In appreciation of the Kongsi’s donation – the biggest that SIT has received thus far – the SIT Library at its future campus in Punggol (as well as its interim campus in Dover) has been named The Ngee Ann Kongsi Library.",
    "16 MARCH 2022",
    "Appointment of New Chairman",
    "SIT welcomed Mr Bill Chang, Chief Executive Officer, Group Enterprise and Country Chief Officer Singapore of Singtel, as the new Chairman to its Board of Trustees with effect from 16 March 2022. Mr Chang took over from Mr Ng Yat Chung, who stepped down on 15 March 2022 as the Chairman of SIT’s Board after more than 12 years at the helm.",
    "Move to top",
    "LEADERSHIP",
    "APPLIED LEARNING &\n APPLIED RESEARCH",
    "Copyright © 2022 Singapore Institute of Technology.",
    "All Rights Reserved.",
    "COVER & THEME",
    "SIT AT A GLANCE",
    "LEADERSHIP",
    "KEY HIGHLIGHTS",
    "APPLIED LEARNING &\n APPLIED RESEARCH",
    "INDUSTRY &\n COMMUNITY",
    "SUSTAINABILITY\n EFFORTS",
    "SPONSORS &\n DONORS",
    "CORPORATE\n GOVERNANCE",
    "BOARD COMMITTEES\n & INTERNAL AUDIT",
    "FINANCIAL\n STATEMENTS",
    "{\"props\":{\"pageProps\":{}},\"page\":\"/key_highlights\",\"query\":{},\"buildId\":\"kf2s_V7KxTNJfDSKtguk4\",\"assetPrefix\":\"/annual_report_2022\",\"nextExport\":true,\"autoExport\":true,\"isFallback\":false,\"scriptLoader\":[]}"
  ],
  "desc_divs": [],
  "article_texts": [],
  "links": [
    "https://www.singaporetech.edu.sg/annual_report_2022",
    "https://www.singaporetech.edu.sg/annual_report_2022/key_highlights",
    "https://www.singaporetech.edu.sg/annual_report_2022/leadership/chairman",
    "https://www.singaporetech.edu.sg/annual_report_2022/applied_learning_applied_research/learning",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.youtube.com/user/SingaporeTech",
    "https://twitter.com/singaporetech",
    "https://www.linkedin.com/company/singapore-institute-of-technology",
    "https://www.singaporetech.edu.sg/annual_report_2022/theme",
    "https://www.singaporetech.edu.sg/annual_report_2022/sit_at_a_glance/about",
    "https://www.singaporetech.edu.sg/annual_report_2022/leadership/chairman",
    "https://www.singaporetech.edu.sg/annual_report_2022/key_highlights",
    "https://www.singaporetech.edu.sg/annual_report_2022/applied_learning_applied_research/learning",
    "https://www.singaporetech.edu.sg/annual_report_2022/industry_community/industry",
    "https://www.singaporetech.edu.sg/annual_report_2022/sustainability_efforts",
    "https://www.singaporetech.edu.sg/annual_report_2022/sponsors_donors",
    "https://www.singaporetech.edu.sg/annual_report_2022/corporate_governance",
    "https://www.singaporetech.edu.sg/annual_report_2022/board_committees_internal_audit",
    "https://www.singaporetech.edu.sg/annual_report_2022/financial_statements"
  ],
  "images": [
    "/annual_report_2022/_next/static/media/SIT_logo.5a504003.svg",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/img1.6e16c068.png",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/img2.4fa76c83.png",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/img3.e5db92ae.png",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/img4.e16e5d44.png",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/img5.3230df7b.png",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/img6.b03b6a25.png",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/img7.7ad55b34.png",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/img8.83636845.png",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/img9.20aaccd4.png",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/img10.c65bdd80.png",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/img11.7be07f2d.png",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/date_bracket.7d07bb3b.svg",
    "/annual_report_2022/_next/static/media/img12.5b963c4d.png",
    "/annual_report_2022/_next/static/media/arrow_up.e8e9ee86.svg",
    "/annual_report_2022/_next/static/media/arrow_up_red.db3a128a.svg",
    "/annual_report_2022/_next/static/media/arrow.06df21d5.svg",
    "/annual_report_2022/_next/static/media/arrow.06df21d5.svg"
  ]
}