{
  "url": "https://www.singaporetech.edu.sg/annual_report_2021/chairman_message.html",
  "title": "SIT Annual Report 2021 - Chairman's message",
  "meta": {
    "description": null,
    "keywords": null
  },
  "text_lines": [
    "Cover",
    "About SIT",
    "SIT at a Glance",
    "Chairman’s Message",
    "President’s Message",
    "Senior Management",
    "Board of Trustees",
    "Key Highlights",
    "Academic Year in Review",
    "Applied Learning",
    "Industry",
    "Community",
    "Support for Students",
    "In Appreciation of Our Donors",
    "Corporate Governance",
    "Board Committees & Internal Audit",
    "Financial Statements",
    "Nurturing the Future Workforce",
    "Contact Us",
    "CHAIRMAN’S MESSAGE",
    "The pandemic has forced a rethink of what being career-ready means as we gear up to face the challenges of a future economy, where digitalisation and sustainability will be key drivers.",
    "MR NG YAT CHUNG",
    "CHAIRMAN",
    "FY2020 was unprecedented for the disruption and uncertainty caused by COVID-19. SIT set in motion various initiatives to help the university navigate the way forward, by sharpening its focus on innovation and lifelong learning. Moving forward in this uncharted environment, we will continue to redefine the higher education landscape by deepening Applied Learning and Research, while continuing to forge strategic partnerships focused on ‘win-win-win’ outcomes for our students, industry and community.",
    "With construction picking up pace again on our new home in Punggol, test-bedding of new initiatives and projects at our living lab in SIT@NYP Building has ramped up in earnest. And, in spite of the enforced hiatus, the can-do spirit ingrained in our faculty and staff has seen the university leading the charge on lifelong learning, and taking the initial steps in pioneering a competency-based upskilling pathway.",
    "Redefining Teaching & Learning",
    "The pivot to full home-based learning brought to the fore new ways of teaching and learning, involving edutech and digital tools. For the first time, online examinations were held for over 9,000 students. I am glad that despite the inevitable disruptions brought about by the pandemic, our staff had worked tirelessly to enable close to 2,200 graduates from the Class of 2020 to receive their scrolls in person at their Graduation Ceremony held in February 2021. With this, more than 11,000 graduates have received degrees from SIT or one of our overseas university partners.",
    "The launch of NACE@SIT is a step towards pioneering a work-learn continuum where lifelong learning is more than just an idea, but is fleshed out through a competency-based framework that allows seamless transitioning between the workplace and classroom. Thanks to the support of our Queen Bee partners, we will soon welcome mid-career professionals into our full-time degree programmes. On a related note, I am heartened that demand for our undergraduate programmes remains high, with an 8.8% increase in applications received for this academic year. Of the close to 12,000 applicants, we welcomed 2,900 new SITizens into the SIT family, where over 90% of them were enrolled into their first- or second-choice programmes.",
    "With collaboration and connectivity across disciplines driving productivity gains in various sectors, we continue to refine our curriculum, and look at harmonising our programmes to ensure that they continue to remain relevant and keep abreast of the ever-changing needs of industry. This push towards interdisciplinary learning is going to be key as we navigate all manner of challenges coming our way.",
    "The need to remain nimble and adaptable to the changing environment was borne out in our Integrated Work Study Programme (IWSP), when travel restrictions and work from home (WFH) measures resulted in less places being made available for our students. Undeterred, our faculty conceived various IWSP innovation projects and worked with industry partners to ensure that learning outcomes were not affected. Leveraging on technology and online teaching tools, the inaugural virtual exchange for students in our Health and Social Sciences cluster enabled cross-border learning to take place with a group of students in Japan. I am confident that as we continue to grow, we will see more of such digitally-enabled collaborations become part and parcel of our programme offerings.",
    "Cementing Ties With Industry",
    "As Singapore’s premier University of Applied Learning, we continue to make significant strides in ensuring that our students’ learning journeys are distinctive and set them up for career success. To that end, we launched various Technology and Innovation Centres (TICs) during the year, including RaPID – a one-stop rapid product development and prototyping facility which will support local industry in their innovation and value creation efforts. Over time, companies will be able to innovate, ideate, prototype and validate products, working closely with SIT faculty and students. Other MOUs signed during the year saw our presence strengthened in areas including robotics systems, cyber security, food and pharmaceutical engineering, as well as sustainable and clean energy.",
    "While our focus remains firmly on growing our undergraduate programmes, our SkillsFuture Work Study Degree (WSDeg) pathway continues to produce graduates who, in spite of demands at the workplace, do their employers proud. In FY20/21 alone, 57 students were successfully placed with 21 companies under the WSDeg pathway. As we forge ahead to strengthen and solidify the work-learn continuum, we continue to grow our programme offerings to allow more avenues for SITizens to upskill and reskill. This includes short courses where specialised training is recognised for professional industry certification.",
    "The Road Ahead",
    "The pandemic has forced a rethink of what being career-ready means as we gear up to face the challenges of a future economy, where digitalisation and sustainability will be key drivers. I am confident that with the support of our strategic partners – the Ministry of Education, polytechnics, overseas university partners, industry partners, government agencies and community leaders – coupled with a sustained ‘whole of SIT’ approach to problem-solving, we will continue to fly the flag high as Singapore’s premier University of Applied Learning.",
    "MR NG YAT CHUNG",
    "CHAIRMAN",
    "SIT at a Glance",
    "President’s Message",
    "Copyright © 2021 Singapore Institute of Technology.",
    "All Rights Reserved.",
    "×"
  ],
  "desc_divs": [],
  "article_texts": [],
  "links": [
    "https://www.singaporetech.edu.sg/annual_report_2021/index.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/cover.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/about.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/sit_glance.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/chairman_message.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/president_message.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/senior_management.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/board_trustees.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/key_highlights.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/academic_year_review.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/applied_learning.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/industry.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/community.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/support_students.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/our_donors.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/corporate_governance.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/board_committees.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/financial_statements.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/next_lap.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/contact.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/sit_glance.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/president_message.html",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.youtube.com/user/SingaporeTech",
    "https://twitter.com/singaporetech",
    "https://www.linkedin.com/company/singapore-institute-of-technology"
  ],
  "images": [
    "assets/imgs/SIT_logo.svg",
    "assets/imgs/members/Ng_yat_chung_umbrage.png",
    "assets/imgs/backgrounds/chairman_message.png"
  ]
}