{
  "url": "https://www.singaporetech.edu.sg/annual_report_2021/applied_learning.html",
  "title": "SIT Annual Report 2021 - Applied Learning",
  "meta": {
    "description": null,
    "keywords": null
  },
  "text_lines": [
    "Cover",
    "About SIT",
    "SIT at a Glance",
    "Chairman’s Message",
    "President’s Message",
    "Senior Management",
    "Board of Trustees",
    "Key Highlights",
    "Academic Year in Review",
    "Applied Learning",
    "Industry",
    "Community",
    "Support for Students",
    "In Appreciation of Our Donors",
    "Corporate Governance",
    "Board Committees & Internal Audit",
    "Financial Statements",
    "Nurturing the Future Workforce",
    "Contact Us",
    "Applied Learning",
    "Core to SIT’s mission in providing higher education is its unique applied learning pedagogy that integrates work and study. Designed to prepare students to meet the ever-changing demands of today and confront the challenges of the future, the education offered at SIT is built upon a solid foundation of industry collaborations and an expanding line-up of programmes that cater to emerging economic sectors.",
    "The university’s suite of applied degree programmes blends high-touch with a core understanding of high-tech, that trains students to think out of the box. SIT’s specialised programmes are designed to deepen the mastery of skills, and are infused with interdisciplinary elements and transferable skills to train students to be agile, work-ready lifelong learning professionals. Complementing SIT’s applied learning approach is the university’s applied research that focuses on creating solutions for contemporary issues, and driving industry innovation and transformation.",
    "Specialised, industry-focused programmes",
    "In line with the university’s mission to offer applied degree programmes targeted at growth sectors of the economy, SIT launched a new",
    "Bachelor of Engineering in Robotics Systems",
    "programme for Academic Year (AY) 2021. With the rising adoption of service and field robots, Singapore’s robotics ecosystem of automation companies, systems integrators, and research institutions has been growing steadily to support the design, development and deployment of robotics solutions in various sectors. The four-year degree programme focuses on the design and development of service/field robotics systems, and places an emphasis on systems engineering, to strengthen the talent pipeline required for the robotics revolution.",
    "Additionally, the Bachelor of Science in Physiotherapy, a joint programme offered by SIT and Trinity College Dublin, has been converted to a three-year, eight-month SIT-conferred programme, starting AY2021. The programme aims to produce professional physiotherapists who are theoretically-grounded and clinically-oriented to practise autonomously in different specialities of physiotherapy.",
    "The accelerated pathway for the Bachelor of Science in Occupational Therapy will be launched in AY2021. Students will be enrolled directly into Year 2 and complete all Year 1 and Year 2 modules within the first year of study to enable graduation in 2 years and 8 months, instead of the usual 3 years and 8 months.",
    "Complementing SIT’s applied degree programmes is the SkillsFuture Work-Study Degree (WSDeg) pathway, which places selected students on an apprenticeship programme with industry partners to gain deeper and meaningful workplace skills and experiences. 58 students were successfully placed with 23 companies under the WSDeg pathway in FY2020. Since its inception in 2017, there have been a total of 243 students placed with 45 companies. 47 out of 48 graduates from the Class of 2019 and 2020 have secured employment within six months upon graduation, with one graduate pursuing a postgraduate programme.",
    "Postgraduate Programmes by Research",
    "In AY2020, SIT launched the Industrial Doctorate Programmes and Industrial Masters Programmes under its suite of Postgraduate Programmes by Research (PGR), with the aim to train and upskill talent for industry at postgraduate level. Students in these programmes will be jointly supervised and hosted by SIT and industry collaborators to work on industry-focused research projects, in addition to completing their postgraduate coursework. As these programmes are new to the industry, they were marketed to companies through various engagement strategies, which include digital campaigns to drive awareness. In FY2020, SIT matriculated six PGR students who are current employees of various partnering companies and organisations, including Sembcorp Marine, NTUC Health Co-operative Ltd and TÜV SÜD PSB Pte Ltd.",
    "Growing Applied Research",
    "Established on 1 April 2020 under the Academic Group, the Applied Research Office (ARO) oversees the governance and management of SIT’s growing array of applied research activities. The key functions of ARO are to oversee:",
    "Research compliance and governance;",
    "Research grant administration and performance management;",
    "Research-related governance of PGR.",
    "ARO has seeded strategic translational research programmes to develop research capabilities to tackle imminent national challenges. Several translational research programmes have been set up in the areas of Energy Resilience, Sustainable Food Innovation, Field/Service Robotics Engineering, Sustainable Infrastructure Engineering & Maintenance, and Community Health Transformation. These translational research programmes are supported by horizontal technology enablers, such as domain-specific cyber security, augmented/virtual reality, artificial intelligence and 5G, as illustrated in Figure 1.",
    "Figure 1: SIT’s translational research programmes",
    "Grants and Industry Funding",
    "ARO has rolled out internal grants, such as Seed Grant, Ignition Grant, and Innovation Capability Grant to provide seed funding to support academic staff to kickstart applied research and work with industry on applied research and innovation projects.",
    "The Seed Grant allows academic staff to test ideas, jumpstart projects, and generate preliminary data for larger quantum grant applications.",
    "The Ignition Grant and Innovation Capability Grant support early-stage translational research projects in collaboration with companies. These grants are aimed at developing SIT academic staff’s capability to work with industry in applied research.",
    "Industry cash and in-kind contributions for the Ignition Grants and Innovation Capability Grants had more than doubled from $2 million in FY2019 to $4.4 million in FY2020 (Figure 2). The total external grants awarded to SIT increased close to three times from $5.5 million in FY2019 to $15.6 million in FY2020 (Figure 3).",
    "Figure 2: Internal Grants (Ignition Grants and Innovation Capability Grants) and Industry Funding",
    "Figure 3: Total external grants awarded to SIT in FY2019 and FY2020",
    "Strengthening Teaching and Learning Through Structured and Strategic Development",
    "In February 2021, the university’s Centre for Learning Environment and Assessment Development (CoLEAD) established three units – Faculty & Strategic Development, Student Development, and Educational Technology – to widen the division’s scope beyond faculty staff development. The division now also aims to harness new technology solutions that are suitable and aligned to the university’s educational needs; develop and run programmes (digital and face-to-face) for students to develop skill sets and traits to learn better; support students’ holistic development, as well as lead institution research studies relating to applied learning outcomes.",
    "CoLEAD launched the",
    "Harnessing Applied Learning Online (HALO)",
    "grant in July 2020 to support academic staff in piloting different online tools that demonstrate the continuity of applied learning despite disruptions in the face of the COVID-19 pandemic. The grant is open to all academic staff with funding of up to $5,000, and the items could range from software licenses to hardware acquisition.",
    "The division also launched the inaugural",
    "Learning to Learn Better (LTLB)",
    "programme in September 2020, in collaboration with the Institute for Applied Learning Sciences and Educational Technology, National University of Singapore, to help at-risk students who require additional support and guidance in their learning. The programme comprises 12 sessions that run throughout a trimester. Students will develop metacognitive skills to plan, implement, and monitor their learning efforts as a self-directed learner. It also focuses on applying these skills to their studies to improve their confidence in learning and academic performance.",
    "In October 2020, CoLEAD refreshed the ‘Coaching as an SIT Educator’ programme that aims to develop academic staff’s capabilities in fully engaging students on their learning journeys in classes, projects, Integrated Work Study Programmes (IWSP), as well as career development. The two-day workshop was highly contextualised and incorporated hands-on practice such as role plays, to support the development of versatile educators who can perform the role of Teacher-Coach-Mentor, and create a deeper impact with their learners at SIT.",
    "The team from CoLEAD led a two-day ‘Coaching as an SIT Educator’ workshop that aims to strengthen academic staff’s capabilities in engaging students.",
    "Enabling Learning Continuity Amid COVID-19 Disruptions",
    "SIT took a whole-of-university approach to minimise disruptions in our students’ educational experience. While flexibility was needed to ensure different learning outcomes could be achieved for different programmes, consistency across the university was important in times of crisis. Despite the challenges, the university made the best use of technology to continue delivering quality education to students.",
    "Students from Mechanical Design and Manufacturing Engineering were able to continue laboratory activities from home, thanks to an innovative Remote Lab for Learning Factory, designed by Professional Officers at SIT. The integrated system comprises webcams, remote access technology, Zoom, computer-based human-machine interfaces (HMI), and Real Electro-Mechanical Systems (REMS). Seven laptops were connected to seven stations at the FESTO learning factory, enabling students to remotely operate the learning factory stations, and monitor operational and control processes via laptop cameras. To facilitate the sessions, Professional Officers were stationed on-site in the laboratory to provide real-time technical support via video conferencing.",
    "The travel restrictions due to the COVID-19 pandemic has not stopped SIT students from participating in cross-border learning. The Global Experience division successfully partnered with overseas companies to bring remote Overseas Integrated Work Study Programme (OIWSP) opportunities to students from the Infocomm Technology cluster. Leveraging virtual platforms, students were able to gain experience working with overseas companies, interact with colleagues of different nationalities, and acquire industry knowledge from the global projects they collaborated on. Some projects that the students worked on remotely include web development, database setup and system research, user interface design, and database architecture design.",
    "In addition, the Global Experience team led a Regional Readiness Initiative to enhance opportunities for students to gain regional exposure and work experience. The initiative also aims to develop students’ awareness of mobility opportunities. Together with partners, including the National Youth Council Singapore, WiseNet Asia, and OSG Youth Alliance, the initiative presents platforms in the form of speaker series, workshops, and seminars, where pertinent social, political, and economic topics are discussed. One such platform was the inaugural Regional Readiness Webinar held in March 2021, on ‘Working Culture & Business Etiquette in China’.",
    "20 Health and Social Sciences students participated in a Virtual Exchange Programme with 73 students from the International University of Health and Welfare (IUHW) in Japan. Students from both universities engaged in knowledge sharing and discussions of their respective countries’ healthcare systems. The session also presented an opportunity for the students to expand their professional network, and gain a wider perspective and deeper understanding of the healthcare systems of both countries.",
    "Laptops connected to different stations at the FESTO learning factory.",
    "Enhancing Applied Learning Experiences",
    "CIA students visited local farms Bollywood Veggies and Insectta as part of the Local Immersion Programme (LIP).",
    "With the Overseas Immersion Programme (OIP) converted to a Local Immersion Programme (LIP) due to the COVID-19 pandemic, 56 students from The Culinary Institute of America (CIA) had the opportunity to learn more about local food production, consumption, and culinary traditions through visits to various local farms, such as Bollywood Veggies and Insectta, from 27 July to 7 August 2020. Students analysed the complexities of the food systems in Singapore and created a research project based on their critical observation and experiential learning, all while observing safe management measures.",
    "Under the Non-Graduating Non-Exchange Coursework scheme, 3 Singaporean students whose overseas studies were disrupted by the COVID-19 pandemic were enrolled into selected SIT programmes. This scheme enabled the students to continue their academic pursuits locally while waiting for the situation to improve.",
    "Hospitality Business students participated in check-in tutorials based on various scenarios of an actual hotel lobby, as part of their applied learning experience.",
    "Professional Officers, in collaboration with faculty from the Hospitality Business programme, conducted hands-on tutorials on 18 and 19 March 2021 for students of the",
    "‘Hotel and Integrated Resort Management’",
    "module. Students participated in check-in tutorials based on various scenarios of an actual hotel lobby, and learned how to create reservations in the Opera Property Management system. They were then split into smaller groups and took turns to role play a check-in, under the coaching of Professional Officers. The role plays were conducted at Republic Polytechnic’s experiential lab.",
    "The Professional Officers supporting SIT’s ICT programmes continue to deepen applied learning and research as well.",
    "A webinar was organised in September 2020, in partnership with ST Engineering, for Telematics (Intelligent Transportation Systems Engineering)* students, showcasing the capabilities of the Smart Lamp Post installed at SIT@Dover. Discussions on technological features, such as the long-range sensors capable of collecting various data, which included vehicle and pedestrian movements, were facilitated. Using an Internet of Things (IoT) platform, students were taught to design dashboards to process the collected data and perform data analysis. They were also encouraged to participate in applied research projects, such as the development of a pedestrian detection system by utilising the lamp post’s CCTV as a sensor platform for autonomous vehicles.",
    "*",
    "Starting Academic Year 2021, the Telematics (Intelligent Transportation Systems Engineering) programme will be known as Computer Engineering.",
    "EXPANDING NETWORK OF PARTNERS FOR LEARNING COLLABORATIONS",
    "A virtual MOU signing ceremony took place between SIT and SCU to renew collaborations in academic staff and student exchanges, as well as research works.",
    "The university’s existing Memorandum of Understanding (MOU) with Seirei Christopher University (SCU) has been renewed for another three years, following a successful partnership between the two institutions in the past three years. With SCU’s focus on Nursing and Rehabilitation Sciences, the areas of collaboration include academic staff exchange, student exchange, and research. The virtual signing ceremony took place on 5 October 2020, attended by Professor Tan Thiam Soon, President, SIT, and Professor Shohei Ohgi, President, SCU.",
    "Enhancing Learning  Framework, Tools, and Operational Capabilities",
    "A student using VR equipment in Gener8 Media Studio as part of an immersive self-study session.",
    "As part of the university’s efforts in enhancing Information and Digital Literacy (IDL), the SIT Library has embarked on developing customisable micro-modules for students that can be explored at their own time. The series of micro-modules rolled out cover fundamental IDL topics, such as ‘Understanding Research Cycle’, ‘Choosing the Right Resources’, and ‘Citing and Organising Sources’. The flipped classroom approach is used, where students watch these micro-modules and attempt quizzes before attending the IDL-embedded modules in classes.",
    "SIT has incorporated a suite of Augmented/Mixed/Virtual Reality (AR/MR/VR) Education Solutions as part of the university’s continual improvement in experiential learning for students. Learning through these solutions provides a low-pressure, risk-free immersive environment that mimics workplace experiences for students to practise, as well as gain familiarity and confidence in handling specific work scenarios before their Integrated Work Study Programme. The SIT Library has configured sensors within the Gener8 Media Studio to double-up the room as a VR immersive environment, and catered for portable equipment, such as VR headsets for loan, so that students can explore immersive learning at their own time.",
    "To ensure that students can access resources anytime and anywhere, the Libraries of all six Autonomous Universities have jointly formed the",
    "Singapore Alliance of University Libraries (SAUL) consortium",
    "to identify common resources for joint negotiation and sharing. In 2020, SAUL negotiated successfully with four publishers — Euromonitor, SAGE, Elsevier, and Statista — to control subscription costs and ensure the financial sustainability and efficiency of resources to support teaching and learning.",
    "A Digital Skills & IT Enrichment Framework (dSiTe) was jointly developed by Centre for Digital Enablement (CoDE), Communications & Information Technology (CIT), Human Resource, and CoLEAD, comprising 27 digital competencies for use by students and staff. The framework provides a guide for students and staff to upskill themselves in preparation for the digital future. dSiTe was first launched during the Learning Fiesta for staff on 28 July 2020, followed by the Digital Fiesta for students on 22 February 2021. Relevant micro-modules are made available on the university’s Learning Management System (xSiTE) for students and staff to kickstart their learning journey.",
    "iD8, a single platform for both divisions and individuals (staff and students) to share innovative digitalisation ideas, was jointly launched by CIT and CoDE on 22 February 2021. A committee chaired by the two divisions will evaluate and identify suitable ideas or problem statements for implementation. To date, the platform has garnered a total of 20 ideas.",
    "In FY2020, the CIT division commenced the development of systemised portals to help streamline and operationalise the flow of knowledge content and databases:",
    "Together with Library and Applied Research Office (ARO), CIT will be launching an all-in-one Institutional Research Repository (IRR) to make research by SIT academics publicly available. The IRR is a digital repository system that captures, stores, preserves, and provides access to academic staff’s intellectual output, so that the reusability of the research outputs can be maximised for the common good. Among the materials included in the repository are articles, technical reports, conference papers and presentations, data sets, and Doctoral and Masters by Research theses. The repository is powered by Figshare, a cloud-based platform that hosts more than 80 universities’ institutional repositories. SIT is partnering Figshare to revolutionise the repository platform with Sherpa Romeo and ORCID integrations. IRR is anticipated to be launched in October 2021.",
    "SIT students who are enrolled in healthcare programmes are required to complete clinical placements in healthcare institutions. The Clinical Practice Education System (CPE) aims to help Clinical Educators, coordinators, and SIT staff to automate the allocation of students – a task that was previously performed manually. A Module Profile Documentation System (MPDS) will be launched as a one-stop portal for module leads to manage module profiles with harmonised data fields and structure, bearing major features, such as versioning control and workflows, for review and approval. The key benefits of MPDS include the acceleration of module profile review and approval processes, improvement of audit readiness and accuracy, ease of coordination, and reduction in human errors. MPDS is anticipated to be launched in October 2021.",
    "The COVID-19 situation required the Admissions division to switch its planned physical interviews to an online platform in 2020. While assessing applicants for admission via an online asynchronous video assessment tool proved to be efficient and effective in 2020 – especially at the height of the pandemic during Circuit Breaker – the Admissions team aimed to incorporate greater interactivity into the assessments for 2021. This has since evolved into a hybrid admissions assessment  model, complementing the use of the video tool with physical interviews for selected students. Additionally, the Admissions team embarked on utilising an artificial intelligence chatbot  for the two Infocomm Technology degree programmes. The chatbot supports ‘conversations’ with invited applicants, assessing them on logical thinking and technical competencies. More than 600 applicants were evaluated through this pilot chatbot assessment and most of them enjoyed the experience, citing that the tool was interactive and user-friendly.",
    "Academic Year in Review",
    "Industry",
    "Copyright © 2021 Singapore Institute of Technology.",
    "All Rights Reserved.",
    "×"
  ],
  "desc_divs": [],
  "article_texts": [],
  "links": [
    "https://www.singaporetech.edu.sg/annual_report_2021/index.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/cover.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/about.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/sit_glance.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/chairman_message.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/president_message.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/senior_management.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/board_trustees.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/key_highlights.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/academic_year_review.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/applied_learning.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/industry.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/community.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/support_students.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/our_donors.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/corporate_governance.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/board_committees.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/financial_statements.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/next_lap.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/contact.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/academic_year_review.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/industry.html",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.youtube.com/user/SingaporeTech",
    "https://twitter.com/singaporetech",
    "https://www.linkedin.com/company/singapore-institute-of-technology"
  ],
  "images": [
    "assets/imgs/SIT_logo.svg",
    "assets/imgs/content/applied_learning_bg.jpg",
    "assets/imgs/content/growing_applied_research.png",
    "assets/imgs/content/internal_grants.jpg",
    "assets/imgs/content/total_grants.jpg",
    "assets/imgs/content/coaching_SIT_Educator_1.jpg",
    "assets/imgs/content/coaching_SIT_Educator_2.jpg",
    "assets/imgs/content/FESTO_learning_1.jpg",
    "assets/imgs/content/FESTO_learning_2.jpg",
    "assets/imgs/content/CIA_Students_LIP_1.jpg",
    "assets/imgs/content/CIA_Students_LIP_2.jpg",
    "assets/imgs/content/CIA_Students_LIP_3.jpg",
    "assets/imgs/content/hospitality_business_students_1.jpg",
    "assets/imgs/content/hospitality_business_students_2.jpg",
    "assets/imgs/content/hospitality_business_students_3.jpg",
    "assets/imgs/content/virtual_MOU.jpg",
    "assets/imgs/content/SAUL_consortium_1.jpg",
    "assets/imgs/content/SAUL_consortium_2.jpg",
    "assets/imgs/content/SAUL_consortium_3.jpg",
    "assets/imgs/content/SAUL_consortium_4.jpg",
    "assets/imgs/content/SAUL_consortium_5.jpg"
  ]
}