{
  "url": "https://www.singaporetech.edu.sg/annual_report_2021/corporate_governance.html",
  "title": "SIT Annual Report 2021 - Corporate Governance",
  "meta": {
    "description": null,
    "keywords": null
  },
  "text_lines": [
    "Cover",
    "About SIT",
    "SIT at a Glance",
    "Chairman’s Message",
    "President’s Message",
    "Senior Management",
    "Board of Trustees",
    "Key Highlights",
    "Academic Year in Review",
    "Applied Learning",
    "Industry",
    "Community",
    "Support for Students",
    "In Appreciation of Our Donors",
    "Corporate Governance",
    "Board Committees & Internal Audit",
    "Financial Statements",
    "Nurturing the Future Workforce",
    "Contact Us",
    "Corporate",
    "GOVERNANCE",
    "(For the financial year ended 31 Mar 2021)",
    "Introduction",
    "SIT was incorporated in September 2009 as a Company limited by guarantee under the Companies Act (Cap. 50). It is an Institution of Public Character (“IPC”) under the Charities Act (Cap 37).",
    "SIT is governed by the Singapore Institute of Technology Act (Cap 299B). Its key constituent document is the Memorandum and Articles of Association which states that the purpose of the University is to promote and undertake the advancement of education by providing educational facilities and courses of study in all fields of knowledge, promote and engage in research and scholarships and establish, operate, promote and maintain the University as a going concern. SIT has three subsidiaries – Verbosecurity Pte. Ltd. (Company Registration No. 201902376G), which was incorporated on 18 January 2019, SIT Microgrid Pte. Ltd. (Company Registration No. 201926986H), which was incorporated on 19 August 2019, and Foodplant Pte. Ltd. (Company Registration No. 202007139N), which was incorporated on 2 March 2020. The three subsidiaries were incorporated to support SIT’s strategic initiatives.",
    "Good corporate governance is the cornerstone of a well-managed University which is, in turn, critical to SIT’s performance and operations. The focus of its governance framework, on which the University’s vision, mission and core values are formulated, promotes accountability and transparency and is manifested in the composition of the Board of Trustees (",
    "“Board”",
    ") and its Committees, division of powers and duties between the Board and Management, adoption of checks and balances and sound measures for internal and corporate controls.",
    "Governance Evaluation Checklist",
    "The University adheres to the Code of Governance for Charities and Institutions of Public Character (",
    "“Code”",
    "). The University has complied in material aspects with the principles and guidelines set out in the Code. Where there are departures from the Code, these are explained under the relevant sections of the Annual Report or the Governance Evaluation Checklist (",
    "“GEC”",
    ").",
    "According to disclosure requirements imposed by the Charity Council, Ministry of Culture, Community and Youth, all IPCs are required to publicly disclose their compliance with the Code. The University’s GEC is made available on the website of the Charity Portal at www.charities.gov.sg.",
    "Board of Trustees",
    "The Board is the highest governing authority of the University and comprises 18 Trustees, chaired by Mr Ng Yat Chung. The Board oversees the business of the University, ensures that it acts in accordance with its objects, that its funds and assets are properly accounted for and safeguarded, and provides guidance and stewardship to Senior Management, conferring regularly with them. The Board is accountable to the Minister for Education, Singapore for its acts and decisions.",
    "The Trustees are eminent persons of good repute and sound judgment who possess collective competencies in areas such as the public and private sectors, academia, accounting and finance, law, information technology, strategic planning, engineering, healthcare and hospitality management and industry knowledge. New Trustees will continue to be selected and invited to serve on the Board on the basis of the diversity of their experience, skills, knowledge, abilities and insight from time to time to ensure constant refreshing of the Board. The Trustees’ profiles appear on pages 13-14 of the Annual Report.",
    "There is an objective decision-making process, which allows each Trustee to exercise his or her own independent judgment. The University has established financial authorisation and approval limits for operating and capital expenditure, the procurement of goods and services, the acquisition and disposal of assets and making investments. The Board approves the annual budget and annual audited financial statements of SIT, amongst other responsibilities. With regard to the reserves policy, the use of the reserves is subject to the approval of the Board.",
    "The Board is supported by eight Board Committees formed in accordance with Article 53 of the Articles of Association (",
    "“AAs”",
    "), namely the Academic Advisory, Audit, Campus Development, External Partnerships, Finance, Industry Relations, Investment and Remuneration Committees. Each Board Committee has clear Terms of Reference setting out their role, authority, powers and matters requiring their approval. The list of Board Committees is on page 54 of the Annual Report.",
    "Briefly, the responsibilities of the Board Committees are described as follows:-",
    "The Academic Advisory Committee advises the University on all academic strategies, policies and issues.",
    "The Audit Committee oversees and reviews the University’s internal controls, integrity of its financial reporting, legal and regulatory risks, enterprise risk management, internal and external audit functions.",
    "The Campus Development Committee maintains oversight of the University’s campus development policies and any other matters related to the acquisition, commissioning and management of significant physical assets or facilities.",
    "The External Partnerships Committee reviews the financial and legal viability of the University’s partnerships with overseas university partners, local universities, institutions of higher learning, corporates, government agencies and other similar institutions.",
    "The Finance Committee provides oversight of the University’s financial policy management.",
    "The Industry Relations Committee advises the University on industry engagement and collaboration strategies.",
    "The Investment Committee oversees the investment of the University’s endowment and surplus funds.",
    "The Remuneration Committee provides independent advice, oversight and policy guidance to the University in employee compensation matters.",
    "Each Board Committee comprises Trustees with appropriate qualifications and skills and there is a fair distribution of responsibilities amongst the Trustees. Where required, non-Trustees who have experience in their respective areas of expertise are invited to provide advice to the Board Committees to enhance the process of decision making. The Board is kept informed of the key matters discussed at each Board Committee meeting.",
    "None of the Trustees have general control and management of the administration of the University’s subsidiaries.",
    "Board Attendance",
    "A total of four Board meetings were held during the financial year from 1 April 2020 to 31 March 2021. The attendance of the Trustees at the Board meetings during the financial year is tabulated below:",
    "Name",
    "Percentage (%) of Attendance",
    "Mr Ng Yat Chung",
    "100",
    "Mr Bill Chang",
    "1",
    "100",
    "Dr Richard Charles Helfer",
    "2",
    "100",
    "Dr Chia Tai Tee",
    "100",
    "Prof Heng Chye Kiang",
    "75",
    "Ms Melissa Khoo",
    "100",
    "Dr Benjamin Koh",
    "100",
    "Mr Kwee Liong Keng",
    "75",
    "Dr Lim Khiang Wee",
    "3",
    "100",
    "Mrs Margaret Lui",
    "100",
    "Name",
    "Percentage (%) of Attendance",
    "Mr Abu Bakar Bin Mohd Nor",
    "75",
    "Ms Gail Ong",
    "100",
    "Mr Quek Gim Pew",
    "75",
    "Mr Ravinder Singh",
    "25",
    "Mr Nagaraj Sivaram",
    "100",
    "Mr Soon Sze Meng",
    "100",
    "Prof Tan Thiam Soon",
    "100",
    "Ms Tammie Tham",
    "100",
    "Mr T K Udairam",
    "100",
    "Mr Wen Khai Meng",
    "100",
    "Management of the University",
    "The President of the University, Professor Tan Thiam Soon, is appointed by the Board and is the Chief Executive Officer and the University’s academic and administrative lead. He is responsible to the Board for the conduct, co-ordination and quality of the programmes of the University and its future development. He is empowered with the authority to perform all acts which are necessary to implement the policies, procedures and actions of the Board. As a liaison between the Board and the University, the President is tasked with the responsibility of informing each party of the views and concerns of the other, relating to the programmes and administration of the University. He also arranges for the annual budget of the University to be presented to the Board annually for approval as part of his duties.",
    "The profiles of other members of the Senior Management of the University can be found on its corporate web page and on pages 11-12 of the Annual Report.",
    "1",
    "Mr Bill Chang was appointed as Trustee of the Board on 16 September 2020.",
    "2",
    "Dr Richard Helfer ceased to be a Trustee of the Board on 16 September 2020.",
    "3",
    "Dr Lim Khiang Wee ceased to be a Trustee of the Board on 16 September 2020.",
    "Conflicts of Interest",
    "The Trustees and staff are required to act in the best interest of the University at all times. Policies have been developed to prevent or manage situations where conflicts of interest could arise, by promoting integrity and ethical business conduct.",
    "The AAs contain provisions for the management and avoidance of conflicts of interest by members of its Board of Trustees. Such provisions include:",
    "permitting a Trustee to be interested in any transaction with the University provided that the Trustee has declared the nature of the interest to the other Trustees of the Board as required under the Companies Act of Singapore and complied with the provisions of AAs to abstain from voting on any matter related to the transaction,",
    "permitting a Trustee, or a firm associated with the Trustee, to act in any professional capacity for the University and to be remunerated for the provision of professional services, and",
    "permitting a Trustee to be reimbursed for out-of-pocket expenses, travelling and other expenses properly incurred by the Trustee in attending and returning from meetings of the Board of Trustees, any of its committees, or any general meeting of the University or otherwise in connection with the affairs of the University.",
    "The AAs also state that Trustees shall not receive any remuneration for services rendered by them as Trustees. In addition, the University does not have any staff receiving more than S$50,000 in annual remuneration that is a close relative of any Trustee.",
    "The University has implemented a Conflicts of Interest Policy which all staff must comply with. In accordance with that Policy, staff must ensure that their private activities and interests do not conflict with their professional obligations to the University. Where there is a potential conflict of interest, the staff is required to submit full disclosure and request for an appropriate exemption. The University will grant such exemptions at its discretion. In addition, staff are required to declare their compliance with the University’s prevailing policy on conflicts of interest annually.",
    "In appreciation of our donors",
    "Board Committees & Internal Audit",
    "Copyright © 2021 Singapore Institute of Technology.",
    "All Rights Reserved.",
    "×"
  ],
  "desc_divs": [],
  "article_texts": [],
  "links": [
    "https://www.singaporetech.edu.sg/annual_report_2021/index.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/cover.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/about.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/sit_glance.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/chairman_message.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/president_message.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/senior_management.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/board_trustees.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/key_highlights.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/academic_year_review.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/applied_learning.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/industry.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/community.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/support_students.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/our_donors.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/corporate_governance.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/board_committees.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/financial_statements.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/next_lap.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/contact.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/our_donors.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/board_committees.html",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.youtube.com/user/SingaporeTech",
    "https://twitter.com/singaporetech",
    "https://www.linkedin.com/company/singapore-institute-of-technology"
  ],
  "images": [
    "assets/imgs/SIT_logo.svg"
  ]
}