{
  "url": "https://www.singaporetech.edu.sg/annual_report_2021/key_highlights.html",
  "title": "SIT Annual Report 2021 - Key Highlights",
  "meta": {
    "description": null,
    "keywords": null
  },
  "text_lines": [
    "Cover",
    "About SIT",
    "SIT at a Glance",
    "Chairman’s Message",
    "President’s Message",
    "Senior Management",
    "Board of Trustees",
    "Key Highlights",
    "Academic Year in Review",
    "Applied Learning",
    "Industry",
    "Community",
    "Support for Students",
    "In Appreciation of Our Donors",
    "Corporate Governance",
    "Board Committees & Internal Audit",
    "Financial Statements",
    "Nurturing the Future Workforce",
    "Contact Us",
    "KEY HIGHLIGHTS",
    "FY2020/21 has been an eventful year at SIT. Despite the challenges posed by the pandemic, we have continued to achieve much progress.",
    "2020",
    "2021",
    "2020",
    "15 April 2020",
    "SIT Alumni Network Events Go Online",
    "During the pandemic, the SIT Alumni Network events were held via Zoom to help alumni stay in touch with one another and with SIT while remaining safe. The Alumni Sports Network kept alumni fit with HIIT (High Intensity Interval Training) sessions, K-Kardio, and Barre exercises. Under the Alumni Career Network, they learnt how to ace virtual interviews and plan for their finances. There were many workshops on offer under the Alumni Leisure Network as well, including workshops on crafting their own scents, creating beautiful marbled coasters in the Jesmonite Marbling Workshop, and making their own terrariums. Many of these workshops were held over multiple sessions to cater to the high demand from alumni.",
    "7 May 2020",
    "Workshop for Community and Home-Based Physiotherapists",
    "Professional Officers supporting the Health and Social Sciences cluster conducted this refresher workshop. Participants were taught basic infection control, which included hand hygiene and personal protective equipment (PPE) protocol. In addition, participants were assessed and certified with the N95 Respirator Fit Test Certificate after their N95 mask fitting.",
    "3 July 2020",
    "SIT Scholars’ Tea Session",
    "As part of the Scholars’ Engagement Programme, the SIT Scholars’ Tea Session is an annual event aimed at strengthening the bond between SIT scholars and the university. This year, 36 scholars attended the virtual session, where guest speaker and trainer, Mr Stephan Lew, Founder, The School of Positive Psychology, spoke about ‘Resilience and Adaptability during COVID-19’ and guided the scholars through a series of introspective exercises. Through the session, the SIT scholars were able to better identify and develop their strengths, as well as learn how to formulate their own resilience plan.",
    "18 August 2020",
    "SIT Faculty Retreat 2020",
    "The SIT Faculty Retreat is an annual event where academic staff get together to exchange ideas and share information on how SIT can further deliver quality education to students. This year’s retreat was hosted by the Centre for Learning Environment and Assessment Development (CoLEAD) and held virtually due to COVID-19. Themed ‘Deepening Applied Learning’, the retreat included sharing by our academic staff and breakout discussions to brainstorm ideas on developing active learning and deepening authentic learning at SIT.",
    "20 August 2020",
    "Inaugural Virtual Exchange Programme for HSS Students",
    "The restrictions on overseas travel did not stop SIT students from having a cross-border learning experience. 20 Health and Social Sciences students participated in an online exchange programme with 73 students from Japan’s University of Health and Welfare (IUHW). Through the sharing and discussion of the respective countries’ healthcare systems, students expanded their professional network and gained a deeper understanding of the workings of both countries’ healthcare systems.",
    "24 August – 24 September 2020",
    "SIT’s First E-Orientation",
    "SIT’s first E-Orientation 2020 went ‘live’ on 24 August 2020, featuring useful resources to induct incoming freshmen into the university. 2,733 participants logged onto a dedicated microsite, developed and managed by four Infocomm Technology students. Key highlights included 3D virtual campus tours, which provided an opportunity for freshmen to ‘explore’ SIT@Dover and SIT@Poly Buildings with SITizen Ambassadors; as well as Day Zero, which introduced SIT’s applied learning pedagogy to 400 students through 140 Zoom sessions involving over 180 faculty. A virtual club fair was also held to enable freshmen to interact with representatives from over 90 student clubs and programmes.",
    "6 October 2020",
    "SAA and Staff Appreciation Day 2020",
    "More than 400 staff supported the online event, which incorporated the annual Service Appreciation Award (SAA) where 5- and 10-year Long Service Awards were given to staff in recognition of their service to SIT. Other activities included a Virtual Sports Challenge to promote well-being and sharing by SIT staff on embracing the ONE SIT culture. Staff were also encouraged to send appreciation messages to one another through the Cheers4Peers e-platform.",
    "19-20 October 2020",
    "Coaching as an SIT Educator Programme",
    "The coaching programme was launched by CoLEAD for academic staff to develop holistic capabilities to fully engage with students at different touchpoints of their learning journeys — classes, projects, Integrated Work Study Programmes (IWSP), and career development. The two-day workshop supported the development of versatile educators who could perform the role of Teacher-Coach-Mentor and create a deeper impact with their learners at SIT.",
    "21 October 2020",
    "IRB-IACUC Joint Awareness Day",
    "The SIT Research Integrity Committee (RIC), Institutional Review Board (IRB), and Institutional Animal Care and Use Committee (IACUC) came together to organise an Awareness Day to promote responsible conducting of research, including ethics in research involving human subjects and the use of animals. Responsible research conduct is an important aspect as SIT grows its portfolio of applied research activities and collaborates widely with industry and national agencies. The webinar, which attracted more than 100 SIT staff and students, saw participants interacting actively with the panel of internal and external speakers on research compliance, research practices, and ethical issues.",
    "29 October 2020",
    "Community Care Industry Networking Day 2020",
    "The Community Care Industry Networking Day 2020 was its fourth run since the inaugural session in 2017. Organised for the first time virtually, the event was supported by our partners — Agency for Integrated Care (AIC), and National Council of Social Service (NCSS) — to raise awareness of the community care setting among Year 1 Allied Health and Nursing undergraduates. At the event, 12 professionals from the healthcare industry shared with the participants their own career journey, giving them insights into the industry and what the typical work culture is like.",
    "13 November 2020",
    "Establishment of the Sing Lun Scholarship and Bursary",
    "Thanks to an endowed gift of $1 million from Mr Patrick Lee, Chairman, Sing Lun Holdings Pte Ltd, the Sing Lun Scholarship and Sing Lun Bursary will go a long way in supporting SIT undergraduates who are passionate about giving back to the community. Five scholarships (valued at $10,000 each) and five bursaries (valued at $5,000 each) will be awarded annually and in perpetuity. Mr Lee’s friendship with SIT goes back to 2013 – in his capacity as President of the Yangzheng Foundation – the year when the Foundation launched the endowed Yangzheng Foundation Bursary for SIT students.",
    "15 November 2020",
    "Naming of the SHHK Collaboration Loop and SHHK Lecture Theatre",
    "As part of its efforts to nurture talents and promote education, the Singapore Hokkien Huay Kuan (SHHK) made an endowed gift of $1.8 million through its charitable arm, The Hokkien Foundation, to SIT, in support of the university’s centralised campus in Punggol. In recognition of this generous gift, SIT named the Collaboration Loop at its future campus in Punggol the ‘Singapore Hokkien Huay Kuan Collaboration Loop’. In the interim, a lecture theatre at the SIT@Dover campus was named the ‘Singapore Hokkien Huay Kuan Lecture Theatre’. This gift was presented to SIT at SHHK’s 180th anniversary celebration, in the presence of Prime Minister Lee Hsien Loong.",
    "27 November 2020",
    "Graduation Ceremony for Specialist Certificate in Systems Engineering",
    "PSA and SIT co-organised a virtual graduation ceremony for the final batch of 30 PSA graduates from the collaborative training programme in Systems Engineering. The ceremony marked the successful culmination of the three-year PSA-SIT strategic partnership to co-develop a training programme that upgrades and deep-skills professionals in port operations.",
    "1-8 December 2020",
    "ASCEL 2020 Bronze Medal Award",
    "A team of Professional Officers at SIT won the bronze medal poster award at the Asian Conference on Safety and Education in Laboratory (ASCEL). The team presented their paper on “Continuous Improvement of Chemical Waste Management to Enhance Safety in the Laboratory Waste Room”. The team highlighted how laboratory waste plays an important role in laboratory safety and unsafe practices, such as mixing of incompatible chemicals in a waste container, which may result in hazardous reactions, thus endangering laboratory safety.",
    "7-11 December 2020",
    "SWITCH 2020",
    "SIT participated as an exhibitor at the Singapore Week of Innovation and TeCHnology (SWITCH) 2020. Previously held physically, this week-long event featured a hybrid digital and physical experience. Together with the Singapore FinTech Festival (SFF), SFF x SWITCH saw more than 60,000 attendees from 160 countries. SIT took up a digital booth under the A*STAR Village, showcasing our applied research focus areas and Technology Innovation Centres (TICs) — Accounting Technology & Innovation Centre (AccTech Centre), Energy Efficiency Technology Centre (EETC), Food Technology Innovation Centre (FoodPlant), Rapid Product Innovation and Development (RaPID) Centre, and Verbosecurity (VBS). Visitors to the booth were able to learn more about these centres and how they could potentially collaborate with SIT.",
    "9 December 2020",
    "MOU Signing with DSO National Laboratories",
    "A joint laboratory at SIT@Dover will be established by DSO and SIT in 2021 to spearhead applied research efforts for potential defence and commercial use. The collaboration includes strategic translational projects in the fields of robotics/unmanned systems and cyber security, involving SIT academic staff and students from the Engineering and Infocomm Technology clusters. The Memorandum of Understanding (MOU) cements a strong intention for DSO and SIT to collaborate in innovation projects, such as design thinking, prototyping, exchanging and development of knowledge and technical expertise, training of students, as well as the engagement of work attachments and student researchers.",
    "9 December 2020",
    "MOU Signing with Professional Engineers Board",
    "A Memorandum of Understanding (MOU) was signed with PEB, paving the way for more bridging courses, aimed at preparing engineers for their Professional Engineers (PE) registration. The collaboration saw the launch of specialised courses for PE registration, such as the Introductory Course on Fundamentals of Engineering Examination (FEE) in Civil Engineering, Introductory Course on FEE in Electrical Engineering, and certification courses in Tunnel Engineering. A total of 90 participants attended these specialised courses from September 2020 to April 2021. This partnership with PEB strengthens SIT’s position as Singapore’s University of Applied Learning and a partner in the advancement of the practice of Professional Engineering for the engineering sector.",
    "10 December 2020",
    "Establishment of the Masonic Charitable Fund Endowment Bursary",
    "A signing and cheque presentation ceremony was held at SIT@Dover to establish the Masonic Charitable Fund Endowment Bursary at SIT. This marked the first endowed gift that The Masonic Charitable Fund made to an Institute of Higher Learning. Starting from AY2021, this gift will enable SIT to support three Singaporean undergraduates, annually and in perpetuity, through the Masonic Charitable Fund Endowment Bursary (valued at $5,000 each).",
    "21 December 2020",
    "SIT Scholarship Awards and Appreciation Ceremony",
    "In view of the COVID-19 pandemic, the annual SIT Scholarship Awards and Appreciation Ceremony was held virtually for the first time. We welcomed 32 new SIT scholars, as well as recognised the contributions and achievements of 26 graduating scholars. Mr Lim Xun Xiang Bryan, a graduating scholar from the Pharmaceutical Engineering programme, shared words of encouragement with the new batch of SIT scholars, calling on them to be resilient in the face of challenging times.",
    "December 2020 - January 2021",
    "Delivered to the Doorstep: The New Alumni Welcome Pack",
    "In place of the traditional New Alumni Welcome Party that had to be delayed amid the pandemic, SIT sent a New Alumni Welcome Pack to the Class of 2020, delivered right to their doorstep. The Pack contained a packet of customised rock candy, a handcrafted soap bar from Rough Beauty (an SIT-alumni owned business), a fabric mask with its pouch, stickers, as well as stick-on patches featuring the winning designs by SITizens from the Sticker-Patch Competition held in 2020. Diagnostic Radiography graduate, Ms Jolene Tan, said, “I definitely enjoyed unwrapping and exploring the items in the pack, I thought it was very thoughtful, especially in times like this. I like that the mask had a small design at the side and I have stuck the patches in my room, as a memento.”",
    "2021",
    "8-9 January 2021",
    "Virtual SIT Scholars’ Camp",
    "The SIT Scholars’ Camp has always been a physical event held at the National Community Leadership Institute. In view of the pandemic, the camp was converted online for the first time, where 32 newly-minted SIT scholars interacted virtually with the rest of the SIT scholar community. Through a series of workshops and team-bonding exercises, the scholars were challenged to look at opportunities to drive positive change in the community and beyond.",
    "16-17, 23-24 January 2021",
    "SIT Virtual Open House",
    "SIT hosted its first Virtual Open House (VOH) in 2021 over two weekends. The inaugural VOH focused on three areas – showcasing our range of undergraduate degree programmes through live talks and dialogue sessions; a live chat function for prospective students to engage with faculty members and current students; as well as a 360-degree virtual tour of all SIT campuses and lab facilities. SIT also continued to feature ‘Stories of SITizens’ and ‘Singularly Talented SITizens’, which presented narratives as well as videos of its current students, scholars, and alumni. The VOH microsite attracted over 81,000 unique visitors and over 25,500 unique views across the talks throughout the admissions exercise.",
    "25-28 January 2021",
    "Career Nexus 2021",
    "Career Nexus 2021, conducted virtually for the first time, was the largest networking event to date, attracting 161 companies and over 2,000 students. The platform enabled SITizens to explore Integrated Work Study Programmes (IWSP) and full-time positions with participating companies. To facilitate the virtual networking, each industry partner was provided a virtual booth which could be personalised to reflect their company branding and featured materials. Video chatrooms were also available for industry partners to invite students to engage with them.",
    "In addition, alumni and industry partners shared their career journeys, work experiences, and invaluable tips with the students through ‘Voices of Experience’ sessions that catered to the different fields of studies.",
    "22 February 2021",
    "Digital Fiesta",
    "The Centre for Digital Enablement (CoDE), in collaboration with Student Life, launched the Digital Fiesta for SIT students with the objective of creating awareness on digital technology and encouraging the learning of digital skills. The event launched the digital skills and IT enrichment (dSiTe) competency framework to students and provided a platform for students to learn new digital skills, such as 3D modelling and Python programming through virtual workshops.",
    "23-27 February 2021",
    "SIT Graduation Ceremony 2020/21",
    "SIT was the first autonomous university in Singapore to conduct a physical graduation ceremony for the Class of 2020, with 11 sessions held in February 2021 at The Theatre at Mediacorp. Close to 2,200 graduates from 47 undergraduate and postgraduate programmes received their degree scrolls, including the pioneer batch of 211 locally trained Allied Health professionals, with 97% of these graduates already employed. In addition, the pioneer cohort of 48 students from the Civil Engineering programme, designed to address the need for local manpower in the built environment and construction industry, graduated at the ceremony.",
    "26 February 2021",
    "Healthcare Innovation Webinar",
    "The National Centre of Excellence for Workplace Learning at SIT (NACE@SIT), in collaboration with Kwong Wai Shiu Hospital and the Lean Management Instituut, Netherlands, held the ‘Sharing of Innovative Best Practice in a Pandemic World’ webinar for about 150 participants from the healthcare industry in both countries. The webinar helped promote cross-sharing of knowledge gained from COVID-19 experiences and encouraged innovation of processes and technology within the sector.",
    "27 February – 13 March 2021",
    "Inter-Cluster Games 2021",
    "The Inter-Cluster Games (ICG) is a hallmark event of SIT that promotes unity, inclusion, and camaraderie amongst students, faculty, and alumni. This year, with safe management measures in place, the Games were carried out over two weeks, with newly-added satellite events conducted across SIT campuses. Aside from conventional physical sports, ICG 2021 also debuted Mindsports together with E-sports as competition categories, with students competing in platforms like Chess, Xiangqi, Mobile Legends, and Counter-Strike: Global Offensive. It also marked the first time SIT alumni formed a cluster of their own to compete in the Games, with alumni bagging several medals across a variety of events.",
    "3 March 2021",
    "SITizen Ambassadors’ Investiture 2021",
    "The SITizen Ambassadors’ Investiture formally inducted 67 students into the SITizen Ambassador programme. These students received coaching in formal business communication and social media management, and learned how SIT’s unique origins can influence the university’s position in today’s economy. SITizen Ambassadors were also given opportunities to gain a deeper understanding of the university’s vision and mission, and strategise for our future alongside members of faculty and staff.",
    "9 March 2021",
    "The Mapletree Challenge 2020 Prize Presentation Ceremony",
    "The six finalist teams of The Mapletree Challenge 2020 Grand Final gathered to present their innovative and entrepreneurial ideas in person at The Mapletree Challenge 2020 Prize Presentation Ceremony in March 2021, hosted by Mapletree Investments Pte Ltd. Team Paste Pods, comprising four Hospitality Business students, clinched The Mapletree Challenge Gold Award at the Grand Final, held via vodcast on 23 July 2020. The team proposed using seaweed abstracts as alternative packaging to eliminate single-use plastic toothpaste tubes to reduce the carbon footprint of hotels.",
    "12 March 2021",
    "Student Leader Appreciation Night 2021",
    "Student Leader Appreciation Night is an annual event to recognise the contributions and achievements of student leaders. Held online for the first time, the event took on the ‘Take Flight’ theme. Attendees were treated to meals (in-flight style), student performances, as well as sand art illustration of a student leader’s journey. The event also saw the announcement of winners for the various Student Leaders Awards.",
    "26 March 2021",
    "Inaugural Regional Readiness Webinar",
    "As part of the strategic goal to attract, develop, and equip the right students, SIT seeks to enhance Regional Readiness of SITizens in the ASEAN, China & India (ACI) region. 14 SIT students attended the webinar session on ’Working Culture & Business Etiquette in China’, the first of a series launched as part of the Regional Readiness initiative. The speakers, Mr Wesley Hui, Founder of WiseNet Asia and Mr Neo Weisheng, a former Global Leadership Associate at Alibaba Group, shared with attendees the social, cultural, and political dimensions of China, and provided practical tips on how to thrive professionally on the global stage in today’s landscape.",
    "Board of Trustees",
    "Academic Year in Review",
    "Copyright © 2021 Singapore Institute of Technology.",
    "All Rights Reserved.",
    "×"
  ],
  "desc_divs": [],
  "article_texts": [],
  "links": [
    "https://www.singaporetech.edu.sg/annual_report_2021/index.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/cover.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/about.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/sit_glance.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/chairman_message.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/president_message.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/senior_management.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/board_trustees.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/key_highlights.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/academic_year_review.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/applied_learning.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/industry.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/community.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/support_students.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/our_donors.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/corporate_governance.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/board_committees.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/financial_statements.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/next_lap.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/contact.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/key_highlights.html#2020_highlights",
    "https://www.singaporetech.edu.sg/annual_report_2021/key_highlights.html#2021_highlights",
    "https://www.singaporetech.edu.sg/annual_report_2021/board_trustees.html",
    "https://www.singaporetech.edu.sg/annual_report_2021/academic_year_review.html",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.youtube.com/user/SingaporeTech",
    "https://twitter.com/singaporetech",
    "https://www.linkedin.com/company/singapore-institute-of-technology"
  ],
  "images": [
    "assets/imgs/SIT_logo.svg",
    "assets/imgs/highlights/15_apr_2020.jpg",
    "assets/imgs/highlights/7_may_2020.jpg",
    "assets/imgs/highlights/3_july_2020.jpg",
    "assets/imgs/highlights/18_aug_2020.jpg",
    "assets/imgs/highlights/20_aug_2020.jpg",
    "assets/imgs/highlights/24_aug_2020.jpg",
    "assets/imgs/highlights/6_oct_2020.jpg",
    "assets/imgs/highlights/19_20_oct_2020.jpg",
    "assets/imgs/highlights/21_oct_2020.jpg",
    "assets/imgs/highlights/29_oct_2020.jpg",
    "assets/imgs/highlights/13_nov_2020.jpg",
    "assets/imgs/highlights/15_nov_2020.jpg",
    "assets/imgs/highlights/27_nov_2020.jpg",
    "assets/imgs/highlights/1_dec_2020.jpg",
    "assets/imgs/highlights/7_dec_2020.jpg",
    "assets/imgs/highlights/9_dec_2020.jpg",
    "assets/imgs/highlights/9_dec_2020-1.jpg",
    "assets/imgs/highlights/10_dec_2020.jpg",
    "assets/imgs/highlights/21_dec_2020.jpg",
    "assets/imgs/highlights/dec_2020_jan_2021.jpg",
    "assets/imgs/highlights/8_jan_2021.jpg",
    "assets/imgs/highlights/16_jan_2021.jpg",
    "assets/imgs/highlights/25_jan_2021.jpg",
    "assets/imgs/highlights/22_feb_2021.jpg",
    "assets/imgs/highlights/23_feb_2021.jpg",
    "assets/imgs/highlights/26_feb_2021.jpg",
    "assets/imgs/highlights/27_feb_2021.jpg",
    "assets/imgs/highlights/3_mar_2021.jpg",
    "assets/imgs/highlights/9_mar_2021.jpg",
    "assets/imgs/highlights/12_mar_2021.jpg",
    "assets/imgs/highlights/26_mar_2021.jpg"
  ]
}