{
  "url": "https://www.singaporetech.edu.sg/annual_report_2022/applied_learning_applied_research/learning",
  "title": "Applied Learning",
  "meta": {
    "description": "2022 Annual Report for Singapore Institute of Technology",
    "keywords": null
  },
  "text_lines": [
    "Applied Learning",
    "Applied Research",
    "APPLIED LEARNING",
    "SIT offers quality higher education through an integrated applied learning and research approach. The University’s specialised degree programmes are designed to deepen the mastery of skills, with interdisciplinary elements and transferable skills infused into the curriculum.",
    "NURTURING WORK-READY AND AGILE LIFELONG LEARNERS",
    "In FY2021, SIT rolled out the",
    "Undergraduate Programme Structure (UPS),",
    "which infuses interdisciplinary and transferable skills into each programme. In Academic Year 2021 (AY2021), SIT selected five degree programmes to come under the UPS, namely Digital Communications and Integrated Media, Pharmaceutical Engineering, Physiotherapy, Robotics Systems, and Speech and Language Therapy.",
    "SIT’s approach to interdisciplinary learning is to develop in its students the ability to take in multiple perspectives and synthesise solutions for multifaceted problems. The University has piloted interdisciplinary learning through a sequence of modules starting with Critical Thinking and Communicating, followed by two Design Innovation modules that are based on a project-based learning approach.",
    "Thereafter, the Social Innovation Project allows multidisciplinary student teams to put their interdisciplinary skills into practice while leveraging their disciplinary expertise. Under the UPS, each programme will have at least 15% of total curriculum credits associated with interdisciplinary elements, including programme-specific modules with subject matter from adjacent disciplines.",
    "In FY2021, an",
    "Industry Ready Skills Framework (IRSF)",
    "was formalised to offer structured transferable skills training embedded into both formal and informal curriculum starting from AY2022. The IRSF aims to equip graduates with transferable skills that will shape them into agile lifelong learners who are able to progress, adapt, and pivot in their careers. The scaffolded training embodies the overall skills, competencies, and attributes that SIT graduates can acquire to bolster their effectiveness as they step into their professional career.",
    "IRSF comprises five competency areas – Thinking Agility, People Agility, Digital Agility, Professional Agility, and Change Agility – and 18 transferable skills that SIT will focus on, such as Creative Thinking, Digital Data Literacy, and Professional Ethics.",
    "NEW DEGREES FOR THE FUTURE ECONOMY",
    "Three new degree programmes aimed at nurturing specialised talents proficient in leading industry transformation will commence in AY2022. The new three-year direct honours programmes are:",
    "Bachelor of Science with Honours in Applied Artificial Intelligence",
    "Bachelor of Science with Honours in Digital Supply Chain",
    "Bachelor of Science with Honours in Applied Computing with a specialisation in Fintech",
    "Additionally, three programmes jointly offered by SIT and Newcastle University – Marine Engineering, Naval Architecture, and Offshore Engineering – have been redesigned to",
    "Bachelor of Engineering with Honours in Naval Architecture and Marine Engineering.",
    "AN INDUSTRY-ENGAGED EDUCATION",
    "As part of the University’s strategic focus in pioneering workplace learning, SIT is piloting a new",
    "Competency-Based Workplace Learning (CBWL)",
    "pathway. This first-of-its kind pathway in Singapore is developed in partnership with Ensign InfoSecurity, the Land Transport Authority (LTA), SBS Transit and SMRT Corporation.",
    "The following CBWL degree programmes were piloted in AY2021:",
    "Bachelor of Engineering in Information and Communications Technology (Information Security)",
    "in collaboration with Ensign InfoSecurity.",
    "Bachelor of Engineering and Master of Engineering Technology in Sustainable Infrastructure Engineering (Land)",
    "in collaboration with LTA, SBS Transit and SMRT Corporation.",
    "Bachelor's Degree",
    "Master's Degree",
    "The University is also looking to introduce other workplace learning programmes based on a revamped",
    "Term-In/Term-Out (TITO)",
    "work-study modality, where students spend at least a trimester every year in the workplace, working on a project or activity with clear learning objectives for credit. The model allows students to effectively start on his or her career while reading a degree. At the same time, sponsoring companies will be able to green harvest talents in an area of high demand.",
    "Mr Chan Chun Sing, Minister for Education with a representative from SMRT Corporation.",
    "PDD BUG BOUNTY COMPETITION",
    "Joel Chan (left), together with Prof Tan Thiam Soon, Institute Professor, SIT, at the ‘PDD: Connecting Smartness’ event on 28 July 2021. Joel won the speed round of the PDD Bug Bounty, where he uncovered the first vulnerability in less than 10 minutes.",
    "SIT organised the inaugural",
    "Punggol Digital District (PDD) Bug Bounty",
    "competition in May 2021, where about 50 students were given four hours to identify vulnerabilities – also known as ‘bugs’ – that could compromise building management systems hosted on an isolated network managed by the University. The contest was held in partnership with Singapore-based cybersecurity firm Group-IB, the Cyber Security Agency of Singapore, and cyber security community, Division Zero.",
    "HANDS-ON MICROLEARNING",
    "The SIT Library facilitates learning opportunities for students to acquire transferable skills through hands-on activities coupled with microlearning or talks. These sessions, aimed at holistic development through transferable skills training outside of the formal curriculum, include tinkering with robots, media equipment, and hydroponics farming:",
    "Borrowing Robots at SIT Library",
    "Robots are available for loan to aid students in their learning in robotic automation and artificial intelligence. Three robots are available for loan, each bearing different sensors and functions, such as facial recognition, emotion recognition, simple navigation, obstacle sensor, and colour sensor.",
    "Edibles: Urban Farming Initiatives",
    "30 students who signed up for hydroponics farming will receive hands-on training at the hydroponics system to grow their chosen list of vegetables.",
    "Hands-on Media Production",
    "Students have access to the Gener8 studio at the Library where they can produce various multimedia projects such as podcasts and vodcasts.",
    "Building on the success of the inaugural",
    "Local Immersion Programme (LIP)",
    "in 2020, 56 students from The Culinary Institute of America (CIA) participated in the second edition of the LIP from 26 July to 13 August 2021. They learnt about local food production, consumption, and culinary traditions through visits to various local farms, including Hay Dairies and Kok Fah. Students analysed the complexities of the food systems in Singapore and created a research project based on their critical observations and experiential learning, all while observing Safe Management Measures.",
    "The immersion activity allowed CIA students to learn about local food production, consumption, culinary traditions, and how to apply the knowledge to their culinary creations.",
    "An alternative",
    "Overseas Immersion Programme (OIP)",
    "from 16 August to 3 September 2021 was also organised for students of University of Glasgow (UofG) due to travel restrictions. The academic portion of the OIP was delivered through a hybrid arrangement, with modules led remotely by UofG faculty with support from the Singapore campus and SIT teaching staff. Students from the Mechanical Engineering and Computing Science programmes also had the opportunity to work on a cross-disciplinary design project.",
    "SIT was the first institute of higher learning to conduct a specialised course on ‘High Moisture Extrusion Technology (HMET) for Meat Analogues’ for the public from 24 to 25 June 2021. A second run took place from 23 to 24 September to cater to the demand from industry.",
    "FoodPlant",
    ", a $13 million shared facility for small-batch food production was jointly launched by SIT, Enterprise Singapore, and JTC Corporation after much planning and preparation throughout FY2021. Food companies will have access to high-tech food equipment at the 1,107 sqm facility in Senoko Drive. More than 20 members, made up of multinational corporations and SMEs, have signed up to date. Firms will be able to utilise the equipment on site, tap research and development consultancy services, as well as attend training and upskilling courses in food innovation.",
    "Attendees from the High Moisture Extrusion Technology (HMET) for Meat Analogues course pictured here with FoodPlant CEO, Dr Lim Bee Gim.",
    "CONTINUED PARTNERSHIPS WITH REPUTABLE OVERSEAS UNIVERSITIES",
    "Since 2016, SIT and New Zealand’s",
    "Massey University (MU)",
    "have partnered to jointly deliver the Bachelor of Food Technology degree programme. The partnership has been mutually beneficial, leveraging MU’s expertise in food technology and SIT’s expertise in engineering to deliver a programme with good graduate employment outcome in a key growth sector. The partnership has been renewed for another five academic years. Beyond the delivery of the degree programme, the continued partnership will also allow both universities to explore new collaborations in applied research.",
    "SIT has also renewed its partnership with",
    "Newcastle University (NU)",
    "to continue to jointly deliver several degree programmes that have been established since AY2017. As a member of the Russell Group, NU brings to the partnership valuable engineering expertise in the delivery of the joint programmes. The Russell Group represents 24 leading universities in the UK. The partnership has been renewed for another five years, and includes opportunities for both universities in applied research.",
    "STRENGTHENING TEACHING AND LEARNING",
    "The",
    "Applied Learning and Innovation Grant (ALIGN)",
    "was launched in May 2021 to meet the increased focus on the use of technology to enhance teaching and learning. ALIGN replaces the SIT Advancement of Learning and Teaching (SALT) grant, and is open to all academic staff, with funding of up to $40,000. A total of nine teams were awarded the ALIGN with a combined funded amount of $150,000 in the first grant call.",
    "In November 2021,",
    "Coach Academy",
    ", a digital coaching and mentoring knowledge repository, was launched to equip academic staff with reference materials by leading academic researchers and industry practitioners. The repository is broadly categorised into General Coaching Resources, Coaching Knowledge & Practices, Coaching Science, and Coaching in Education.",
    "In line with the launch of CBWL,",
    "the Centre for Learning Environment and Assessment Development (CoLEAD)",
    "organised several training sessions in 2021 for all academic staff to attend. The key focus was on curriculum design based on the ‘backward design’ approach, and development of authentic assessments in alignment with course competencies.",
    "To support social innovation projects, the internal",
    "CLASIC Project Grant Scheme",
    "was established in 2021 by the University’s Community Leadership and Social Innovation Centre (CLASIC) to evaluate and fund projects proposed by academic staff that harnessed their expertise, as well as students’ skills and knowledge. The projects must aim to develop practical and innovative solutions that address national or common social challenges in Singapore. In its first year of establishment, CLASIC has awarded a total of S$53,232 to four projects:",
    "Project Partner(s)",
    "Project Title",
    "Project Lead",
    "National Environment Agency (NEA)",
    "Design a Recycling Receptacle for distribution to all households in Singapore",
    "Mr Kwong Kwok Kuen",
    "Senior Professional Officer",
    "ECOSOFTT Pte Ltd",
    "Development and installation of a Smart Meter to better manage water usage and cost for the low-income households",
    "A/Prof Steven Tay",
    "Engineering",
    "Rainbow Centre and HOPE Technik",
    "Design solutions for special needs classroom chairs in Singapore",
    "Asst Prof Karina Dancza",
    "Health and Social Sciences",
    "Singapore Muslim Women’s Association (PPIS)",
    "Design learning activities for PPIS student care centre",
    "Dr Muhamed Fauzi Bin Abbas",
    "Infocomm Technology",
    "Applied Learning",
    "Applied Research",
    "Move to top",
    "KEY HIGHLIGHTS",
    "INDUSTRY &\n COMMUNITY",
    "Copyright © 2022 Singapore Institute of Technology.",
    "All Rights Reserved.",
    "COVER & THEME",
    "SIT AT A GLANCE",
    "LEADERSHIP",
    "KEY HIGHLIGHTS",
    "APPLIED LEARNING &\n APPLIED RESEARCH",
    "INDUSTRY &\n COMMUNITY",
    "SUSTAINABILITY\n EFFORTS",
    "SPONSORS &\n DONORS",
    "CORPORATE\n GOVERNANCE",
    "BOARD COMMITTEES\n & INTERNAL AUDIT",
    "FINANCIAL\n STATEMENTS",
    "{\"props\":{\"pageProps\":{\"initialSelected\":0},\"__N_SSG\":true},\"page\":\"/applied_learning_applied_research/[[...slug]]\",\"query\":{\"slug\":[\"learning\"]},\"buildId\":\"kf2s_V7KxTNJfDSKtguk4\",\"assetPrefix\":\"/annual_report_2022\",\"isFallback\":false,\"gsp\":true,\"scriptLoader\":[]}"
  ],
  "desc_divs": [],
  "article_texts": [],
  "links": [
    "https://www.singaporetech.edu.sg/annual_report_2022",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/applied-artificial-intelligence",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/digital-supply-chain",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/applied-computing-fintech",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/naval-architecture-and-marine-engineering",
    "https://www.singaporetech.edu.sg/digitalnewsroom/sit-and-industry-partners-launch-competency-based-workplace-learning-to-upskill-singaporeans-in-infocomm-technology-and-land-transport-sectors/",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/information-and-communications-technology-information-security",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/sustainable-infrastructure-engineering-land",
    "https://www.singaporetech.edu.sg/postgraduate-programmes/master-engineering-technology-sustainable-infrastructure-engineering-land",
    "https://www.singaporetech.edu.sg/annual_report_2022/applied_learning_applied_research/learning",
    "https://www.singaporetech.edu.sg/annual_report_2022/key_highlights",
    "https://www.singaporetech.edu.sg/annual_report_2022/industry_community/industry",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.youtube.com/user/SingaporeTech",
    "https://twitter.com/singaporetech",
    "https://www.linkedin.com/company/singapore-institute-of-technology",
    "https://www.singaporetech.edu.sg/annual_report_2022/theme",
    "https://www.singaporetech.edu.sg/annual_report_2022/sit_at_a_glance/about",
    "https://www.singaporetech.edu.sg/annual_report_2022/leadership/chairman",
    "https://www.singaporetech.edu.sg/annual_report_2022/key_highlights",
    "https://www.singaporetech.edu.sg/annual_report_2022/applied_learning_applied_research/learning",
    "https://www.singaporetech.edu.sg/annual_report_2022/industry_community/industry",
    "https://www.singaporetech.edu.sg/annual_report_2022/sustainability_efforts",
    "https://www.singaporetech.edu.sg/annual_report_2022/sponsors_donors",
    "https://www.singaporetech.edu.sg/annual_report_2022/corporate_governance",
    "https://www.singaporetech.edu.sg/annual_report_2022/board_committees_internal_audit",
    "https://www.singaporetech.edu.sg/annual_report_2022/financial_statements"
  ],
  "images": [
    "/annual_report_2022/_next/static/media/SIT_logo.5a504003.svg",
    "/annual_report_2022/_next/static/media/wheel.2c8f18b5.png",
    "/annual_report_2022/_next/static/media/minister.17d98ed2.png",
    "/annual_report_2022/_next/static/media/bug.cbf3c0c6.jpg",
    "/annual_report_2022/_next/static/media/robot1.d6c626d7.jpg",
    "/annual_report_2022/_next/static/media/robot2.a5d7a96b.jpg",
    "/annual_report_2022/_next/static/media/robot3.5d2900d2.jpg",
    "/annual_report_2022/_next/static/media/lip.31ef9b14.jpg",
    "/annual_report_2022/_next/static/media/food.12fa7741.jpg",
    "/annual_report_2022/_next/static/media/arrow_up.e8e9ee86.svg",
    "/annual_report_2022/_next/static/media/arrow_up_red.db3a128a.svg",
    "/annual_report_2022/_next/static/media/arrow.06df21d5.svg",
    "/annual_report_2022/_next/static/media/arrow.06df21d5.svg"
  ]
}