{
  "url": "https://www.singaporetech.edu.sg/business-communication-and-design",
  "title": "Business, Communication and Design | Singapore Institute of Technology",
  "meta": {
    "description": null,
    "keywords": null
  },
  "text_lines": [
    "Skip to main content",
    "DSB secondary menu",
    "Careers",
    "Library",
    "Students",
    "Staff",
    "Business, Communication and Design",
    "DSB primary menu",
    "About Us",
    "Dropdown",
    "Applied Learning",
    "Applied Research",
    "Our People",
    "News",
    "Faculty Directory",
    "Contact Us",
    "Overview",
    "arrow--right",
    "Directors' Message",
    "All",
    "News",
    "DSB primary menu",
    "About Us",
    "Dropdown",
    "Overview",
    "arrow--right",
    "Directors' Message",
    "Applied Learning",
    "Dropdown",
    "Overview",
    "arrow--right",
    "Applied Research",
    "Dropdown",
    "arrow--right",
    "Our People",
    "Dropdown",
    "arrow--right",
    "News",
    "Dropdown",
    "arrow--right",
    "Faculty Directory",
    "Dropdown",
    "arrow--right",
    "Contact Us",
    "Dropdown",
    "arrow--right",
    "DSB secondary menu",
    "Quick Links",
    "Careers",
    "Library",
    "Students",
    "Staff",
    "What You Can Support",
    "Student Excellence",
    "Student Financial Aid",
    "Applied Research and Academic Initiatives",
    "Professorships",
    "SIT Punggol Campus",
    "Legacy Giving",
    "Alumni Giving",
    "Faculty & Staff Giving",
    "The Gift that Keeps on Giving",
    "Dropdown",
    "Giving to SIT",
    "Highlights",
    "Dropdown",
    "Giving News",
    "Transformative Giving",
    "What’s Up Punggol",
    "Dropdown",
    "Home",
    "About SIT",
    "Academic Clusters",
    "Business, Communication and Design",
    "Stuffed with Success: CIA Alumna Wins First-Ever World Stuffed Cabbage Championship",
    "CIA Singapore alumna Bernadette Rozario, a sous-chef at French brasserie Claudine Singapore, beats the French at their own game.",
    "Read More",
    "Power Through Emotion",
    "26 Mar 2025",
    "Building Dreams in Aviation",
    "7 Feb 2025",
    "Empowering Engineers for the Future",
    "4 Feb 2025",
    "Why pursue Business, Communication and Design",
    "In order to prepare for an ever-changing world, it is crucial for you to gain a strong foundation in the principles of business and innovation",
    "Global Perspective",
    "SIT also nurtures global perspectives and cross-cultural understanding amongst its students through the various overseas student exchanges and overseas programmes.",
    "Innovative Learning Approach",
    "Through innovative, technology-enhanced, and authentic learning and teaching approaches, students are engaged and equipped with industry-relevant knowledge, real-world skills and attitudes to prepare them for the industry. The Integrated Work Study Programme (IWSP) will allow students to apply what they learn to actual work situations.",
    "Industry-relevant Curriculum",
    "Through collaborations with small and medium-sized companies, government agencies and multinational corporations, SIT is able to plug into a diverse ecosystem to ensure that the industry-relevant curriculum will empower SIT graduates to adapt quickly to rapidly changing business models and stay ahead.",
    "Programmes That Develop Future-ready Practitioners",
    "SIT offers entry-level honours degree programmes in Accountancy, Aviation Management, Communications and Digital Media, and Hospitality and Tourism Management. In addition, SIT also has a partnership with The Culinary Institute of America to offer Food Business Management degree programmes with specialisations in Baking and Pastry Arts, and Culinary Arts. These programmes prepare students to become true practitioners of their respective crafts in the global marketplace.",
    "Exciting and Rewarding Careers",
    "As Singapore’s economy transforms through enterprise and innovation, there will be a strong demand for talents with people-centric skills and service-oriented mindsets; who are geared towards providing the best service experience. SIT’s Business, Communication and Design programmes prepare a unique breed of graduates who are not only dynamic and innovative but able to play a role in their future employers’ capabilities to adapt to global marketplace volatilities.",
    "AACSB Business Education Alliance Membership",
    "AACSB Business Education Alliance: This membership reinforces our commitment to delivering high-quality, relevant, and globally connected business education that prepares our students for success in a dynamic world.",
    "What our faculty, students, and industry partners say",
    "ACCOUNTANCY",
    "quote-left",
    "The SIT Accountancy programme provides Domain Knowledge, Democratisation of Technology, and Dynamic Learning to nurture technically-savvy future accounting professionals.",
    "quote-right",
    "Michelle Zou",
    "Associate Professor",
    "quote-left",
    "As an African proverb goes, \"It takes a village to raise a child\" the Accountancy faculty works closely with our students to nurture them to be industry-ready and thrive in the digital world upon graduation.”",
    "quote-right",
    "Yeap Lay Huay",
    "Senior Lecturer",
    "quote-left",
    "The Accountancy program is where you will be trained to get ready for today's digital age.",
    "quote-right",
    "Li Bingqiao",
    "Assistant Professor",
    "quote-left",
    "The content within each Accountancy module has been well organised, making it easier for the students to comprehend.",
    "quote-right",
    "Raif Hakim",
    "Year 3",
    "quote-left",
    "The modules within Accountancy are well-structured and provide students with valuable insights into the industry.",
    "quote-right",
    "Kwong Si Min",
    "Year 2",
    "quote-left",
    "The modules give us a platform to apply critical thinking skills that aids us greatly when we transition into the industry as working professionals.",
    "quote-right",
    "Joshua Dyason",
    "Year 3",
    "quote-left",
    "The knowledge gained from Accountancy has helped in the development of numerous soft and technical skills in students as they prepare for the industry.",
    "quote-right",
    "Tan Hui Shan",
    "Year 2",
    "quote-left",
    "Accountancy offers their students up to date modules, as well as an inclusive and supportive environment to thrive in.",
    "quote-right",
    "Jolene Teo",
    "Year 3",
    "chevron--left",
    "chevron--right",
    "chevron--up",
    "AVIATION MANAGEMENT",
    "quote-left",
    "Have no doubt that the aviation industry will soar again to new heights. SIT’s ATM is here to provide a well rounded and comprehensive education for all students aspiring for a career in aviation",
    "quote-right",
    "John Sim Whay Huong",
    "Senior Professional Officer",
    "quote-left",
    "Your academic journey will be enriched with international Faculty who are accomplished researchers and have had strong professional experience(s) at the airlines and airports. Certainly not self-effacing but an opulence of proficiencies you should not miss.",
    "quote-right",
    "Seck Tan",
    "Associate Professor",
    "quote-left",
    "SIT’s ATM is the best place to get started on your aviation dream job.",
    "quote-right",
    "Colin Law",
    "Senior Lecturer",
    "quote-left",
    "ATM has been a great opportunity for me to expand my knowledge after my diploma. It has given me insights to the aviation industry and I am looking forward to my Integrated Work Study Programme before I graduate as the pioneer batch!",
    "quote-right",
    "S V Anand Kumar",
    "Year 3",
    "quote-left",
    "ATM is an ideal aviation management degree programme that is in demand and strongly supported by the industry where you learn relevant skillsets and solve existing problems with applied learning.",
    "quote-right",
    "Darren Loo RuiXiang",
    "ATM Cohort 2020",
    "quote-left",
    "An interesting insight to aviation business, ATM provides a detailed understanding and description of its environment, fulfilling the hearts of aviation enthusiasts",
    "quote-right",
    "Jerry Lai Jia Jun",
    "ATM Cohort 2020",
    "quote-left",
    "The modules within ATM are very detailed and provides great insight into the different branches within aviation. Along with knowledgeable and experienced professors who will be glad to guide you throughout your journey!",
    "quote-right",
    "Tan Yu Xuan",
    "ATM Cohort 2020",
    "chevron--left",
    "chevron--right",
    "chevron--up",
    "BUSINESS AND INFOCOMM TECHNOLOGY",
    "quote-left",
    "For the new Bachelor of Integrated Studies in Business and Infocomm Technology (BICT) degree programme, we do see the potential of such an interdisciplinary programme and the impact in growing the talent that is very much needed to support the rapid digital transformation in the industry.\r\n\r\nWe are excited to support the launch of this degree programme. We believe that it aligns well with the needs of the industry. We are open to exploring opportunities for collaboration, including providing internships, mentorship, or other forms of engagement that can offer real-world experience to the students.\r\n\r\nWe look forward to the possibility of working closely with the Singapore Institute of Technology and contributing to the success of this degree programme.",
    "quote-right",
    "MR GERALD LEE HWEE KEONG",
    "Chief Executive Officer and Executive Director",
    "Far East Hospitality Trust",
    "chevron--left",
    "chevron--right",
    "chevron--up",
    "COMMUNICATION AND DIGITAL MEDIA",
    "quote-left",
    "CDM prepares our graduates to excel in the digital future, and we have an amazing and caring faculty team!",
    "quote-right",
    "Jiow Hee Jhee",
    "Associate Professor",
    "quote-left",
    "SIT has a very nurturing environment. It is different from other Universities because it values applied learning and works very closely with the industry to bring relevant and pragmatic knowledge to the students. Coming from the industry to join as a Faculty, I feel my experiences and skillsets are valued and put to good use here.",
    "quote-right",
    "Angela Ng",
    "Assistant Professor",
    "quote-left",
    "CDM provides students with various spheres of specialisations that not only piques their interests but is also sought after by today's industry. This course has given me the opportunity to learn the relevant skillsets for the comms industry with a hands-on approach, and even helped me make good connections along the way!",
    "quote-right",
    "Belynda Wong",
    "Year 2",
    "quote-left",
    "The ability to dabble in a large variety of topics that range from data analysis to production makes CDM a course that’s sufficient to prepare anyone for anything the media and communications world might throw at you! With opportunities to expand my knowledge and also delve creatively into various fields of interest, I feel ready to tackle the integrated work study programme before joining the industry in the future!",
    "quote-right",
    "Marian Govin",
    "Year 2",
    "chevron--left",
    "chevron--right",
    "chevron--up",
    "Food Business Management (Culinary Arts and Baking & Pastry Arts)",
    "quote-left",
    "My time in the CIA has been everything I could have dreamt of. Classes are a good balance of hand on and theoretical work. And while the course is intense the community of supportive faculty and seniors are always around to lend a hand.",
    "quote-right",
    "Hilary Ye Zhan Shou,",
    "Year 2",
    "Culinary arts (2020)",
    "quote-left",
    "The CIA has provided me with a very dynamic education. The very interesting combination of modules ranging from Liberal Arts to Sciences, as well as engaging practical modules, drew me to the course. With this course, I have always been pushed to achieve excellence, and I am confident that I will be able to enter the industry and be a change maker with my knowledge and skills.",
    "quote-right",
    "Swathi Balasubramanian",
    "Year 1",
    "Baking and Pastry (2021)",
    "quote-left",
    "SIT’s partnership with the Culinary Institute of America has enabled me to specialise and build a strong foundation in Culinary Arts. The extensive coverage and hands-on practical lessons have also allowed me to hone my skills and build my confidence in the kitchen.",
    "quote-right",
    "Keisia Dominique Lim-Urquhart",
    "Year 1",
    "Culinary Arts (2021)",
    "quote-left",
    "CIA definitely played a big part to bring me to where I am today. It allowed me to build my culinary fundamentals and provided a platform for me to kickstart my career. With the vast network of over 50,000 alumni, it allowed me to have a professional connection and enabled me to begin my internship in the 3 Michelin star Restaurant, Eleven Madison Park in New York City. Thereafter, with years of hard work and perseverance, I am where I am now.",
    "quote-right",
    "Mark Tai",
    "‘2013 Head Chef of Cloudstreet – Michelin Young Chef of the Year 2021",
    "quote-left",
    "Some alumni may say that the most valuable takeaway of the CIA degree was that it provided them with the relevant skills and discipline to be able to take on the challenges of the Food and Beverage Industry. Personally, for me, the CIA degree not only gave me the right skills, qualities, and discipline but it provided me with something far more valuable. It provided me with a multiverse network of alumnus, seniors and mentors from all different disciplines related to food and beverage who are all intertwined within one another. With all their wisdom and experiences, they have guided and navigated me through my culinary career.",
    "quote-right",
    "Chef Terence Chua",
    "‘2014, Chef Owner South Union Park and Eleven Strands",
    "quote-left",
    "I graduated from The Culinary Institute of America, Singapore in 2013, one of the renowned programme’s pioneer batch of students. Its rigorous training program prepared me for the real world, through the opportunity to work with its alumni and industry leaders. These included Chefs Wil Cox (Bar Boulud) and Ivan Brehm (Bacchanalia). Thanks to their tutelage and\r\nguidance, I was able to open my first restaurant, Meating Place, in 2018.",
    "quote-right",
    "Jerome Lim",
    "‘2013 (Chef-Owner of Meating Place)",
    "quote-left",
    "CIA BBA in Food Business Management has opened many doors of opportunities for me – experiential learning in professional kitchens, and overseas exposure. The CIA alumni 50,000 strong provides a supportive network in the F&B industry. \r\n\r\nIn pursuit of my dreams in the culinary world, my enrolment in the CIA has equipped me with comprehensive knowledge on the whys on cooking as well as the hands-on training needed to succeed in the industry. The programme is reflective of the industry – rigorous and demanding but it is exactly what I need to establish myself in this field. It has led to vast and coveted opportunities for working overseas. I am very happy to have made the choice to enrol in CIA, Singapore.",
    "quote-right",
    "Siti Nur Aishah Binti Selamat",
    "quote-left",
    "Apart from the technical aspect of cooking and managing a business, the CIA was able to teach me how to become a better version of myself. Above everything I learned the importance of discipline, self-confidence, and respect for the craft.",
    "quote-right",
    "Hadi Mohamed",
    "‘2019, Service Captain at Appetit, BBA Food Business Management",
    "quote-left",
    "My journey with Culinary Institute of America, has really been a rewarding one. It is filled with endless opportunities and connections not only locally but also internationally - which ultimately provides me with growth and development. It is definitely the perfect option for passionate individuals seeking knowledge and skills in this field of study!",
    "quote-right",
    "Nur’ Ainun Sorfiana Binte Mohd Jarir Jumaen",
    "‘2020",
    "quote-left",
    "My Degree from the CIA has helped me gain a competitive advantage in workforce, it has opened doors of international opportunities for me to grow and extend my culinary knowledge, and most importantly, it has connected me to the alumni family all around the world, looking out for each other.",
    "quote-right",
    "Ramsey Ho",
    "‘2020, Chef de Partie, State Bird Provsions and The Progress, San Francisco, CA",
    "quote-left",
    "Knowledge and skills garnered here goes beyond just the kitchen.  It has allowed me to become a better version of who I was and enabled me to unleash my full potential to face the culinary world.”",
    "quote-right",
    "Renushri Katong Ravindran Pillay,",
    "2020",
    "quote-left",
    "Teaching at The Culinary Institute of America is an incredibly gratifying experience. Each day I am able to share my knowledge and skills to students who are eager to learn and share my passion for food. As we follow the cohort through the curriculum, we are able to target their specific needs to help them grow and excel.",
    "quote-right",
    "Chef Yvonne Ruperti,",
    "Baking and Pastry",
    "quote-left",
    "The most rewarding aspect of teaching and mentoring our students is to see how they develop into Chefs and individuals over the course of the curriculum, starting from the simplest tasks to the more difficult. For me being a good instructor and mentor to our students is about drawing out skills and talents they have never discovered about themselves.",
    "quote-right",
    "Chef Michael Sanson",
    "Culinary",
    "quote-left",
    "I have been teaching at CIA since 2015. While every batch of students is different in personality and abilities, they all share one thing in common: enthusiasm for learning. Even if the subjects are foreign and beyond the immediate experiences of the students, they never shy away from learning new things. It’s been a pleasure teaching at CIA because the students always bring with them their willingness to learn and creative perspectives which makes for a wonderful learning experience for everyone, including myself.",
    "quote-right",
    "Professor Jaime Koh",
    "Phd, History and Cultures of Asia",
    "quote-left",
    "The University is one of the best according to my teaching experiences so far. You can see the level of professionalism of the institute from the way the students look and carry themselves in class.",
    "quote-right",
    "Professor Raj Kamal",
    "Phd, Survey of Math",
    "quote-left",
    "It’s a joy to engage CIA students in accounting. Batch after batch, they inspire me with their curiosity for numbers and an eagerness to apply the language of business in contexts which will serve them in their culinary professions ahead.",
    "quote-right",
    "Professor Chan Seet Meng",
    "MBA, Managerial Accounting",
    "quote-left",
    "Students at the CIA are a joy to teach. They are very keen and hands on learners with practical application of concepts. Due to their work experience, students are mature in their communication and able to work in teams. Since the program has been running successfully for several Years the procedures are clear and support for faculty is abundant. Overall teaching in the CIA program is an enriching experience for both students and faculty.",
    "quote-right",
    "Professor Sonal Manek",
    "Nutrition, MS Food and Nutrition",
    "chevron--left",
    "chevron--right",
    "chevron--up",
    "HOSPITALITY AND TOURISM MANAGEMENT",
    "quote-left",
    "Fuel your passion for hospitality! If you commit your three years to HTM program at SIT, you will be transformed to be a future leader of the hospitality industry all across the globe.",
    "quote-right",
    "Bona Kim",
    "Assistant Professor",
    "quote-left",
    "It has been, and continues to be, our responsibility to fill the earth with the light and warmth of hospitality.” – Conrad Hilton, founder of Hilton Hotels. At Hospitality and Tourism Management, let your passion for hospitality soar on wings of knowledge and experience, empowered by the comprehensive curriculum and industry internships.",
    "quote-right",
    "Brandon Chan",
    "Senior Lecturer",
    "quote-left",
    "HTM has provided me with the opportunity to develop myself professionally and understand the importance of self-awareness and situational management to prepare for the future of work, and help me build my edge of differentiation to make a difference to the world and community around me.",
    "quote-right",
    "Edsel Li",
    "2021 Grad",
    "quote-left",
    "Hospitality and Tourism Management provides students with the soft and hard skills required to excel in the customer-centric industry. With a core around hospitality, I was able to apply relevant skills through projects and internships, which trained me to tackle and adapt to any challenges.",
    "quote-right",
    "Jansen Lim",
    "2021 Grad",
    "chevron--left",
    "chevron--right",
    "chevron--up",
    "Discover more about us",
    "We can help you achieve your career goals through programmes that combine the best of theory and practice.",
    "Applied Learning",
    "Applied Learning for industry readiness",
    "Explore",
    "Applied Research",
    "Co-designing solutions with industry partners",
    "Explore",
    "Our People",
    "Explore",
    "#block-stickyapplynowbutton {\n        position: fixed;\n        bottom: 1.5rem;\n        right: 1.5rem;\n        z-index: 100;\ndisplay: none;\n    }\ndiv#block-stickyapplynowbutton {\n    display: none;\n}\n    div#block-stickyapplynowbutton .field.field--name-body.field--type-text-with-summary.field--label-.field__item.text-long {\n        padding: 0 !important;\n    }\n\n   div#block-stickyapplynowbutton img {\n        max-width:100px;\n\n    }\n\n    .adm-container {\n        display: flex;\n        gap: 0.5rem;\n        align-items: center;\ndisplay: none;\n    }",
    "Admissions AY2025",
    "Apply Now!",
    "Address",
    "1 Punggol Coast Road Singapore 828608",
    "Contact Us",
    "Send an Enquiry",
    "Visiting SIT",
    "Our Campus Locations",
    "Privacy Policy",
    "Safety and Health",
    "Social Media Guidelines",
    "Terms of Use",
    "Whistleblowing",
    "Copyright ©",
    "2025",
    "Singapore Institute of Technology. All Rights Reserved.",
    ".contact-link2 a:link,  .contact-link2 a:visited {\n    border-bottom:0px;\n}",
    "{\"path\":{\"baseUrl\":\"\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/5411\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"colorbox\":{\"transition\":\"elastic\",\"speed\":350,\"opacity\":0.84999999999999998,\"slideshow\":false,\"slideshowAuto\":true,\"slideshowSpeed\":2500,\"slideshowStart\":\"start slideshow\",\"slideshowStop\":\"stop slideshow\",\"current\":\"{current} of {total}\",\"previous\":\"\\u00ab Prev\",\"next\":\"Next \\u00bb\",\"close\":\"Close\",\"overlayClose\":true,\"returnFocus\":true,\"maxWidth\":\"80%\",\"maxHeight\":\"80%\",\"initialWidth\":\"1%\",\"initialHeight\":\"1%\",\"fixed\":true,\"scrolling\":true,\"mobiledetect\":false,\"mobiledevicewidth\":\"480px\"},\"lazyLoadUrl\":\"\\/term_reference_fancytree\\/subTree\",\"user\":{\"uid\":0,\"permissionsHash\":\"e848f09cb4b2e749e40b35cdcee7948d09ab58717b89591b749dd0cbde6d3ee6\"}}"
  ],
  "desc_divs": [
    "26 Mar 2025",
    "7 Feb 2025",
    "4 Feb 2025"
  ],
  "article_texts": [
    "Stuffed with Success: CIA Alumna Wins First-Ever World Stuffed Cabbage Championship\nCIA Singapore alumna Bernadette Rozario, a sous-chef at French brasserie Claudine Singapore, beats the French at their own game.\nRead More\nPower Through Emotion\n26 Mar 2025\nBuilding Dreams in Aviation\n7 Feb 2025\nEmpowering Engineers for the Future\n4 Feb 2025\nWhy pursue Business, Communication and Design\nIn order to prepare for an ever-changing world, it is crucial for you to gain a strong foundation in the principles of business and innovation\nGlobal Perspective\nSIT also nurtures global perspectives and cross-cultural understanding amongst its students through the various overseas student exchanges and overseas programmes.\nInnovative Learning Approach\nThrough innovative, technology-enhanced, and authentic learning and teaching approaches, students are engaged and equipped with industry-relevant knowledge, real-world skills and attitudes to prepare them for the industry. The Integrated Work Study Programme (IWSP) will allow students to apply what they learn to actual work situations.\nIndustry-relevant Curriculum\nThrough collaborations with small and medium-sized companies, government agencies and multinational corporations, SIT is able to plug into a diverse ecosystem to ensure that the industry-relevant curriculum will empower SIT graduates to adapt quickly to rapidly changing business models and stay ahead.\nProgrammes That Develop Future-ready Practitioners\nSIT offers entry-level honours degree programmes in Accountancy, Aviation Management, Communications and Digital Media, and Hospitality and Tourism Management. In addition, SIT also has a partnership with The Culinary Institute of America to offer Food Business Management degree programmes with specialisations in Baking and Pastry Arts, and Culinary Arts. These programmes prepare students to become true practitioners of their respective crafts in the global marketplace.\nExciting and Rewarding Careers\nAs Singapore’s economy transforms through enterprise and innovation, there will be a strong demand for talents with people-centric skills and service-oriented mindsets; who are geared towards providing the best service experience. SIT’s Business, Communication and Design programmes prepare a unique breed of graduates who are not only dynamic and innovative but able to play a role in their future employers’ capabilities to adapt to global marketplace volatilities.\nAACSB Business Education Alliance Membership\nAACSB Business Education Alliance: This membership reinforces our commitment to delivering high-quality, relevant, and globally connected business education that prepares our students for success in a dynamic world.\nWhat our faculty, students, and industry partners say\nACCOUNTANCY\nquote-left\nThe SIT Accountancy programme provides Domain Knowledge, Democratisation of Technology, and Dynamic Learning to nurture technically-savvy future accounting professionals.\nquote-right\nMichelle Zou\nAssociate Professor\nquote-left\nAs an African proverb goes, \"It takes a village to raise a child\" the Accountancy faculty works closely with our students to nurture them to be industry-ready and thrive in the digital world upon graduation.”\nquote-right\nYeap Lay Huay\nSenior Lecturer\nquote-left\nThe Accountancy program is where you will be trained to get ready for today's digital age.\nquote-right\nLi Bingqiao\nAssistant Professor\nquote-left\nThe content within each Accountancy module has been well organised, making it easier for the students to comprehend.\nquote-right\nRaif Hakim\nYear 3\nquote-left\nThe modules within Accountancy are well-structured and provide students with valuable insights into the industry.\nquote-right\nKwong Si Min\nYear 2\nquote-left\nThe modules give us a platform to apply critical thinking skills that aids us greatly when we transition into the industry as working professionals.\nquote-right\nJoshua Dyason\nYear 3\nquote-left\nThe knowledge gained from Accountancy has helped in the development of numerous soft and technical skills in students as they prepare for the industry.\nquote-right\nTan Hui Shan\nYear 2\nquote-left\nAccountancy offers their students up to date modules, as well as an inclusive and supportive environment to thrive in.\nquote-right\nJolene Teo\nYear 3\nchevron--left\nchevron--right\nchevron--up\nAVIATION MANAGEMENT\nquote-left\nHave no doubt that the aviation industry will soar again to new heights. SIT’s ATM is here to provide a well rounded and comprehensive education for all students aspiring for a career in aviation\nquote-right\nJohn Sim Whay Huong\nSenior Professional Officer\nquote-left\nYour academic journey will be enriched with international Faculty who are accomplished researchers and have had strong professional experience(s) at the airlines and airports. Certainly not self-effacing but an opulence of proficiencies you should not miss.\nquote-right\nSeck Tan\nAssociate Professor\nquote-left\nSIT’s ATM is the best place to get started on your aviation dream job.\nquote-right\nColin Law\nSenior Lecturer\nquote-left\nATM has been a great opportunity for me to expand my knowledge after my diploma. It has given me insights to the aviation industry and I am looking forward to my Integrated Work Study Programme before I graduate as the pioneer batch!\nquote-right\nS V Anand Kumar\nYear 3\nquote-left\nATM is an ideal aviation management degree programme that is in demand and strongly supported by the industry where you learn relevant skillsets and solve existing problems with applied learning.\nquote-right\nDarren Loo RuiXiang\nATM Cohort 2020\nquote-left\nAn interesting insight to aviation business, ATM provides a detailed understanding and description of its environment, fulfilling the hearts of aviation enthusiasts\nquote-right\nJerry Lai Jia Jun\nATM Cohort 2020\nquote-left\nThe modules within ATM are very detailed and provides great insight into the different branches within aviation. Along with knowledgeable and experienced professors who will be glad to guide you throughout your journey!\nquote-right\nTan Yu Xuan\nATM Cohort 2020\nchevron--left\nchevron--right\nchevron--up\nBUSINESS AND INFOCOMM TECHNOLOGY\nquote-left\nFor the new Bachelor of Integrated Studies in Business and Infocomm Technology (BICT) degree programme, we do see the potential of such an interdisciplinary programme and the impact in growing the talent that is very much needed to support the rapid digital transformation in the industry.\r\n\r\nWe are excited to support the launch of this degree programme. We believe that it aligns well with the needs of the industry. We are open to exploring opportunities for collaboration, including providing internships, mentorship, or other forms of engagement that can offer real-world experience to the students.\r\n\r\nWe look forward to the possibility of working closely with the Singapore Institute of Technology and contributing to the success of this degree programme.\nquote-right\nMR GERALD LEE HWEE KEONG\nChief Executive Officer and Executive Director\nFar East Hospitality Trust\nchevron--left\nchevron--right\nchevron--up\nCOMMUNICATION AND DIGITAL MEDIA\nquote-left\nCDM prepares our graduates to excel in the digital future, and we have an amazing and caring faculty team!\nquote-right\nJiow Hee Jhee\nAssociate Professor\nquote-left\nSIT has a very nurturing environment. It is different from other Universities because it values applied learning and works very closely with the industry to bring relevant and pragmatic knowledge to the students. Coming from the industry to join as a Faculty, I feel my experiences and skillsets are valued and put to good use here.\nquote-right\nAngela Ng\nAssistant Professor\nquote-left\nCDM provides students with various spheres of specialisations that not only piques their interests but is also sought after by today's industry. This course has given me the opportunity to learn the relevant skillsets for the comms industry with a hands-on approach, and even helped me make good connections along the way!\nquote-right\nBelynda Wong\nYear 2\nquote-left\nThe ability to dabble in a large variety of topics that range from data analysis to production makes CDM a course that’s sufficient to prepare anyone for anything the media and communications world might throw at you! With opportunities to expand my knowledge and also delve creatively into various fields of interest, I feel ready to tackle the integrated work study programme before joining the industry in the future!\nquote-right\nMarian Govin\nYear 2\nchevron--left\nchevron--right\nchevron--up\nFood Business Management (Culinary Arts and Baking & Pastry Arts)\nquote-left\nMy time in the CIA has been everything I could have dreamt of. Classes are a good balance of hand on and theoretical work. And while the course is intense the community of supportive faculty and seniors are always around to lend a hand.\nquote-right\nHilary Ye Zhan Shou,\nYear 2\nCulinary arts (2020)\nquote-left\nThe CIA has provided me with a very dynamic education. The very interesting combination of modules ranging from Liberal Arts to Sciences, as well as engaging practical modules, drew me to the course. With this course, I have always been pushed to achieve excellence, and I am confident that I will be able to enter the industry and be a change maker with my knowledge and skills.\nquote-right\nSwathi Balasubramanian\nYear 1\nBaking and Pastry (2021)\nquote-left\nSIT’s partnership with the Culinary Institute of America has enabled me to specialise and build a strong foundation in Culinary Arts. The extensive coverage and hands-on practical lessons have also allowed me to hone my skills and build my confidence in the kitchen.\nquote-right\nKeisia Dominique Lim-Urquhart\nYear 1\nCulinary Arts (2021)\nquote-left\nCIA definitely played a big part to bring me to where I am today. It allowed me to build my culinary fundamentals and provided a platform for me to kickstart my career. With the vast network of over 50,000 alumni, it allowed me to have a professional connection and enabled me to begin my internship in the 3 Michelin star Restaurant, Eleven Madison Park in New York City. Thereafter, with years of hard work and perseverance, I am where I am now.\nquote-right\nMark Tai\n‘2013 Head Chef of Cloudstreet – Michelin Young Chef of the Year 2021\nquote-left\nSome alumni may say that the most valuable takeaway of the CIA degree was that it provided them with the relevant skills and discipline to be able to take on the challenges of the Food and Beverage Industry. Personally, for me, the CIA degree not only gave me the right skills, qualities, and discipline but it provided me with something far more valuable. It provided me with a multiverse network of alumnus, seniors and mentors from all different disciplines related to food and beverage who are all intertwined within one another. With all their wisdom and experiences, they have guided and navigated me through my culinary career.\nquote-right\nChef Terence Chua\n‘2014, Chef Owner South Union Park and Eleven Strands\nquote-left\nI graduated from The Culinary Institute of America, Singapore in 2013, one of the renowned programme’s pioneer batch of students. Its rigorous training program prepared me for the real world, through the opportunity to work with its alumni and industry leaders. These included Chefs Wil Cox (Bar Boulud) and Ivan Brehm (Bacchanalia). Thanks to their tutelage and\r\nguidance, I was able to open my first restaurant, Meating Place, in 2018.\nquote-right\nJerome Lim\n‘2013 (Chef-Owner of Meating Place)\nquote-left\nCIA BBA in Food Business Management has opened many doors of opportunities for me – experiential learning in professional kitchens, and overseas exposure. The CIA alumni 50,000 strong provides a supportive network in the F&B industry. \r\n\r\nIn pursuit of my dreams in the culinary world, my enrolment in the CIA has equipped me with comprehensive knowledge on the whys on cooking as well as the hands-on training needed to succeed in the industry. The programme is reflective of the industry – rigorous and demanding but it is exactly what I need to establish myself in this field. It has led to vast and coveted opportunities for working overseas. I am very happy to have made the choice to enrol in CIA, Singapore.\nquote-right\nSiti Nur Aishah Binti Selamat\nquote-left\nApart from the technical aspect of cooking and managing a business, the CIA was able to teach me how to become a better version of myself. Above everything I learned the importance of discipline, self-confidence, and respect for the craft.\nquote-right\nHadi Mohamed\n‘2019, Service Captain at Appetit, BBA Food Business Management\nquote-left\nMy journey with Culinary Institute of America, has really been a rewarding one. It is filled with endless opportunities and connections not only locally but also internationally - which ultimately provides me with growth and development. It is definitely the perfect option for passionate individuals seeking knowledge and skills in this field of study!\nquote-right\nNur’ Ainun Sorfiana Binte Mohd Jarir Jumaen\n‘2020\nquote-left\nMy Degree from the CIA has helped me gain a competitive advantage in workforce, it has opened doors of international opportunities for me to grow and extend my culinary knowledge, and most importantly, it has connected me to the alumni family all around the world, looking out for each other.\nquote-right\nRamsey Ho\n‘2020, Chef de Partie, State Bird Provsions and The Progress, San Francisco, CA\nquote-left\nKnowledge and skills garnered here goes beyond just the kitchen.  It has allowed me to become a better version of who I was and enabled me to unleash my full potential to face the culinary world.”\nquote-right\nRenushri Katong Ravindran Pillay,\n2020\nquote-left\nTeaching at The Culinary Institute of America is an incredibly gratifying experience. Each day I am able to share my knowledge and skills to students who are eager to learn and share my passion for food. As we follow the cohort through the curriculum, we are able to target their specific needs to help them grow and excel.\nquote-right\nChef Yvonne Ruperti,\nBaking and Pastry\nquote-left\nThe most rewarding aspect of teaching and mentoring our students is to see how they develop into Chefs and individuals over the course of the curriculum, starting from the simplest tasks to the more difficult. For me being a good instructor and mentor to our students is about drawing out skills and talents they have never discovered about themselves.\nquote-right\nChef Michael Sanson\nCulinary\nquote-left\nI have been teaching at CIA since 2015. While every batch of students is different in personality and abilities, they all share one thing in common: enthusiasm for learning. Even if the subjects are foreign and beyond the immediate experiences of the students, they never shy away from learning new things. It’s been a pleasure teaching at CIA because the students always bring with them their willingness to learn and creative perspectives which makes for a wonderful learning experience for everyone, including myself.\nquote-right\nProfessor Jaime Koh\nPhd, History and Cultures of Asia\nquote-left\nThe University is one of the best according to my teaching experiences so far. You can see the level of professionalism of the institute from the way the students look and carry themselves in class.\nquote-right\nProfessor Raj Kamal\nPhd, Survey of Math\nquote-left\nIt’s a joy to engage CIA students in accounting. Batch after batch, they inspire me with their curiosity for numbers and an eagerness to apply the language of business in contexts which will serve them in their culinary professions ahead.\nquote-right\nProfessor Chan Seet Meng\nMBA, Managerial Accounting\nquote-left\nStudents at the CIA are a joy to teach. They are very keen and hands on learners with practical application of concepts. Due to their work experience, students are mature in their communication and able to work in teams. Since the program has been running successfully for several Years the procedures are clear and support for faculty is abundant. Overall teaching in the CIA program is an enriching experience for both students and faculty.\nquote-right\nProfessor Sonal Manek\nNutrition, MS Food and Nutrition\nchevron--left\nchevron--right\nchevron--up\nHOSPITALITY AND TOURISM MANAGEMENT\nquote-left\nFuel your passion for hospitality! If you commit your three years to HTM program at SIT, you will be transformed to be a future leader of the hospitality industry all across the globe.\nquote-right\nBona Kim\nAssistant Professor\nquote-left\nIt has been, and continues to be, our responsibility to fill the earth with the light and warmth of hospitality.” – Conrad Hilton, founder of Hilton Hotels. At Hospitality and Tourism Management, let your passion for hospitality soar on wings of knowledge and experience, empowered by the comprehensive curriculum and industry internships.\nquote-right\nBrandon Chan\nSenior Lecturer\nquote-left\nHTM has provided me with the opportunity to develop myself professionally and understand the importance of self-awareness and situational management to prepare for the future of work, and help me build my edge of differentiation to make a difference to the world and community around me.\nquote-right\nEdsel Li\n2021 Grad\nquote-left\nHospitality and Tourism Management provides students with the soft and hard skills required to excel in the customer-centric industry. With a core around hospitality, I was able to apply relevant skills through projects and internships, which trained me to tackle and adapt to any challenges.\nquote-right\nJansen Lim\n2021 Grad\nchevron--left\nchevron--right\nchevron--up\nDiscover more about us\nWe can help you achieve your career goals through programmes that combine the best of theory and practice.\nApplied Learning\nApplied Learning for industry readiness\nExplore\nApplied Research\nCo-designing solutions with industry partners\nExplore\nOur People\nExplore"
  ],
  "links": [
    "https://www.singaporetech.edu.sg/business-communication-and-design#main-content",
    "https://www.singaporetech.edu.sg/careers",
    "https://libguides.singaporetech.edu.sg/library",
    "https://students.singaporetech.edu.sg/",
    "https://sitsingaporetechedu.sharepoint.com/sites/DW/staff/Pages/Home.aspx",
    "https://www.singaporetech.edu.sg",
    "https://www.singaporetech.edu.sg/business-communication-and-design/applied-learning",
    "https://www.singaporetech.edu.sg/business-communication-and-design/applied-research",
    "https://www.singaporetech.edu.sg/business-communication-and-design/our-people",
    "https://www.singaporetech.edu.sg/digitalnewsroom/?h=1&t=BCD%2CBusiness%20Communication%20and%20Design%2CDSB",
    "https://www.singaporetech.edu.sg/directory/faculty?search_type=name&name=&research=&keyword=&cluster=1&sort_by=first_name&first_char_first_name=&first_char_last_name=",
    "https://www.singaporetech.edu.sg/business-communication-and-design/contact-us",
    "https://www.singaporetech.edu.sg/business-communication-and-design/bcd-directors-message",
    "https://www.singaporetech.edu.sg/business-communication-and-design/bcd-directors-message",
    "https://www.singaporetech.edu.sg/search",
    "https://www.singaporetech.edu.sg/business-communication-and-design#all",
    "https://www.singaporetech.edu.sg/business-communication-and-design#news",
    "https://www.singaporetech.edu.sg/business-communication-and-design/bcd-directors-message",
    "https://www.singaporetech.edu.sg/business-communication-and-design/bcd-directors-message",
    "https://www.singaporetech.edu.sg/business-communication-and-design/applied-learning",
    "https://www.singaporetech.edu.sg/business-communication-and-design/applied-research",
    "https://www.singaporetech.edu.sg/business-communication-and-design/our-people",
    "https://www.singaporetech.edu.sg/digitalnewsroom/?h=1&t=BCD%2CBusiness%20Communication%20and%20Design%2CDSB",
    "https://www.singaporetech.edu.sg/directory/faculty?search_type=name&name=&research=&keyword=&cluster=1&sort_by=first_name&first_char_first_name=&first_char_last_name=",
    "https://www.singaporetech.edu.sg/business-communication-and-design/contact-us",
    "https://www.singaporetech.edu.sg/careers",
    "https://libguides.singaporetech.edu.sg/library",
    "https://students.singaporetech.edu.sg/",
    "https://sitsingaporetechedu.sharepoint.com/sites/DW/staff/Pages/Home.aspx",
    "https://www.singaporetech.edu.sg/giving#what-you-can-support",
    "https://www.singaporetech.edu.sg/giving#support-student-excellence",
    "https://www.singaporetech.edu.sg/giving#support-student-financial-aid",
    "https://www.singaporetech.edu.sg/giving#support-applied-research-and-academic-initiatives",
    "https://www.singaporetech.edu.sg/giving#support-professorships",
    "https://www.singaporetech.edu.sg/giving#SIT-Punggol-campus",
    "https://www.singaporetech.edu.sg/giving#legacy-giving",
    "https://www.singaporetech.edu.sg/giving#alumni-giving",
    "https://www.singaporetech.edu.sg/giving#faculty-staff-giving",
    "https://www.singaporetech.edu.sg/giving#the-gift-that-keeps-on-giving",
    "https://www.singaporetech.edu.sg/business-communication-and-design",
    "https://www.singaporetech.edu.sg/giving",
    "https://www.singaporetech.edu.sg/giving/news",
    "https://www.singaporetech.edu.sg/giving/news?category=5496",
    "https://www.singaporetech.edu.sg/giving/news?category=5491",
    "https://www.singaporetech.edu.sg/one-sitizen-fund",
    "https://www.singaporetech.edu.sg/",
    "https://www.singaporetech.edu.sg/about",
    "https://www.singaporetech.edu.sg/about/academic-clusters",
    "https://www.singaporetech.edu.sg/business-communication-and-design",
    "https://www.singaporetech.edu.sg/news/stuffed-success-cia-alumna-wins-first-ever-world-stuffed-cabbage-championship",
    "https://www.singaporetech.edu.sg/news/power-through-emotion",
    "https://www.singaporetech.edu.sg/news/building-dreams-aviation",
    "https://www.singaporetech.edu.sg/news/empowering-engineers-future",
    "https://www.singaporetech.edu.sg/business-communication-and-design/applied-learning",
    "https://www.singaporetech.edu.sg/business-communication-and-design/applied-research",
    "https://www.singaporetech.edu.sg/business-communication-and-design/our-people",
    "https://learner.singaporetech.edu.sg/",
    "https://www.google.com/maps/place/Singapore+Institute+of+Technology+(SIT)+-+Punggol/@1.41364,103.91229,14z/data=!4m6!3m5!1s0x31da1515bfb2d263:0xc71c56458ac08497!8m2!3d1.4136399!4d103.9122896!16s%2Fg%2F11t42h3wb_",
    "https://www.singaporetech.edu.sg/contact-us",
    "https://www.singaporetech.edu.sg/campus-locations",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.linkedin.com/company/singapore-institute-of-technology",
    "https://www.youtube.com/user/SingaporeTech",
    "https://www.tiktok.com/@singaporetech",
    "https://www.singaporetech.edu.sg/privacy-policy",
    "https://www.singaporetech.edu.sg/safety-and-health-policy",
    "https://www.singaporetech.edu.sg/social-media-guidelines",
    "https://www.singaporetech.edu.sg/terms-use",
    "https://www.singaporetech.edu.sg/whistleblowing"
  ],
  "images": [
    "/sites/default/files/2024-12/%5BFA%5D%20%20SIT%20One%20SITizen%20Alumni%20Initiative_Web%20banner_1244px%20x%20688px.jpg",
    "/sites/default/files/styles/card_rectangle_medium/public/2025-04/Picture4%20%281%29.jpg?itok=KROK7UPP",
    "/sites/default/files/styles/card_rectangle_medium/public/2025-03/WhatsApp%20Image%202025-01-09%20at%2017.36.40_0.jpg?itok=0uP0NOPE",
    "/sites/default/files/styles/card_rectangle_medium/public/2025-01/Homepage%20Image%20Resize%201920%20x%201080_Ariff.jpg?itok=jgRv-po5",
    "/sites/default/files/styles/card_rectangle_medium/public/2025-01/EEE%20CSM%20Class_hero%20%281%29.jpg?itok=4m9iU3dg",
    "/sites/default/files/2024-10/AppliedLearning.jpg",
    "/sites/default/files/2024-10/AppliedResearch.JPG",
    "/sites/default/files/2024-11/BCD2024.jpg"
  ]
}