{
  "url": "https://www.singaporetech.edu.sg/centre-professional-communication/about-cpc/our-faculty?id=",
  "title": "Our Faculty | Singapore Institute of Technology",
  "meta": {
    "description": null,
    "keywords": null
  },
  "text_lines": [
    "Skip to main content",
    "Centre for Professional Communication",
    "Menu primary",
    "Modules and Initiatives",
    "CET Workshops",
    "Research and Collaboration",
    "About CPC",
    "Menu primary",
    "Modules and Initiatives",
    "Dropdown",
    "arrow--right",
    "CET Workshops",
    "Dropdown",
    "arrow--right",
    "Research and Collaboration",
    "Dropdown",
    "arrow--right",
    "About CPC",
    "Dropdown",
    "arrow--right",
    "Home",
    "About CPC",
    "Our Faculty",
    "Our Faculty",
    "Kenneth Ong",
    "Assistant Professor",
    "Director, Centre for Professional Communication",
    "See Full Profile",
    "Dr. Kenneth Ong is Director of the Centre for Professional Communication and Assistant Professor. He received his Ph.D. degree in Education (Applied Linguistics) from The University of Auckland, New Zealand. Previously, he was Senior Lecturer and Assistant Chair of the School of Humanities and Social Sciences, Nanyang Technological University. He has published articles in System (Elsevier), Journal of Psycholinguistic Research (Springer), Discourse Studies (Sage), Language and Education (Routledge), English Today (Cambridge University Press), RELC Journal (Sage) and World Englishes (Wiley), as well as edited books and book chapters published by Routledge, Springer, John Benjamins, Multilingual Matters and CRC Press, Taylor and Francis. His recent coauthored book titled “Guide to Research Projects for Engineering Students: Planning, Writing and Presenting” is published by CRC Press, Taylor and Francis. His main research interests centre around technical communication, STEM communication, English for specific purposes, and computer-mediated communication.",
    "Christopher Bedwell",
    "Deputy Director, Centre for Professional Communication",
    "See Full Profile",
    "Christopher Bedwell is the Deputy Director, Centre for Professional Communication at Singapore Institute of Technology and a Fellow of the Association of Chartered Certified Accountants (FCCA). He received his bachelor's degree in Physics from King's College London, and later a master's degree in English Language Teaching from Essex University. He spent the early part of his career in finance, before specialising in the Teaching of English to the Speakers of Other Languages. He has also taught general English in Japan, as well as technical English in the Middle East. His research interests are centred on materials development and the use of self-driven learning activities that can be employed inside or out of the classroom.",
    "Lee Chien Ching",
    "Associate Professor",
    "See Full Profile",
    "ChienChing LEE is an Associate Professor at the Centre for Professional Communication. She is a life-long believer in experiential learning that involves inculcating a curious, open, and critical mindset in viewing situations from multiple perspectives, based on evidence. Her areas of interests are in technical communication, professional communication, career and professional development, technology-enhanced teaching and learning, development of micro-modules, coaching and mentoring, and strategy and self-regulation instruction. She has worked in interdisciplinary faculty project teams to deliver solutions in teaching and learning involving IT.",
    "Chien Ching has a PhD in Learning Sciences and Technology. She is currently an Associate Editor for the Australasian Journal of Educational Technology. She is also an NICF-PMI Agile Certified Practitioner, and Myer-Briggs Type Certified Trainer. Chien Ching also conducts corporate training.",
    "Radhika Jaidev",
    "Associate Professor",
    "See Full Profile",
    "Radhika Jaidev is an Associate Professor at the Centre for Professional Communication, Singapore Institute of Technology (SIT). She teaches academic and technical writing, as well as presentation skills to undergraduate students. She has approximately 40 years of experience in teaching English language and communication in higher education. Her previous employers include the National University of Singapore, UniSIM (now SUSS), Nanyang Polytechnic and RELC.",
    "Her research interests include writing transfer, content and language-integrated learning through embedding and professional communication. She was part of an international team of writing researchers, investigating Writing Transfer in Work-Integrated Learning or WIL in the Writing Beyond the University writing research seminar from 2019-2021, organised by Elon University’s Center for Engaged Learning and Teaching in North Carolina. The team has since published their findings in several platforms.",
    "Behnam Soltani",
    "Assistant Professor",
    "See Full Profile",
    "Dr. Behnam Soltani is an Assistant Professor of Applied Linguistics at the Center for Professional Communication, Singapore Institute of Technology. He received his PhD in Applied Linguistics from Victoria University of Wellington, New Zealand. Behnam taught in Iran from 1997-2010 and from 2010-2023 in New Zealand. Prior to joining Singapore Institute of Technology, Behnam taught in Victoria University of Wellington, Massey University, Otago Polytechnic, Eastern Institute of Technology, Manukau Institute of Technology, and Waikato Institute of Technology. He has published articles in TESOL Quarterly (Wiley), Linguistics and Education (Elsevier), Australian Review of Applied Linguistics (John Benjamins), Educational Linguistics (De Gruyter Mouton), Personality and Individual Differences (Elsevier), Transitions: Journal of Transient Migration, and Scope. His co-authored book, Enhancing Student Education Transitions and Employability: From Theory to Practice, was published by Routledge.",
    "He has also contributed a book chapter that was published by Springer Nature. His book reviews have appeared in Language in Society (Cambridge University Press), Discourse & Society (Sage), and Discourse Studies (Sage). Behnam has been a Senior Research Fellow at Otago Polytechnic and a Research Officer at Massey University, New Zealand. His research interests lie in areas of graduate employability, work integrated learning, language socialization, identities, the production of space, communities of practice, and assessment for learning. He uses qualitative methodologies, including ethnography and narrative inquiry, in his work. He has been a journal reviewer for TESOL Quarterly and other journals in Education and Applied Linguistics. Behnam is passionate about writing, and as a service, he has run several hundred nightly writing sessions on Clubhouse and X (formerly known as Twitter).",
    "Lee Hwee Hoon",
    "Assistant Professor",
    "See Full Profile",
    "Hwee Hoon LEE is Assistant Professor in the Centre for Professional Communication at the Singapore Institute of Technology (SIT). Trained in Applied Linguistics, she teaches the use of language for communication, both written and oral. She has taught undergraduates and adult learners technical and professional communication, career skills, interpersonal communication, critical thinking, and presentation skills. At SIT, she also teaches foundational morphology, semantics and grammar in the Speech and Language Therapy programme.",
    "Hwee Hoon has a doctorate in education from University of Leicester and a master in English Language teaching from University of Lancaster. Her research interests are in teaching and learning issues in higher education. She has co-written a book chapter on significant learning in a multi-modal learning environment, and published in education journals on stakeholder perspectives on teaching and teacher feedback. She is also an editor for the Arab World English Journal.",
    "Muhammad Rahimi",
    "Assistant Professor",
    "See Full Profile",
    "Muhammad Rahimi, PhD, is currently Assistant Professor of Applied Linguistics in the Centre for Professional Communication at Singapore Institute of Technology (SIT). He earned his PhD in Education (Applied Linguistics & TESOL) at the University of Auckland, New Zealand. He has two decades of experience teaching undergraduate and postgraduate students in Iran, New Zealand, and China. His publications on language education have appeared in international journals, such as Language Teaching Research (SSCI-indexed), System: An International Journal of Educational Technology and Applied Linguistics (SSCI-indexed), Reading and Writing: An Interdisciplinary Journal (SSCI-indexed), Discourse Processes (SSCI-indexed), and Reading and Writing Quarterly (SSCI-indexed).",
    "He is a frequent reviewer to the leading international journals, including Language Teaching Research (SSCI-indexed), TESOL Quarterly (the flagship journal of TESOL, Inc., Alexandria, VA; SSCI-indexed), System: An International Journal of Educational Technology and Applied Linguistics (Elsevier Science, Oxford, UK; SSCI-indexed), and Assessing Writing (SSCI-indexed). His areas of research and teaching interests are dynamic and evolving, and span across language education, critical thinking, communication skills, assessment, and research methods.",
    "Padma Rao",
    "Assistant Professor",
    "See Full Profile",
    "Dr. Padma Rao is Assistant Professor in the Centre for Professional Communication, Singapore Institute of Technology (SIT) and Chair of the Centre’s Communication Helpdesk. Since joining the Centre in 2016, Padma has developed and coordinated multiple modules across a number of academic clusters, including Engineering, Business, Communication and Design, and Food, Chemical and Biotechnology. These modules cover a variety of skills for SIT students, such as critical thinking and communicating, academic and technical writing, workplace and interpersonal communication, oral presentation, and career skills. Padma is also a Specialist Adult Educator (Curriculum Development) certified by the Institute of Adult Learning, Singapore. She has conducted several workshops for adult learners, both in Singapore and overseas, on teaching practices, active learning, and designing authentic assessments for the workplace.",
    "Rosmawati",
    "Assistant Professor",
    "See Full Profile",
    "Rosmawati is an Assistant Professor in the Centre for Professional Communication. As an applied linguist and educator, she is interested in and passionate about the teaching/learning, as well as the development of language and communication skills. She has more than 10 years of experience teaching in the higher education settings in several countries, including Indonesia and Australia. Her research areas align with her teaching passions and focus on the development of syntactic complexity in academic writing from the perspective of Complex Dynamic Systems Theory (CDST), which she has published several journal articles and book chapters on.",
    "Rosmawati has a PhD in education from the University of Sydney and an MA in applied linguistics from the South China University of Technology. She is a member of the American Association of Applied Linguistics and of the Australian Applied Linguistics Association. She is also a reviewer for several journals in applied linguistics.",
    "Victor Matthew Cole",
    "Assistant Professor",
    "See Full Profile",
    "Dr. Victor Cole is Assistant Professor in the Centre for Professional Communication at Singapore Institute of Technology (SIT). He is an ethicist and communications educator with more than 20 years' experience in innovative curriculum development and programme leadership at the tertiary level. Throughout his career, he has sought meaningful opportunities to develop stakeholders' critical thinking and communication skills around ethical issues in a variety of professional domains (e.g., medicine, nursing, allied health, engineering and hospitality). He is committed to researching moral challenges arising from boundary-pushing technological endeavours (e.g., human enhancement and spaceflight) and is experienced in ethical board review and research ethics training. Victor is also a seasoned moderator of C-level panel discussions on innovation and entrepreneurship and of public forums on bioethics.",
    "Janice Wong",
    "Assistant Professor",
    "See Full Profile",
    "Dr Janice Wong is an Assistant Professor in the Centre for Professional Communication at the Singapore Institute of Technology (SIT). She brings over a decade of corporate experience in managing media, corporate communications and employee engagement for multinational companies in the banking and technology industries.",
    "A former journalist with Singapore Press Holdings, she wrote for various news channels such as The Straits Times before venturing into branding and public relations. Prior to joining SIT, she led global business communications for supply operations of the world’s largest agrochemical company headquartered in Switzerland. As a Prosci-certified change management practitioner, she is experienced in supporting C-suite level leaders and teams in steering change communications for large-scale transformation projects, as well as mergers and acquisitions.",
    "She received a PhD in Business from Singapore Management University where her research focused on corporate internal communications and organisational culture change. Additionally, she holds a Master's in Mass Communication from Nanyang Technological University, where she was awarded the Pearson Education Gold Medal for being the most outstanding graduate of the programme.",
    "At SIT, she is passionate about empowering learners with practical industry-focused communication skills and supporting them in unlocking their full potential.",
    "Yvonne Kong-Ho",
    "Senior Lecturer",
    "See Full Profile",
    "Deeply passionate about the topics of workforce development, career resilience and career longevity, Yvonne is thankful for the privilege and honour to be able to journey with many who have faced conundrums or needed greater clarity in the career-related decisions which they have had to make. From years of teaching, coaching and mentoring, she has witnessed the power of tenacity and resilience as people overcome almost insurmountable obstacles to be who they are and what they have grown to become.",
    "Yvonne has had close to two decades of experiences in education, people and career development. Her teaching and research interests lie in the fields of industrial gerontology and workforce development. It is her greatest hope to see people working towards the building and strengthening of their career capital at every stage of their lives.",
    "Yvonne holds a Master of Arts in Lifelong Learning from the Institute of Education (University College London) and received her PhD in Gerontology from the Singapore University of Social Sciences.",
    "Erick Tan",
    "Senior Lecturer",
    "See Full Profile",
    "Erick is a Senior Lecturer in the Centre for Professional Communication at the Singapore Institute of Technology (SIT). Upon completing his Masters in Speech Pathology (MSpPath) from La Trobe University (Australia), Erick practiced as a Speech-Language Therapist before transitioning into education, working with patients presenting with speech, articulation, voice, and cognitive-linguistic disorders. His practice focused on neurorehabilitation, assisting patients with neurolinguistic deficits following stroke and other neurological disorders to regain their ability to communicate.",
    "A passionate award-winning educator, Erick has been teaching at various institutes for higher learning since 2008. He currently teaches courses relating to critical thinking and communicating, and in the area of phonetics and phonology at SIT. As a part-time radio broadcaster, Erick continues to apply industry knowledge into his classroom teaching. Erick currently coordinates the Communicating Across Curriculum embedded workshops across the university’s 40 programmes.",
    "Nazerene Ibrahim",
    "Senior Lecturer",
    "See Full Profile",
    "Nazerene Ibrahim is a Senior Lecturer in the Centre for Professional Communication at the Singapore Institute of Technology (SIT). Following the completion of her Masters degree in Political Science, Nazerene joined the Singapore Foreign Service as a senior officer in the diplomatic line. Her keen interest in communication skills was born during this time. The years spent there honed her communication skills and gave her insight into professional communication and behaviours. Since obtaining a CELTA certification, Nazerene has taught several tertiary-level courses in communication, critical thinking and communication, as well as academic research and writing.",
    "An award-winning educator, Nazerene is driven to help her students gain valuable knowledge in academia, while moulding themselves as responsible and compassionate contributors to society. She continues to explore strategies that can be employed in the tertiary classroom to motivate students to excel in their studies to the best of their abilities, while developing their own character and identity. Nazerene continues to also study and note changing trends in the workplace behaviours and communication in the Asian (specifically Singaporean) workplace.",
    "Address",
    "1 Punggol Coast Road Singapore 828608",
    "Contact Us",
    "Send an Enquiry",
    "Visiting SIT",
    "Our Campus Locations",
    "Academic Policies",
    "Privacy Policy",
    "Safety and Health",
    "Social Media Guidelines",
    "Terms of Use",
    "Whistleblowing",
    "Copyright ©",
    "2025",
    "Singapore Institute of Technology. All Rights Reserved.",
    ".contact-link2 a:link,  .contact-link2 a:visited {\n    border-bottom:0px;\n}",
    "{\"path\":{\"baseUrl\":\"\\/centre-professional-communication\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/11\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\",\"currentQuery\":{\"id\":\"\"}},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"colorbox\":{\"transition\":\"elastic\",\"speed\":350,\"opacity\":0.84999999999999998,\"slideshow\":false,\"slideshowAuto\":true,\"slideshowSpeed\":2500,\"slideshowStart\":\"start slideshow\",\"slideshowStop\":\"stop slideshow\",\"current\":\"{current} of {total}\",\"previous\":\"\\u00ab Prev\",\"next\":\"Next \\u00bb\",\"close\":\"Close\",\"overlayClose\":true,\"returnFocus\":true,\"maxWidth\":\"80%\",\"maxHeight\":\"80%\",\"initialWidth\":\"1%\",\"initialHeight\":\"1%\",\"fixed\":true,\"scrolling\":true,\"mobiledetect\":false,\"mobiledevicewidth\":\"480px\"},\"lazyLoadUrl\":\"\\/centre-professional-communication\\/term_reference_fancytree\\/subTree\",\"user\":{\"uid\":0,\"permissionsHash\":\"056240583d3a62924b1ca19b123ae3dbf3d40ab2555cbb4fba9d506a49ff6038\"}}"
  ],
  "desc_divs": [],
  "article_texts": [
    "Our Faculty\nKenneth Ong\nAssistant Professor\nDirector, Centre for Professional Communication\nSee Full Profile\nDr. Kenneth Ong is Director of the Centre for Professional Communication and Assistant Professor. He received his Ph.D. degree in Education (Applied Linguistics) from The University of Auckland, New Zealand. Previously, he was Senior Lecturer and Assistant Chair of the School of Humanities and Social Sciences, Nanyang Technological University. He has published articles in System (Elsevier), Journal of Psycholinguistic Research (Springer), Discourse Studies (Sage), Language and Education (Routledge), English Today (Cambridge University Press), RELC Journal (Sage) and World Englishes (Wiley), as well as edited books and book chapters published by Routledge, Springer, John Benjamins, Multilingual Matters and CRC Press, Taylor and Francis. His recent coauthored book titled “Guide to Research Projects for Engineering Students: Planning, Writing and Presenting” is published by CRC Press, Taylor and Francis. His main research interests centre around technical communication, STEM communication, English for specific purposes, and computer-mediated communication.\nChristopher Bedwell\nDeputy Director, Centre for Professional Communication\nSee Full Profile\nChristopher Bedwell is the Deputy Director, Centre for Professional Communication at Singapore Institute of Technology and a Fellow of the Association of Chartered Certified Accountants (FCCA). He received his bachelor's degree in Physics from King's College London, and later a master's degree in English Language Teaching from Essex University. He spent the early part of his career in finance, before specialising in the Teaching of English to the Speakers of Other Languages. He has also taught general English in Japan, as well as technical English in the Middle East. His research interests are centred on materials development and the use of self-driven learning activities that can be employed inside or out of the classroom.\nLee Chien Ching\nAssociate Professor\nSee Full Profile\nChienChing LEE is an Associate Professor at the Centre for Professional Communication. She is a life-long believer in experiential learning that involves inculcating a curious, open, and critical mindset in viewing situations from multiple perspectives, based on evidence. Her areas of interests are in technical communication, professional communication, career and professional development, technology-enhanced teaching and learning, development of micro-modules, coaching and mentoring, and strategy and self-regulation instruction. She has worked in interdisciplinary faculty project teams to deliver solutions in teaching and learning involving IT.\nChien Ching has a PhD in Learning Sciences and Technology. She is currently an Associate Editor for the Australasian Journal of Educational Technology. She is also an NICF-PMI Agile Certified Practitioner, and Myer-Briggs Type Certified Trainer. Chien Ching also conducts corporate training.\nRadhika Jaidev\nAssociate Professor\nSee Full Profile\nRadhika Jaidev is an Associate Professor at the Centre for Professional Communication, Singapore Institute of Technology (SIT). She teaches academic and technical writing, as well as presentation skills to undergraduate students. She has approximately 40 years of experience in teaching English language and communication in higher education. Her previous employers include the National University of Singapore, UniSIM (now SUSS), Nanyang Polytechnic and RELC.\nHer research interests include writing transfer, content and language-integrated learning through embedding and professional communication. She was part of an international team of writing researchers, investigating Writing Transfer in Work-Integrated Learning or WIL in the Writing Beyond the University writing research seminar from 2019-2021, organised by Elon University’s Center for Engaged Learning and Teaching in North Carolina. The team has since published their findings in several platforms.\nBehnam Soltani\nAssistant Professor\nSee Full Profile\nDr. Behnam Soltani is an Assistant Professor of Applied Linguistics at the Center for Professional Communication, Singapore Institute of Technology. He received his PhD in Applied Linguistics from Victoria University of Wellington, New Zealand. Behnam taught in Iran from 1997-2010 and from 2010-2023 in New Zealand. Prior to joining Singapore Institute of Technology, Behnam taught in Victoria University of Wellington, Massey University, Otago Polytechnic, Eastern Institute of Technology, Manukau Institute of Technology, and Waikato Institute of Technology. He has published articles in TESOL Quarterly (Wiley), Linguistics and Education (Elsevier), Australian Review of Applied Linguistics (John Benjamins), Educational Linguistics (De Gruyter Mouton), Personality and Individual Differences (Elsevier), Transitions: Journal of Transient Migration, and Scope. His co-authored book, Enhancing Student Education Transitions and Employability: From Theory to Practice, was published by Routledge.\nHe has also contributed a book chapter that was published by Springer Nature. His book reviews have appeared in Language in Society (Cambridge University Press), Discourse & Society (Sage), and Discourse Studies (Sage). Behnam has been a Senior Research Fellow at Otago Polytechnic and a Research Officer at Massey University, New Zealand. His research interests lie in areas of graduate employability, work integrated learning, language socialization, identities, the production of space, communities of practice, and assessment for learning. He uses qualitative methodologies, including ethnography and narrative inquiry, in his work. He has been a journal reviewer for TESOL Quarterly and other journals in Education and Applied Linguistics. Behnam is passionate about writing, and as a service, he has run several hundred nightly writing sessions on Clubhouse and X (formerly known as Twitter).\nLee Hwee Hoon\nAssistant Professor\nSee Full Profile\nHwee Hoon LEE is Assistant Professor in the Centre for Professional Communication at the Singapore Institute of Technology (SIT). Trained in Applied Linguistics, she teaches the use of language for communication, both written and oral. She has taught undergraduates and adult learners technical and professional communication, career skills, interpersonal communication, critical thinking, and presentation skills. At SIT, she also teaches foundational morphology, semantics and grammar in the Speech and Language Therapy programme.\nHwee Hoon has a doctorate in education from University of Leicester and a master in English Language teaching from University of Lancaster. Her research interests are in teaching and learning issues in higher education. She has co-written a book chapter on significant learning in a multi-modal learning environment, and published in education journals on stakeholder perspectives on teaching and teacher feedback. She is also an editor for the Arab World English Journal.\nMuhammad Rahimi\nAssistant Professor\nSee Full Profile\nMuhammad Rahimi, PhD, is currently Assistant Professor of Applied Linguistics in the Centre for Professional Communication at Singapore Institute of Technology (SIT). He earned his PhD in Education (Applied Linguistics & TESOL) at the University of Auckland, New Zealand. He has two decades of experience teaching undergraduate and postgraduate students in Iran, New Zealand, and China. His publications on language education have appeared in international journals, such as Language Teaching Research (SSCI-indexed), System: An International Journal of Educational Technology and Applied Linguistics (SSCI-indexed), Reading and Writing: An Interdisciplinary Journal (SSCI-indexed), Discourse Processes (SSCI-indexed), and Reading and Writing Quarterly (SSCI-indexed).\nHe is a frequent reviewer to the leading international journals, including Language Teaching Research (SSCI-indexed), TESOL Quarterly (the flagship journal of TESOL, Inc., Alexandria, VA; SSCI-indexed), System: An International Journal of Educational Technology and Applied Linguistics (Elsevier Science, Oxford, UK; SSCI-indexed), and Assessing Writing (SSCI-indexed). His areas of research and teaching interests are dynamic and evolving, and span across language education, critical thinking, communication skills, assessment, and research methods.\nPadma Rao\nAssistant Professor\nSee Full Profile\nDr. Padma Rao is Assistant Professor in the Centre for Professional Communication, Singapore Institute of Technology (SIT) and Chair of the Centre’s Communication Helpdesk. Since joining the Centre in 2016, Padma has developed and coordinated multiple modules across a number of academic clusters, including Engineering, Business, Communication and Design, and Food, Chemical and Biotechnology. These modules cover a variety of skills for SIT students, such as critical thinking and communicating, academic and technical writing, workplace and interpersonal communication, oral presentation, and career skills. Padma is also a Specialist Adult Educator (Curriculum Development) certified by the Institute of Adult Learning, Singapore. She has conducted several workshops for adult learners, both in Singapore and overseas, on teaching practices, active learning, and designing authentic assessments for the workplace.\nRosmawati\nAssistant Professor\nSee Full Profile\nRosmawati is an Assistant Professor in the Centre for Professional Communication. As an applied linguist and educator, she is interested in and passionate about the teaching/learning, as well as the development of language and communication skills. She has more than 10 years of experience teaching in the higher education settings in several countries, including Indonesia and Australia. Her research areas align with her teaching passions and focus on the development of syntactic complexity in academic writing from the perspective of Complex Dynamic Systems Theory (CDST), which she has published several journal articles and book chapters on.\nRosmawati has a PhD in education from the University of Sydney and an MA in applied linguistics from the South China University of Technology. She is a member of the American Association of Applied Linguistics and of the Australian Applied Linguistics Association. She is also a reviewer for several journals in applied linguistics.\nVictor Matthew Cole\nAssistant Professor\nSee Full Profile\nDr. Victor Cole is Assistant Professor in the Centre for Professional Communication at Singapore Institute of Technology (SIT). He is an ethicist and communications educator with more than 20 years' experience in innovative curriculum development and programme leadership at the tertiary level. Throughout his career, he has sought meaningful opportunities to develop stakeholders' critical thinking and communication skills around ethical issues in a variety of professional domains (e.g., medicine, nursing, allied health, engineering and hospitality). He is committed to researching moral challenges arising from boundary-pushing technological endeavours (e.g., human enhancement and spaceflight) and is experienced in ethical board review and research ethics training. Victor is also a seasoned moderator of C-level panel discussions on innovation and entrepreneurship and of public forums on bioethics.\nJanice Wong\nAssistant Professor\nSee Full Profile\nDr Janice Wong is an Assistant Professor in the Centre for Professional Communication at the Singapore Institute of Technology (SIT). She brings over a decade of corporate experience in managing media, corporate communications and employee engagement for multinational companies in the banking and technology industries.\nA former journalist with Singapore Press Holdings, she wrote for various news channels such as The Straits Times before venturing into branding and public relations. Prior to joining SIT, she led global business communications for supply operations of the world’s largest agrochemical company headquartered in Switzerland. As a Prosci-certified change management practitioner, she is experienced in supporting C-suite level leaders and teams in steering change communications for large-scale transformation projects, as well as mergers and acquisitions.\nShe received a PhD in Business from Singapore Management University where her research focused on corporate internal communications and organisational culture change. Additionally, she holds a Master's in Mass Communication from Nanyang Technological University, where she was awarded the Pearson Education Gold Medal for being the most outstanding graduate of the programme.\nAt SIT, she is passionate about empowering learners with practical industry-focused communication skills and supporting them in unlocking their full potential.\nYvonne Kong-Ho\nSenior Lecturer\nSee Full Profile\nDeeply passionate about the topics of workforce development, career resilience and career longevity, Yvonne is thankful for the privilege and honour to be able to journey with many who have faced conundrums or needed greater clarity in the career-related decisions which they have had to make. From years of teaching, coaching and mentoring, she has witnessed the power of tenacity and resilience as people overcome almost insurmountable obstacles to be who they are and what they have grown to become.\nYvonne has had close to two decades of experiences in education, people and career development. Her teaching and research interests lie in the fields of industrial gerontology and workforce development. It is her greatest hope to see people working towards the building and strengthening of their career capital at every stage of their lives.\nYvonne holds a Master of Arts in Lifelong Learning from the Institute of Education (University College London) and received her PhD in Gerontology from the Singapore University of Social Sciences.\nErick Tan\nSenior Lecturer\nSee Full Profile\nErick is a Senior Lecturer in the Centre for Professional Communication at the Singapore Institute of Technology (SIT). Upon completing his Masters in Speech Pathology (MSpPath) from La Trobe University (Australia), Erick practiced as a Speech-Language Therapist before transitioning into education, working with patients presenting with speech, articulation, voice, and cognitive-linguistic disorders. His practice focused on neurorehabilitation, assisting patients with neurolinguistic deficits following stroke and other neurological disorders to regain their ability to communicate.\nA passionate award-winning educator, Erick has been teaching at various institutes for higher learning since 2008. He currently teaches courses relating to critical thinking and communicating, and in the area of phonetics and phonology at SIT. As a part-time radio broadcaster, Erick continues to apply industry knowledge into his classroom teaching. Erick currently coordinates the Communicating Across Curriculum embedded workshops across the university’s 40 programmes.\nNazerene Ibrahim\nSenior Lecturer\nSee Full Profile\nNazerene Ibrahim is a Senior Lecturer in the Centre for Professional Communication at the Singapore Institute of Technology (SIT). Following the completion of her Masters degree in Political Science, Nazerene joined the Singapore Foreign Service as a senior officer in the diplomatic line. Her keen interest in communication skills was born during this time. The years spent there honed her communication skills and gave her insight into professional communication and behaviours. Since obtaining a CELTA certification, Nazerene has taught several tertiary-level courses in communication, critical thinking and communication, as well as academic research and writing.\nAn award-winning educator, Nazerene is driven to help her students gain valuable knowledge in academia, while moulding themselves as responsible and compassionate contributors to society. She continues to explore strategies that can be employed in the tertiary classroom to motivate students to excel in their studies to the best of their abilities, while developing their own character and identity. Nazerene continues to also study and note changing trends in the workplace behaviours and communication in the Asian (specifically Singaporean) workplace."
  ],
  "links": [
    "https://www.singaporetech.edu.sg/centre-professional-communication/about-cpc/our-faculty?id=#main-content",
    "https://www.singaporetech.edu.sg/",
    "https://www.singaporetech.edu.sg/centre-professional-communication/modules-and-initiatives-students",
    "https://www.singaporetech.edu.sg/centre-professional-communication/modules-and-initiatives-working-professionals",
    "https://www.singaporetech.edu.sg/centre-professional-communication/collaboration",
    "https://www.singaporetech.edu.sg/centre-professional-communication/about-cpc",
    "https://www.singaporetech.edu.sg/search",
    "https://www.singaporetech.edu.sg/centre-professional-communication/modules-and-initiatives-students",
    "https://www.singaporetech.edu.sg/centre-professional-communication/modules-and-initiatives-working-professionals",
    "https://www.singaporetech.edu.sg/centre-professional-communication/collaboration",
    "https://www.singaporetech.edu.sg/centre-professional-communication/about-cpc",
    "https://www.singaporetech.edu.sg/centre-professional-communication/",
    "https://www.singaporetech.edu.sg/centre-professional-communication/about-cpc",
    "https://www.singaporetech.edu.sg/centre-professional-communication/about-cpc/our-faculty?id=",
    "https://www.singaporetech.edu.sg/directory/faculty/kenneth-ong",
    "https://www.singaporetech.edu.sg/directory/faculty/christopher-james-bedwell",
    "https://www.singaporetech.edu.sg/directory/faculty/chien-ching-lee",
    "https://www.singaporetech.edu.sg/directory/faculty/jaidev-radhika",
    "https://www.singaporetech.edu.sg/directory/faculty/behnam-soltani",
    "https://www.singaporetech.edu.sg/directory/faculty/hwee-hoon-lee",
    "https://www.singaporetech.edu.sg/directory/faculty/rahimi-muhammad",
    "https://www.singaporetech.edu.sg/directory/faculty/padma-rao",
    "https://www.singaporetech.edu.sg/directory/faculty/rosmawati",
    "https://www.singaporetech.edu.sg/directory/faculty/victor-matthew-cole",
    "https://www.singaporetech.edu.sg/directory/faculty/huei-ling-janice-wong",
    "https://www.singaporetech.edu.sg/directory/faculty/shi-qi-yvonne-kong",
    "https://www.singaporetech.edu.sg/directory/faculty/kian-lip-erick-tan",
    "https://www.singaporetech.edu.sg/directory/faculty/nazerene-do-ibrahim",
    "https://www.google.com/maps/place/Singapore+Institute+of+Technology+(SIT)+-+Punggol/@1.41364,103.91229,14z/data=!4m6!3m5!1s0x31da1515bfb2d263:0xc71c56458ac08497!8m2!3d1.4136399!4d103.9122896!16s%2Fg%2F11t42h3wb_",
    "https://www.singaporetech.edu.sg/contact-us",
    "https://www.singaporetech.edu.sg/campus-locations",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.linkedin.com/company/singapore-institute-of-technology",
    "https://www.youtube.com/user/SingaporeTech",
    "https://www.tiktok.com/@singaporetech",
    "https://www.singaporetech.edu.sg/academic-policies",
    "https://www.singaporetech.edu.sg/privacy-policy",
    "https://www.singaporetech.edu.sg/safety-and-health-policy",
    "https://www.singaporetech.edu.sg/social-media-guidelines",
    "https://www.singaporetech.edu.sg/terms-use",
    "https://www.singaporetech.edu.sg/whistleblowing"
  ],
  "images": [
    "https://www.singaporetech.edu.sg/directory/sites/directory/files/styles/profile_picture/public/profile-picture/8787%20ppHR%20.jpg?itok=-bhmFLGz",
    "https://www.singaporetech.edu.sg/directory/sites/directory/files/styles/profile_picture/public/profile-picture/Christopher%20James%20Bedwell.jpg?itok=BEbpHeLh",
    "https://www.singaporetech.edu.sg/directory/sites/directory/files/styles/profile_picture/public/profile-picture/Dr%20Lee%20Chien%20Ching.jpg?itok=oEupAJyX",
    "https://www.singaporetech.edu.sg/directory/sites/directory/files/styles/profile_picture/public/profile-picture/Radhika.jpg?itok=7TVlhDuw",
    "https://sitcorptemp.prod.acquia-sites.com/directory/sites/directory/files/styles/profile_picture/public/profile-picture/MicrosoftTeams-image%20%2821%29.png?itok=Q1yEm6zy",
    "https://www.singaporetech.edu.sg/directory/sites/directory/files/styles/profile_picture/public/profile-picture/Dr%20Lee%20Hwee%20Hoon.jpg?itok=38N0Zjk7",
    "https://www.singaporetech.edu.sg/directory/sites/directory/files/styles/profile_picture/public/profile-picture/Profile%20Photo%20Dr%20Rahimi.jpg?itok=Louk624j",
    "https://www.singaporetech.edu.sg/directory/sites/directory/files/styles/profile_picture/public/profile-picture/Padma%20Rao_25.jpg?itok=Jirbn2uF",
    "https://www.singaporetech.edu.sg/directory/sites/directory/files/styles/profile_picture/public/profile-picture/Professional%20headshot.png?itok=Ix7wpOZf",
    "/centre-professional-communication/sites/ccs/files/2024-03/victor-matthew.png",
    "/centre-professional-communication/sites/ccs/files/2025-03/wong.png",
    "/centre-professional-communication/sites/ccs/files/2025-05/Yvonne%20profile%20photo_0.jpg",
    "https://www.singaporetech.edu.sg/directory/sites/directory/files/styles/profile_picture/public/profile-picture/Erick%20Tan%20%28CCS%29.jpg?itok=UdjfxczW",
    "/centre-professional-communication/sites/ccs/files/2023-01/Untitled%20design%20%2820%29.png"
  ]
}