{
  "url": "https://www.singaporetech.edu.sg/directory/faculty/tan-kim-chuan",
  "title": "Matthew Tan | Web Directory | Singapore Institute of Technology",
  "meta": {
    "description": "Associate Professor Matthew Tan is a sustainability professional with over 20 years of experience in the Agri-Tech sector. His career has been marked by successful implementations and management of sustainability initiatives in the Aquaculture & Agriculture industries. Notably, he has played a pivotal role in assisting governments with their economic transformation through the adoption of Agri-Tech 4.0.As a Sustainability Specialist for the Agri & Food production industry, he has been instrumental in developing and implementing carbon neutral strategies that significantly reduce carbon footprints, contributing to a more environmentally conscious & sustainable future plus guiding organizations through the complex process of transitioning to carbon-neutral operations.His recent achievements include spearheading the integration of ESG principles into Agri related  projects, aligning business strategies with sustainable practices; development and executing carbon-neutral strategies whereby effectively reducing the environmental footprint of related Agri & food processing operations. His commitment to promoting sustainable practices is further demonstrated through the establishment of strategic partnerships with key stakeholders, including government bodies, NGOs, and industry leaders.He is also currently Singapore Representative (Private Sector) to APEC Policy Partnership on Food Security and is also the current APEC Chair for Sustainable Development in Agricultural and Fishery sectors (PPFS) where he co-ordinates discussions between senior officials, APEC governments and the private sector on the use of technology and combined resources for Sustainable Development in the Aquaculture, Agriculture and Fishery industry. For the past number of years, he has also been actively involved in assisting governments with their Economic Transformation – Agri Tech 4.0 in the light of food security; working in tandem with the various ministries and multiple stakeholders in the country with an overarching view to achieving their future food securities goals.In tandem with his current APEC appointment, A/Prof Tan is also serving as the Chief Executive Officer (Asia) of Assentoft Aqua Asia Pte Ltd. Assentoft Aqua A/S (Denmark) is one of the world's leading Aquaculture Engineering companies and the team at Assentoft Aqua has been involved in Recirculating Aquaculture System (RAS) development since the very beginning of the recirculation aquaculture industry in 1978; thus, learning from both successes and failures from existing plants, including salmon plants. Assentoft is second to none in having the lowest possible footprint RAS that saves space, pipes, buildings etc, rapid installation time by using steel tanks as our basic component, having the best available water treatment within the industry, low investment per produced ton of fish and deep knowledge about salmon, trout and tropical pelagic fish production in land-based RAS-systems.Prior to his current corporate appointment, A/Prof Tan was previously the Group Chief Technology Officer & Chief Risk Officer of Oceanus Group Ltd and CEO & Director of Oceanus Tech Pte Ltd (a wholly owned subsidiary of Oceanus Group) – One of the world’s largest land-based aquaculture companies which is listed on the main board of the Singapore Stock Exchange (from 2013 to 2020).He was responsible for the development of Oceanus Group's Risk Management framework and farms' operational protocols manuals and oversaw the development and implementation of the company farm’s Bio-security plan which includes the validation & adoption of sustainable technologies, implementation of water monitoring system, animal nutrition & feed formulation and possible use of Recirculating Aquaculture technologies in their land-based farms (total 42 farms spread over 300 km of coastal areas and a 5,000 floating sea cage farm).He was also part of the new management team that spearheaded the restructuring of the company in 2015 and was instrumental in proposing the major changes to their business model and restructuring of operations which saw a 60% reduction in overheads and expenses subsequently. The restructuring efforts paid off and the company turned profitable in 2020. Note that the company was saddled with huge debts and defaulted on a totalling debt of S$94 million in 2014 and had a negative net asset position of approximately S$66 million.Subsequently, he was seconded and promoted to CEO & Director of Oceanus Tech Pte Ltd which was setup by the group to spearhead the group expansion.He is also a graduate from SEAFDEC (Southeast Asian Fisheries Development Centre) – Asia’s leading fishery institution; where he received a Training Fellowship under a Government of Japan – Trust Fund Programme in hatchery and grow-out, seaweed and Benthic Diatom culture and production.On the academic frontier, Matthew serves as an Adjunct Professor with domain expertise in applied sustainability practices and protocols for the Agri & Food Industry. Beyond his hands-on contributions, he shares his insights as a lecturer cum instructor in Deep Tech Translation and Master’s degree programmes; with key focus in ESG, Sustainability, and Carbon-Neutral Engineering. His engaging teaching style, coupled with real-world examples, not only makes complex concepts accessible but also inspires students to be catalysts for positive change in their respective fields.He was also previously serving as an Adjunct Senior Research Fellow and Associate Professor (Aquaculture) with the Centre for Sustainable Tropical Fisheries and Aquaculture (CSTFA) - College of Science and Engineering - James Cook University, Australia.James Cook University specializes in the sustainable exploitation of tropical aquatic species and is Australia’s leading university in Tropical Fisheries Science. Through the Centre for Sustainable Tropical Fisheries and Aquaculture (CSTFA), JCU partners with industry, NGOs, and government to tackle grand challenges associated with sustainable production of seafood. Current external appointments:1. Singapore Representative (Private Sector): Policy Partnership on Food Security, Asia Pacific Economic Cooperation (APEC). About APEC PPFS : https://apec.org/Groups/Other-Groups/Policy-Partnership-on-Food-Security.aspx2. Chair - Sustainable Development for the Agriculture and Fisheries Sector, APEC PPFS. Responsible for coordination of discussions between APEC governments and the private sector on the use of technology and combined resources for Sustainable Development of Aquaculture, Agriculture and Fishery Sectors within the APEC region and set-up of APEC Centre for Sustainable Development in Agriculture and Fisheries sectors in Singapore.3. Member – Advisory Board : PT. Terra Baru Indonesia – Indonesia's Leading Biochar and Carbon Credit Specialists : TerraBaru drives sustainable innovation by transforming waste into valuable capital, powering a net-zero future and delivering measurable impact across the planet, society, and the economy. TerraBaru is a seasoned team of global executives united by a single mission— to address Indonesia’s 250 million tons per year agricultural waste problem. With a diverse background encompassing expertise in resource development, sustainable practices, ecosystem and biodiversity conservation, environmental law, and investment banking, TerraBaru is uniquely positioned to create transformative solutions.  By impacting communities, soil, air, and water, and transforming waste and emissions into capital, we build a world where carbon emissions and soil degradation become valuable resources to fund environmental and social sustainability. https://terrabaru.com/4. Member – Scientific Advisory Board : Sento Biotech Sdn Bhd – Development of Carbon Neutral feed for culture of Macrobrachium rosenbergii, also known as the giant river prawn or giant freshwater prawn.5. Advisor (HON) - Centre for Aquaculture and Veterinary Science, School of Applied Science, Temasek Polytechnic. 6.  Member - Investment Committee - Asia Food Sustainability Fund. This Venture fund targets startups in the Deep-tech, Agri-tech, Food Sustainability and Consumer Packaged Goods industry. It is committed to support agri-food tech startups around the world that are committed to creating a sustainable and healthier future for everyone. The Asia Food Sustainability Fund is dedicated to backing early-stage companies that are leveraging the vast potential for growth in the agri-food tech industry in Asia. This fund leverage on Innovate 360’s ecosystem, which includes infrastructure, accelerator, strategic partnerships and networks in which deep tech startups are well positioned to grow exponentially and create positive impact to the world.  About Innovate 360 - https://innovate360.sg/about/7. Member – Editorial Board : Journal of Marine Biology and Aquatic Research (JMBAR)8. Member – Editorial Board : Aquatic Research Journal Track Records and Completed Projects- Principal Consultant/ Chief Sustainability & Technology Officer Designate – On site survey and measurement for carbon sequestration potential, carbon credit development and mangrove aquaculture CSR in Indonesia for Singapore/ Indonesia entity. This project involves Mangrove, peatland & coastal restoration plus possible CSR planning for regenerative Aquaculture for the indigenous people. June 2022 to 2024- Member - Scientific Advisory Board cum Chief Sustainability Officer - Carbon Neutral Prawn Project – An APEC reference project – Singapore & Malaysia. A carbon-neutral prawn aquaculture system through the development of sustainable aquafeed and the adoption of a green circular economy. The fruition of this project will create a massive disruption to the aquaculture & feed industry as it will create a sustainable aquaculture industry that minimizes its environmental impact while providing high-quality and carbon neutral seafood to consumers. Dec 2022 to present.- Advisor (Sustainability) - Frederiksdal Pte Ltd. Frederiksdal is one of the world’s largest cherry vineyards (Denmark) and also the only one in the world that produces wine from cherries according to the same principles that have been used in centuries of production of grape wine. Providence of net zero and carbon neutral advisory and recommendations for the implementation of carbon mitigation strategies and re-evaluation of the wine Life Cycle Analysis re. carbon neutrality – July 23 to present.- Member of Advisory Board – One of the world’s leading cell-based cultured seafood company that utilizes tissue formation methods to produce healthy and tasty seafood meat. June 23 to present. - Member - Technical Advisory Panel (Agri Tech) - Institute of Materials Research and Engineering (IMRE) : Agency for Science, Technology & Research (A*STAR). 2022 to 2024- Principal Consultant – Agritech feasibility study and development of a Strategic White Paper for a main board listed company in Singapore. This listco is looking to diversify and enter the Agri Industry. Oct 2020.- Senior Principal Consultant  & Head of Technical Team  – Part of the economic advisory team that put together the Strategic Aquaculture Redevelopment Plan for the Government of Western Africa. This project includes 53 site surveys completed and the identification and development of 16 sites as Special Economic Zone for self-sustainable aquaculture.  2018 – 2020.Chairman - Scientific Advisory Board – Singapore Crawfish (Singapore, Malaysia and Indonesia). Specialized in the production of genetically improved SPF (Specific Pathogen Free) Cherax Quadricarinatus with SPF and SPR family lines originating from Australia, Indonesia, Malaysia, Thailand and Singapore. This company pioneers modern vertical aquaculture system and it boasts an R&D and engineering team that has the capability to install and fabricate customized systems for crawfish breeding and cultivation - 2021 to August 2024- Chairman – Scientific Advisory Board - SEA Aquaculture. Development of a vertically integrated 10,000 Metric Ton production per year Atlantic Salmon RAS facility in Vietnam. This is a key food security project in Asia – An APEC Project. Total project value US$100m – 10 HA footprint.- Member - Scientific Advisory Board - Pebble Labs, Inc : A USA based biotechnology company developing solutions to safely and sustainably increase aquaculture yield and food security. Its mission is to develop breakthrough disruptive technologies that address the greatest agriculture, aquaculture, and environmental challenges facing the globe. Pebble Labs is committed to urgently solving these challenges. - Member - Peer Review Group : Global Livestock and Aquaculture Policy Project - Funded by Bill and Melinda Gates Foundation (BMGF) - CHATHAM HOUSE - The Royal Institute of International Affairs. From 2019 to 2020.- Principal Consultant – Development of the proposal for the introduction of intensive & indoor shrimp farming system and redevelopment of 2,000 acres of land for Aquaculture in Rompin, Malaysia.  2019 to 2022.- Principal Consultant – Assessment of the Vanuatu Aquaculture Industry – Development of the re-development  proposal for the Trade commissioner of Vanuatu – 2018- Principal Consultant – Assessment the conversion of 8,000 disused shrimp (post disease outbreak)  pond into Barramundi Culture – Sri Lanka- Principal Consultant : AVA Land tender specification – 1.3 HA and proposal development for a bio secure hatchery for a leading aquaculture player in Singapore. Awarded land lease in 2019.- Principal Consultant : Strategy development and implementation for the largest fishery feed player in Nigeria. Was involved in the implementation of the plans which include training of farmers cooperatives (aquaculture) and a team of technical executives responsible for subsequent follow-up with these farmers for the whole of Nigeria - 2017 to 2020.- Principal Consultant : Design of 2.3 HA Bio-secure aquaculture facility which include hatchery, nursery, grow-out and brood stock holding areas in Africa - 2017 to 2020.- Principal Consultant : Technical advisory to Aquaculture farmers in Egypt & Ghana for the largest fishery feed mill in Africa- 2017 to 2020.- Principal Consultant : Design and set-up of 2.3-hectare Bio-secure aquaculture facility (about US$3m) which include hatchery, nursery and brood stock holding areas in Malaysia – 2017.- Principal Consultant : Site survey - 220 Acres of disused shrimps’ raceways and land for possible aquaculture grow-out use. West Malaysia 2016.- Principal Consultant : Hybrid Grouper species development and ECO diversity study on endemic species– Malaysia – 2016- Collaborator : Bio marker study on Abalone laggard and Selective Genetics breeding - Jointly with Temasek Poly & Oceanus Group – 2017.- Collaborator & Technology Partner : Use of Hydrocavitation technology for increasing aquaculture harvest yield - Jointly with one of the world's largest shrimps’ producers – 2015 to 2017- Principal Consultant : Design and Setup of 2 HA Bio Secure Grouper/ Sea Bass Hatchery and Aquaculture farm – Malaysia – 2016- Principal Investigator : Design and use of hydrocavitation technology for Sea Bass and shrimps pond culture in Sri Lanka.- Principal Consultant : Design of Inland bio secure Hatchery facility (1.2 HA) in Ipoh, Malaysia.- Principal Investigator : Investigation on possible conversion of existing shrimp culture ponds (500 HA) for food fish grow-out in Pahang, Malaysia.- Principal Investigator – Investigation and technical Advisory on the mortalities and grow-out issues in a State-owned Tilapia farm. Indonesia.- Principal Investigator : MND Research Fund Grant on “Ecological Land Based Aquaculture - Farming of food fish in Urban environment”. Multi-million-dollar MND grant to fully develop a high intensity & high yield aquaculture RAS farming system using minimum space and labour through the integration of people, technology and business system.- Co-Principal Investigator (with Surbana Technologies) : Development of Multiple storey land-based food-fish breeding system with Surbana Technologies. This project leverage off high intensity vertical fish farming as an \"engineering\" solution to solve this issue.- Project Director : Development of a Fully automated and online monitoring of water conditions for aquaculture farms – Horiba Instruments & Bio X Pte Ltd- Principal Investigator - Development of live support system for shipping containers for the shipping of live sea food (sea to land) with APL (part of NOL Shipping Group) one of the world’s top shipping companies. The project successfully research, designed and developed an enclosed automated recirculation water filtration and treatment system for incorporation into APL’s Live reefer container.- Project Director – 2013 Technical farm audit completed for the world’s largest Aquaculture (China) spanning more than 300 km. Oceanus Group.- Principal Investigator and project Director – Development and setup of Asia first Aquahub (live seafood holding logistic hub) in Jurong Cold Hub One, Singapore. A joint development with CWT Fresh (Part of CWT Group) ",
    "keywords": null
  },
  "text_lines": [
    "Skip to main content",
    "Menu secondary",
    "Who We Are",
    "Faculty Directory",
    "Professional Officers Directory",
    "user",
    "Sign in",
    "Faculty Directory",
    "Professional Officers Directory",
    "Menu secondary",
    "Quick Links",
    "Who We Are",
    "Faculty Directory",
    "Professional Officers Directory",
    "user",
    "Sign in",
    "body {\n  overflow-x: hidden;\n}\n#block-chunwaicustomcss {\n  display: none;\n}\nh1,\nh2 {\n  color: #ea2429;\n  font-weight: 400;\n}\nh1[class$=\"__h1\"],\nh2[class$=\"__h1\"] {\n  color: inherit;\n}\n.page-card__body .accent--tall,\n.section-header__subtitle .accent--tall {\n  height: 100%;\n  max-height: 2.5rem;\n}\n.avatar--lg img {\n  display: block;\n  border-radius: 7.5rem;\n  width: 7.5rem;\n  height: 7.5rem;\n}\n.simple-paragraph li,\n.group-left li {\n  box-sizing: border-box;\n}\n.simple-paragraph li:not([class]) a,\n.group-left li:not([class]) a {\n  font-family: \"IBM Plex Sans\", sans-serif;\n  font-weight: 500;\n  text-decoration: none;\n  color: #da291c;\n  border-bottom: 1px solid currentColor;\n  -webkit-transition: color 150ms, outline 150ms, background 150ms;\n  transition: color 150ms, outline 150ms, background 150ms;\n}\n.simple-paragraph li:not([class]) a:hover,\n.group-left li:not([class]) a:hover {\n  color: #a8071a;\n}\n.simple-paragraph li:not([class]) a:focus,\n.group-left li:not([class]) a:focus {\n  outline: .25rem solid #fff1f0;\n  background: #fff1f0;\n}\n.simple-paragraph ul:not([class]),\n.group-left ul:not([class]) {\n  list-style-type: disc !important;\n  padding-left: 1.5rem;\n  margin-top: 1rem;\n  margin-bottom: 1rem;\n}\n.simple-paragraph ol:not([class]),\n.group-left ol:not([class]) {\n  padding-left: 1.5rem;\n  margin-top: 1rem;\n  margin-bottom: 1rem;\n}\n.simple-paragraph li:not([class]),\n.group-left li:not([class]) {\n  margin-bottom: .5rem;\n  padding-left: .5rem;\n}\n.simple-paragraph table.default,\n.group-left table.default {\n  float: none;\n}\n.simple-paragraph table.default td,\n.group-left table.default td {\n  vertical-align: top;\n}\n.simple-paragraph table.default th,\n.group-left table.default th,\n.simple-paragraph table.default td,\n.group-left table.default td {\n  border: 1px solid #d9d9d9;\n}\n.simple-paragraph table.default td:after,\n.group-left table.default td:after {\n  content: none;\n}\n.simple-paragraph table,\n.group-left table {\n  float: none;\n}\n.simple-paragraph table td,\n.group-left table td {\n  border-bottom: 1px solid #d9d9d9;\n}\n.simple-paragraph table td[rowspan]::after,\n.group-left table td[rowspan]::after {\n  content: none;\n}\n.simple-paragraph table.border th,\n.group-left table.border th,\n.simple-paragraph table.border td,\n.group-left table.border td {\n  border: 1px solid #d9d9d9;\n}\n.simple-paragraph figure,\n.group-left figure,\n.simple-paragraph .figure,\n.group-left .figure {\n  margin-right: 0;\n}\n.slick .slick__slide > div .simple-paragraph {\n  padding: 0;\n}\n.add-spacing .slick-track {\n  margin-left: 0;\n}\n.add-spacing .simple-paragraph {\n  padding: 0 !important;\n}\n.add-spacing .slick-slide,\n.add-spacing .slick-list {\n  margin: 5px 0 !important;\n}\n.add-spacing .slick-slide:not(:last-child) {\n  padding-right: 2.5rem !important;\n}\n.add-spacing .slick-list {\n  padding: 0 10% 0 0 !important;\n}\n.add-spacing .slick-slide {\n  -webkit-transition: opacity 0.3s ease-in-out;\n  -moz-transition: opacity 0.3s ease-in-out;\n  -ms-transition: opacity 0.3s ease-in-out;\n  -o-transition: opacity 0.3s ease-in-out;\n  transition: opacity 0.3s ease-in-out;\n  filter: alpha(opacity=30);\n  opacity: 0.3 !important;\n  outline: none !important;\n}\n.add-spacing .slick-slide.slick-active {\n  opacity: 1 !important;\n}\n.life-card .imgholder::after {\n  content: \" \";\n  background: linear-gradient(to bottom, rgba(0, 0, 0, 0), rgba(0, 0, 0, 0.6));\n  width: 100%;\n  height: 100%;\n  max-height: 35%;\n  position: absolute;\n  top: auto;\n  bottom: 0;\n}\n.testimonial-article {\n  max-width: none;\n}\n.testimonial-article::before {\n  content: \"\";\n}\n@media (min-width: 57.5rem) {\n  .testimonial-article .testimonial-article__text {\n    font-size: 1.2rem;\n  }\n}\n.testimonial-article .testimonial-article__designation .testimonial-article__cite {\n  margin-top: 0;\n}\n.page-node-type-page form.webform-submission-form:not(.full-width) .js-form-item.form-item.row--sm {\n  width: 49.5%;\n  display: inline-block;\n  padding-right: 25px;\n}\n.page-node-type-page form.webform-submission-form:not(.full-width) .visually-hidden {\n  position: relative !important;\n  overflow: auto;\n  width: auto;\n  height: auto;\n  clip: auto;\n}\n.page-node-type-page form.webform-submission-form:not(.full-width) .hidden {\n  display: none !important;\n}\n.page-node-type-page form.webform-submission-form:not(.full-width) .full-width {\n  width: 100% !important;\n}\n.accordion .accordion__li-title {\n  max-width: none;\n}\n@media screen and (max-width: 920px) {\n  .menu-sidebar {\n    display: none1;\n  }\n}\n.menu-sidebar .menu-sidebar__menu ul {\n  padding-left: 0;\n}\n.link-item {\n  max-width: 450px;\n}\n.section-header .section-header__subtitle {\n  max-width: 920px;\n}\nh2.section-header,\nh3.section-header {\n  margin-top: 5rem;\n  margin-bottom: 1.5rem;\n}\n.layout-content .block:last-of-type {\n  /*margin-bottom: 1.5rem;*/\n}\n.align-self-center {\n  padding: 5rem;\n}\n@media screen and (max-width: 920px) {\n  .align-self-center {\n    padding: 0rem !important;\n  }\n}\n.flex-col {\n  display: -webkit-flex;\n  display: -ms-flexbox;\n  display: flex;\n  border-top: 1px dashed #ccc;\n}\n.flex-col .col {\n  padding: 2rem;\n  margin-bottom: 2rem;\n  flex: 1;\n}\n.flex-col .col:last-child {\n  margin-bottom: 0rem;\n}\n.flex-col .col:not(:first-child):not(:last-child) {\n  border-left: 1px dashed #ccc;\n  border-right: 1px dashed #ccc;\n  margin-left: -1px;\n}\n.flex-col .col ul {\n  margin-top: 0;\n  margin-bottom: 0;\n}\n@media screen and (max-width: 920px) {\n  .flex-col {\n    -webkit-flex-direction: column;\n    flex-direction: column;\n    padding: 2rem 0;\n    border-bottom: 1px dashed #ccc;\n  }\n  .flex-col .col {\n    padding: 0;\n  }\n  .flex-col .col:not(:first-child):not(:last-child) {\n    border: none;\n    margin-left: 0;\n  }\n}\n.embed-container > div {\n  position: relative;\n  padding-bottom: 56.25%;\n  height: 0;\n  overflow: hidden;\n  max-width: 100%;\n}\n.embed-container iframe,\n.embed-container object,\n.embed-container embed {\n  position: absolute;\n  top: 0;\n  left: 0;\n  width: 100%;\n  height: 100%;\n}\n.img-responsive {\n  width: 100%;\n}\n.img-responsive img {\n  width: 100%;\n}\n@media screen and (min-width: 920px) {\n  #half {\n    width: 46%;\n    float: left;\n    margin-right: 2rem;\n    margin-bottom: 1rem;\n  }\n}\n.layout--onecol .simple-paragraph h1,\n.layout--onecol .simple-paragraph p,\n.layout--onecol .simple-paragraph ul,\n.layout--onecol .simple-paragraph ol:not(.page-cards__list),\n.layout--onecol .simple-paragraph .embed-container {\n  max-width: 920px;\n}\nform.webform-submission-form,\n.accordion {\n  max-width: 920px;\n}\ndiv.layout--background--none:last-of-type {\n  padding-bottom: 10rem !important;\n}\n.layout--background--light-grey {\n  background: #eeeeee;\n  overflow: hidden;\n}\n.layout--background--light-grey.layout--background-size--contain::after {\n  content: \" \";\n  width: 100vw;\n  height: 25vh;\n  background: white;\n  position: absolute;\n  top: 0px;\n}\n.layout--background--black {\n  background: #323232;\n  overflow: hidden;\n}\n.layout--background--black.layout--background-size--contain::after {\n  content: \" \";\n  width: 100vw;\n  height: 25vh;\n  background: white;\n  position: absolute;\n  top: 0px;\n}\n@media screen and (min-width: 720px) {\n  .layout--suite--twocols.layout--column-gap--remove.layout--background-size--contain .layout__region.layout__region--second {\n    display: flex;\n    align-items: center;\n    justify-content: center;\n    background: #eeeeee;\n    padding: 0 5rem !important;\n  }\n}\n@media screen and (max-width: 720px) {\n  .layout--twocol.layout--background-size--contain.layout--column-gap--added.layout--column-width--50-50.layout--align-items--start .grid--layout--suite {\n    display: flex;\n    flex-wrap: wrap;\n    flex-direction: column-reverse;\n  }\n}\n.layout--twocol.layout--background-size--contain.layout--column-gap--added.layout--column-width--50-50.layout--align-items--start .grid--layout--suite .layout__region--second {\n  margin-bottom: 1.5rem;\n}\n.layout--twocol.layout--background-size--contain.layout--column-gap--added.layout--column-width--50-50.layout--align-items--start .grid--layout--suite .layout__region--first {\n  margin-bottom: 0;\n}\n@media screen and (max-width: 720px) {\n  .layout--background--light-grey.layout--top-padding--xl {\n    padding-top: 2.5rem !important;\n  }\n  .layout--background--light-grey.layout--bottom-padding--xl {\n    padding-bottom: 2.5rem !important;\n  }\n}\n#sit-history {\n  margin: 0 0 5rem 0;\n  max-width: none !important;\n}\n@media (min-width: 57.5rem) {\n  #sit-history .page-cards__li {\n    flex-basis: 50%;\n    max-width: 50%;\n    padding: 0 !important;\n  }\n}\n#sit-history .stick {\n  overflow: auto;\n  position: -webkit-sticky;\n  position: sticky;\n  top: 12rem;\n}\n#sit-history h2 {\n  margin-top: 0;\n}\n#sit-history .text {\n  padding: 5rem;\n}\n#sit-history img {\n  width: 100%;\n}\n.icon-title {\n  display: flex;\n  align-items: center;\n  margin-bottom: 1.5rem;\n}\n.icon-title * {\n  margin: 0;\n}\n.icon-title img {\n  height: 80px;\n  margin-right: 1.5rem;\n}\narticle[data-history-node-id=\"211\"] .columned-section__left-content,\narticle[data-history-node-id=\"211\"] .columned-section__right-content {\n  box-sizing: border-box;\n}\narticle[data-history-node-id=\"161\"] #careers-what-drives-us h5 {\n  font-weight: 500;\n  margin: 0;\n}\narticle[data-history-node-id=\"161\"] #careers-what-drives-us hr {\n  border-style: dashed;\n  margin: 1.5rem 0;\n}\narticle[data-history-node-id=\"2836\"] .page-card,\narticle[data-history-node-id=\"2836\"] .page-card img {\n  max-width: none;\n  width: 100%;\n}\narticle[data-history-node-id=\"2846\"] > div > div:nth-child(5) .layout__region--first {\n  border-right: 1px solid #d9d9d9;\n}\n.wsdeg-programme-structure img {\n  max-width: 806px;\n}\narticle[data-history-node-id=\"186\"] table {\n  margin-top: 0;\n  border-bottom: 1px solid #d9d9d9;\n}\narticle[data-history-node-id=\"186\"] table td[rowspan]::after {\n  background: none;\n}\narticle[data-history-node-id=\"2771\"] .paragraph--type-slick-container,\narticle[data-history-node-id=\"2776\"] .paragraph--type-slick-container,\narticle[data-history-node-id=\"2781\"] .paragraph--type-slick-container,\narticle[data-history-node-id=\"2786\"] .paragraph--type-slick-container,\narticle[data-history-node-id=\"2791\"] .paragraph--type-slick-container {\n  max-width: 58rem;\n  margin-bottom: 2.5rem;\n}\narticle[data-history-node-id=\"2491\"] .related-nav__list li {\n  border-bottom: 1px solid #d9d9d9;\n  padding: 1rem 0;\n  margin: 0 !important;\n}\narticle[data-history-node-id=\"2721\"] ul.two-col {\n  columns: 2;\n  -webkit-columns: 2;\n  -moz-columns: 2;\n}\narticle[data-history-node-id=\"2721\"] ul.two-col.nolist {\n  margin-left: 0;\n  padding-left: 0;\n}\narticle[data-history-node-id=\"2721\"] ul.two-col.nolist li {\n  list-style: none !important;\n  padding-left: 0;\n}\narticle[data-history-node-id=\"2721\"] .club-logo,\narticle[data-history-node-id=\"2721\"] .club-logo td,\narticle[data-history-node-id=\"2721\"] .club-logo th {\n  border: none !important;\n}\narticle[data-history-node-id=\"2721\"] .club-logo img {\n  max-height: 127px;\n  width: auto;\n}\n.page-node-type-programme #student-stories,\n.page-node-type-programme #iwsp .field__label {\n  display: none;\n}\n@media (min-width: 57.5rem) {\n  .page-node-type-programme .row--tb-lg {\n    padding-top: 2.5rem !important;\n    padding-bottom: 2.5rem !important;\n  }\n}\n.page-node-type-programme .background--jagged-bottom {\n  padding-bottom: 0;\n}\n.page-node-type-programme .background--jagged-bottom .paragraph.paragraph--type--simple-paragraph.paragraph--view-mode--default {\n  flex-basis: 100%;\n}\n.page-node-type-programme .background--jagged-bottom::after {\n  content: none;\n}\n.page-node-type-programme .background--jagged-bottom #video {\n  margin-top: 1.5rem;\n  margin-bottom: 2.5rem;\n}\n@media screen and (min-width: 920px) {\n  .page-node-type-programme .background--jagged-bottom #video {\n    position: relative;\n    margin-top: 2.5rem;\n    margin-bottom: 7.5rem;\n  }\n  .page-node-type-programme .background--jagged-bottom #video::before {\n    content: \" \";\n    background-color: #323232;\n    width: 150vw;\n    height: 70%;\n    position: absolute;\n    bottom: -5rem;\n    margin-left: -50vw;\n    z-index: -1;\n  }\n}\n.page-node-type-programme .background.background__color--grey {\n  padding: 5rem 0 !important;\n  margin: 2.5rem 0;\n}\n.page-node-type-programme .paragraph-wrapper .link-item {\n  margin-bottom: 1.5rem;\n}\n.page-node-type-programme h2#overview {\n  margin-bottom: 2.5rem !important;\n  padding-bottom: 0;\n}\n@media screen and (max-width: 920px) {\n  .page-node-type-programme h2#overview {\n    margin-top: 2rem !important;\n  }\n}\n.page-node-type-programme .section-header.contextual-region {\n  margin-bottom: 0;\n}\n.page-node-type-programme h2 {\n  margin-top: 0;\n  margin-bottom: 1rem !important;\n}\n@media screen and (min-width: 920px) {\n  .page-node-type-programme h2 {\n    margin-bottom: 2.5rem !important;\n  }\n}\n@media (min-width: 76.5rem) {\n  .page-node-type-programme .banner-header__main-content {\n    padding-top: 0;\n  }\n  .page-node-type-programme .banner-header__text-block > .accent {\n    right: 0;\n  }\n  .page-node-type-programme .banner-header__text-block {\n    padding-left: 0;\n    padding-right: 0;\n    background: none;\n    max-width: none;\n  }\n  .page-node-type-programme .banner-header__text-block > .h1 {\n    max-width: 60vw;\n  }\n  .page-node-type-programme .banner-header__overlay {\n    bottom: 0;\n    top: auto;\n  }\n  .page-node-type-programme .banner-header--cover .banner-header__background_media {\n    background-position: center center !important;\n  }\n  .page-node-type-programme .banner-header__background_media:before {\n    content: \"\";\n    background: linear-gradient(to top, black 0%, rgba(0, 0, 0, 0.738) 19%, rgba(0, 0, 0, 0.541) 34%, rgba(0, 0, 0, 0.382) 47%, rgba(0, 0, 0, 0.278) 56.5%, rgba(0, 0, 0, 0.194) 65%, rgba(0, 0, 0, 0.126) 73%, rgba(0, 0, 0, 0.075) 80.2%, rgba(0, 0, 0, 0.042) 86.1%, rgba(0, 0, 0, 0.021) 91%, rgba(0, 0, 0, 0.008) 95.2%, rgba(0, 0, 0, 0.002) 98.2%, transparent 100%);\n    height: 100%;\n    display: block;\n  }\n}\n.teaching-out-programme #programme-menu-sidebar,\n.teaching-out-programme #fees-and-finances {\n  display: none;\n}\ndiv[data-history-node-id=\"2609\"] .banner-header--cover .banner-header__background_media,\ndiv[data-history-node-id=\"2589\"] .banner-header--cover .banner-header__background_media,\ndiv[data-history-node-id=\"2601\"] .banner-header--cover .banner-header__background_media,\ndiv[data-history-node-id=\"2569\"] .banner-header--cover .banner-header__background_media,\ndiv[data-history-node-id=\"2590\"] .banner-header--cover .banner-header__background_media {\n  background-position: top center !important;\n}\ndiv[data-history-node-id=\"2566\"] .banner-header--cover .banner-header__background_media,\ndiv[data-history-node-id=\"2614\"] .banner-header--cover .banner-header__background_media,\ndiv[data-history-node-id=\"2578\"] .banner-header--cover .banner-header__background_media,\ndiv[data-history-node-id=\"2568\"] .banner-header--cover .banner-header__background_media {\n  background-position: bottom center !important;\n}\narticle[data-history-node-id=\"2471\"] img[src*=\".svg\"],\narticle[data-history-node-id=\"2701\"] img[src*=\".svg\"],\narticle[data-history-node-id=\"3821\"] img[src*=\".svg\"],\narticle[data-history-node-id=\"3816\"] img[src*=\".svg\"],\n#how-to-apply img[src*=\".svg\"] {\n  height: 120px;\n}\n.course-card .tag {\n  background: rgba(0, 0, 0, 0.4);\n  text-align: left;\n  padding: .25rem;\n  font-size: .733rem;\n}\n.menu-sidebar__button,\n.programme-menu-sidebar__button {\n  display: none;\n}\narticle[data-history-node-id=\"2536\"] h3 {\n  margin-bottom: 0.5rem;\n}\narticle[data-history-node-id=\"2536\"] h3:not(:first-child) {\n  margin-top: 3rem;\n}\narticle[data-history-node-id=\"2546\"] .horizontal-tabs .horizontal-tabs-list li {\n  -webkit-box-flex: 0;\n  -ms-flex: 1;\n  flex: 1;\n}\n.page-node-type-financial-aid h1 {\n  padding-bottom: 0;\n}\n.page-node-type-financial-aid .alert-md {\n  padding: 2.5rem;\n}\n.page-node-type-financial-aid .row--tb-lg.background {\n  padding-top: 6rem !important;\n  padding-bottom: 6rem !important;\n  margin-top: 6rem;\n}\n.how-to-apply {\n  max-width: 920px;\n}\n.how-to-apply table {\n  float: none;\n  max-width: 500px;\n  margin-top: 0;\n}\n.how-to-apply table td {\n  text-align: left;\n}\n.how-to-apply h3:nth-of-type(1) {\n  margin-top: 0;\n}\n.how-to-apply .link-item {\n  background: white;\n}\n@media screen and (min-width: 920px) {\n  .how-to-apply .link-item {\n    margin-right: 1.5rem;\n    margin-bottom: 1.5rem;\n    display: inline-block;\n    width: 47%;\n  }\n}\n.how-to-apply.remove-background {\n  padding-top: 0rem !important;\n  padding-bottom: 0rem !important;\n}\n.how-to-apply.remove-background::after {\n  background-color: white;\n}\narticle[data-history-node-id=\"2506\"] h3 {\n  margin-bottom: 0.5rem;\n}\narticle[data-history-node-id=\"2506\"] h3:not(:first-child) {\n  margin-top: 3rem;\n}\narticle[data-history-node-id=\"3561\"] .testimonial-article__cite span {\n  display: block;\n  margin-bottom: 0.5rem;\n}\narticle[data-history-node-id=\"2516\"] .view thead,\narticle[data-history-node-id=\"2526\"] .view thead {\n  display: none;\n}\n.page-node-type-scholarship h1 {\n  padding-bottom: 0;\n}\n.page-node-type-scholarship div.preamble p {\n  line-height: 1.4;\n}\n.page-node-type-scholarship .background {\n  padding-top: 6.5rem !important;\n  padding-bottom: 6.5rem !important;\n  margin-top: 6rem;\n}\n.page-node-type-scholarship .row--lg {\n  padding-bottom: 0;\n}\n.page-node-type-scholarship .paragraph-wrapper > :not(:last-of-type) {\n  margin-bottom: 5rem;\n}\n.page-node-type-award .group-left-right-container .wrap.wrap--xl.wrap--center {\n  padding-left: 0 !important;\n  padding-right: 0 !important;\n}\n.page-node-type-award h1 {\n  padding-bottom: 0;\n}\n.page-node-type-award div.preamble p {\n  line-height: 1.4;\n}\n.page-node-type-award .paragraph--type--simple-paragraph > div {\n  margin-bottom: 5rem;\n}\narticle[data-history-node-id=\"3741\"] .signup a {\n  width: 100%;\n  border-radius: 0;\n  padding: 2rem 2rem;\n  text-transform: inherit;\n}\n#alumni-mentors-slider .row.row--md {\n  padding-right: 2rem;\n}\n#alumni-mentors-slider .h5 {\n  margin-top: 1rem;\n}\n#alumni-mentors-slider .slick nav[role=navigation] {\n  top: 25%;\n}\n#alumni-mentors-filter .input {\n  margin-bottom: 0.75rem;\n}\n@media screen and (min-width: 920px) {\n  #alumni-mentors-filter .input {\n    display: inline-block;\n    margin-right: 0.5rem;\n    width: auto;\n    margin-bottom: 0rem;\n  }\n}\narticle[data-history-node-id=\"3166\"] .page-card {\n  max-width: none;\n}\ntable[summary=\"SITizen-Buzz-Asks\"] {\n  max-width: 1000px;\n  border: none !important;\n}\ntable[summary=\"SITizen-Buzz-Asks\"] td:nth-child(1) {\n  width: 350px;\n}\ntable[summary=\"SITizen-Buzz-Asks\"] td:nth-child(2) {\n  padding: 4rem;\n}\narticle[data-history-node-id=\"3861\"] h4.section-header,\narticle[data-history-node-id=\"3866\"] h4.section-header,\narticle[data-history-node-id=\"3871\"] h4.section-header,\narticle[data-history-node-id=\"3876\"] h4.section-header {\n  margin-bottom: 2.5rem;\n}\narticle[data-history-node-id=\"3861\"] hr,\narticle[data-history-node-id=\"3866\"] hr,\narticle[data-history-node-id=\"3871\"] hr,\narticle[data-history-node-id=\"3876\"] hr {\n  margin: 3rem 0;\n}\narticle[data-history-node-id=\"3861\"] .text-right,\narticle[data-history-node-id=\"3866\"] .text-right,\narticle[data-history-node-id=\"3871\"] .text-right,\narticle[data-history-node-id=\"3876\"] .text-right {\n  text-align: right;\n}\narticle[data-history-node-id=\"3861\"] table,\narticle[data-history-node-id=\"3866\"] table,\narticle[data-history-node-id=\"3871\"] table,\narticle[data-history-node-id=\"3876\"] table {\n  margin-top: 0;\n}\narticle[data-history-node-id=\"3861\"] table td,\narticle[data-history-node-id=\"3866\"] table td,\narticle[data-history-node-id=\"3871\"] table td,\narticle[data-history-node-id=\"3876\"] table td {\n  text-align: left;\n}\narticle[data-history-node-id=\"3861\"] table a,\narticle[data-history-node-id=\"3866\"] table a,\narticle[data-history-node-id=\"3871\"] table a,\narticle[data-history-node-id=\"3876\"] table a {\n  border-bottom: none;\n}\narticle[data-history-node-id=\"3861\"] .ceremony-registration-table,\narticle[data-history-node-id=\"3866\"] .ceremony-registration-table,\narticle[data-history-node-id=\"3871\"] .ceremony-registration-table,\narticle[data-history-node-id=\"3876\"] .ceremony-registration-table {\n  background: #eeeeee;\n  padding: 4rem;\n}\narticle[data-history-node-id=\"3861\"] .ceremony-registration-table table,\narticle[data-history-node-id=\"3866\"] .ceremony-registration-table table,\narticle[data-history-node-id=\"3871\"] .ceremony-registration-table table,\narticle[data-history-node-id=\"3876\"] .ceremony-registration-table table {\n  border: none;\n}\narticle[data-history-node-id=\"3861\"] .ceremony-registration-table table td,\narticle[data-history-node-id=\"3866\"] .ceremony-registration-table table td,\narticle[data-history-node-id=\"3871\"] .ceremony-registration-table table td,\narticle[data-history-node-id=\"3876\"] .ceremony-registration-table table td {\n  padding: 2rem 0;\n}\narticle[data-history-node-id=\"3861\"] .ceremony-registration-table table tr:first-child td,\narticle[data-history-node-id=\"3866\"] .ceremony-registration-table table tr:first-child td,\narticle[data-history-node-id=\"3871\"] .ceremony-registration-table table tr:first-child td,\narticle[data-history-node-id=\"3876\"] .ceremony-registration-table table tr:first-child td {\n  padding-top: 0;\n  border-top: none;\n}\narticle[data-history-node-id=\"3861\"] .ceremony-registration-table table tr:last-child td,\narticle[data-history-node-id=\"3866\"] .ceremony-registration-table table tr:last-child td,\narticle[data-history-node-id=\"3871\"] .ceremony-registration-table table tr:last-child td,\narticle[data-history-node-id=\"3876\"] .ceremony-registration-table table tr:last-child td {\n  padding-bottom: 0;\n  border-bottom: none;\n}\narticle[data-history-node-id=\"3861\"] .paragraph--type-slick-container .field p,\narticle[data-history-node-id=\"3866\"] .paragraph--type-slick-container .field p,\narticle[data-history-node-id=\"3871\"] .paragraph--type-slick-container .field p,\narticle[data-history-node-id=\"3876\"] .paragraph--type-slick-container .field p {\n  margin-bottom: 0;\n}\narticle[data-history-node-id=\"3861\"] .paragraph--type-slick-container .field img,\narticle[data-history-node-id=\"3866\"] .paragraph--type-slick-container .field img,\narticle[data-history-node-id=\"3871\"] .paragraph--type-slick-container .field img,\narticle[data-history-node-id=\"3876\"] .paragraph--type-slick-container .field img {\n  border: 15px solid white;\n}\narticle[data-history-node-id=\"3861\"] .paragraph--type-slick-container .field > div,\narticle[data-history-node-id=\"3866\"] .paragraph--type-slick-container .field > div,\narticle[data-history-node-id=\"3871\"] .paragraph--type-slick-container .field > div,\narticle[data-history-node-id=\"3876\"] .paragraph--type-slick-container .field > div {\n  background: #4d4d4d !important;\n  color: white;\n  padding: 10px 10px;\n  text-align: center;\n}",
    "$(document).ready(function() {\n    //Hide see more link after click\n    $(\"a.ckeditor-readmore-toggler\").click(function(event) {\n        $(this).hide();\n    })\n    if ($('.programme-menu-sidebar__menu').length) {\n        //Hide Student Stories\n        $(\".programme-menu-sidebar__menu li > a:contains('Student stories')\").remove();\n        //Replace ISWP anchor link\n        $(\".page-node-type-programme .programme-menu-sidebar__menu a[href='#iwsp']\").text($(\"#iwsp h2\").text());\n    }\n    //Remove Fees and Finances when it's empty\n    if ($('.page-node-type-programme').length) {\n        if (!$('#fees-and-finances .group-tabs-fees-and-finances').length) {\n            $('#fees-and-finances').hide();\n        }\n    }\n    //Alumni Mentoring Programme - Alumni Mentors\n    if ($(\"#cluster_filter\").length) {\n        //Alumni Mentors Slider\n        $('.slick__slider').slick({\n            dots: false,\n            infinite: false,\n            speed: 300,\n            slidesToShow: 4,\n            slidesToScroll: 4,\n            prevArrow: '<nav class=\"slick__arrow\" role=\"navigation\"><button type=\"button\" data-role=\"none\" class=\"slick-prev slick-arrow\" aria-label=\"❮\" style=\"display: inline-block;\" aria-disabled=\"true\">❮</button></nav>',\n            nextArrow: '<nav class=\"slick__arrow\" role=\"navigation\"><button type=\"button\" data-role=\"none\" class=\"slick-next slick-arrow\" aria-label=\"❯\" aria-disabled=\"false\" style=\"\">❯</button></nav>',\n            responsive: [{\n                breakpoint: 720,\n                settings: {\n                    slidesToShow: 1,\n                    slidesToScroll: 1,\n                }\n            }]\n        });\n        //Alumni Mentors Filter\n        var filtered = false;\n        $('#cluster_filter').on('change', function() {\n            $('.slick__slider').slick('slickUnfilter').slick('slickGoTo', 0).slick('slickFilter', '.' + $('#year_filter').val() + '.' + this.value);\n        });\n        $('#year_filter').on('change', function() {\n            $('.slick__slider').slick('slickUnfilter').slick('slickGoTo', 0).slick('slickFilter', '.' + $('#cluster_filter').val() + '.' + this.value);\n        });\n    }\n    //Alumni Landing Page - SITizen Past Issue\n    if ($(\"#sitizenissue\").length) {\n        $('#sitizenissue').on('change', function() {\n            if (this.value != \"\") window.open(this.value, '_blank ');\n        });\n    }\n    //Wrap table responsive\n    $(\".simple-paragraph table\").wrap('<div class=\"responsive-table\"><div class=\"responsive-table__wrap\"></div></div>');\n\n    if($(\"#block-head-search-button\").length == 0)\n    {\n        $(\"#block-head-menu-button\").css(\"margin-left\", \"auto\");\n    }\n});",
    "Get in Touch",
    "With Matthew Tan",
    "Name and email",
    "My name",
    "My email",
    "I am a",
    "I am a",
    "- please select one -",
    "student",
    "prospective student",
    "alumnus",
    "industry representative",
    "other…",
    "Please enter your role...",
    "Subject",
    "Message",
    "CAPTCHA",
    "This question is for testing whether or not you are a human visitor and to prevent automated spam submissions.",
    "Adjunct Associate Professor",
    "Matthew",
    "Tan",
    "Cluster:",
    "Engineering",
    "Email",
    "LinkedIn",
    "Website",
    "Profile",
    "Biography",
    "Associate Professor Matthew Tan",
    "is a sustainability professional with over 20 years of experience in the Agri-Tech sector. His career has been marked by successful implementations and management of sustainability initiatives in the Aquaculture & Agriculture industries. Notably, he has played a pivotal role in assisting governments with their economic transformation through the adoption of Agri-Tech 4.0.",
    "As a Sustainability Specialist for the Agri & Food production industry, he has been instrumental in developing and implementing carbon neutral strategies that significantly reduce carbon footprints, contributing to a more environmentally conscious & sustainable future plus guiding organizations through the complex process of transitioning to carbon-neutral operations.",
    "His recent achievements include spearheading the integration of ESG principles into Agri related  projects, aligning business strategies with sustainable practices; development and executing carbon-neutral strategies whereby effectively reducing the environmental footprint of related Agri & food processing operations. His commitment to promoting sustainable practices is further demonstrated through the establishment of strategic partnerships with key stakeholders, including government bodies, NGOs, and industry leaders.",
    "He is also currently Singapore Representative (Private Sector) to APEC Policy Partnership on Food Security and is also the current APEC Chair for Sustainable Development in Agricultural and Fishery sectors (PPFS) where he co-ordinates discussions between senior officials, APEC governments and the private sector on the use of technology and combined resources for Sustainable Development in the Aquaculture, Agriculture and Fishery industry. For the past number of years, he has also been actively involved in assisting governments with their Economic Transformation – Agri Tech 4.0 in the light of food security; working in tandem with the various ministries and multiple stakeholders in the country with an overarching view to achieving their future food securities goals.",
    "In tandem with his current APEC appointment, A/Prof Tan is also serving as the Chief Executive Officer (Asia) of Assentoft Aqua Asia Pte Ltd. Assentoft Aqua A/S (Denmark) is one of the world's leading Aquaculture Engineering companies and the team at Assentoft Aqua has been involved in Recirculating Aquaculture System (RAS) development since the very beginning of the recirculation aquaculture industry in 1978; thus, learning from both successes and failures from existing plants, including salmon plants. Assentoft is second to none in having the lowest possible footprint RAS that saves space, pipes, buildings etc, rapid installation time by using steel tanks as our basic component, having the best available water treatment within the industry, low investment per produced ton of fish and deep knowledge about salmon, trout and tropical pelagic fish production in land-based RAS-systems.",
    "Prior to his current corporate appointment, A/Prof Tan was previously the Group Chief Technology Officer & Chief Risk Officer of Oceanus Group Ltd and CEO & Director of Oceanus Tech Pte Ltd (a wholly owned subsidiary of Oceanus Group) – One of the world’s largest land-based aquaculture companies which is listed on the main board of the Singapore Stock Exchange (from 2013 to 2020).",
    "He was responsible for the development of Oceanus Group's Risk Management framework and farms' operational protocols manuals and oversaw the development and implementation of the company farm’s Bio-security plan which includes the validation & adoption of sustainable technologies, implementation of water monitoring system, animal nutrition & feed formulation and possible use of Recirculating Aquaculture technologies in their land-based farms (total 42 farms spread over 300 km of coastal areas and a 5,000 floating sea cage farm).",
    "He was also part of the new management team that spearheaded the restructuring of the company in 2015 and was instrumental in proposing the major changes to their business model and restructuring of operations which saw a 60% reduction in overheads and expenses subsequently. The restructuring efforts paid off and the company turned profitable in 2020. Note that the company was saddled with huge debts and defaulted on a totalling debt of S$94 million in 2014 and had a negative net asset position of approximately S$66 million.",
    "Subsequently, he was seconded and promoted to CEO & Director of Oceanus Tech Pte Ltd which was setup by the group to spearhead the group expansion.",
    "He is also a graduate from SEAFDEC (Southeast Asian Fisheries Development Centre) – Asia’s leading fishery institution; where he received a Training Fellowship under a Government of Japan – Trust Fund Programme in hatchery and grow-out, seaweed and Benthic Diatom culture and production.",
    "On the academic frontier, Matthew serves as an Adjunct Professor with domain expertise in applied sustainability practices and protocols for the Agri & Food Industry. Beyond his hands-on contributions, he shares his insights as a lecturer cum instructor in Deep Tech Translation and Master’s degree programmes; with key focus in ESG, Sustainability, and Carbon-Neutral Engineering. His engaging teaching style, coupled with real-world examples, not only makes complex concepts accessible but also inspires students to be catalysts for positive change in their respective fields.",
    "He was also previously serving as an Adjunct Senior Research Fellow and Associate Professor (Aquaculture) with the Centre for Sustainable Tropical Fisheries and Aquaculture (CSTFA) - College of Science and Engineering - James Cook University, Australia.",
    "James Cook University specializes in the sustainable exploitation of tropical aquatic species and is Australia’s leading university in Tropical Fisheries Science. Through the Centre for Sustainable Tropical Fisheries and Aquaculture (CSTFA), JCU partners with industry, NGOs, and government to tackle grand challenges associated with sustainable production of seafood.",
    "Current external appointments:",
    "1. Singapore Representative (Private Sector):",
    "Policy Partnership on Food Security, Asia Pacific Economic Cooperation (APEC). About APEC PPFS :",
    "https://apec.org/Groups/Other-Groups/Policy-Partnership-on-Food-Security.aspx",
    "2. Chair - Sustainable Development for the Agriculture and Fisheries Sector, APEC PPFS.",
    "Responsible for coordination of discussions between APEC governments and the private sector on the use of technology and combined resources for Sustainable Development of Aquaculture, Agriculture and Fishery Sectors within the APEC region and set-up of APEC Centre for Sustainable Development in Agriculture and Fisheries sectors in Singapore.",
    "3. Member – Advisory Board",
    ":",
    "PT. Terra Baru Indonesia",
    "–",
    "Indonesia's Leading Biochar and Carbon Credit Specialists :",
    "TerraBaru drives sustainable innovation by transforming waste into valuable capital, powering a net-zero future and delivering measurable impact across the planet, society, and the economy. TerraBaru is a seasoned team of global executives united by a single mission— to address Indonesia’s 250 million tons per year agricultural waste problem. With a diverse background encompassing expertise in resource development, sustainable practices, ecosystem and biodiversity conservation, environmental law, and investment banking, TerraBaru is uniquely positioned to create transformative solutions.  By impacting communities, soil, air, and water, and transforming waste and emissions into capital, we build a world where carbon emissions and soil degradation become valuable resources to fund environmental and social sustainability.",
    "https://terrabaru.com/",
    "4. Member – Scientific Advisory Board",
    ": Sento Biotech Sdn Bhd – Development of Carbon Neutral feed for culture of Macrobrachium rosenbergii, also known as the giant river prawn or giant freshwater prawn.",
    "5. Advisor (HON)",
    "- Centre for Aquaculture and Veterinary Science, School of Applied Science, Temasek Polytechnic.",
    "6.  Member - Investment Committee",
    "- Asia Food Sustainability Fund. This Venture fund targets startups in the Deep-tech, Agri-tech, Food Sustainability and Consumer Packaged Goods industry. It is committed to support agri-food tech startups around the world that are committed to creating a sustainable and healthier future for everyone. The Asia Food Sustainability Fund is dedicated to backing early-stage companies that are leveraging the vast potential for growth in the agri-food tech industry in Asia. This fund leverage on Innovate 360’s ecosystem, which includes infrastructure, accelerator, strategic partnerships and networks in which deep tech startups are well positioned to grow exponentially and create positive impact to the world.",
    "About Innovate 360 - https://innovate360.sg/about/",
    "7. Member – Editorial Board",
    ": Journal of Marine Biology and Aquatic Research (JMBAR)",
    "8. Member – Editorial Board",
    ": Aquatic Research Journal",
    "Track Records and Completed Projects",
    "- Principal Consultant/ Chief Sustainability & Technology Officer Designate",
    "– On site survey and measurement for carbon sequestration potential, carbon credit development and mangrove aquaculture CSR in Indonesia for Singapore/ Indonesia entity. This project involves Mangrove, peatland & coastal restoration plus possible CSR planning for regenerative Aquaculture for the indigenous people. June 2022 to 2024",
    "- Member - Scientific Advisory Board cum Chief Sustainability Officer",
    "- Carbon Neutral Prawn Project – An APEC reference project – Singapore & Malaysia. A carbon-neutral prawn aquaculture system through the development of sustainable aquafeed and the adoption of a green circular economy. The fruition of this project will create a massive disruption to the aquaculture & feed industry as it will create a sustainable aquaculture industry that minimizes its environmental impact while providing high-quality and carbon neutral seafood to consumers. Dec 2022 to present.",
    "- Advisor (Sustainability)",
    "- Frederiksdal Pte Ltd. Frederiksdal is one of the world’s largest cherry vineyards (Denmark) and also the only one in the world that produces wine from cherries according to the same principles that have been used in centuries of production of grape wine. Providence of net zero and carbon neutral advisory and recommendations for the implementation of carbon mitigation strategies and re-evaluation of the wine Life Cycle Analysis re. carbon neutrality – July 23 to present.",
    "- Member of Advisory Board",
    "– One of the world’s leading cell-based cultured seafood company that utilizes tissue formation methods to produce healthy and tasty seafood meat. June 23 to present.",
    "- Member - Technical Advisory Panel (Agri Tech)",
    "- Institute of Materials Research and Engineering (IMRE) : Agency for Science, Technology & Research (A*STAR). 2022 to 2024",
    "- Principal Consultant",
    "– Agritech feasibility study and development of a Strategic White Paper for a main board listed company in Singapore. This listco is looking to diversify and enter the Agri Industry. Oct 2020.",
    "- Senior Principal Consultant  & Head of Technical Team",
    "– Part of the economic advisory team that put together the Strategic Aquaculture Redevelopment Plan for the Government of Western Africa. This project includes 53 site surveys completed and the identification and development of 16 sites as Special Economic Zone for self-sustainable aquaculture.  2018 – 2020.",
    "Chairman - Scientific Advisory Board",
    "– Singapore Crawfish (Singapore, Malaysia and Indonesia). Specialized in the production of genetically improved SPF (Specific Pathogen Free) Cherax Quadricarinatus with SPF and SPR family lines originating from Australia, Indonesia, Malaysia, Thailand and Singapore. This company pioneers modern vertical aquaculture system and it boasts an R&D and engineering team that has the capability to install and fabricate customized systems for crawfish breeding and cultivation - 2021 to August 2024",
    "- Chairman – Scientific Advisory Board",
    "- SEA Aquaculture. Development of a vertically integrated 10,000 Metric Ton production per year Atlantic Salmon RAS facility in Vietnam. This is a key food security project in Asia – An APEC Project. Total project value US$100m – 10 HA footprint.",
    "- Member - Scientific Advisory Board",
    "- Pebble Labs, Inc : A USA based biotechnology company developing solutions to safely and sustainably increase aquaculture yield and food security. Its mission is to develop breakthrough disruptive technologies that address the greatest agriculture, aquaculture, and environmental challenges facing the globe. Pebble Labs is committed to urgently solving these challenges.",
    "- Member - Peer Review Group",
    ": Global Livestock and Aquaculture Policy Project - Funded by Bill and Melinda Gates Foundation (BMGF) - CHATHAM HOUSE - The Royal Institute of International Affairs. From 2019 to 2020.",
    "- Principal Consultant",
    "– Development of the proposal for the introduction of intensive & indoor shrimp farming system and redevelopment of 2,000 acres of land for Aquaculture in Rompin, Malaysia.  2019 to 2022.",
    "- Principal Consultant",
    "– Assessment of the Vanuatu Aquaculture Industry – Development of the re-development  proposal for the Trade commissioner of Vanuatu – 2018",
    "- Principal Consultant",
    "– Assessment the conversion of 8,000 disused shrimp (post disease outbreak)  pond into Barramundi Culture – Sri Lanka",
    "- Principal Consultant",
    ": AVA Land tender specification – 1.3 HA and proposal development for a bio secure hatchery for a leading aquaculture player in Singapore. Awarded land lease in 2019.",
    "- Principal Consultant",
    ": Strategy development and implementation for the largest fishery feed player in Nigeria. Was involved in the implementation of the plans which include training of farmers cooperatives (aquaculture) and a team of technical executives responsible for subsequent follow-up with these farmers for the whole of Nigeria - 2017 to 2020.",
    "- Principal Consultant",
    ": Design of 2.3 HA Bio-secure aquaculture facility which include hatchery, nursery, grow-out and brood stock holding areas in Africa - 2017 to 2020.",
    "- Principal Consultant",
    ": Technical advisory to Aquaculture farmers in Egypt & Ghana for the largest fishery feed mill in Africa- 2017 to 2020.",
    "- Principal Consultant",
    ": Design and set-up of 2.3-hectare Bio-secure aquaculture facility (about US$3m) which include hatchery, nursery and brood stock holding areas in Malaysia – 2017.",
    "- Principal Consultant",
    ": Site survey - 220 Acres of disused shrimps’ raceways and land for possible aquaculture grow-out use. West Malaysia 2016.",
    "- Principal Consultant",
    ": Hybrid Grouper species development and ECO diversity study on endemic species– Malaysia – 2016",
    "- Collaborator",
    ": Bio marker study on Abalone laggard and Selective Genetics breeding - Jointly with Temasek Poly & Oceanus Group – 2017.",
    "- Collaborator & Technology Partner",
    ": Use of Hydrocavitation technology for increasing aquaculture harvest yield - Jointly with one of the world's largest shrimps’ producers – 2015 to 2017",
    "- Principal Consultant",
    ": Design and Setup of 2 HA Bio Secure Grouper/ Sea Bass Hatchery and Aquaculture farm – Malaysia – 2016",
    "- Principal Investigator",
    ": Design and use of hydrocavitation technology for Sea Bass and shrimps pond culture in Sri Lanka.",
    "- Principal Consultant",
    ": Design of Inland bio secure Hatchery facility (1.2 HA) in Ipoh, Malaysia.",
    "- Principal Investigator",
    ": Investigation on possible conversion of existing shrimp culture ponds (500 HA) for food fish grow-out in Pahang, Malaysia.",
    "- Principal Investigator",
    "– Investigation and technical Advisory on the mortalities and grow-out issues in a State-owned Tilapia farm. Indonesia.",
    "- Principal Investigator",
    ": MND Research Fund Grant on “Ecological Land Based Aquaculture - Farming of food fish in Urban environment”. Multi-million-dollar MND grant to fully develop a high intensity & high yield aquaculture RAS farming system using minimum space and labour through the integration of people, technology and business system.",
    "- Co-Principal Investigator (with Surbana Technologies)",
    ": Development of Multiple storey land-based food-fish breeding system with Surbana Technologies. This project leverage off high intensity vertical fish farming as an \"engineering\" solution to solve this issue.",
    "- Project Director",
    ": Development of a Fully automated and online monitoring of water conditions for aquaculture farms – Horiba Instruments & Bio X Pte Ltd",
    "- Principal Investigator",
    "- Development of live support system for shipping containers for the shipping of live sea food (sea to land) with APL (part of NOL Shipping Group) one of the world’s top shipping companies. The project successfully research, designed and developed an enclosed automated recirculation water filtration and treatment system for incorporation into APL’s Live reefer container.",
    "- Project Director",
    "– 2013 Technical farm audit completed for the world’s largest Aquaculture (China) spanning more than 300 km. Oceanus Group.",
    "- Principal Investigator and project Director",
    "– Development and setup of Asia first Aquahub (live seafood holding logistic hub) in Jurong Cold Hub One, Singapore. A joint development with CWT Fresh (Part of CWT Group)",
    "SIT Appointments",
    "Industry Advisory Committee - SIT-Massey University Food Technology Programme",
    "Achievements",
    "2009 - Distinguished Award - Minister's Innovation Award 2009 - Awarded by Ministry of Transport, Singapore.",
    "2009",
    "–",
    "2009",
    "Service to the community Award 2009 - Awarded by Bishan Toa Payoh GROs, Singapore",
    "2002",
    "–",
    "2009",
    "Certificate of Appreciation for 5 Years of dedicated Voluntary Service to the Community - Awarded by People's Association Singapore",
    "2002",
    "–",
    "2007",
    "chevron--up",
    "Research",
    "Current Projects",
    "Enhancement of Existing Life support system (RAS) for Large Scale Crustacean Hatchery in Asia.",
    "2023",
    "–",
    "Present",
    "Enhancement to existing life support system for Large Scale Crustacean Hatchery  - Use of Passive Hydrocavitation support.",
    "Carbon Credit Developer for the Aquaculture Industry",
    "2023",
    "–",
    "Present",
    "Member – Advisory Board - PT Terra Baru Indonesia -  PT Terra Baru  – Carbon Credit Specialist. Planet NetZero is built from the need to develop large-scale, impactful, and measurable solutions to increase food security and fight climate change. PNZ delivers profitable, internationally funded projects to reduce carbon emissions and plastic waste, protect the environment and biodiversity, and drive social development. From 2022 to present.",
    "Carbon Neutral Wine Production",
    "2023",
    "–",
    "Present",
    "Advisor (Sustainability) : Frederiksdal is one of the world’s largest cherry vineyards (Denmark) and also the only one in the world that produces wine from cherries according to the same principles that have been used in centuries of production of grape wine. Providence of net zero and carbon neutral advisory and recommendations for the implementation of carbon mitigation strategies and re-evaluation of the wine Life Cycle Analysis re. carbon neutrality – July 23 to present.",
    "Cell cultured Seafood",
    "2023",
    "–",
    "Present",
    "Member - Advisory Board : One of the world’s leading cell-based cultured seafood company that utilizes tissue formation methods to produce healthy and tasty seafood meat plus advisory on their launch in Asia.",
    "High Tech Rainbow Trout Farm in Asia",
    "2023",
    "–",
    "Present",
    "The Project looks to develop Asia's first high-tech fish farm for producing 2,110 tonnes of trout, to cater to local demand for fresh, sustainable, premium fish. The project showcases the proprietary ModulRAS system developed by Assentoft Aqua, a Danish technological partner specialising in sustainable land-based RAS aquaculture technologies. The intended project will incorporate super-intensive technology coupled with AI to help achieve sustainable fish production locally to support Asia's food security initiatives, by making available fresh daily harvest of its premium quality trout.",
    "Valorization of food  processing  waste-streams  into  functional  ingredients and/materials for sustainable functional food and animal feed development.",
    "2023",
    "–",
    "Present",
    "Advisor (Sustainability) - Valorization of food  processing  waste-streams  into  functional  ingredients and/materials for sustainable functional food and animal feed development.",
    "Mangrove, peatland & coastal restoration",
    "2022",
    "–",
    "Present",
    "Principal Consultant/ Chief Sustainability & Technology Officer Designate – On site survey and measurement for carbon sequestration potential, carbon credit development and mangrove aquaculture CSR in Indonesia for Singapore/ Indonesia entity. This project involves Mangrove, peatland & coastal restoration plus possible CSR planning for regenerative Aquaculture for the indigenous people. June 2022 to present.",
    "Principal Consultant – Development of a strategic plan which include the filing of proprietary Aquaculture IP and farm management manual for a leading crustacean Hatchery in Asia – 2021.",
    "2020",
    "–",
    "2021",
    "Present",
    "Carbon Neutral Prawn Project",
    "2002",
    "–",
    "Present",
    "Member - Scientific Advisory Board cum Chief Sustainability Officer - Carbon Neutral Prawn Project – An APEC reference project – Singapore & Malaysia. A carbon-neutral prawn aquaculture system through the development of sustainable aquafeed and the adoption of a green circular economy. The fruition of this project will create a massive disruption to the aquaculture & feed industry as it will create a sustainable aquaculture industry that minimizes its environmental impact while providing high-quality and carbon neutral seafood to consumers. Dec 2022 to present.",
    "Past Projects",
    "Principal Consultant – Aquaculture & Agri related feasibility study and development of a Strategic White Paper for a main board listed company in Singapore. This listco is looking to enter the Agri & Food Industry. Oct 2020.",
    "2020",
    "–",
    "2020",
    "Member - Peer Review Group : Global Livestock and Aquaculture Policy Project - Funded by Bill and Melinda Gates Foundation (BMGF) - CHATHAM HOUSE - The Royal Institute of International Affairs. From 2019 to 2020.",
    "2019",
    "–",
    "2020",
    "Member - Scientific Advisory Board - Pebble Labs, Inc :A USA based biotechnology company developing solutions to safely and sustainably increase natural crop yield and food security.",
    "2018",
    "–",
    "2021",
    "Co-Principal Investigator : Development of sustained micro nutrient/ amino acid delivery system for fish feed  - Awarded AVA Food sustainability grant - Jointly with NTU.",
    "2018",
    "–",
    "2020",
    "Principal Consultant - Development of Chemical Free instant disinfection process for freshly cut vegetables for one of Asia's largest indoor multi storey plant factory",
    "2017",
    "–",
    "2020",
    "Principal Investigator : Development of an Accelerated Seedling germination process and vegetable growth acceleration process for an Urban farming facility in Singapore.",
    "2017",
    "–",
    "2020",
    "Principal Consultant : Assessment of the Nigerian fishery & Aquaculture industry and design and Development of a 2 hectare High Tech Aquaculture facility in Africa.",
    "2017",
    "–",
    "2020",
    "Principal Consultant : Assessment of the Egypt fishery and aquaculture market and made recommendations for client strategic entry into the Egyptian market.",
    "2017",
    "–",
    "2020",
    "Collaborator : Bio marker study on Abalone laggards and Selective Genetics breeding - Jointly with Temasek Poly & Oceanus Group",
    "2017",
    "–",
    "2017",
    "Principal Consultant : Land Based Aquaponics farm that is powered entirely by Solar Energy (Singapore & Malaysia) - An APEC project",
    "2017",
    "–",
    "2017",
    "Principal Consultant : Design and setup of Hatchery, nursery and brood stock holding facility in Kelantan, Malaysia, hybrid Grouper species development and assessment on the possible takeover of a disused shrimp island facility in Kota Bahru. Malaysia.",
    "2017",
    "–",
    "2017",
    "Principal Investigator : Development of anti-thermal coating, film for use in Aquaculture – Jointly with Nanyang Technological University",
    "2016",
    "–",
    "2016",
    "Principal Consultant: Assessment on the takeover of 500 disused shrimp’s raceway for Aquaculture use in Pahang, Malaysia.",
    "2016",
    "–",
    "2017",
    "Principal Consultant: Assessment on the use of disused shrimp’s ponds in Sri Lanka for Sea Bass breeding and the use of chemical free water treatment processes for such large pond.",
    "2016",
    "–",
    "2016",
    "Principal Consultant: Design and development of Sea Bass hatchery facility in Ipoh, Malaysia.",
    "2016",
    "–",
    "2016",
    "Principal Consultant : Design and Setup of Bio Secure Grouper/ Sea Bass Hatchery and Aquaculture farm - Malaysia",
    "2016",
    "–",
    "2016",
    "Principal Investigator: River Bio Remediation Project (Sungei Peng Siang). Joint project with PUB to develop a chemical free treatment process to treat and clean Sungei Peng Siang River (behind Warren Golf and Country club).",
    "2013",
    "–",
    "2015",
    "This river suffers from regular massive algae bloom which leads to unbearable stench for members of the public.",
    "Principal Investigator and project Director – Development and setup of Asia first Aqua Hub (live seafood holding logistic hub) in Jurong Cold Hub One, Singapore. A joint development with CWT Fresh (Part of CWT Group).",
    "2012",
    "–",
    "2014",
    "Principal Consultant: Supply of Genetically selected sea bass fingerling to major aquaculture group in Thailand",
    "2012",
    "–",
    "2012",
    "Project Director : Technical farm audit completed for the world’s largest Abalone farm (China) spanning more than 300 km",
    "2011",
    "–",
    "2011",
    "Principal Investigator : Development of live support system for shipping containers for the shipping of live sea food (sea to land) with APL (part of NOL Shipping Group) one of the world’s top shipping company.",
    "2010",
    "–",
    "2012",
    "The project successfully research, designed and developed an enclosed automated recirculation water filtration and treatment system for incorporation into APL’s live reefer container.",
    "Project Director : Development of a Fully automated and online monitoring of water conditions for aquaculture farms – Horiba Instruments & Bio X Pte Ltd",
    "2010",
    "–",
    "2011",
    "Collaborator & Technology Partner : Use of Hydrocavitation technology for increasing White Shrimps harvest yield in Indonesia- Jointly with one of the world’s largest shrimps producer",
    "2010",
    "–",
    "2013",
    "Principal Investigator: MND Research Fund Grant on “Ecological Land Based Aquaculture - Farming of food fish in urban environment”",
    "2008",
    "–",
    "2012",
    "Multi-million dollar MND grant awarded to fully develop a high intensity & high yield aquaculture farming system using minimum space and labour through the integration of people, technology and business system.",
    "Co-Principal Investigator (with Surbana Technologies): Development of Multiple storey land based food-fish breeding system with Surbana Technologies",
    "2007",
    "–",
    "2008",
    "This project leverage off high intensity vertical fish farming as an \"engineering\" solution to solve this issue.",
    "Principal Consultant : Design of chemical free water treatment processes (disinfection and oxygenation) for one of Singapore largest Koi hatchery",
    "2007",
    "–",
    "2007",
    "chevron--up",
    "Publication",
    "Journal Papers",
    "Lork C, Cubillas M, Ng B, Chau Y and Tan M (2020)",
    "Minimizing electricity cost through smart lighting control for indoor plant factories.",
    "Proceedings of the 46th Annual Conference of the IEEE Industrial Electronics Society. In: IECON 2020: 46th Annual Conference of the IEEE Industrial Electronics Society, 18-21 October 2020, Singapore",
    "Kang C, Tandiono T, Lu X, Turangan C, Osman H, Lim F, Lucas M and Tan M (2018)",
    "Numerical and experimental studies of collapsing cavitation bubbles for ballast water treatment.",
    "Proceedings of the International Conference on Ocean, Offshore and Arctic Engineering. In: ASME 2018: 37th International Conference on Ocean, Offshore and Arctic Engineering, 17-22 June 2018, Madrid, Spain",
    "Tan M (2017)",
    "Future of agriculture and fisheries in the era of the Fourth Industrial Revolution.",
    "World Food, Agriculture and Fisheries, 5. pp. 4-7",
    "Tan M, Wenham S and Chong C (2016)",
    "Elimination of LID with innovative new hydrogenation technology facilitates increased PERC cell efficiencies through the use of lower resistivity p-type Cz wafers.",
    "Extended Abstracts from the Photovoltaic Science and Engineering Conference. In: PVSEC-26: 26th Photovoltaic Science and Engineering Conference, 24-28 October 2016, Singapore",
    "Tan M (2008)",
    "Water quality and the ornamental aquatic sector.",
    "Aquarama Magazine, 5 (10). pp. 8-11",
    "Conferences",
    "Panel Speaker – Sustainable Food Future Seminar - FHA-Food & Beverage 2025. The Sustainable Food Future Seminar delves into the evolving landscape of sustainability in the F&B industry, tackling pressing issues such as food security, sustainable packaging, novel foods, and alternative proteins.",
    "Guest Speaker and Panellist - Economist World Sustainability Week Asia 2025. Harvesting tomorrow: Making food production sustainable. 25-26 March 2025 , Bangkok, Thailand.",
    "Workshop Chair - Use of GEN AI in APIP : APEC Senior Official Meeting week One – 4",
    "th",
    "March 2025.",
    "Guest Speaker and Panellist - Canada-in-Asia Conference 2025. Advancing Agri-food & Aquaculture Systems Through AI.",
    "19",
    "th",
    "to 21st February 2025 – Singapore.",
    "Chief Judge- Agri-Food Innovation World Championship. Theme : Into the Future of Food Sustainability and Security at Agri-Food Tech Expo Asia (AFTEA) 2024.",
    "Keynote Speaker – The Future of Agri Food Innovation - Agri-Food Tech Expo Asia (AFTEA) 2024 – 19",
    "th",
    "to 21",
    "st",
    "November 2024",
    "Guest Speaker – International workshop on circularity in agriculture. A pathway to sustainability among APEC economies. Organised by Institute of Policy and Strategy for Agriculture and Rural Development – 24",
    "th",
    "– 25",
    "th",
    "October 20254 Hanoi.",
    "Guest Speaker – Sabah International Blue Economy Conference (SIBEC) 2024 - 19th – 20th October 2024. Organised by Sabah Maju Jaya Secretariat (SSMJ),  Sabah Chief Minister Department Malaysia",
    "Guest Speaker - Implementation of Artificial Intelligence on Carbon Neutrality and Blue Economy. ASEAN-RoK Workshop on the Implementation of Artificial Intelligence on Carbon Neutrality and Blue Economy – 16 October 2024.",
    "Guest Speaker -",
    "ASEAN SCMSAT 40 Meeting 2024 – Collaboration opportunities with APEC Policy Partnership on Food security – 7",
    "th",
    "October 2024",
    "Speaker & Panel member - TBN Asia Conference 2024 – Food security and Sustainable Livelihood - 13",
    "th",
    "September 2024",
    "Guest Speaker - HLPDAB-High-Level Policy Dialogue on Agricultural Biotechnology Workshop - Role of Agricultural Biotechnology in Food Security and Climate Change & Advances and Perspectives on the Use of Genome-Edited Animals for Food Security and Climate Change, Trujillo, Peru – 15",
    "th",
    "August 2024",
    "Guest Speaker - OFWG Workshop on the application of biotechnology in fishing and aquaculture to improve management, sustainability and productivity in APEC economies - Selective Genetic Breeding Impact on Aquaculture & Use of Biotechnology for Breeding Impact in Aquaculture, Trujillo, Peru – 13",
    "th",
    "August 2024",
    "Speaker - Workshop on Preventing and Reducing Food Loss and waste to achieve sustainable food system in APEC Economies, Trujillo, Peru – 12",
    "th",
    "August 2024",
    "Speaker & Panel Moderator - Towards a Sustainable Seafood Industry. Sustainable Food Future Seminar Series. FHA Food & Beverage April 2024",
    "Guest Speaker - 2nd Mandiri Sustainability Forum on 7th December 2023 in Jakarta. ESG Implementation and Technology in Aquaculture.",
    "Keynote Speaker - 1st APEC seminar on best practices and applications of digitalization and innovation in food supply chain – Hangzhou, China – 4th Dec 2023.",
    "Speaker & Panel Discussion – Bridge2food Summit Asia 2023 - Consumer & Industry Challenges – The Future of Seafood Track – 22 November 2023.",
    "Guest Speaker - APEC Workshop on Reducing Food Loss and Waste by Strengthening Resilience and Digitalization in APEC Food System - Taipei - July 2023.",
    "Expert Guest Speaker - Youth Model ASEAN 2023. This annual event connects youths (our future leaders, regulators and policy makers) across ASEAN. Theme : Fishery & Aquaculture and its impact on future food security – 21st June 2023",
    "Speaker & Panel Member - Industry Leads and Subject Matter Experts - 2nd Global Food and Agriculture Sustainability Symposium. Organised by U.S. Soybean Export Council (USSEC). 26th to 27th April 2023 @ Marriott Marquis Queens Park, Bangkok, Thailand.",
    "Speaker - Workshop on Designing Policies that Support Water Efficient and Sustainable Agricultural Practices in the APEC Region @ Palm Springs, California USA. Organized by USDA - Feb 2023",
    "Co-Chair - World Aquaculture 2022 - APEC PPFS Aquaculture Track. Organised by APEC Centre for Sustainable Development in Agriculture & Fishery Sectors @ Centre for Aquaculture and Veterinary Science, School of Applied Science, Temasek Polytechnic.",
    "Keynote Speaker - Asia ESG & Sustainability Summit 2022 @ MBS - Future Food System & The Blue Economy - 13th Oct 2022.",
    "Guest Speaker - AgriTech 4.0 – Use of Automation, 28 Feb 2022. Temasek Foundation’s Innovation & Technology Asia Workshop - Jointly hosted by Asian Development Bank and Singapore Polytechnic.",
    "Chairman - Advisory Board : 2nd Global Food Security & Sustainability Summit 2022. 30th June to 1st July 2022. An APEC PPFS supported event.",
    "Keynote Speaker - FDI Asia 2022 conference - 17th May 2022. Agritech Trends in Asia - Agritech Investment Track.",
    "Chairman - Workshop III : 4 days Workshop on Technology & IoT For Food Trade & Connectivity - April 2022. Organised by Singapore Cooperation Enterprise/ Temasek Foundation.",
    "Chairman - Workshop II : 3 days Workshop on Regional Export Promotion Strategy For The Food Sector - Feb 2022. Organised by Singapore Cooperation Enterprise/ Temasek Foundation.",
    "Chairman - Workshop I : 4 Days workshop on The Future of food in ASEAN and South Asia, January 2022. Workshop Theme - Harmonized Food Safety Standards and Regulation - Organised by Singapore Cooperation Enterprise/ Temasek Foundation.",
    "Keynote Speaker - The 15th World Ocean Forum 2021 - Fisheries. Theme : The Future of Everything: Ocean Transformation. Organized by the Ministry of Oceans and Fisheries, Busan Metropolitan City, and Busanilbo.",
    "Chairman - Advisory Board - Global Food Security - The Next Frontier in the Agriculture & Aquaculture Industry @ Global Food Security & Sustainability summit 2021 - 17th Sept 2021.",
    "Keynote Speaker - Future of Food Security @ Food and Drinks Innovate Asia Conference - 25th - 26th August 2021",
    "Keynote Speaker - Global Food Security - The Next Frontier in the Agriculture & Aquaculture Industry @ Global Food Security & Sustainability summit 2021 - 17th Sept 2021",
    "Speaker - 2021 APEC PPFS Webinar on “Digitalization and Innovation of APEC Food System”. Hosted by Ministry of Agriculture, Food and Rural Affairs of Korea.",
    "Speaker - Future of Aquaculture, MIFB Future Food Panel Discussion - 30th July 2021.",
    "Expert Speaker – Industry Revolution 4.0 Readiness Assessment (Aquaculture) and Strategy Development Workshop. Organized by Temasek Foundation in Partnership with Asian Development Bank & Singapore Polytechnic – 26th March 2021.",
    "Keynote Speaker – Land use change and Aquaculture for food security. Green Synergy Solutions in APEC Region, 18 Dec 2020. Organized by APEC Research Center for Advanced Biohydrogen Technology.",
    "Speaker - Application of Smart Aquaculture. APEC Workshop on the R&D and Promotion of Smart Agriculture – 23rd to 24th November 2020. Organized by Chinese Taipei.",
    "Speaker - Food Tech for Good - 7th August 2020 : Organized by TBN Asia.",
    "Speaker - The Next Frontier in Aquaculture - 29th April 2020 : Organized by Agribusiness : A Tool For Economic Recovery.",
    "Opening Address & Keynote Speaker - World Ocean Week, 8th Annual World Congress for Aquaculture, 2nd to 4th Nov 2019. Xiamen, China.",
    "Guest Speaker - NYP Symposium on Recent Advances in Finfish & Crustacean Aquaculture - 25th October 2019",
    "Speaker - APEC Ocean & Fishery Working Group - SOM3 Food Security Week - August 2019 @ Puerto Varas, Chile",
    "Guest Lecturer - Ekiti State Farmers' Forum - Aquaculture. Fisheries Cooperative Federation of Nigeria, 2019.",
    "Speaker - Rethink Agri Food Innovation Week @ Novotel Steven Singapore - 27th to 29th November 2018",
    "Speaker - ASTAR Farm to Fork Accelerator Event - 9th November 2018. Speed to Market - Helping enterprises and Accelerating the translation of RD into economic outcomes. Singapore.",
    "Keynote Speaker - 7th Annual World Congress for Ocean, Aquaculture and Fishery - Wei Hai China, 2018.",
    "Guest Speaker - AVA Inaugural Tech Matching event March 2018",
    "Guest Lecturer – Aquaculture: Foundation for Partnership Initiatives in the Niger Delta. Economic Development Centre Warri, Nigeria - January 2018",
    "Guest Speaker - APEC Expert Group on New and Renewable Energy Technologies – Tokyo - EGNRET 49 : Presentation on possible joint project re. use of clean and renewal energy for the Aquaculture industry – October 2017.",
    "Guest/ Plenary Speaker - AquaSg 2017 - Intensification & Disease Management : Opportunities in Aquaculture – Oct 2017 Singapore.",
    "Guest Speaker - AVA-URA’s Agri-Technovation 2017: A Business & Technology Matching Event 2017 organised by the Agri Authority of Singapore – Sept 2017.",
    "Guest Speaker - TechInnovation 2017 - A premier technology-industry brokerage event : Trend and Opportunities in use of technology in Aquaculture – Sept 2017",
    "Guest Speaker - APEC Expert Group on New and Renewable Energy Technologies – Jeju Korea - EGNRET 48 : Use of clean and renewal energy for Aquaculture – March 2017",
    "Guest/ Plenary Speaker - Use of fine bubbles in Aquaculture – International Symposium of Fine Bubbles Technology – Nov 2015 @ Osaka University.",
    "Guest/ Plenary Speaker - Financial Times LIVE – Nov 2015: Global Treasury Retreat @ Capella Hotel Sentosa – Use of Technology for enterprise risk mitigation.",
    "Speaker and Moderator - 18th Federation of Asian Veterinary Association Congress – FAVA 2014 : Use of Technology in Aquaculture",
    "Speaker - Asia Food Technology, Innovation & Safety conference and exhibition 2010 – Tackling Global Food shortages through advances in fish breeding technology.– 2010",
    "Chair & Speaker - Advancing Aquaculture Summit 2021- Organized by Aqmen 365 (Informa group). The main theme for this year summit is \"The Rising Tide : Supporting a Sustainable Future for the Aquaculture Industry\".",
    "Speaker & Panel member - AquaTropics Summit 2024 – Driving Aquaculture Innovation to ensure food security.  Jointly organised by Aquapolis,  Singapore Food Agency, Urban Solutions & Sustainability Innovation & Enterprise Office (USS IEO) and NUS Enterprise, the forum provided an engaging platform for all to share their perspectives on how innovative science can support the tropical aquaculture industry - 3",
    "rd",
    "October 2024",
    "chevron--up",
    "Address",
    "1 Punggol Coast Road Singapore 828608",
    "Contact Us",
    "Send an Enquiry",
    "Visiting SIT",
    "Our Campus Locations",
    "Academic Policies",
    "Privacy Policy",
    "Safety and Health",
    "Social Media Guidelines",
    "Terms of Use",
    "Whistleblowing",
    "Copyright ©",
    "2025",
    "Singapore Institute of Technology. All Rights Reserved.",
    ".contact-link2 a:link,  .contact-link2 a:visited {\n    border-bottom:0px;\n}",
    "{\"path\":{\"baseUrl\":\"\\/directory\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/18971\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"colorbox\":{\"transition\":\"elastic\",\"speed\":350,\"opacity\":0.84999999999999998,\"slideshow\":false,\"slideshowAuto\":true,\"slideshowSpeed\":2500,\"slideshowStart\":\"start slideshow\",\"slideshowStop\":\"stop slideshow\",\"current\":\"{current} of {total}\",\"previous\":\"\\u00ab Prev\",\"next\":\"Next \\u00bb\",\"close\":\"Close\",\"overlayClose\":true,\"returnFocus\":true,\"maxWidth\":\"100%\",\"maxHeight\":\"100%\",\"initialWidth\":\"1%\",\"initialHeight\":\"1%\",\"fixed\":true,\"scrolling\":true,\"mobiledetect\":false,\"mobiledevicewidth\":\"480px\"},\"lazyLoadUrl\":\"\\/directory\\/term_reference_fancytree\\/subTree\",\"field_group\":{\"tabs\":{\"mode\":\"default\",\"context\":\"view\",\"settings\":{\"classes\":\"group-tabs field-group-tabs\",\"id\":\"\",\"formatter\":\"\",\"direction\":\"horizontal\"}},\"tab\":{\"mode\":\"default\",\"context\":\"view\",\"settings\":{\"classes\":\"profile-tab\",\"id\":\"profile-tab\",\"formatter\":\"closed\",\"description\":\"\"}},\"html_element\":{\"mode\":\"default\",\"context\":\"view\",\"settings\":{\"classes\":\"duration--year\",\"id\":\"\",\"element\":\"div\",\"show_label\":false,\"label_element\":\"h3\",\"label_element_classes\":\"\",\"attributes\":\"\",\"effect\":\"none\",\"speed\":\"fast\",\"show_empty_fields\":false}}},\"widthBreakpoint\":640,\"ajaxTrustedUrl\":{\"form_action_p_pvdeGsVG5zNF_XLGPTvYSKCf43t8qZYSwcfZl2uzM\":true},\"user\":{\"uid\":0,\"permissionsHash\":\"d0595e7fb693116ef5f44ee673d3bef83684cb76f0b11cf66359034b4f834013\"}}"
  ],
  "desc_divs": [
    "This question is for testing whether or not you are a human visitor and to prevent automated spam submissions.",
    "Enhancement to existing life support system for Large Scale Crustacean Hatchery  - Use of Passive Hydrocavitation support.",
    "Member – Advisory Board - PT Terra Baru Indonesia -  PT Terra Baru  – Carbon Credit Specialist. Planet NetZero is built from the need to develop large-scale, impactful, and measurable solutions to increase food security and fight climate change. PNZ delivers profitable, internationally funded projects to reduce carbon emissions and plastic waste, protect the environment and biodiversity, and drive social development. From 2022 to present.",
    "Advisor (Sustainability) : Frederiksdal is one of the world’s largest cherry vineyards (Denmark) and also the only one in the world that produces wine from cherries according to the same principles that have been used in centuries of production of grape wine. Providence of net zero and carbon neutral advisory and recommendations for the implementation of carbon mitigation strategies and re-evaluation of the wine Life Cycle Analysis re. carbon neutrality – July 23 to present.",
    "Member - Advisory Board : One of the world’s leading cell-based cultured seafood company that utilizes tissue formation methods to produce healthy and tasty seafood meat plus advisory on their launch in Asia.",
    "The Project looks to develop Asia's first high-tech fish farm for producing 2,110 tonnes of trout, to cater to local demand for fresh, sustainable, premium fish. The project showcases the proprietary ModulRAS system developed by Assentoft Aqua, a Danish technological partner specialising in sustainable land-based RAS aquaculture technologies. The intended project will incorporate super-intensive technology coupled with AI to help achieve sustainable fish production locally to support Asia's food security initiatives, by making available fresh daily harvest of its premium quality trout.",
    "Advisor (Sustainability) - Valorization of food  processing  waste-streams  into  functional  ingredients and/materials for sustainable functional food and animal feed development.",
    "Principal Consultant/ Chief Sustainability & Technology Officer Designate – On site survey and measurement for carbon sequestration potential, carbon credit development and mangrove aquaculture CSR in Indonesia for Singapore/ Indonesia entity. This project involves Mangrove, peatland & coastal restoration plus possible CSR planning for regenerative Aquaculture for the indigenous people. June 2022 to present.",
    "Member - Scientific Advisory Board cum Chief Sustainability Officer - Carbon Neutral Prawn Project – An APEC reference project – Singapore & Malaysia. A carbon-neutral prawn aquaculture system through the development of sustainable aquafeed and the adoption of a green circular economy. The fruition of this project will create a massive disruption to the aquaculture & feed industry as it will create a sustainable aquaculture industry that minimizes its environmental impact while providing high-quality and carbon neutral seafood to consumers. Dec 2022 to present.",
    "This river suffers from regular massive algae bloom which leads to unbearable stench for members of the public.",
    "The project successfully research, designed and developed an enclosed automated recirculation water filtration and treatment system for incorporation into APL’s live reefer container.",
    "Multi-million dollar MND grant awarded to fully develop a high intensity & high yield aquaculture farming system using minimum space and labour through the integration of people, technology and business system.",
    "This project leverage off high intensity vertical fish farming as an \"engineering\" solution to solve this issue.",
    "Lork C, Cubillas M, Ng B, Chau Y and Tan M (2020)\nMinimizing electricity cost through smart lighting control for indoor plant factories.\nProceedings of the 46th Annual Conference of the IEEE Industrial Electronics Society. In: IECON 2020: 46th Annual Conference of the IEEE Industrial Electronics Society, 18-21 October 2020, Singapore",
    "Kang C, Tandiono T, Lu X, Turangan C, Osman H, Lim F, Lucas M and Tan M (2018)\nNumerical and experimental studies of collapsing cavitation bubbles for ballast water treatment.\nProceedings of the International Conference on Ocean, Offshore and Arctic Engineering. In: ASME 2018: 37th International Conference on Ocean, Offshore and Arctic Engineering, 17-22 June 2018, Madrid, Spain",
    "Tan M (2017)\nFuture of agriculture and fisheries in the era of the Fourth Industrial Revolution.\nWorld Food, Agriculture and Fisheries, 5. pp. 4-7",
    "Tan M, Wenham S and Chong C (2016)\nElimination of LID with innovative new hydrogenation technology facilitates increased PERC cell efficiencies through the use of lower resistivity p-type Cz wafers.\nExtended Abstracts from the Photovoltaic Science and Engineering Conference. In: PVSEC-26: 26th Photovoltaic Science and Engineering Conference, 24-28 October 2016, Singapore",
    "Tan M (2008)\nWater quality and the ornamental aquatic sector.\nAquarama Magazine, 5 (10). pp. 8-11",
    "Panel Speaker – Sustainable Food Future Seminar - FHA-Food & Beverage 2025. The Sustainable Food Future Seminar delves into the evolving landscape of sustainability in the F&B industry, tackling pressing issues such as food security, sustainable packaging, novel foods, and alternative proteins.",
    "Guest Speaker and Panellist - Economist World Sustainability Week Asia 2025. Harvesting tomorrow: Making food production sustainable. 25-26 March 2025 , Bangkok, Thailand.",
    "Workshop Chair - Use of GEN AI in APIP : APEC Senior Official Meeting week One – 4\nth\nMarch 2025.",
    "Guest Speaker and Panellist - Canada-in-Asia Conference 2025. Advancing Agri-food & Aquaculture Systems Through AI.\n19\nth\nto 21st February 2025 – Singapore.",
    "Chief Judge- Agri-Food Innovation World Championship. Theme : Into the Future of Food Sustainability and Security at Agri-Food Tech Expo Asia (AFTEA) 2024.",
    "Keynote Speaker – The Future of Agri Food Innovation - Agri-Food Tech Expo Asia (AFTEA) 2024 – 19\nth\nto 21\nst\nNovember 2024",
    "Guest Speaker – International workshop on circularity in agriculture. A pathway to sustainability among APEC economies. Organised by Institute of Policy and Strategy for Agriculture and Rural Development – 24\nth\n– 25\nth\nOctober 20254 Hanoi.",
    "Guest Speaker – Sabah International Blue Economy Conference (SIBEC) 2024 - 19th – 20th October 2024. Organised by Sabah Maju Jaya Secretariat (SSMJ),  Sabah Chief Minister Department Malaysia",
    "Guest Speaker - Implementation of Artificial Intelligence on Carbon Neutrality and Blue Economy. ASEAN-RoK Workshop on the Implementation of Artificial Intelligence on Carbon Neutrality and Blue Economy – 16 October 2024.",
    "Guest Speaker -\nASEAN SCMSAT 40 Meeting 2024 – Collaboration opportunities with APEC Policy Partnership on Food security – 7\nth\nOctober 2024",
    "Speaker & Panel member - TBN Asia Conference 2024 – Food security and Sustainable Livelihood - 13\nth\nSeptember 2024",
    "Guest Speaker - HLPDAB-High-Level Policy Dialogue on Agricultural Biotechnology Workshop - Role of Agricultural Biotechnology in Food Security and Climate Change & Advances and Perspectives on the Use of Genome-Edited Animals for Food Security and Climate Change, Trujillo, Peru – 15\nth\nAugust 2024",
    "Guest Speaker - OFWG Workshop on the application of biotechnology in fishing and aquaculture to improve management, sustainability and productivity in APEC economies - Selective Genetic Breeding Impact on Aquaculture & Use of Biotechnology for Breeding Impact in Aquaculture, Trujillo, Peru – 13\nth\nAugust 2024",
    "Speaker - Workshop on Preventing and Reducing Food Loss and waste to achieve sustainable food system in APEC Economies, Trujillo, Peru – 12\nth\nAugust 2024",
    "Speaker & Panel Moderator - Towards a Sustainable Seafood Industry. Sustainable Food Future Seminar Series. FHA Food & Beverage April 2024",
    "Guest Speaker - 2nd Mandiri Sustainability Forum on 7th December 2023 in Jakarta. ESG Implementation and Technology in Aquaculture.",
    "Keynote Speaker - 1st APEC seminar on best practices and applications of digitalization and innovation in food supply chain – Hangzhou, China – 4th Dec 2023.",
    "Speaker & Panel Discussion – Bridge2food Summit Asia 2023 - Consumer & Industry Challenges – The Future of Seafood Track – 22 November 2023.",
    "Guest Speaker - APEC Workshop on Reducing Food Loss and Waste by Strengthening Resilience and Digitalization in APEC Food System - Taipei - July 2023.",
    "Expert Guest Speaker - Youth Model ASEAN 2023. This annual event connects youths (our future leaders, regulators and policy makers) across ASEAN. Theme : Fishery & Aquaculture and its impact on future food security – 21st June 2023",
    "Speaker & Panel Member - Industry Leads and Subject Matter Experts - 2nd Global Food and Agriculture Sustainability Symposium. Organised by U.S. Soybean Export Council (USSEC). 26th to 27th April 2023 @ Marriott Marquis Queens Park, Bangkok, Thailand.",
    "Speaker - Workshop on Designing Policies that Support Water Efficient and Sustainable Agricultural Practices in the APEC Region @ Palm Springs, California USA. Organized by USDA - Feb 2023",
    "Co-Chair - World Aquaculture 2022 - APEC PPFS Aquaculture Track. Organised by APEC Centre for Sustainable Development in Agriculture & Fishery Sectors @ Centre for Aquaculture and Veterinary Science, School of Applied Science, Temasek Polytechnic.",
    "Keynote Speaker - Asia ESG & Sustainability Summit 2022 @ MBS - Future Food System & The Blue Economy - 13th Oct 2022.",
    "Guest Speaker - AgriTech 4.0 – Use of Automation, 28 Feb 2022. Temasek Foundation’s Innovation & Technology Asia Workshop - Jointly hosted by Asian Development Bank and Singapore Polytechnic.",
    "Chairman - Advisory Board : 2nd Global Food Security & Sustainability Summit 2022. 30th June to 1st July 2022. An APEC PPFS supported event.",
    "Keynote Speaker - FDI Asia 2022 conference - 17th May 2022. Agritech Trends in Asia - Agritech Investment Track.",
    "Chairman - Workshop III : 4 days Workshop on Technology & IoT For Food Trade & Connectivity - April 2022. Organised by Singapore Cooperation Enterprise/ Temasek Foundation.",
    "Chairman - Workshop II : 3 days Workshop on Regional Export Promotion Strategy For The Food Sector - Feb 2022. Organised by Singapore Cooperation Enterprise/ Temasek Foundation.",
    "Chairman - Workshop I : 4 Days workshop on The Future of food in ASEAN and South Asia, January 2022. Workshop Theme - Harmonized Food Safety Standards and Regulation - Organised by Singapore Cooperation Enterprise/ Temasek Foundation.",
    "Keynote Speaker - The 15th World Ocean Forum 2021 - Fisheries. Theme : The Future of Everything: Ocean Transformation. Organized by the Ministry of Oceans and Fisheries, Busan Metropolitan City, and Busanilbo.",
    "Chairman - Advisory Board - Global Food Security - The Next Frontier in the Agriculture & Aquaculture Industry @ Global Food Security & Sustainability summit 2021 - 17th Sept 2021.",
    "Keynote Speaker - Future of Food Security @ Food and Drinks Innovate Asia Conference - 25th - 26th August 2021",
    "Keynote Speaker - Global Food Security - The Next Frontier in the Agriculture & Aquaculture Industry @ Global Food Security & Sustainability summit 2021 - 17th Sept 2021",
    "Speaker - 2021 APEC PPFS Webinar on “Digitalization and Innovation of APEC Food System”. Hosted by Ministry of Agriculture, Food and Rural Affairs of Korea.",
    "Speaker - Future of Aquaculture, MIFB Future Food Panel Discussion - 30th July 2021.",
    "Expert Speaker – Industry Revolution 4.0 Readiness Assessment (Aquaculture) and Strategy Development Workshop. Organized by Temasek Foundation in Partnership with Asian Development Bank & Singapore Polytechnic – 26th March 2021.",
    "Keynote Speaker – Land use change and Aquaculture for food security. Green Synergy Solutions in APEC Region, 18 Dec 2020. Organized by APEC Research Center for Advanced Biohydrogen Technology.",
    "Speaker - Application of Smart Aquaculture. APEC Workshop on the R&D and Promotion of Smart Agriculture – 23rd to 24th November 2020. Organized by Chinese Taipei.",
    "Speaker - Food Tech for Good - 7th August 2020 : Organized by TBN Asia.",
    "Speaker - The Next Frontier in Aquaculture - 29th April 2020 : Organized by Agribusiness : A Tool For Economic Recovery.",
    "Opening Address & Keynote Speaker - World Ocean Week, 8th Annual World Congress for Aquaculture, 2nd to 4th Nov 2019. Xiamen, China.",
    "Guest Speaker - NYP Symposium on Recent Advances in Finfish & Crustacean Aquaculture - 25th October 2019",
    "Speaker - APEC Ocean & Fishery Working Group - SOM3 Food Security Week - August 2019 @ Puerto Varas, Chile",
    "Guest Lecturer - Ekiti State Farmers' Forum - Aquaculture. Fisheries Cooperative Federation of Nigeria, 2019.",
    "Speaker - Rethink Agri Food Innovation Week @ Novotel Steven Singapore - 27th to 29th November 2018",
    "Speaker - ASTAR Farm to Fork Accelerator Event - 9th November 2018. Speed to Market - Helping enterprises and Accelerating the translation of RD into economic outcomes. Singapore.",
    "Keynote Speaker - 7th Annual World Congress for Ocean, Aquaculture and Fishery - Wei Hai China, 2018.",
    "Guest Speaker - AVA Inaugural Tech Matching event March 2018",
    "Guest Lecturer – Aquaculture: Foundation for Partnership Initiatives in the Niger Delta. Economic Development Centre Warri, Nigeria - January 2018",
    "Guest Speaker - APEC Expert Group on New and Renewable Energy Technologies – Tokyo - EGNRET 49 : Presentation on possible joint project re. use of clean and renewal energy for the Aquaculture industry – October 2017.",
    "Guest/ Plenary Speaker - AquaSg 2017 - Intensification & Disease Management : Opportunities in Aquaculture – Oct 2017 Singapore.",
    "Guest Speaker - AVA-URA’s Agri-Technovation 2017: A Business & Technology Matching Event 2017 organised by the Agri Authority of Singapore – Sept 2017.",
    "Guest Speaker - TechInnovation 2017 - A premier technology-industry brokerage event : Trend and Opportunities in use of technology in Aquaculture – Sept 2017",
    "Guest Speaker - APEC Expert Group on New and Renewable Energy Technologies – Jeju Korea - EGNRET 48 : Use of clean and renewal energy for Aquaculture – March 2017",
    "Guest/ Plenary Speaker - Use of fine bubbles in Aquaculture – International Symposium of Fine Bubbles Technology – Nov 2015 @ Osaka University.",
    "Guest/ Plenary Speaker - Financial Times LIVE – Nov 2015: Global Treasury Retreat @ Capella Hotel Sentosa – Use of Technology for enterprise risk mitigation.",
    "Speaker and Moderator - 18th Federation of Asian Veterinary Association Congress – FAVA 2014 : Use of Technology in Aquaculture",
    "Speaker - Asia Food Technology, Innovation & Safety conference and exhibition 2010 – Tackling Global Food shortages through advances in fish breeding technology.– 2010",
    "Chair & Speaker - Advancing Aquaculture Summit 2021- Organized by Aqmen 365 (Informa group). The main theme for this year summit is \"The Rising Tide : Supporting a Sustainable Future for the Aquaculture Industry\".",
    "Speaker & Panel member - AquaTropics Summit 2024 – Driving Aquaculture Innovation to ensure food security.  Jointly organised by Aquapolis,  Singapore Food Agency, Urban Solutions & Sustainability Innovation & Enterprise Office (USS IEO) and NUS Enterprise, the forum provided an engaging platform for all to share their perspectives on how innovative science can support the tropical aquaculture industry - 3\nrd\nOctober 2024"
  ],
  "article_texts": [],
  "links": [
    "https://www.singaporetech.edu.sg/directory/faculty/tan-kim-chuan#main-content",
    "https://www.singaporetech.edu.sg/directory/faculty/tan-kim-chuan",
    "https://www.singaporetech.edu.sg/directory/faculty",
    "https://www.singaporetech.edu.sg/directory/professional-officers",
    "https://www.singaporetech.edu.sg/directory/user/login",
    "https://www.singaporetech.edu.sg/",
    "https://www.singaporetech.edu.sg/directory/faculty",
    "https://www.singaporetech.edu.sg/directory/professional-officers",
    "https://www.singaporetech.edu.sg/search/node",
    "https://www.singaporetech.edu.sg/directory/faculty/tan-kim-chuan",
    "https://www.singaporetech.edu.sg/directory/faculty",
    "https://www.singaporetech.edu.sg/directory/professional-officers",
    "https://www.singaporetech.edu.sg/directory/user/login",
    "https://www.singaporetech.edu.sg/directory/faculty/tan-kim-chuan",
    "https://www.linkedin.com/in/matthew-tan-45b446a",
    "https://www.asiaresearchnews.com/content/matthew-tan",
    "https://apec.org/Groups/Other-Groups/Policy-Partnership-on-Food-Security.aspx",
    "https://terrabaru.com/",
    "http://researchonline.jcu.edu.au/65054",
    "http://researchonline.jcu.edu.au/56589",
    "http://researchonline.jcu.edu.au/51443",
    "http://researchonline.jcu.edu.au/51424",
    "http://researchonline.jcu.edu.au/51423",
    "https://www.google.com/maps/place/Singapore+Institute+of+Technology+(SIT)+-+Punggol/@1.41364,103.91229,14z/data=!4m6!3m5!1s0x31da1515bfb2d263:0xc71c56458ac08497!8m2!3d1.4136399!4d103.9122896!16s%2Fg%2F11t42h3wb_",
    "https://www.singaporetech.edu.sg/contact-us",
    "https://www.singaporetech.edu.sg/campus-locations",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.linkedin.com/company/singapore-institute-of-technology",
    "https://www.youtube.com/user/SingaporeTech",
    "https://www.tiktok.com/@singaporetech",
    "https://www.singaporetech.edu.sg/academic-policies",
    "https://www.singaporetech.edu.sg/privacy-policy",
    "https://www.singaporetech.edu.sg/safety-and-health-policy",
    "https://www.singaporetech.edu.sg/social-media-guidelines",
    "https://www.singaporetech.edu.sg/terms-use",
    "https://www.singaporetech.edu.sg/whistleblowing"
  ],
  "images": [
    "/directory/sites/directory/files/styles/profile_picture/public/profile-picture/20180726_TNCM_Mag-096.jpg?itok=o0XZdx9W"
  ]
}