{
  "url": "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/applied-research",
  "title": "Applied Research | Singapore Institute of Technology",
  "meta": {
    "description": null,
    "keywords": null
  },
  "text_lines": [
    "Skip to main content",
    "CEFT secondary menu",
    "Library",
    "Students",
    "Staff",
    "Food, Chemical and Biotechnology",
    "CEFT primary menu",
    "About Us",
    "Dropdown",
    "Applied Learning",
    "Applied Research",
    "Our People",
    "News",
    "Contact Us",
    "Overview",
    "arrow--right",
    "Directors' Message",
    "Advisory Board",
    "Faculty",
    "All",
    "News",
    "CEFT primary menu",
    "About Us",
    "Dropdown",
    "Overview",
    "arrow--right",
    "Directors' Message",
    "Advisory Board",
    "Faculty",
    "Applied Learning",
    "Dropdown",
    "arrow--right",
    "Applied Research",
    "Dropdown",
    "arrow--right",
    "Our People",
    "Dropdown",
    "arrow--right",
    "News",
    "Dropdown",
    "arrow--right",
    "Contact Us",
    "Dropdown",
    "arrow--right",
    "CEFT secondary menu",
    "Quick Links",
    "Library",
    "Students",
    "Staff",
    "What You Can Support",
    "Student Excellence",
    "Student Financial Aid",
    "Applied Research and Academic Initiatives",
    "Professorships",
    "SIT Punggol Campus",
    "Legacy Giving",
    "Alumni Giving",
    "Faculty & Staff Giving",
    "The Gift that Keeps on Giving",
    "Dropdown",
    "Giving to SIT",
    "Highlights",
    "Dropdown",
    "Giving News",
    "Transformative Giving",
    "What’s Up Punggol",
    "Dropdown",
    "Home",
    "Food, Chemical and Biotechnology",
    "Applied Research",
    "Applied Research",
    "Areas of Expertise",
    "Sustainability",
    "Sustainable development has been defined by the United Nations World Commission on Environment and Development as ‘development that meets the needs of the present without compromising the ability of future generations to meet their own needs’. In the FCB cluster, faculty work with industry collaborators on various projects that fall under the Sustainability theme. These projects range from optimising energy efficiency and food waste valorisation to life cycle analysis. Environmental sustainability is paramount for the survival of living organisms. Our work recognises that not only do we need to protect the environment but also that new processes and products need to be economically sustainable and socially acceptable.",
    "Our Research Activities",
    "Food waste digestion",
    "Food waste is generated worldwide, with different cuisines resulting in different food wastes. Assistant Professor Joy Pang and Associate Professor Cheow Wean Sin are collaborating with Westcom Bio-tech, a biotechnology development company with on-site food waste-to-fertiliser digester, in a two-pronged environment sustainability project. The objectives of the project are to: (1) optimise a bacteria consortium capable of efficiently digesting different kinds of food wastes into fertiliser, and (2) formulate the bacteria consortium into dry powder to minimise carbon footprint for export transportation.",
    "Simulation for energy efficiency",
    "Spray drying is one of the most frequently used drying techniques used in the production of powders. For example, the production of milk powder involves the heavy use of spray dryers. However, the energy consumption of spray dryers is very high, and when operated inefficiently, the energy loss is substantial. In a project funded by the MOE Translational R&D and Innovation Fund (TIF), Associate Professor Cheow Wean Sin and Associate Professor Tham Ming Tan aim to optimise the energy efficiency of industrial spray drying processes by developing a model-based energy utilisation monitoring system.",
    "Life cycle analysis of pharmaceutical excipients",
    "The environmental impact of the excipients in solid dosage form (i.e. tablets, capsules) manufacturing of active pharmaceutical ingredients should not be underestimated considering that pharmaceutical excipients (e.g. filler, binder, lubricant) make up > 70% of solid dosage formulations. Collaborating with Associate Professor Kunn Hadinoto Ong (PI) of NTU, Associate Professor Cheow Wean Sin and Dr Wang Danping leveraged SIT’s kilo scale solid dosage form manufacturing equipment to formulate tablets. They conducted a life cycle analysis of the tablets, with a focus on the excipients. The work research findings have been published. This work was supported by the GSK-Singapore Partnership for Green and Sustainable Manufacturing.",
    "Food",
    "What is Food?",
    "Food is vital to life. The focus on health and well-being through food consumption is growing. World economies are looking for new ways to add value to raw products. These global changes will lead to an increased demand for skilled food technology graduates, provide opportunities for international careers, and competitive salaries. Food technology is the application of food science to the selection, preservation, processing, packaging, distribution, and use of safe food. Related fields include analytical chemistry, biotechnology, engineering, nutrition, quality control, and food safety management.",
    "On-going projects:",
    "1. Low Gi Asian Bread (2020–2022)",
    "2. Unsweetened Non-Dairy Whipped Cream (2021–2022)",
    "3. Marine Algae Proteins: Isolation, Assessment & Optimisation for Direct Incorporation in High-Value Foods (2021–2022)",
    "4. Modification of Brown Rice Protein Isolate Using Microbial Transglutaminases: Functional Property Enhancement and Nutritional Evaluation",
    "5. Formulation of Beneficial Microorganisms in Hydroponic Vegetable Production.",
    "6. Smart and Sustainable Urban Aquaponics Farming for Healthy Liveable Cities",
    "7. Validation of Performance Indicators and Development of Benchmarks of Resource Use and Waste Generation for Urban Farms in Singapore",
    "8. Urban-Metabolic Farming-Module (UmFm): A Novel Farming Module Towards Eco-resilient Megacity Farmscape in 2030",
    "9. Study on the Use of Probiotics to Increase Yield and Nutritional Value in an Integrated Rooftop Hydroponic Farming and Solar Photovoltaics (PV) System",
    "FCB Faculty Research Interests and Expertise",
    "• Interactions between proteins and polysaccharides",
    "• Plant-based protein structure and functionalities",
    "• Ice cream innovation",
    "• Food hydrocolloids",
    "• Low glycemic index bread",
    "• Flavour and aroma profiling",
    "• Sensory evaluation and research",
    "• Product development (focused on foods for the elderly)",
    "Process Analytics & Control",
    "In engineering, a process can be defined as a series of tasks or steps that transform inputs into a particular output. In this applied research area, we use statistics, data analytics, and machine learning techniques to gain an understanding of the inputs, outputs, and process steps involved. We also apply state-of-the-art process control algorithms to guide the ways in which controllable inputs can be manipulated to optimise an objective function of the output(s).",
    "Our Activities and the Faculty’s Interests/Expertise",
    "Process analytical technology (PAT)",
    "Process analytical technology (PAT) is defined as a system for designing, analysing, and controlling manufacturing through timely measurements of critical quality and performance attributes of raw and in-process materials and processes, with the goal of ensuring the quality of the final product. PAT is a comprehensive framework that can be used to design, analyse, and control via the employment of tools such as analytical sensors, univariate, and multivariate data analysis, advanced process control, and information management systems.",
    "We have considerable experience in using various spectroscopic techniques (FTIR, Far IR, NIR, Raman, NMR, UV, MS, etc.) successfully for in-situ investigations of various liquid and reaction systems. In particular, a few unique capabilities that we have developed include (1) in-house software for spectral reconstruction and (2) algorithms for quantitative analysis. More than 100 papers on process monitoring and analysis as well as material characterisation have been published using these in-situ spectroscopic technologies.",
    "PAT is not new to chemical process and has been increasingly studied and adopted in pharmaceutical manufacturing process. With funding support from Pharma Innovation Programme Singapore (PIPS), we are currently working with a multinational pharmaceutical company to develop cost-efficient PAT tools for continuous monitoring and quality control for more sustainable waste recycling and management process.",
    "Process analytics, optimisation, and control",
    "It is normal to employ one production line to make different types of products in process industries. Frequent product or grade switch is time-and-resource consuming and generates low-value off-grade products. Dynamic optimisation of product switch-over to minimise time and cost has been continually pursued in both academia and industry. Most of the research work focuses on optimisation methodologies and solvers and it is not easy or practical to implement these complex online optimisation tools in real practice. The control objectives used are not effective enough to reflect or cut product transition and the manipulated variables are limited.",
    "A local polymer company is currently using one continuous product line to produce different grades of polystyrene according to customer requirements. With funding support from both SIT and the company, we have developed a practical approach to guide optimal product switch-over operation. The real plant data are analysed and used to build and calibrate process models to provide new strategies and parameters to minimise transition time and off-spec products. Statistical models based on plant data are developed to better describe the product properties. More process parameters are used to further optimise the operation. The process control loops are also calibrated and optimised to enhance the process operability.",
    "Analytics of post-COVID consumer preference for airline meals and simulation-based projection and optimisation of the meals’ production",
    "The COVID-19 pandemic has impacted almost all industries, with aviation and its supporting industries among those that have been particularly hard-hit. As countries begin to ease restrictions and reopen borders, more consumers will resume air travel.",
    "However, their consumption behaviour and their preferences for airline meals might be different compared to pre-COVID time. Despite an increasing number of studies on the impact of the pandemic on consumer behaviours, there is scant research to date that reflects the specific preferences of Singapore-based air travellers who are the major end customers of our industry partner, which produces airline meals in the country. To this end, we carried out a survey on a representative sample of the local air travellers. The objective of the survey was to gauge the dimension and magnitude of change, if any, in travellers’ preferences for in-flight meals caused by the COVID-19 pandemic.",
    "With data science techniques, we also performed segmentation analysis on this group of consumers to find sub-groups among them who had suggested similar statistically significant preference changes for in-flight catering in the survey. With this updated understanding of consumer preferences, we then projected and optimised the airline meal production process at the industry partner’s site using discrete-event simulation of its business operations. This project is an Industrial Masters’ thesis project under the supervision of A/Prof Fung Ho-Ki, A/Prof Siti Noorbaiyah Binti Abdul Malek, and an industry supervisor from the company.",
    "Biotechnology",
    "Biotechnology refers to the engineering of biological systems and cellular materials to develop high-value products that can be used in a myriad of applications, including medicine, agriculture, food and chemical production, environmental management, and forensics. In 2021, Singapore’s biotech companies raised US$360M in venture capital, surpassing the previous record of US$65.5M in 2018 by five times (The Business Times). The biotech ecosystem in Singapore, an amalgamation of more than 350 biotechnology and medical technology companies, is flourishing. It is a testament to the strong government support, investment, and connectivity in this sector. At SIT, we are proud to have a multi-disciplinary team of scientists and engineers. Backed by years of experience in bioinformatics, molecular biology, metabolic engineering, synthetic biology, and industrial bioprocessing, the team actively collaborates with local and overseas partners to drive intelligent product design and innovation, and transform the industry.",
    "Our Research Activities",
    "Diagnostic Kit for Molecular Biomarkers",
    "Implantation failure of blastocysts is a major obstacle to in-vitro fertilisation (IVF) treatment. Not only is the treatment costly, but failures have been strongly associated with increased rates of physiological distress and anxiety in families. To address this problem, Dr Joy Pang and collaborators from KK Women’s and Children’s Hospital and JNMedsys Pte Ltd investigated the use of extracellular microRNAs (miRNAs) found in spent blastocyst culture media as biomarkers for blastocyst quality before implantation during IVF. A biomarker is a molecular signature that can be measured and analysed to provide information on a patient’s physiological health and pharmacological responses to a therapeutic intervention. In this project, miRNAs found in spent blastocyst cultures were identified by Next Generation Sequencing (NGS) and correlated with blastocyst viability to determine a pool of miRNAs that may potentially serve as accurate diagnostic biomarkers. The team also developed a highly sensitive digital PCR technique that can be used to detect miRNAs directly from spent media without the need for secondary processing, hence improving diagnostic efficiency. Refer to the diagram. This project was jointly funded by SIT’s Ignition Grant and JNMedsys. Read about the project in",
    "this article",
    ".",
    "Identification and analysis of novel miRNA biomarkers for IVF diagnostics",
    "Engineering Antibody Production",
    "Antibodies are extensively exploited in biomedical research and medicine, particularly as a biologic therapeutic in the treatment of a wide range of both communicable and non-communicable diseases.",
    "However, a major impediment to the use of therapeutic antibodies for acute infections is the long development time and cost, usually 10–-15 years from discovery to availability as a marketed therapeutic. This is not ideal for the control of emerging diseases that require rapid production and deployment at scale.",
    "To address this issue, Dr Joy Pang collaborated with Tychan Pte Ltd, a Singapore based clinical-stage biotechnology company, to engineer cells for more efficient production of antibodies. This project was jointly funded by SIT’s Ignition Grant and Tychan.",
    "SIT Pharmaceutical Engineering graduate and current full-time research associate at Tychan Pte Ltd.",
    "A Scale-up Platform for Adoptive Cell Therapy",
    "Adoptive cell therapy (ACT) involves the repurposing and in vitro expansion of a patient’s immune cells for cancer immunotherapy. This is often accomplished by first withdrawing blood containing T-cells from the patient, followed by genetic augmentation of the patient’s T-cells antigen receptors to recognise cancer cell surface biomarkers. The engineered T-cells are then scaled up to higher cell densities using T-flasks, impeller-based or rocking-based bioreactors before transfusion back into the patient for treatment. While reports have indicated that ACT is effective at curing cancer, adoption of the technology is impeded due to the lack of an economical and viable bioprocessing strategy for scale-up production of genetically modified T-cells. To overcome this limitation, Dr Bernard Loo and Dr Adison Wong teamed up with industry collaborators from Tessa Therapeutics and Quintech Scientific to explore new methods in T-cell expansion. Using Jurkat T-cells and peripheral blood mononuclear cells as testbeds, the team evaluated different bioreactor setups, culture conditions and media formulations and elucidated critical process determinants for robust and economical bioprocessing of T-cells. This project was funded by the Translational R&D and Innovation Fund (Ministry of Education, Singapore).",
    "Developing scale-up strategies for adoptive cell therapy. (a) Cell growth kinetics of Jurkat cells in different bioreactors configuration. (b) Microscope images of Jurkat cells after 12 days of growth in bi-axial rotation and static conditions. The scale bar represents 100µm in length.",
    "Prevention and Control of Microbial Contamination",
    "Biofouling is the undesirable growth and accumulation of microorganisms on surfaces that are immersed in water. If undetected or left unresolved, it can lead to severe infrastructure damage and affect workplace safety. Confronted by this problem and the absence of viable solutions to tackle these challenges at present, Dr Susanna Leong and the team comprising Dr Joy Pang, Dr Adison Wong, and colleagues from DSO National Laboratory sought to prevent microbial contamination by developing biochemical sensors and synthetic peptides against the environmental microbes in Singapore. This project is funded by the Ministry of Defence, Singapore.",
    "Fermentation of Single Cell Proteins for Human Nutrition and Animal Feed",
    "Single Cell Proteins (SCP) are proteins originating from single-celled microorganisms, such as nutritional yeasts and algae, with abundant crude protein content. The development of scalable SCP production platforms is very attractive for land-scarce Singapore, where fermentation of SCP can produce relatively high-quality protein over a short period of time, is climate-independent, requires a small growing area, and is supported by relatively inexpensive growth substrates. Funded by Lee Foundation, the SIT Novel Food Research Programme is led by Dr Adison Wong and Dr Susanna Leong. It aims to explore the use of food processing side streams as raw materials to produce nutritional food ingredients from edible SCP. This entails the characterisation and testing of various strains in terms of their genetics, metabolism, and bioprocessing demands.",
    "Quick Links",
    "Area of Expertise",
    "– Sustainability",
    "– Food",
    "– Process Analytics & Control",
    "– Biotechnology",
    "Resources",
    "Institutional Animal Care and Use Committee",
    "The Institutional Animal Care and Use Committee (IACUC) was set up on 12th October 2019 to oversee the care and use of animals for scientific purposes in SIT. Members of the IACUC are appointed by the Provost and include veterinarians, scientists, non-scientists and members of the community who are not affiliated to SIT.",
    "Learn More",
    "Institutional Biosafety Committee",
    "The Institutional Biosafety Committee’s (IBC) primary role is to assess and review the use of biological materials for activities conducted by the University. It supports the University to comply with legislation and guidelines, such as the Biological Agents and Toxins Act (BATA) and the Singapore Biosafety Guidelines for Research on Genetically Modified Organisms (GMOs).",
    "Learn More",
    "#block-stickyapplynowbutton {\n        position: fixed;\n        bottom: 1.5rem;\n        right: 1.5rem;\n        z-index: 100;\ndisplay: none;\n    }\ndiv#block-stickyapplynowbutton {\n    display: none;\n}\n    div#block-stickyapplynowbutton .field.field--name-body.field--type-text-with-summary.field--label-.field__item.text-long {\n        padding: 0 !important;\n    }\n\n   div#block-stickyapplynowbutton img {\n        max-width:100px;\n\n    }\n\n    .adm-container {\n        display: flex;\n        gap: 0.5rem;\n        align-items: center;\ndisplay: none;\n    }",
    "Admissions AY2025",
    "Apply Now!",
    "Address",
    "1 Punggol Coast Road Singapore 828608",
    "Contact Us",
    "Send an Enquiry",
    "Visiting SIT",
    "Our Campus Locations",
    "Privacy Policy",
    "Safety and Health",
    "Social Media Guidelines",
    "Terms of Use",
    "Whistleblowing",
    "Copyright ©",
    "2025",
    "Singapore Institute of Technology. All Rights Reserved.",
    ".contact-link2 a:link,  .contact-link2 a:visited {\n    border-bottom:0px;\n}",
    "{\"path\":{\"baseUrl\":\"\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/5351\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"colorbox\":{\"transition\":\"elastic\",\"speed\":350,\"opacity\":0.84999999999999998,\"slideshow\":false,\"slideshowAuto\":true,\"slideshowSpeed\":2500,\"slideshowStart\":\"start slideshow\",\"slideshowStop\":\"stop slideshow\",\"current\":\"{current} of {total}\",\"previous\":\"\\u00ab Prev\",\"next\":\"Next \\u00bb\",\"close\":\"Close\",\"overlayClose\":true,\"returnFocus\":true,\"maxWidth\":\"80%\",\"maxHeight\":\"80%\",\"initialWidth\":\"1%\",\"initialHeight\":\"1%\",\"fixed\":true,\"scrolling\":true,\"mobiledetect\":false,\"mobiledevicewidth\":\"480px\"},\"lazyLoadUrl\":\"\\/term_reference_fancytree\\/subTree\",\"user\":{\"uid\":0,\"permissionsHash\":\"e848f09cb4b2e749e40b35cdcee7948d09ab58717b89591b749dd0cbde6d3ee6\"}}"
  ],
  "desc_divs": [],
  "article_texts": [
    "Applied Research\nAreas of Expertise\nSustainability\nSustainable development has been defined by the United Nations World Commission on Environment and Development as ‘development that meets the needs of the present without compromising the ability of future generations to meet their own needs’. In the FCB cluster, faculty work with industry collaborators on various projects that fall under the Sustainability theme. These projects range from optimising energy efficiency and food waste valorisation to life cycle analysis. Environmental sustainability is paramount for the survival of living organisms. Our work recognises that not only do we need to protect the environment but also that new processes and products need to be economically sustainable and socially acceptable.\nOur Research Activities\nFood waste digestion\nFood waste is generated worldwide, with different cuisines resulting in different food wastes. Assistant Professor Joy Pang and Associate Professor Cheow Wean Sin are collaborating with Westcom Bio-tech, a biotechnology development company with on-site food waste-to-fertiliser digester, in a two-pronged environment sustainability project. The objectives of the project are to: (1) optimise a bacteria consortium capable of efficiently digesting different kinds of food wastes into fertiliser, and (2) formulate the bacteria consortium into dry powder to minimise carbon footprint for export transportation.\nSimulation for energy efficiency\nSpray drying is one of the most frequently used drying techniques used in the production of powders. For example, the production of milk powder involves the heavy use of spray dryers. However, the energy consumption of spray dryers is very high, and when operated inefficiently, the energy loss is substantial. In a project funded by the MOE Translational R&D and Innovation Fund (TIF), Associate Professor Cheow Wean Sin and Associate Professor Tham Ming Tan aim to optimise the energy efficiency of industrial spray drying processes by developing a model-based energy utilisation monitoring system.\nLife cycle analysis of pharmaceutical excipients\nThe environmental impact of the excipients in solid dosage form (i.e. tablets, capsules) manufacturing of active pharmaceutical ingredients should not be underestimated considering that pharmaceutical excipients (e.g. filler, binder, lubricant) make up > 70% of solid dosage formulations. Collaborating with Associate Professor Kunn Hadinoto Ong (PI) of NTU, Associate Professor Cheow Wean Sin and Dr Wang Danping leveraged SIT’s kilo scale solid dosage form manufacturing equipment to formulate tablets. They conducted a life cycle analysis of the tablets, with a focus on the excipients. The work research findings have been published. This work was supported by the GSK-Singapore Partnership for Green and Sustainable Manufacturing.\nFood\nWhat is Food?\nFood is vital to life. The focus on health and well-being through food consumption is growing. World economies are looking for new ways to add value to raw products. These global changes will lead to an increased demand for skilled food technology graduates, provide opportunities for international careers, and competitive salaries. Food technology is the application of food science to the selection, preservation, processing, packaging, distribution, and use of safe food. Related fields include analytical chemistry, biotechnology, engineering, nutrition, quality control, and food safety management.\nOn-going projects:\n1. Low Gi Asian Bread (2020–2022)\n2. Unsweetened Non-Dairy Whipped Cream (2021–2022)\n3. Marine Algae Proteins: Isolation, Assessment & Optimisation for Direct Incorporation in High-Value Foods (2021–2022)\n4. Modification of Brown Rice Protein Isolate Using Microbial Transglutaminases: Functional Property Enhancement and Nutritional Evaluation\n5. Formulation of Beneficial Microorganisms in Hydroponic Vegetable Production.\n6. Smart and Sustainable Urban Aquaponics Farming for Healthy Liveable Cities\n7. Validation of Performance Indicators and Development of Benchmarks of Resource Use and Waste Generation for Urban Farms in Singapore\n8. Urban-Metabolic Farming-Module (UmFm): A Novel Farming Module Towards Eco-resilient Megacity Farmscape in 2030\n9. Study on the Use of Probiotics to Increase Yield and Nutritional Value in an Integrated Rooftop Hydroponic Farming and Solar Photovoltaics (PV) System\nFCB Faculty Research Interests and Expertise\n• Interactions between proteins and polysaccharides\n• Plant-based protein structure and functionalities\n• Ice cream innovation\n• Food hydrocolloids\n• Low glycemic index bread\n• Flavour and aroma profiling\n• Sensory evaluation and research\n• Product development (focused on foods for the elderly)\nProcess Analytics & Control\nIn engineering, a process can be defined as a series of tasks or steps that transform inputs into a particular output. In this applied research area, we use statistics, data analytics, and machine learning techniques to gain an understanding of the inputs, outputs, and process steps involved. We also apply state-of-the-art process control algorithms to guide the ways in which controllable inputs can be manipulated to optimise an objective function of the output(s).\nOur Activities and the Faculty’s Interests/Expertise\nProcess analytical technology (PAT)\nProcess analytical technology (PAT) is defined as a system for designing, analysing, and controlling manufacturing through timely measurements of critical quality and performance attributes of raw and in-process materials and processes, with the goal of ensuring the quality of the final product. PAT is a comprehensive framework that can be used to design, analyse, and control via the employment of tools such as analytical sensors, univariate, and multivariate data analysis, advanced process control, and information management systems.\nWe have considerable experience in using various spectroscopic techniques (FTIR, Far IR, NIR, Raman, NMR, UV, MS, etc.) successfully for in-situ investigations of various liquid and reaction systems. In particular, a few unique capabilities that we have developed include (1) in-house software for spectral reconstruction and (2) algorithms for quantitative analysis. More than 100 papers on process monitoring and analysis as well as material characterisation have been published using these in-situ spectroscopic technologies.\nPAT is not new to chemical process and has been increasingly studied and adopted in pharmaceutical manufacturing process. With funding support from Pharma Innovation Programme Singapore (PIPS), we are currently working with a multinational pharmaceutical company to develop cost-efficient PAT tools for continuous monitoring and quality control for more sustainable waste recycling and management process.\nProcess analytics, optimisation, and control\nIt is normal to employ one production line to make different types of products in process industries. Frequent product or grade switch is time-and-resource consuming and generates low-value off-grade products. Dynamic optimisation of product switch-over to minimise time and cost has been continually pursued in both academia and industry. Most of the research work focuses on optimisation methodologies and solvers and it is not easy or practical to implement these complex online optimisation tools in real practice. The control objectives used are not effective enough to reflect or cut product transition and the manipulated variables are limited.\nA local polymer company is currently using one continuous product line to produce different grades of polystyrene according to customer requirements. With funding support from both SIT and the company, we have developed a practical approach to guide optimal product switch-over operation. The real plant data are analysed and used to build and calibrate process models to provide new strategies and parameters to minimise transition time and off-spec products. Statistical models based on plant data are developed to better describe the product properties. More process parameters are used to further optimise the operation. The process control loops are also calibrated and optimised to enhance the process operability.\nAnalytics of post-COVID consumer preference for airline meals and simulation-based projection and optimisation of the meals’ production\nThe COVID-19 pandemic has impacted almost all industries, with aviation and its supporting industries among those that have been particularly hard-hit. As countries begin to ease restrictions and reopen borders, more consumers will resume air travel.\nHowever, their consumption behaviour and their preferences for airline meals might be different compared to pre-COVID time. Despite an increasing number of studies on the impact of the pandemic on consumer behaviours, there is scant research to date that reflects the specific preferences of Singapore-based air travellers who are the major end customers of our industry partner, which produces airline meals in the country. To this end, we carried out a survey on a representative sample of the local air travellers. The objective of the survey was to gauge the dimension and magnitude of change, if any, in travellers’ preferences for in-flight meals caused by the COVID-19 pandemic.\nWith data science techniques, we also performed segmentation analysis on this group of consumers to find sub-groups among them who had suggested similar statistically significant preference changes for in-flight catering in the survey. With this updated understanding of consumer preferences, we then projected and optimised the airline meal production process at the industry partner’s site using discrete-event simulation of its business operations. This project is an Industrial Masters’ thesis project under the supervision of A/Prof Fung Ho-Ki, A/Prof Siti Noorbaiyah Binti Abdul Malek, and an industry supervisor from the company.\nBiotechnology\nBiotechnology refers to the engineering of biological systems and cellular materials to develop high-value products that can be used in a myriad of applications, including medicine, agriculture, food and chemical production, environmental management, and forensics. In 2021, Singapore’s biotech companies raised US$360M in venture capital, surpassing the previous record of US$65.5M in 2018 by five times (The Business Times). The biotech ecosystem in Singapore, an amalgamation of more than 350 biotechnology and medical technology companies, is flourishing. It is a testament to the strong government support, investment, and connectivity in this sector. At SIT, we are proud to have a multi-disciplinary team of scientists and engineers. Backed by years of experience in bioinformatics, molecular biology, metabolic engineering, synthetic biology, and industrial bioprocessing, the team actively collaborates with local and overseas partners to drive intelligent product design and innovation, and transform the industry.\nOur Research Activities\nDiagnostic Kit for Molecular Biomarkers\nImplantation failure of blastocysts is a major obstacle to in-vitro fertilisation (IVF) treatment. Not only is the treatment costly, but failures have been strongly associated with increased rates of physiological distress and anxiety in families. To address this problem, Dr Joy Pang and collaborators from KK Women’s and Children’s Hospital and JNMedsys Pte Ltd investigated the use of extracellular microRNAs (miRNAs) found in spent blastocyst culture media as biomarkers for blastocyst quality before implantation during IVF. A biomarker is a molecular signature that can be measured and analysed to provide information on a patient’s physiological health and pharmacological responses to a therapeutic intervention. In this project, miRNAs found in spent blastocyst cultures were identified by Next Generation Sequencing (NGS) and correlated with blastocyst viability to determine a pool of miRNAs that may potentially serve as accurate diagnostic biomarkers. The team also developed a highly sensitive digital PCR technique that can be used to detect miRNAs directly from spent media without the need for secondary processing, hence improving diagnostic efficiency. Refer to the diagram. This project was jointly funded by SIT’s Ignition Grant and JNMedsys. Read about the project in\nthis article\n.\nIdentification and analysis of novel miRNA biomarkers for IVF diagnostics\nEngineering Antibody Production\nAntibodies are extensively exploited in biomedical research and medicine, particularly as a biologic therapeutic in the treatment of a wide range of both communicable and non-communicable diseases.\nHowever, a major impediment to the use of therapeutic antibodies for acute infections is the long development time and cost, usually 10–-15 years from discovery to availability as a marketed therapeutic. This is not ideal for the control of emerging diseases that require rapid production and deployment at scale.\nTo address this issue, Dr Joy Pang collaborated with Tychan Pte Ltd, a Singapore based clinical-stage biotechnology company, to engineer cells for more efficient production of antibodies. This project was jointly funded by SIT’s Ignition Grant and Tychan.\nSIT Pharmaceutical Engineering graduate and current full-time research associate at Tychan Pte Ltd.\nA Scale-up Platform for Adoptive Cell Therapy\nAdoptive cell therapy (ACT) involves the repurposing and in vitro expansion of a patient’s immune cells for cancer immunotherapy. This is often accomplished by first withdrawing blood containing T-cells from the patient, followed by genetic augmentation of the patient’s T-cells antigen receptors to recognise cancer cell surface biomarkers. The engineered T-cells are then scaled up to higher cell densities using T-flasks, impeller-based or rocking-based bioreactors before transfusion back into the patient for treatment. While reports have indicated that ACT is effective at curing cancer, adoption of the technology is impeded due to the lack of an economical and viable bioprocessing strategy for scale-up production of genetically modified T-cells. To overcome this limitation, Dr Bernard Loo and Dr Adison Wong teamed up with industry collaborators from Tessa Therapeutics and Quintech Scientific to explore new methods in T-cell expansion. Using Jurkat T-cells and peripheral blood mononuclear cells as testbeds, the team evaluated different bioreactor setups, culture conditions and media formulations and elucidated critical process determinants for robust and economical bioprocessing of T-cells. This project was funded by the Translational R&D and Innovation Fund (Ministry of Education, Singapore).\nDeveloping scale-up strategies for adoptive cell therapy. (a) Cell growth kinetics of Jurkat cells in different bioreactors configuration. (b) Microscope images of Jurkat cells after 12 days of growth in bi-axial rotation and static conditions. The scale bar represents 100µm in length.\nPrevention and Control of Microbial Contamination\nBiofouling is the undesirable growth and accumulation of microorganisms on surfaces that are immersed in water. If undetected or left unresolved, it can lead to severe infrastructure damage and affect workplace safety. Confronted by this problem and the absence of viable solutions to tackle these challenges at present, Dr Susanna Leong and the team comprising Dr Joy Pang, Dr Adison Wong, and colleagues from DSO National Laboratory sought to prevent microbial contamination by developing biochemical sensors and synthetic peptides against the environmental microbes in Singapore. This project is funded by the Ministry of Defence, Singapore.\nFermentation of Single Cell Proteins for Human Nutrition and Animal Feed\nSingle Cell Proteins (SCP) are proteins originating from single-celled microorganisms, such as nutritional yeasts and algae, with abundant crude protein content. The development of scalable SCP production platforms is very attractive for land-scarce Singapore, where fermentation of SCP can produce relatively high-quality protein over a short period of time, is climate-independent, requires a small growing area, and is supported by relatively inexpensive growth substrates. Funded by Lee Foundation, the SIT Novel Food Research Programme is led by Dr Adison Wong and Dr Susanna Leong. It aims to explore the use of food processing side streams as raw materials to produce nutritional food ingredients from edible SCP. This entails the characterisation and testing of various strains in terms of their genetics, metabolism, and bioprocessing demands.\nQuick Links\nArea of Expertise\n– Sustainability\n– Food\n– Process Analytics & Control\n– Biotechnology\nResources\nInstitutional Animal Care and Use Committee\nThe Institutional Animal Care and Use Committee (IACUC) was set up on 12th October 2019 to oversee the care and use of animals for scientific purposes in SIT. Members of the IACUC are appointed by the Provost and include veterinarians, scientists, non-scientists and members of the community who are not affiliated to SIT.\nLearn More\nInstitutional Biosafety Committee\nThe Institutional Biosafety Committee’s (IBC) primary role is to assess and review the use of biological materials for activities conducted by the University. It supports the University to comply with legislation and guidelines, such as the Biological Agents and Toxins Act (BATA) and the Singapore Biosafety Guidelines for Research on Genetically Modified Organisms (GMOs).\nLearn More"
  ],
  "links": [
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/applied-research#main-content",
    "https://libguides.singaporetech.edu.sg/library",
    "https://students.singaporetech.edu.sg/",
    "https://sitsingaporetechedu.sharepoint.com/sites/DW/staff/Pages/Home.aspx",
    "https://www.singaporetech.edu.sg",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/applied-learning",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/applied-research",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/our-people",
    "https://www.singaporetech.edu.sg/digitalnewsroom/?h=1&t=FCB%2CFood%20Chemical%20and%20Biotechnology%2CCEFT",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/contact-us",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/fcb-directors-message",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/fcb-directors-message",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/fcb-directors-message/advisory-board",
    "https://www.singaporetech.edu.sg/directory/faculty?search_type=name&name=&research=&keyword=&cluster=6&sort_by=first_name&first_char_first_name=&first_char_last_name=",
    "https://www.singaporetech.edu.sg/search",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/applied-research#all",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/applied-research#news",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/fcb-directors-message",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/fcb-directors-message",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/fcb-directors-message/advisory-board",
    "https://www.singaporetech.edu.sg/directory/faculty?search_type=name&name=&research=&keyword=&cluster=6&sort_by=first_name&first_char_first_name=&first_char_last_name=",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/applied-learning",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/applied-research",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/our-people",
    "https://www.singaporetech.edu.sg/digitalnewsroom/?h=1&t=FCB%2CFood%20Chemical%20and%20Biotechnology%2CCEFT",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/contact-us",
    "https://libguides.singaporetech.edu.sg/library",
    "https://students.singaporetech.edu.sg/",
    "https://sitsingaporetechedu.sharepoint.com/sites/DW/staff/Pages/Home.aspx",
    "https://www.singaporetech.edu.sg/giving#what-you-can-support",
    "https://www.singaporetech.edu.sg/giving#support-student-excellence",
    "https://www.singaporetech.edu.sg/giving#support-student-financial-aid",
    "https://www.singaporetech.edu.sg/giving#support-applied-research-and-academic-initiatives",
    "https://www.singaporetech.edu.sg/giving#support-professorships",
    "https://www.singaporetech.edu.sg/giving#SIT-Punggol-campus",
    "https://www.singaporetech.edu.sg/giving#legacy-giving",
    "https://www.singaporetech.edu.sg/giving#alumni-giving",
    "https://www.singaporetech.edu.sg/giving#faculty-staff-giving",
    "https://www.singaporetech.edu.sg/giving#the-gift-that-keeps-on-giving",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/applied-research",
    "https://www.singaporetech.edu.sg/giving",
    "https://www.singaporetech.edu.sg/giving/news",
    "https://www.singaporetech.edu.sg/giving/news?category=5496",
    "https://www.singaporetech.edu.sg/giving/news?category=5491",
    "https://www.singaporetech.edu.sg/one-sitizen-fund",
    "https://www.singaporetech.edu.sg/",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/applied-research",
    "https://www.biorxiv.org/content/10.1101/2021.06.03.446991v1.full",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/applied-research#expertise-1",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/applied-research#expertise-2",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/applied-research#expertise-3",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology/applied-research#expertise-4",
    "https://www.singaporetech.edu.sg/research/institutional-animal-care-and-use-committee",
    "https://www.singaporetech.edu.sg/research/institutional-biosafety-committee",
    "https://learner.singaporetech.edu.sg/",
    "https://www.google.com/maps/place/Singapore+Institute+of+Technology+(SIT)+-+Punggol/@1.41364,103.91229,14z/data=!4m6!3m5!1s0x31da1515bfb2d263:0xc71c56458ac08497!8m2!3d1.4136399!4d103.9122896!16s%2Fg%2F11t42h3wb_",
    "https://www.singaporetech.edu.sg/contact-us",
    "https://www.singaporetech.edu.sg/campus-locations",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.linkedin.com/company/singapore-institute-of-technology",
    "https://www.youtube.com/user/SingaporeTech",
    "https://www.tiktok.com/@singaporetech",
    "https://www.singaporetech.edu.sg/privacy-policy",
    "https://www.singaporetech.edu.sg/safety-and-health-policy",
    "https://www.singaporetech.edu.sg/social-media-guidelines",
    "https://www.singaporetech.edu.sg/terms-use",
    "https://www.singaporetech.edu.sg/whistleblowing"
  ],
  "images": [
    "/sites/default/files/2024-12/%5BFA%5D%20%20SIT%20One%20SITizen%20Alumni%20Initiative_Web%20banner_1244px%20x%20688px.jpg",
    "/sites/default/files/styles/full_width_large/public/2020-11/SIT%20-%20Technische%20Universit%C3%A4t%20M%C3%BCnchen_CEMEngTech_resized.jpg?itok=2gRTIaj8",
    "/sites/default/files/2022-01/image002.png",
    "/sites/default/files/2022-02/process-analytics.png",
    "/sites/default/files/2022-01/diagnostic-kit.jpg",
    "/sites/default/files/2022-01/tychan-pte-ltd.jpg",
    "/sites/default/files/2022-01/adoptive-cell-therapy.png",
    "/sites/default/files/2021-09/Institutional-Animal-Care.jpg",
    "/sites/default/files/2021-09/Institutional-Biosafety-Committee.jpg"
  ]
}