{
  "url": "https://www.singaporetech.edu.sg/innovate/clasic",
  "title": "Community Leadership And Social Innovation Centre | Singapore Institute of Technology",
  "meta": {
    "description": null,
    "keywords": null
  },
  "text_lines": [
    "Skip to main content",
    "Punggol Campus",
    "Virtual Open House",
    "IWSP 10",
    "Careers",
    "Library",
    "Students",
    "Staff",
    "Alumni",
    "Mega menu",
    "About SIT",
    "Dropdown",
    "Admissions",
    "Dropdown",
    "Education",
    "Dropdown",
    "Research",
    "Dropdown",
    "News",
    "Giving",
    "Dropdown",
    "Who We Are",
    "President's Welcome",
    "Our Mission and Vision",
    "Our Values and SITizen-DNA",
    "Our History",
    "Overseas University Partners",
    "Punggol Campus",
    "Sustainability",
    "Dropdown",
    "Leadership",
    "Board of Trustees",
    "Senior Management",
    "Academic Leadership",
    "Dropdown",
    "Academic Clusters",
    "Business, Communication and Design",
    "Engineering",
    "Food, Chemical and Biotechnology",
    "Health and Social Sciences",
    "Infocomm Technology",
    "Dropdown",
    "Resources",
    "Annual Report",
    "SITizen Buzz",
    "Careers",
    "MOE START Scheme",
    "Faculty Directory",
    "Professional Officers Directory",
    "Procurement Opportunities",
    "Campus Locations",
    "Campus Wayfinder",
    "Frequently Asked Questions",
    "Contact Us",
    "Dropdown",
    "Undergraduate",
    "Requirements",
    "Matriculation",
    "Tuition Fees",
    "Financial Aid",
    "Scholarships",
    "Early Admissions Exercise",
    "Returning NSmen",
    "Readmissions, Transfers And Deferments",
    "FAQs",
    "Subscribe to Mailing List",
    "Dropdown",
    "Postgraduate",
    "Requirements",
    "Matriculation",
    "Tuition Fees",
    "Financial Aid",
    "Scholarships",
    "FAQs",
    "Dropdown",
    "Why SIT",
    "Our Education Philosophy",
    "Applied Learning",
    "Academic Clusters",
    "University Programme Structure",
    "Healthy Employment Outcomes",
    "Sustainability Education",
    "Dropdown",
    "Undergraduate Programmes",
    "Aerospace and Aviation",
    "Allied Health",
    "Building and Infrastructure Engineering",
    "Business and Management",
    "Chemical Engineering",
    "Design and Media",
    "Digital Supply Chain",
    "Electrical and Electronics Engineering",
    "Food Technology",
    "Information and Digital Technology",
    "Mechanical Engineering",
    "Nursing",
    "Pharmaceutical Engineering",
    "Systems Engineering",
    "Transport Engineering",
    "Dropdown",
    "Postgraduate Programmes",
    "By Coursework",
    "By Research",
    "Dropdown",
    "Academic Bulletin",
    "Lifelong Learning",
    "Professional Development Courses",
    "Competency-based Stackable Programmes",
    "Dropdown",
    "Specialist Teaching & Learning",
    "Centre for Professional Communication",
    "Centre for Digital Enablement",
    "Community Leadership And Social Innovation Centre",
    "SIT Teaching and Learning Academy",
    "Dropdown",
    "Life@SIT",
    "Career Readiness",
    "Global Experience",
    "Life on Campus",
    "Find Your Tribe",
    "Life Readiness",
    "Student Wellness",
    "Facilities",
    "Dropdown",
    "Strategic Translational Research Programmes",
    "Community Health Transformation",
    "Sustainable Food Innovation",
    "Energy Resilience",
    "Sustainable Infrastructure Engineering & Maintenance",
    "Sustainable Maritime Engineering",
    "Dropdown",
    "Technology Enablers",
    "Artificial Intelligence",
    "Cybersecurity",
    "Augmented/Virtual Reality",
    "5G and Future Communications",
    "Robotics and Autonomous Systems",
    "Dropdown",
    "Applied Research Centres",
    "Centre for Infrastructure and Tunnel Engineering",
    "Construction Technology Innovation Laboratory",
    "Energy Efficiency Technology Centre",
    "Innovation Hub",
    "SIT x NVIDIA AI Centre (SNAIC)",
    "FoodPlant",
    "Future Communications Translation Lab",
    "Dropdown",
    "Innovation Centres",
    "Design Factory@SIT",
    "NAMIC Hub@SIT",
    "Rapid Product Innovation and Development Centre",
    "SIT-Polytechnic Innovation Centre of Excellence",
    "Dropdown",
    "Governance and Ethics",
    "Research Integrity Committee",
    "Institutional Review Board",
    "Institutional Animal Care and Use Committee",
    "Institutional Biosafety Committee",
    "Dropdown",
    "Intellectual Property",
    "Technology Transfer Office",
    "Dropdown",
    "All",
    "News",
    "What You Can Support",
    "Student Excellence",
    "Student Financial Aid",
    "Applied Research and Academic Initiatives",
    "Professorships",
    "SIT Punggol Campus",
    "Legacy Giving",
    "Alumni Giving",
    "Faculty & Staff Giving",
    "The Gift that Keeps on Giving",
    "Dropdown",
    "Giving to SIT",
    "Highlights",
    "Dropdown",
    "Giving News",
    "Transformative Giving",
    "What’s Up Punggol",
    "Dropdown",
    "Who We Are",
    "President's Welcome",
    "Our Mission and Vision",
    "Our Values and SITizen-DNA",
    "Our History",
    "Overseas University Partners",
    "Punggol Campus",
    "Sustainability",
    "Dropdown",
    "Leadership",
    "Board of Trustees",
    "Senior Management",
    "Academic Leadership",
    "Dropdown",
    "Academic Clusters",
    "Business, Communication and Design",
    "Engineering",
    "Food, Chemical and Biotechnology",
    "Health and Social Sciences",
    "Infocomm Technology",
    "Dropdown",
    "Resources",
    "Annual Report",
    "SITizen Buzz",
    "Careers",
    "MOE START Scheme",
    "Faculty Directory",
    "Professional Officers Directory",
    "Procurement Opportunities",
    "Campus Locations",
    "Campus Wayfinder",
    "Frequently Asked Questions",
    "Contact Us",
    "Dropdown",
    "Undergraduate",
    "Requirements",
    "Matriculation",
    "Tuition Fees",
    "Financial Aid",
    "Scholarships",
    "Early Admissions Exercise",
    "Returning NSmen",
    "Readmissions, Transfers And Deferments",
    "FAQs",
    "Subscribe to Mailing List",
    "Dropdown",
    "Postgraduate",
    "Requirements",
    "Matriculation",
    "Tuition Fees",
    "Financial Aid",
    "Scholarships",
    "FAQs",
    "Dropdown",
    "Why SIT",
    "Our Education Philosophy",
    "Applied Learning",
    "Academic Clusters",
    "University Programme Structure",
    "Healthy Employment Outcomes",
    "Sustainability Education",
    "Dropdown",
    "Undergraduate Programmes",
    "Aerospace and Aviation",
    "Allied Health",
    "Building and Infrastructure Engineering",
    "Business and Management",
    "Chemical Engineering",
    "Design and Media",
    "Digital Supply Chain",
    "Electrical and Electronics Engineering",
    "Food Technology",
    "Information and Digital Technology",
    "Mechanical Engineering",
    "Nursing",
    "Pharmaceutical Engineering",
    "Systems Engineering",
    "Transport Engineering",
    "Dropdown",
    "Postgraduate Programmes",
    "By Coursework",
    "By Research",
    "Dropdown",
    "Academic Bulletin",
    "Lifelong Learning",
    "Professional Development Courses",
    "Competency-based Stackable Programmes",
    "Dropdown",
    "Specialist Teaching & Learning",
    "Centre for Professional Communication",
    "Centre for Digital Enablement",
    "Community Leadership And Social Innovation Centre",
    "SIT Teaching and Learning Academy",
    "Dropdown",
    "Life@SIT",
    "Career Readiness",
    "Global Experience",
    "Life on Campus",
    "Find Your Tribe",
    "Life Readiness",
    "Student Wellness",
    "Facilities",
    "Dropdown",
    "Strategic Translational Research Programmes",
    "Community Health Transformation",
    "Sustainable Food Innovation",
    "Energy Resilience",
    "Sustainable Infrastructure Engineering & Maintenance",
    "Sustainable Maritime Engineering",
    "Dropdown",
    "Technology Enablers",
    "Artificial Intelligence",
    "Cybersecurity",
    "Augmented/Virtual Reality",
    "5G and Future Communications",
    "Robotics and Autonomous Systems",
    "Dropdown",
    "Applied Research Centres",
    "Centre for Infrastructure and Tunnel Engineering",
    "Construction Technology Innovation Laboratory",
    "Energy Efficiency Technology Centre",
    "Innovation Hub",
    "SIT x NVIDIA AI Centre (SNAIC)",
    "FoodPlant",
    "Future Communications Translation Lab",
    "Dropdown",
    "Innovation Centres",
    "Design Factory@SIT",
    "NAMIC Hub@SIT",
    "Rapid Product Innovation and Development Centre",
    "SIT-Polytechnic Innovation Centre of Excellence",
    "Dropdown",
    "Governance and Ethics",
    "Research Integrity Committee",
    "Institutional Review Board",
    "Institutional Animal Care and Use Committee",
    "Institutional Biosafety Committee",
    "Dropdown",
    "Intellectual Property",
    "Technology Transfer Office",
    "Dropdown",
    "Mega menu",
    "< Back",
    "About SIT",
    "Dropdown",
    "Admissions",
    "Dropdown",
    "Education",
    "Dropdown",
    "Research",
    "Dropdown",
    "News",
    "Giving",
    "Dropdown",
    "Quick Links",
    "Punggol Campus",
    "Virtual Open House",
    "IWSP 10",
    "Careers",
    "Library",
    "Students",
    "Staff",
    "Alumni",
    "What You Can Support",
    "Student Excellence",
    "Student Financial Aid",
    "Applied Research and Academic Initiatives",
    "Professorships",
    "SIT Punggol Campus",
    "Legacy Giving",
    "Alumni Giving",
    "Faculty & Staff Giving",
    "The Gift that Keeps on Giving",
    "Dropdown",
    "Giving to SIT",
    "Highlights",
    "Dropdown",
    "Giving News",
    "Transformative Giving",
    "What’s Up Punggol",
    "Dropdown",
    "Home",
    "Community Leadership And Social Innovation Centre",
    "Community Leadership And Social Innovation Centre (CLASIC)",
    "Leading innovation to impact communities",
    "The Community Leadership And Social Innovation Centre (CLASIC) of the Singapore Institute of Technology (SIT) curates social innovation projects carried out in collaboration with community partners.",
    "CLASIC curates, tracks, and optimises community initiatives and projects by leveraging the interdisciplinary knowledge, expertise, and skills of SIT faculty, students, and staff across different academic clusters.",
    "Why get involved in community projects?",
    "At SIT, we nurture our students to be 'Grounded in the Community' because it is part of the university’s DNA. Our Centre works closely with partners and stakeholders to provide avenues for our students, who we call SITizens, to give back to society through social innovation. This includes the design of projects that complement our faculty’s expertise and their professional practice.",
    "By being involved in community projects, students and faculty can play an important role in enhancing the quality of life for beneficiaries. At the same time, such projects also allow them to gain greater awareness of prevailing social issues.",
    "Our vision",
    "We envision CLASIC as an enabler of community initiatives. Our objective is to play a key role in elevating SIT as the partner of choice for community-related projects and initiatives.",
    "What we do",
    "chevron--up",
    "Coordinate and monitor the inclusion of social context elements in SIT’s curriculum",
    "SIT will progressively incorporate social context elements in all its degree programmes by 2023. These elements will comprise at least 2 credits and include topics from the ‘Singapore: Imagining the Next 50 Years’ e-module; the updated UCM3001 Change Management module; or other custom modules.",
    "The Social Innovation Project (USI2001) is a 3-credit module that forms part of the SIT-wide suite of interdisciplinary initiatives under the new Undergraduate Programme Structure that will bring students from different disciplines together. All students from the AY2022/23 cohort will be required to take the module as part of SIT",
    "’",
    "s graduation requirements.",
    "Students taking this module will be at least Year-of-study 2 standing or have completed both the UDE1001 Introduction to Design Innovation and UDE2001 Interdisciplinary Design Innovation modules.",
    "USI2001 aims to create opportunities for SIT students to address some of the current issues and multi-faceted challenges faced in our society using a multi-pronged, problem-solving and collaborative approach. Students will compete three e-learning micromodules, and working in teams of 3 to 5, they will plan, co-create, prototype, and present a socially innovative solution meant for a specific community group.",
    "More information on the module will be shared during the introductory briefing to be conducted every Trimester for all students required to take the module.",
    "chevron--up",
    "Curate community-related projects by tapping into faculty’s expertise (e.g. supported by CLASIC Project Grant) and students’ knowledge (e.g. USI2001 Social Innovation Project module)",
    "SIT integrates social context teaching and learning elements, activities, and projects within its academic programmes. In addition, the university also provides opportunities for SITizens to be involved in making a positive impact in the community through social innovation projects. This immersion aims to impart the SITizen-DNA, particularly ‘Grounded in the Community’, to all students.",
    "By using the skills and knowledge gained in their learning journey at SIT on projects that promote social good, SITizens can develop meaningful interactions with the community and our community partners.",
    "Students can participate in social innovation projects with community partners to fulfil their required interdisciplinary requirements learning credits. These projects may comprise any local community innovation projects spearheaded by our partners or stakeholders, including:",
    "SIT’s Technology Transfer Office (TTO) division",
    "Community programmes organised by our Student Life division",
    "YES! Programme led by a group of SIT faculty members",
    "CLASIC-curated projects in partnership with community and industry leaders",
    "CLASIC works with SIT faculty, professional officers, and staff to coordinate their involvement in these community-related projects. We also connect and collaborate with community and industry partners to curate these opportunities.",
    "chevron--up",
    "Connect to SIT's workplace learning and training",
    "The",
    "National Centre of Excellence for Workplace Learning",
    "(NACE@SIT) is a partner of CLASIC and one of the centres located in SIT. NACE@SIT focuses on enhancing work processes and organisational efficiency through workplace learning and training workshops. Companies seeking to access workplace learning and training benefits can connect with NACE@SIT through our Centre.",
    "Connect me with NACE@SIT",
    "USI2001 Social Innovation Project Module",
    "There are many current issues and challenges faced in our pluralistic society, such as diversity and inclusivity, changing demographics, environmental concerns, and sustainable practices, among others. The inclusion of the Social Innovation Project module as a graduation requirement will create opportunities for SIT students to address some of these multi-faceted issues and challenges in a multi-pronged, problem-solving approach, and through inter-disciplinary collaboration.",
    "In this module, students will be applying the principles and mindset of being socially attuned and human-centered to understand the interdisciplinary and diverse factors, concerns, needs, and expectations that different stakeholders in society have when addressing these issues and challenges. Throughout the module, students will put aside their assumptions and biases, and objectively learn and understand real-life and current issues and challenges, through observation, personal engagement of stakeholders, interviews, and various other outreach and engagement methods. In turn, students will propose a socially innovative solution to address the issue(s) or challenge(s) identified, drawing from their project team’s interdisciplinary background and expertise.",
    "This experience will nurture students’ ability to see the broader connection of issues and challenges and bring about an awareness of the multiple considerations that need to be weighed in, including social, environmental, and sustainability factors, in the planning and decision-making process involved in the course of their work – such as being cognisant of the circular economy, how companies operate, and corresponding investments made in the sectors involved. This experience will also prepare students for the interdisciplinary nature of work teams and the demands of stakeholders, regardless of the industry they venture into after graduation from SIT.",
    "Projects",
    "Current Projects",
    "Tools for Story-Reading / Telling for students with Special Needs",
    "This cross-cluster, collaborative project aims to develop a mobile prototype application that performs storytelling in an interactive and gamified manner for children with special needs. Unlike commercially available storytelling apps for children, the narratives in this storytelling app reference familiar sights and scenarios in the Singapore context. Backdrops for these scenarios include kopitiams, mom-and-pop shops, and void decks; while story plots include local festivals and visiting grandparents to pay respect to them on these special days, living in Housing and Development Board (HDB) flats, or playing at the void deck. A total of 11 stories of varying levels of difficulty were created, with two selected for the prototype.",
    "The storytelling app will be designed with these needs in mind to facilitate both teacher-directed and learner-directed vocabulary learning and assessment. Additionally, the personalised and intelligent app will record and track the learner’s responses to vocabulary questions, as well as diagnose his receptive vocabulary via a digitalised Peabody Picture Vocabulary test",
    "Faculty from the Centre for Professional Communication (CPC), namely, Assoc Prof Radhika Jaidev, Asst Prof Kenneth Ong, Asst Prof Lee Hwee Hoon and Senior Lecturer Erick Tan as well as faculty from the ICT cluster, namely, Asst Prof Muhammad Fauzi Abbas and Asst Prof Alex Qiang have collaborated with speech therapists / interventionists from AWWA School to identify the needs of such children and to design and develop the story plots.",
    "Interactive Carbon Footprint Calculator Prototype for Visitors’ Journey to Mandai Wildlife Reserve (MWR) Parks",
    "In Singapore, Mandai Wildlife Reserves (MWR) is a popular destination for both domestic and international leisure visitors. It is home to wildlife parks including the Singapore Zoo, River Wonders, Night Safari, and Bird Paradise. Given the popularity of MWR parks and the completion of the Mandai Rejuvenation Project, the number of local and international visitors to this destination is expected to grow. While welcoming and offering a satisfactory experience for visitors is important, promoting sustainability in MWR parks is essential.",
    "The project team, led by Assoc Prof Michael Alexander Kruesi (from the Business, Communication and Design Cluster) comprising three SIT faculty and seven SIT students, will investigate a specific current sustainable development effort in MWR parks. This project seeks to design and test-run an interactive carbon footprint calculator prototype to document and examine visitors’ carbon footprint and relevant travel behaviours to and within MWR parks.",
    "Developing Digital Reminder for the Management of Community-Dwelling Individuals at Risk of Pressure Injuries",
    "Pressure injuries (PI) are largely preventable by maintaining the quality and standard of key evidence-based practices such as risk assessment, repositioning, or turning, using pressure-relief devices; maintaining adequate nutrition and moisture; and education on PI prevention. Currently, there are no digital reminders in the market targeting the management of PI prevention.",
    "The project team, led by Assoc Prof Elaine Siow from the Health and Social Sciences Cluster, comprising three SIT faculty and four SIT students, will develop an application software that will remind the caregivers via a tablet device at home. The application software may potentially include other functions to support caregivers at home, e.g., reminders to administer medication. The project will obtain user inputs from key stakeholders, such as caregivers and community nurses on the interface and function of this application before fabricating the first prototype.",
    "Developing and Setting Up an Interactive Health Zone in St Luke's ElderCare’s New Centre at Anchorvale",
    "PSt Luke’s ElderCare (SLEC) is a healthcare provider committed to meeting the evolving needs of their patients, clients and caregivers. SLEC delivers a full range of integrated services such as maintenance day care, day rehabilitation programme and dementia care.",
    "The project team, led by Senior Professional Officer Seah Jianxing, comprising four SIT Professional Officers and 50 SIT students, collaborated with SLEC to develop and set up an Interactive Health Zone in the new senior activities centre at Anchorvale, to benefit Active Agers (60 years old and above) through interactive activities. These interactive activities help in guiding residents on self-assessment of key medical vitals (BP, O2, height weight etc.) using the equipment at SLEC, usage of exercise machines, and addressing prevention or management of medical conditions common in older adults.",
    "chevron--up",
    "Completed Projects",
    "chevron--up",
    "Improving accessibility at Kwong Wai Shiu Hospital",
    "Improving accessibility at Kwong Wai Shiu Hospital",
    "Kwong Wai Shiu Hospital (KWSH) is collaborating with NACE@SIT in the planning, design, and development of its new nursing home.",
    "Scope of the collaboration between KWSH and NACE@SIT",
    "Facilitating the design and planning of the new nursing home in Potong Pasir",
    "Understanding the needs and expectations of users (e.g. residents, staff)",
    "Designing a workplace training programme for KWSH staff",
    "KWSH highlighted two important design requirements: access to assistance and access to information. Both requirements should factor in the need for limited social interactions and social distancing in a post-COVID-19 environment. In addition, plans related to overall operations of the nursing home operations must ensure smooth service provision and delivery in spite of manpower constraints.",
    "This project is led by Assoc Professor Intan Azura Mokhtar and Asst Prof Nicholas Teo Boon How from the Business, Communication and Design cluster in partnership with NACE@SIT and CLASIC.",
    "chevron--up",
    "Redesigning a Seniors’ Corner",
    "Redesigning a Seniors’ Corner",
    "SIT was commissioned to redesign a communal space for seniors that would facilitate community bonding and socialisation. SIT’s research and design team needed to gain a precise understanding of the basic and aspirational needs of users. The team observed user behaviour throughout the day and studied the surrounding area. They hoped to discover insights on potential gathering spots and identify areas adjacent to the site that would augment the design.",
    "Led by Assistant Professor Mark Teo (Business, Communication and Design) and Senior Lecturer Corrine Hoo (Health and Social Sciences), the team got feedback from the residents’ committee to uncover latent needs. The redesigned Seniors’ Corner would cater to different user groups at different times of the day. It would be suitable for formal and informal gatherings as well as planned activities. One possible utilisation of the space is to include a community garden for residents.",
    "chevron--up",
    "Enhancing control of water usage and cost with ECOSOFTT-CLASIC Smart meter",
    "Enhancing Communities Through Water for Life Programme in Siem Reap, Cambodia with the Singapore International Foundation",
    "The Water for Life (WFL) programme is an initiative by Singapore International Foundation (SIF) that provides rural communities with access to clean drinking water, improving their overall health and hygiene practices. This programme aligns with United Nations’ Sustainable Development Goal 6, which aims to provide universal access to clean water and sanitation by 2030. By facilitating cross-border friendships and promoting intercultural understanding, the WFL programme helps build stronger global communities.",
    "As part of the WFL programme, the project team led by Assoc Prof Steven Tay from the Engineering Cluster and six SIT students collaborated with SIF to build and install bio-sand filters in the Siem Reap community. Our students connected with the villagers and gained insights into their water usage patterns, enabling them to identify the most suitable locations for installing bio-sand filters. The students' interactions with the community facilitated the gathering of feedback and information, developing effective water management strategies.",
    "chevron--up",
    "Recycling Receptacle for the National Environment Agency (NEA Bloobox)",
    "Recycling Receptacle for the National Environment Agency (NEA Bloobox)",
    "To promote recycling right and to encourage higher recycling rates among Singaporeans, the National Environment Agency (NEA) wanted to produce a recycling receptacle for distribution to all households in Singapore. NEA invited students at Institutes of Higher Learning, including SIT, to contribute designs of a household recycling receptacle for their consideration. They wanted the receptacle to allow for different types of common recyclable items to be placed inside and to be compact, foldable, and attractive, whilst at the same time, be expandable, sturdy, waterproof and washable.",
    "SIT Professional Officers and six SIT students from various disciplines formed a team to work on receptacle designs that would meet NEA’s expectations and unit price requirements. The team successfully presented a total of six design concepts and prototypes to NEA in Sep 2021, and one was selected for refinement and development into a final prototype. The recycling receptacle was mass-produced by NEA’s authorised vendors and distributed to households across Singapore from late 2022.",
    "chevron--up",
    "PPIS Student Care Invention Lounge",
    "PPIS Student Care Invention Lounge",
    "The onset of the COVID-19 pandemic posed unprecedented disruptions to many social service agencies as they encountered difficulties in providing their services to clients who were no longer able to physically visit their centres freely for consultation and other activities. The Singapore Muslim Women’s Association (PPIS) whose services include casework and counselling for clients with marital, domestic violence and parenting issues, were faced with similar challenges.",
    "Asst Prof Muhamed Fauzi Abbas from the ICT Cluster and his project team accepted the challenge to support PPIS on their process and activity improvement journey by leading SIT students in projects that measure the effectiveness of PPIS’ online social service programmes, as well as to design a space and curate activities for a PPIS student care centre that would inspire the young in the area of Science, Technology, Engineering, Arts and Mathematics (STEAM).",
    "In Phase 1, a space called the Invention Lounge was designed and created in PPIS’ student-care centre as a learning space for children to explore, tinker and in the process, pick up practical skills. The children are given the freedom and resources to develop and realise their ideas, and the opportunity to create, innovate, invent, make mistakes, and try again.",
    "In Phase 2, the children are guided on three activities tailored to the lower and upper primary levels. These activities leverage the Invention Lounge and other facilities available in the centre and are designed to empower the children with essential skill sets and to connect them to their STEAM knowledge. The lesson plans for these activities were developed such that the educators in PPIS could continue with these activities after the initial run by the SIT student mentors.",
    "chevron--up",
    "On-going",
    "Inspiring STEM education in secondary schools through SIT’s YES!Programme",
    "SIT’s annual Young Engineers’ Space Programme",
    "(YES!Programme) was first conceived in October 2016. It aims to create a positive and enriching service-learning environment for SIT’s undergraduates. The four-month programme allows SIT undergraduates to hone their mentorship skills and inspire secondary school students to learn more about STEM. YES!Programme allows secondary school students to pick up new knowledge and skills in robotics, programming, 3D printing, and food technology (chocolate making).",
    "To date, more than 100 Secondary 3 and 4 students from Tanglin Secondary School and Yusof Ishak Secondary School have taken part and benefitted from the programme. These students are from the Normal Academic (NA)/ Normal Technical (NT) streams and are also from underprivileged families. They have been supported by close to 60 SITizen mentors.",
    "Associate Professor (A/P) Victor Wang Peng Cheng (Engineering) in partnership with CLASIC has led the YES!Programme since 2019. The programme was conceived by SIT President Professor Tan Thiam Soon and a former SIT colleague, Dr Cheong Kang Hao in 2016. Lian Ho Lee Construction starting funding the programme in 2017 and the donation amounted to $300,000 over a period of four years.",
    "chevron--up",
    "E-BOOK",
    "Download Our e-Book",
    "chevron--up",
    "Our team",
    "Professor Yaacob Ibrahim",
    "Advisor, Community Leadership And Social Innovation Centre (CLASIC)",
    "Dr Intan Azura Mokhtar (Associate Professor)",
    "Director, Community Leadership And Social Innovation Centre (CLASIC)",
    "Mr Dan Chia",
    "Deputy Director, Community Leadership and Social Innovation Centre (CLASIC)",
    "Ms Lim Xin Yi",
    "Centre Manager, Community Leadership And Social Innovation Centre (CLASIC)",
    "Ms Raudhah Binte Razali",
    "Senior Assistant Manager, Community Leadership And Social Innovation Centre (CLASIC)",
    "Ms Claudya Clara Boru Hombing",
    "Assistant Manager, Community Leadership And Social Innovation Centre (CLASIC)",
    "Ms Lim Sock Hwee",
    "Assistant Manager, Community Leadership And Social Innovation Centre (CLASIC)",
    "$(document).ready(function() {\n\n$( \".horizontal-tab-button\" ).click(function() {\n$('.slick-slider').slick('refresh');\n});\n\n});",
    "Get in Touch",
    "Connect with us to discover how you can get started on community projects.",
    "Email CLASIC",
    "$(document).ready(function() {\n\n$( \".horizontal-tab-button, .drupal-horizontal-tabs summary\" ).click(function() {\nconsole.log(\"...\");\n$('.slick-slider').slick('refresh');\n});\n\n});",
    "#block-stickyapplynowbutton {\n        position: fixed;\n        bottom: 1.5rem;\n        right: 1.5rem;\n        z-index: 100;\ndisplay: none;\n    }\ndiv#block-stickyapplynowbutton {\n    display: none;\n}\n    div#block-stickyapplynowbutton .field.field--name-body.field--type-text-with-summary.field--label-.field__item.text-long {\n        padding: 0 !important;\n    }\n\n   div#block-stickyapplynowbutton img {\n        max-width:100px;\n\n    }\n\n    .adm-container {\n        display: flex;\n        gap: 0.5rem;\n        align-items: center;\ndisplay: none;\n    }",
    "Admissions AY2025",
    "Apply Now!",
    "Address",
    "1 Punggol Coast Road Singapore 828608",
    "Contact Us",
    "Send an Enquiry",
    "Visiting SIT",
    "Our Campus Locations",
    "Privacy Policy",
    "Safety and Health",
    "Social Media Guidelines",
    "Terms of Use",
    "Whistleblowing",
    "Copyright ©",
    "2025",
    "Singapore Institute of Technology. All Rights Reserved.",
    ".contact-link2 a:link,  .contact-link2 a:visited {\n    border-bottom:0px;\n}",
    "{\"path\":{\"baseUrl\":\"\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/3666\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"colorbox\":{\"transition\":\"elastic\",\"speed\":350,\"opacity\":0.84999999999999998,\"slideshow\":false,\"slideshowAuto\":true,\"slideshowSpeed\":2500,\"slideshowStart\":\"start slideshow\",\"slideshowStop\":\"stop slideshow\",\"current\":\"{current} of {total}\",\"previous\":\"\\u00ab Prev\",\"next\":\"Next \\u00bb\",\"close\":\"Close\",\"overlayClose\":true,\"returnFocus\":true,\"maxWidth\":\"80%\",\"maxHeight\":\"80%\",\"initialWidth\":\"1%\",\"initialHeight\":\"1%\",\"fixed\":true,\"scrolling\":true,\"mobiledetect\":false,\"mobiledevicewidth\":\"480px\"},\"lazyLoadUrl\":\"\\/term_reference_fancytree\\/subTree\",\"user\":{\"uid\":0,\"permissionsHash\":\"e848f09cb4b2e749e40b35cdcee7948d09ab58717b89591b749dd0cbde6d3ee6\"}}"
  ],
  "desc_divs": [],
  "article_texts": [
    "Community Leadership And Social Innovation Centre (CLASIC)\nLeading innovation to impact communities\nThe Community Leadership And Social Innovation Centre (CLASIC) of the Singapore Institute of Technology (SIT) curates social innovation projects carried out in collaboration with community partners.\nCLASIC curates, tracks, and optimises community initiatives and projects by leveraging the interdisciplinary knowledge, expertise, and skills of SIT faculty, students, and staff across different academic clusters.\nWhy get involved in community projects?\nAt SIT, we nurture our students to be 'Grounded in the Community' because it is part of the university’s DNA. Our Centre works closely with partners and stakeholders to provide avenues for our students, who we call SITizens, to give back to society through social innovation. This includes the design of projects that complement our faculty’s expertise and their professional practice.\nBy being involved in community projects, students and faculty can play an important role in enhancing the quality of life for beneficiaries. At the same time, such projects also allow them to gain greater awareness of prevailing social issues.\nOur vision\nWe envision CLASIC as an enabler of community initiatives. Our objective is to play a key role in elevating SIT as the partner of choice for community-related projects and initiatives.\nWhat we do\nchevron--up\nCoordinate and monitor the inclusion of social context elements in SIT’s curriculum\nSIT will progressively incorporate social context elements in all its degree programmes by 2023. These elements will comprise at least 2 credits and include topics from the ‘Singapore: Imagining the Next 50 Years’ e-module; the updated UCM3001 Change Management module; or other custom modules.\nThe Social Innovation Project (USI2001) is a 3-credit module that forms part of the SIT-wide suite of interdisciplinary initiatives under the new Undergraduate Programme Structure that will bring students from different disciplines together. All students from the AY2022/23 cohort will be required to take the module as part of SIT\n’\ns graduation requirements.\nStudents taking this module will be at least Year-of-study 2 standing or have completed both the UDE1001 Introduction to Design Innovation and UDE2001 Interdisciplinary Design Innovation modules.\nUSI2001 aims to create opportunities for SIT students to address some of the current issues and multi-faceted challenges faced in our society using a multi-pronged, problem-solving and collaborative approach. Students will compete three e-learning micromodules, and working in teams of 3 to 5, they will plan, co-create, prototype, and present a socially innovative solution meant for a specific community group.\nMore information on the module will be shared during the introductory briefing to be conducted every Trimester for all students required to take the module.\nchevron--up\nCurate community-related projects by tapping into faculty’s expertise (e.g. supported by CLASIC Project Grant) and students’ knowledge (e.g. USI2001 Social Innovation Project module)\nSIT integrates social context teaching and learning elements, activities, and projects within its academic programmes. In addition, the university also provides opportunities for SITizens to be involved in making a positive impact in the community through social innovation projects. This immersion aims to impart the SITizen-DNA, particularly ‘Grounded in the Community’, to all students.\nBy using the skills and knowledge gained in their learning journey at SIT on projects that promote social good, SITizens can develop meaningful interactions with the community and our community partners.\nStudents can participate in social innovation projects with community partners to fulfil their required interdisciplinary requirements learning credits. These projects may comprise any local community innovation projects spearheaded by our partners or stakeholders, including:\nSIT’s Technology Transfer Office (TTO) division\nCommunity programmes organised by our Student Life division\nYES! Programme led by a group of SIT faculty members\nCLASIC-curated projects in partnership with community and industry leaders\nCLASIC works with SIT faculty, professional officers, and staff to coordinate their involvement in these community-related projects. We also connect and collaborate with community and industry partners to curate these opportunities.\nchevron--up\nConnect to SIT's workplace learning and training\nThe\nNational Centre of Excellence for Workplace Learning\n(NACE@SIT) is a partner of CLASIC and one of the centres located in SIT. NACE@SIT focuses on enhancing work processes and organisational efficiency through workplace learning and training workshops. Companies seeking to access workplace learning and training benefits can connect with NACE@SIT through our Centre.\nConnect me with NACE@SIT\nUSI2001 Social Innovation Project Module\nThere are many current issues and challenges faced in our pluralistic society, such as diversity and inclusivity, changing demographics, environmental concerns, and sustainable practices, among others. The inclusion of the Social Innovation Project module as a graduation requirement will create opportunities for SIT students to address some of these multi-faceted issues and challenges in a multi-pronged, problem-solving approach, and through inter-disciplinary collaboration.\nIn this module, students will be applying the principles and mindset of being socially attuned and human-centered to understand the interdisciplinary and diverse factors, concerns, needs, and expectations that different stakeholders in society have when addressing these issues and challenges. Throughout the module, students will put aside their assumptions and biases, and objectively learn and understand real-life and current issues and challenges, through observation, personal engagement of stakeholders, interviews, and various other outreach and engagement methods. In turn, students will propose a socially innovative solution to address the issue(s) or challenge(s) identified, drawing from their project team’s interdisciplinary background and expertise.\nThis experience will nurture students’ ability to see the broader connection of issues and challenges and bring about an awareness of the multiple considerations that need to be weighed in, including social, environmental, and sustainability factors, in the planning and decision-making process involved in the course of their work – such as being cognisant of the circular economy, how companies operate, and corresponding investments made in the sectors involved. This experience will also prepare students for the interdisciplinary nature of work teams and the demands of stakeholders, regardless of the industry they venture into after graduation from SIT.\nProjects\nCurrent Projects\nTools for Story-Reading / Telling for students with Special Needs\nThis cross-cluster, collaborative project aims to develop a mobile prototype application that performs storytelling in an interactive and gamified manner for children with special needs. Unlike commercially available storytelling apps for children, the narratives in this storytelling app reference familiar sights and scenarios in the Singapore context. Backdrops for these scenarios include kopitiams, mom-and-pop shops, and void decks; while story plots include local festivals and visiting grandparents to pay respect to them on these special days, living in Housing and Development Board (HDB) flats, or playing at the void deck. A total of 11 stories of varying levels of difficulty were created, with two selected for the prototype.\nThe storytelling app will be designed with these needs in mind to facilitate both teacher-directed and learner-directed vocabulary learning and assessment. Additionally, the personalised and intelligent app will record and track the learner’s responses to vocabulary questions, as well as diagnose his receptive vocabulary via a digitalised Peabody Picture Vocabulary test\nFaculty from the Centre for Professional Communication (CPC), namely, Assoc Prof Radhika Jaidev, Asst Prof Kenneth Ong, Asst Prof Lee Hwee Hoon and Senior Lecturer Erick Tan as well as faculty from the ICT cluster, namely, Asst Prof Muhammad Fauzi Abbas and Asst Prof Alex Qiang have collaborated with speech therapists / interventionists from AWWA School to identify the needs of such children and to design and develop the story plots.\nInteractive Carbon Footprint Calculator Prototype for Visitors’ Journey to Mandai Wildlife Reserve (MWR) Parks\nIn Singapore, Mandai Wildlife Reserves (MWR) is a popular destination for both domestic and international leisure visitors. It is home to wildlife parks including the Singapore Zoo, River Wonders, Night Safari, and Bird Paradise. Given the popularity of MWR parks and the completion of the Mandai Rejuvenation Project, the number of local and international visitors to this destination is expected to grow. While welcoming and offering a satisfactory experience for visitors is important, promoting sustainability in MWR parks is essential.\nThe project team, led by Assoc Prof Michael Alexander Kruesi (from the Business, Communication and Design Cluster) comprising three SIT faculty and seven SIT students, will investigate a specific current sustainable development effort in MWR parks. This project seeks to design and test-run an interactive carbon footprint calculator prototype to document and examine visitors’ carbon footprint and relevant travel behaviours to and within MWR parks.\nDeveloping Digital Reminder for the Management of Community-Dwelling Individuals at Risk of Pressure Injuries\nPressure injuries (PI) are largely preventable by maintaining the quality and standard of key evidence-based practices such as risk assessment, repositioning, or turning, using pressure-relief devices; maintaining adequate nutrition and moisture; and education on PI prevention. Currently, there are no digital reminders in the market targeting the management of PI prevention.\nThe project team, led by Assoc Prof Elaine Siow from the Health and Social Sciences Cluster, comprising three SIT faculty and four SIT students, will develop an application software that will remind the caregivers via a tablet device at home. The application software may potentially include other functions to support caregivers at home, e.g., reminders to administer medication. The project will obtain user inputs from key stakeholders, such as caregivers and community nurses on the interface and function of this application before fabricating the first prototype.\nDeveloping and Setting Up an Interactive Health Zone in St Luke's ElderCare’s New Centre at Anchorvale\nPSt Luke’s ElderCare (SLEC) is a healthcare provider committed to meeting the evolving needs of their patients, clients and caregivers. SLEC delivers a full range of integrated services such as maintenance day care, day rehabilitation programme and dementia care.\nThe project team, led by Senior Professional Officer Seah Jianxing, comprising four SIT Professional Officers and 50 SIT students, collaborated with SLEC to develop and set up an Interactive Health Zone in the new senior activities centre at Anchorvale, to benefit Active Agers (60 years old and above) through interactive activities. These interactive activities help in guiding residents on self-assessment of key medical vitals (BP, O2, height weight etc.) using the equipment at SLEC, usage of exercise machines, and addressing prevention or management of medical conditions common in older adults.\nchevron--up\nCompleted Projects\nchevron--up\nImproving accessibility at Kwong Wai Shiu Hospital\nImproving accessibility at Kwong Wai Shiu Hospital\nKwong Wai Shiu Hospital (KWSH) is collaborating with NACE@SIT in the planning, design, and development of its new nursing home.\nScope of the collaboration between KWSH and NACE@SIT\nFacilitating the design and planning of the new nursing home in Potong Pasir\nUnderstanding the needs and expectations of users (e.g. residents, staff)\nDesigning a workplace training programme for KWSH staff\nKWSH highlighted two important design requirements: access to assistance and access to information. Both requirements should factor in the need for limited social interactions and social distancing in a post-COVID-19 environment. In addition, plans related to overall operations of the nursing home operations must ensure smooth service provision and delivery in spite of manpower constraints.\nThis project is led by Assoc Professor Intan Azura Mokhtar and Asst Prof Nicholas Teo Boon How from the Business, Communication and Design cluster in partnership with NACE@SIT and CLASIC.\nchevron--up\nRedesigning a Seniors’ Corner\nRedesigning a Seniors’ Corner\nSIT was commissioned to redesign a communal space for seniors that would facilitate community bonding and socialisation. SIT’s research and design team needed to gain a precise understanding of the basic and aspirational needs of users. The team observed user behaviour throughout the day and studied the surrounding area. They hoped to discover insights on potential gathering spots and identify areas adjacent to the site that would augment the design.\nLed by Assistant Professor Mark Teo (Business, Communication and Design) and Senior Lecturer Corrine Hoo (Health and Social Sciences), the team got feedback from the residents’ committee to uncover latent needs. The redesigned Seniors’ Corner would cater to different user groups at different times of the day. It would be suitable for formal and informal gatherings as well as planned activities. One possible utilisation of the space is to include a community garden for residents.\nchevron--up\nEnhancing control of water usage and cost with ECOSOFTT-CLASIC Smart meter\nEnhancing Communities Through Water for Life Programme in Siem Reap, Cambodia with the Singapore International Foundation\nThe Water for Life (WFL) programme is an initiative by Singapore International Foundation (SIF) that provides rural communities with access to clean drinking water, improving their overall health and hygiene practices. This programme aligns with United Nations’ Sustainable Development Goal 6, which aims to provide universal access to clean water and sanitation by 2030. By facilitating cross-border friendships and promoting intercultural understanding, the WFL programme helps build stronger global communities.\nAs part of the WFL programme, the project team led by Assoc Prof Steven Tay from the Engineering Cluster and six SIT students collaborated with SIF to build and install bio-sand filters in the Siem Reap community. Our students connected with the villagers and gained insights into their water usage patterns, enabling them to identify the most suitable locations for installing bio-sand filters. The students' interactions with the community facilitated the gathering of feedback and information, developing effective water management strategies.\nchevron--up\nRecycling Receptacle for the National Environment Agency (NEA Bloobox)\nRecycling Receptacle for the National Environment Agency (NEA Bloobox)\nTo promote recycling right and to encourage higher recycling rates among Singaporeans, the National Environment Agency (NEA) wanted to produce a recycling receptacle for distribution to all households in Singapore. NEA invited students at Institutes of Higher Learning, including SIT, to contribute designs of a household recycling receptacle for their consideration. They wanted the receptacle to allow for different types of common recyclable items to be placed inside and to be compact, foldable, and attractive, whilst at the same time, be expandable, sturdy, waterproof and washable.\nSIT Professional Officers and six SIT students from various disciplines formed a team to work on receptacle designs that would meet NEA’s expectations and unit price requirements. The team successfully presented a total of six design concepts and prototypes to NEA in Sep 2021, and one was selected for refinement and development into a final prototype. The recycling receptacle was mass-produced by NEA’s authorised vendors and distributed to households across Singapore from late 2022.\nchevron--up\nPPIS Student Care Invention Lounge\nPPIS Student Care Invention Lounge\nThe onset of the COVID-19 pandemic posed unprecedented disruptions to many social service agencies as they encountered difficulties in providing their services to clients who were no longer able to physically visit their centres freely for consultation and other activities. The Singapore Muslim Women’s Association (PPIS) whose services include casework and counselling for clients with marital, domestic violence and parenting issues, were faced with similar challenges.\nAsst Prof Muhamed Fauzi Abbas from the ICT Cluster and his project team accepted the challenge to support PPIS on their process and activity improvement journey by leading SIT students in projects that measure the effectiveness of PPIS’ online social service programmes, as well as to design a space and curate activities for a PPIS student care centre that would inspire the young in the area of Science, Technology, Engineering, Arts and Mathematics (STEAM).\nIn Phase 1, a space called the Invention Lounge was designed and created in PPIS’ student-care centre as a learning space for children to explore, tinker and in the process, pick up practical skills. The children are given the freedom and resources to develop and realise their ideas, and the opportunity to create, innovate, invent, make mistakes, and try again.\nIn Phase 2, the children are guided on three activities tailored to the lower and upper primary levels. These activities leverage the Invention Lounge and other facilities available in the centre and are designed to empower the children with essential skill sets and to connect them to their STEAM knowledge. The lesson plans for these activities were developed such that the educators in PPIS could continue with these activities after the initial run by the SIT student mentors.\nchevron--up\nOn-going\nInspiring STEM education in secondary schools through SIT’s YES!Programme\nSIT’s annual Young Engineers’ Space Programme\n(YES!Programme) was first conceived in October 2016. It aims to create a positive and enriching service-learning environment for SIT’s undergraduates. The four-month programme allows SIT undergraduates to hone their mentorship skills and inspire secondary school students to learn more about STEM. YES!Programme allows secondary school students to pick up new knowledge and skills in robotics, programming, 3D printing, and food technology (chocolate making).\nTo date, more than 100 Secondary 3 and 4 students from Tanglin Secondary School and Yusof Ishak Secondary School have taken part and benefitted from the programme. These students are from the Normal Academic (NA)/ Normal Technical (NT) streams and are also from underprivileged families. They have been supported by close to 60 SITizen mentors.\nAssociate Professor (A/P) Victor Wang Peng Cheng (Engineering) in partnership with CLASIC has led the YES!Programme since 2019. The programme was conceived by SIT President Professor Tan Thiam Soon and a former SIT colleague, Dr Cheong Kang Hao in 2016. Lian Ho Lee Construction starting funding the programme in 2017 and the donation amounted to $300,000 over a period of four years.\nchevron--up\nE-BOOK\nDownload Our e-Book\nchevron--up\nOur team\nProfessor Yaacob Ibrahim\nAdvisor, Community Leadership And Social Innovation Centre (CLASIC)\nDr Intan Azura Mokhtar (Associate Professor)\nDirector, Community Leadership And Social Innovation Centre (CLASIC)\nMr Dan Chia\nDeputy Director, Community Leadership and Social Innovation Centre (CLASIC)\nMs Lim Xin Yi\nCentre Manager, Community Leadership And Social Innovation Centre (CLASIC)\nMs Raudhah Binte Razali\nSenior Assistant Manager, Community Leadership And Social Innovation Centre (CLASIC)\nMs Claudya Clara Boru Hombing\nAssistant Manager, Community Leadership And Social Innovation Centre (CLASIC)\nMs Lim Sock Hwee\nAssistant Manager, Community Leadership And Social Innovation Centre (CLASIC)\n$(document).ready(function() {\n\n$( \".horizontal-tab-button\" ).click(function() {\n$('.slick-slider').slick('refresh');\n});\n\n});\nGet in Touch\nConnect with us to discover how you can get started on community projects.\nEmail CLASIC\n$(document).ready(function() {\n\n$( \".horizontal-tab-button, .drupal-horizontal-tabs summary\" ).click(function() {\nconsole.log(\"...\");\n$('.slick-slider').slick('refresh');\n});\n\n});"
  ],
  "links": [
    "https://www.singaporetech.edu.sg/innovate/clasic#main-content",
    "https://www.singaporetech.edu.sg/about/punggol-campus",
    "https://www.singaporetech.edu.sg/openhouse?utm_source=quick-links&utm_medium=cta&utm_campaign=oh-2024",
    "https://www.singaporetech.edu.sg/iwsp10",
    "https://www.singaporetech.edu.sg/about/careers",
    "https://libguides.singaporetech.edu.sg/library",
    "https://students.singaporetech.edu.sg/",
    "https://sitsingaporetechedu.sharepoint.com/sites/Staff",
    "https://alumni.singaporetech.edu.sg/",
    "https://www.singaporetech.edu.sg",
    "https://www.singaporetech.edu.sg/digitalnewsroom/",
    "https://www.singaporetech.edu.sg/search",
    "https://www.singaporetech.edu.sg/about",
    "https://www.singaporetech.edu.sg/about/presidents-welcome",
    "https://www.singaporetech.edu.sg/about/our-mission-and-vision",
    "https://www.singaporetech.edu.sg/about/our-values-and-sitizen-dna",
    "https://www.singaporetech.edu.sg/about/our-history",
    "https://www.singaporetech.edu.sg/about/overseas-university-partners",
    "https://www.singaporetech.edu.sg/about/punggol-campus",
    "https://www.singaporetech.edu.sg/sustainability",
    "https://www.singaporetech.edu.sg/about/leadership",
    "https://www.singaporetech.edu.sg/about/leadership#board-of-trustees",
    "https://www.singaporetech.edu.sg/about/leadership#senior-management",
    "https://www.singaporetech.edu.sg/about/leadership#academic-leadership",
    "https://www.singaporetech.edu.sg/about/academic-clusters",
    "https://www.singaporetech.edu.sg/business-communication-and-design",
    "https://www.singaporetech.edu.sg/engineering",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology",
    "https://www.singaporetech.edu.sg/health-and-social-sciences",
    "https://www.singaporetech.edu.sg/infocomm-technology",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/annual-report",
    "https://www.singaporetech.edu.sg/sitizen-buzz/",
    "https://www.singaporetech.edu.sg/careers",
    "https://www.singaporetech.edu.sg/moe-start-scheme",
    "https://www.singaporetech.edu.sg/directory",
    "https://www.singaporetech.edu.sg/directory/professional-officers",
    "https://www.singaporetech.edu.sg/procurement-opportunities",
    "https://www.singaporetech.edu.sg/campus-locations",
    "https://www.singaporetech.edu.sg/campus-wayfinder",
    "https://www.singaporetech.edu.sg/frequently-asked-question",
    "https://www.singaporetech.edu.sg/contact-us",
    "https://www.singaporetech.edu.sg/admissions/undergraduate",
    "https://www.singaporetech.edu.sg/admissions/undergraduate/requirements",
    "https://www.singaporetech.edu.sg/admissions/undergraduate/matriculation",
    "https://www.singaporetech.edu.sg/admissions/undergraduate/tuition-fees",
    "https://www.singaporetech.edu.sg/admissions/financial-aid",
    "https://www.singaporetech.edu.sg/admissions/scholarships",
    "https://www.singaporetech.edu.sg/admissions/undergraduate/early-admissions-exercise",
    "https://www.singaporetech.edu.sg/admissions/undergraduate/returning-nsmen",
    "https://www.singaporetech.edu.sg/admissions/undergraduate/readmissions-transfers-and-deferments",
    "https://www.singaporetech.edu.sg/admissions/admissions-faqs",
    "https://www.singaporetech.edu.sg/admissions/undergraduate/mailing-list",
    "https://www.singaporetech.edu.sg/admissions/postgraduate",
    "https://www.singaporetech.edu.sg/admissions/postgraduate/requirements",
    "https://www.singaporetech.edu.sg/admissions/postgraduate/matriculation",
    "https://www.singaporetech.edu.sg/admissions/postgraduate/tuition-fees",
    "https://www.singaporetech.edu.sg/admissions/financial-aid",
    "https://www.singaporetech.edu.sg/admissions/scholarships",
    "https://www.singaporetech.edu.sg/frequently-asked-question?tag=Admissions&tab=2",
    "https://www.singaporetech.edu.sg/why-sit",
    "https://www.singaporetech.edu.sg/why-sit/our-philosophy",
    "https://www.singaporetech.edu.sg/why-sit/applied-learning",
    "https://www.singaporetech.edu.sg/about/academic-clusters",
    "https://www.singaporetech.edu.sg/why-sit/university-programme-structure",
    "https://www.singaporetech.edu.sg/news/upward-trend-salaries-and-healthy-employment-outcomes-mark-sits-decade-impact",
    "https://www.singaporetech.edu.sg/sustainability-education",
    "https://www.singaporetech.edu.sg/undergraduate-programmes",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/aerospace-and-aviation-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/allied-health-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/building-and-infrastructure-engineering-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/business-and-management-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/chemical-engineering-tum",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/design-and-media-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/digital-supply-chain",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/electrical-and-electronics-engineering-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/food-technology",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/information-and-digital-technology-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/mechanical-engineering-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/nursing-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/pharmaceutical-engineering",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/systems-engineering-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/transport-engineering-degrees",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/postgraduate/coursework",
    "https://www.singaporetech.edu.sg/postgraduate/research",
    "https://www.singaporetech.edu.sg/academic-bulletin",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/sitlearn/",
    "https://www.singaporetech.edu.sg/csm",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/centre-communication-skills",
    "https://www.singaporetech.edu.sg/about/centre-digital-enablement-code",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy",
    "https://www.singaporetech.edu.sg/life-at-sit",
    "https://www.singaporetech.edu.sg/life-at-sit/get-career-ready",
    "https://www.singaporetech.edu.sg/life-at-sit/global-experience",
    "https://www.singaporetech.edu.sg/life-at-sit/life-campus",
    "https://www.singaporetech.edu.sg/life-at-sit/find-your-tribe",
    "https://www.singaporetech.edu.sg/life-at-sit/life-readiness",
    "https://www.singaporetech.edu.sg/life-at-sit/student-wellness",
    "https://www.singaporetech.edu.sg/life-at-sit/facilities",
    "https://www.singaporetech.edu.sg/research#programmes",
    "https://www.singaporetech.edu.sg/research#community-health-transformation",
    "https://www.singaporetech.edu.sg/research#sustainable-food-innovation",
    "https://www.singaporetech.edu.sg/research#energy-resilience",
    "https://www.singaporetech.edu.sg/research#sustainable-infrastructure-engineering-maintenance",
    "https://www.singaporetech.edu.sg/research#sustainable-maritime-engineering",
    "https://www.singaporetech.edu.sg/research#technology-enablers",
    "https://www.singaporetech.edu.sg/research#artificial-intelligence",
    "https://www.singaporetech.edu.sg/research#cybersecurity",
    "https://www.singaporetech.edu.sg/research#augmented-virtual-reality",
    "https://www.singaporetech.edu.sg/research#5g-future-communications",
    "https://www.singaporetech.edu.sg/research#robotics-autonomous-systems",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/cite",
    "https://www.singaporetech.edu.sg/innovate/ctil",
    "https://www.singaporetech.edu.sg/energy-efficiency-technology-centre",
    "https://www.singaporetech.edu.sg/innohub",
    "https://www.singaporetech.edu.sg/sit-x-nvidia-ai-centre-snaic",
    "https://foodplant.com.sg/",
    "https://www.singaporetech.edu.sg/research/FCTLab",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/DesignFactory",
    "https://www.singaporetech.edu.sg/namic-hub",
    "https://www.singaporetech.edu.sg/RaPID",
    "https://www.singaporetech.edu.sg/sit-poly-innovation-centre-excellence-spice",
    "https://www.singaporetech.edu.sg/research",
    "https://www.singaporetech.edu.sg/research/research-integrity-committee",
    "https://www.singaporetech.edu.sg/research/institutional-review-board",
    "https://www.singaporetech.edu.sg/research/institutional-animal-care-and-use-committee",
    "https://www.singaporetech.edu.sg/research/institutional-biosafety-committee",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/research/tto",
    "https://www.singaporetech.edu.sg/innovate/clasic#all",
    "https://www.singaporetech.edu.sg/innovate/clasic#news",
    "https://www.singaporetech.edu.sg/giving#what-you-can-support",
    "https://www.singaporetech.edu.sg/giving#support-student-excellence",
    "https://www.singaporetech.edu.sg/giving#support-student-financial-aid",
    "https://www.singaporetech.edu.sg/giving#support-applied-research-and-academic-initiatives",
    "https://www.singaporetech.edu.sg/giving#support-professorships",
    "https://www.singaporetech.edu.sg/giving#SIT-Punggol-campus",
    "https://www.singaporetech.edu.sg/giving#legacy-giving",
    "https://www.singaporetech.edu.sg/giving#alumni-giving",
    "https://www.singaporetech.edu.sg/giving#faculty-staff-giving",
    "https://www.singaporetech.edu.sg/giving#the-gift-that-keeps-on-giving",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/giving",
    "https://www.singaporetech.edu.sg/giving/news",
    "https://www.singaporetech.edu.sg/giving/news?category=5496",
    "https://www.singaporetech.edu.sg/giving/news?category=5491",
    "https://www.singaporetech.edu.sg/one-sitizen-fund",
    "https://www.singaporetech.edu.sg/about",
    "https://www.singaporetech.edu.sg/about/presidents-welcome",
    "https://www.singaporetech.edu.sg/about/our-mission-and-vision",
    "https://www.singaporetech.edu.sg/about/our-values-and-sitizen-dna",
    "https://www.singaporetech.edu.sg/about/our-history",
    "https://www.singaporetech.edu.sg/about/overseas-university-partners",
    "https://www.singaporetech.edu.sg/about/punggol-campus",
    "https://www.singaporetech.edu.sg/sustainability",
    "https://www.singaporetech.edu.sg/about/leadership",
    "https://www.singaporetech.edu.sg/about/leadership#board-of-trustees",
    "https://www.singaporetech.edu.sg/about/leadership#senior-management",
    "https://www.singaporetech.edu.sg/about/leadership#academic-leadership",
    "https://www.singaporetech.edu.sg/about/academic-clusters",
    "https://www.singaporetech.edu.sg/business-communication-and-design",
    "https://www.singaporetech.edu.sg/engineering",
    "https://www.singaporetech.edu.sg/food-chemical-and-biotechnology",
    "https://www.singaporetech.edu.sg/health-and-social-sciences",
    "https://www.singaporetech.edu.sg/infocomm-technology",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/annual-report",
    "https://www.singaporetech.edu.sg/sitizen-buzz/",
    "https://www.singaporetech.edu.sg/careers",
    "https://www.singaporetech.edu.sg/moe-start-scheme",
    "https://www.singaporetech.edu.sg/directory",
    "https://www.singaporetech.edu.sg/directory/professional-officers",
    "https://www.singaporetech.edu.sg/procurement-opportunities",
    "https://www.singaporetech.edu.sg/campus-locations",
    "https://www.singaporetech.edu.sg/campus-wayfinder",
    "https://www.singaporetech.edu.sg/frequently-asked-question",
    "https://www.singaporetech.edu.sg/contact-us",
    "https://www.singaporetech.edu.sg/admissions/undergraduate",
    "https://www.singaporetech.edu.sg/admissions/undergraduate/requirements",
    "https://www.singaporetech.edu.sg/admissions/undergraduate/matriculation",
    "https://www.singaporetech.edu.sg/admissions/undergraduate/tuition-fees",
    "https://www.singaporetech.edu.sg/admissions/financial-aid",
    "https://www.singaporetech.edu.sg/admissions/scholarships",
    "https://www.singaporetech.edu.sg/admissions/undergraduate/early-admissions-exercise",
    "https://www.singaporetech.edu.sg/admissions/undergraduate/returning-nsmen",
    "https://www.singaporetech.edu.sg/admissions/undergraduate/readmissions-transfers-and-deferments",
    "https://www.singaporetech.edu.sg/admissions/admissions-faqs",
    "https://www.singaporetech.edu.sg/admissions/undergraduate/mailing-list",
    "https://www.singaporetech.edu.sg/admissions/postgraduate",
    "https://www.singaporetech.edu.sg/admissions/postgraduate/requirements",
    "https://www.singaporetech.edu.sg/admissions/postgraduate/matriculation",
    "https://www.singaporetech.edu.sg/admissions/postgraduate/tuition-fees",
    "https://www.singaporetech.edu.sg/admissions/financial-aid",
    "https://www.singaporetech.edu.sg/admissions/scholarships",
    "https://www.singaporetech.edu.sg/frequently-asked-question?tag=Admissions&tab=2",
    "https://www.singaporetech.edu.sg/why-sit",
    "https://www.singaporetech.edu.sg/why-sit/our-philosophy",
    "https://www.singaporetech.edu.sg/why-sit/applied-learning",
    "https://www.singaporetech.edu.sg/about/academic-clusters",
    "https://www.singaporetech.edu.sg/why-sit/university-programme-structure",
    "https://www.singaporetech.edu.sg/news/upward-trend-salaries-and-healthy-employment-outcomes-mark-sits-decade-impact",
    "https://www.singaporetech.edu.sg/sustainability-education",
    "https://www.singaporetech.edu.sg/undergraduate-programmes",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/aerospace-and-aviation-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/allied-health-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/building-and-infrastructure-engineering-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/business-and-management-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/chemical-engineering-tum",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/design-and-media-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/digital-supply-chain",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/electrical-and-electronics-engineering-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/food-technology",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/information-and-digital-technology-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/mechanical-engineering-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/nursing-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/pharmaceutical-engineering",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/systems-engineering-degrees",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/transport-engineering-degrees",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/postgraduate/coursework",
    "https://www.singaporetech.edu.sg/postgraduate/research",
    "https://www.singaporetech.edu.sg/academic-bulletin",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/sitlearn/",
    "https://www.singaporetech.edu.sg/csm",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/centre-communication-skills",
    "https://www.singaporetech.edu.sg/about/centre-digital-enablement-code",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy",
    "https://www.singaporetech.edu.sg/life-at-sit",
    "https://www.singaporetech.edu.sg/life-at-sit/get-career-ready",
    "https://www.singaporetech.edu.sg/life-at-sit/global-experience",
    "https://www.singaporetech.edu.sg/life-at-sit/life-campus",
    "https://www.singaporetech.edu.sg/life-at-sit/find-your-tribe",
    "https://www.singaporetech.edu.sg/life-at-sit/life-readiness",
    "https://www.singaporetech.edu.sg/life-at-sit/student-wellness",
    "https://www.singaporetech.edu.sg/life-at-sit/facilities",
    "https://www.singaporetech.edu.sg/research#programmes",
    "https://www.singaporetech.edu.sg/research#community-health-transformation",
    "https://www.singaporetech.edu.sg/research#sustainable-food-innovation",
    "https://www.singaporetech.edu.sg/research#energy-resilience",
    "https://www.singaporetech.edu.sg/research#sustainable-infrastructure-engineering-maintenance",
    "https://www.singaporetech.edu.sg/research#sustainable-maritime-engineering",
    "https://www.singaporetech.edu.sg/research#technology-enablers",
    "https://www.singaporetech.edu.sg/research#artificial-intelligence",
    "https://www.singaporetech.edu.sg/research#cybersecurity",
    "https://www.singaporetech.edu.sg/research#augmented-virtual-reality",
    "https://www.singaporetech.edu.sg/research#5g-future-communications",
    "https://www.singaporetech.edu.sg/research#robotics-autonomous-systems",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/cite",
    "https://www.singaporetech.edu.sg/innovate/ctil",
    "https://www.singaporetech.edu.sg/energy-efficiency-technology-centre",
    "https://www.singaporetech.edu.sg/innohub",
    "https://www.singaporetech.edu.sg/sit-x-nvidia-ai-centre-snaic",
    "https://foodplant.com.sg/",
    "https://www.singaporetech.edu.sg/research/FCTLab",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/DesignFactory",
    "https://www.singaporetech.edu.sg/namic-hub",
    "https://www.singaporetech.edu.sg/RaPID",
    "https://www.singaporetech.edu.sg/sit-poly-innovation-centre-excellence-spice",
    "https://www.singaporetech.edu.sg/research",
    "https://www.singaporetech.edu.sg/research/research-integrity-committee",
    "https://www.singaporetech.edu.sg/research/institutional-review-board",
    "https://www.singaporetech.edu.sg/research/institutional-animal-care-and-use-committee",
    "https://www.singaporetech.edu.sg/research/institutional-biosafety-committee",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/research/tto",
    "https://www.singaporetech.edu.sg/about",
    "https://www.singaporetech.edu.sg/admissions",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/research",
    "https://www.singaporetech.edu.sg/digitalnewsroom/",
    "https://www.singaporetech.edu.sg/giving",
    "https://www.singaporetech.edu.sg/about/punggol-campus",
    "https://www.singaporetech.edu.sg/openhouse?utm_source=quick-links&utm_medium=cta&utm_campaign=oh-2024",
    "https://www.singaporetech.edu.sg/iwsp10",
    "https://www.singaporetech.edu.sg/about/careers",
    "https://libguides.singaporetech.edu.sg/library",
    "https://students.singaporetech.edu.sg/",
    "https://sitsingaporetechedu.sharepoint.com/sites/Staff",
    "https://alumni.singaporetech.edu.sg/",
    "https://www.singaporetech.edu.sg/giving#what-you-can-support",
    "https://www.singaporetech.edu.sg/giving#support-student-excellence",
    "https://www.singaporetech.edu.sg/giving#support-student-financial-aid",
    "https://www.singaporetech.edu.sg/giving#support-applied-research-and-academic-initiatives",
    "https://www.singaporetech.edu.sg/giving#support-professorships",
    "https://www.singaporetech.edu.sg/giving#SIT-Punggol-campus",
    "https://www.singaporetech.edu.sg/giving#legacy-giving",
    "https://www.singaporetech.edu.sg/giving#alumni-giving",
    "https://www.singaporetech.edu.sg/giving#faculty-staff-giving",
    "https://www.singaporetech.edu.sg/giving#the-gift-that-keeps-on-giving",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/giving",
    "https://www.singaporetech.edu.sg/giving/news",
    "https://www.singaporetech.edu.sg/giving/news?category=5496",
    "https://www.singaporetech.edu.sg/giving/news?category=5491",
    "https://www.singaporetech.edu.sg/one-sitizen-fund",
    "https://www.singaporetech.edu.sg/",
    "https://www.singaporetech.edu.sg/innovate/clasic",
    "https://www.singaporetech.edu.sg/NACE",
    "mailto:SIT.NACE@singaporetech.edu.sg",
    "https://www.singaporetech.edu.sg/media/clasic-projects-e-book",
    "mailto:SIT.CLASIC@singaporetech.edu.sg",
    "https://learner.singaporetech.edu.sg/",
    "https://www.google.com/maps/place/Singapore+Institute+of+Technology+(SIT)+-+Punggol/@1.41364,103.91229,14z/data=!4m6!3m5!1s0x31da1515bfb2d263:0xc71c56458ac08497!8m2!3d1.4136399!4d103.9122896!16s%2Fg%2F11t42h3wb_",
    "https://www.singaporetech.edu.sg/contact-us",
    "https://www.singaporetech.edu.sg/campus-locations",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.linkedin.com/company/singapore-institute-of-technology",
    "https://www.youtube.com/user/SingaporeTech",
    "https://www.tiktok.com/@singaporetech",
    "https://www.singaporetech.edu.sg/privacy-policy",
    "https://www.singaporetech.edu.sg/safety-and-health-policy",
    "https://www.singaporetech.edu.sg/social-media-guidelines",
    "https://www.singaporetech.edu.sg/terms-use",
    "https://www.singaporetech.edu.sg/whistleblowing"
  ],
  "images": [
    "/sites/default/files/2024-12/%5BFA%5D%20%20SIT%20One%20SITizen%20Alumni%20Initiative_Web%20banner_1244px%20x%20688px.jpg",
    "/sites/default/files/2024-12/%5BFA%5D%20%20SIT%20One%20SITizen%20Alumni%20Initiative_Web%20banner_1244px%20x%20688px.jpg",
    "/sites/default/files/styles/full_width_large/public/2020-11/CLASIC%20Hero%20Image.jpg?h=d1cb525d&itok=FG5BQofv",
    "/sites/default/files/2024-11/Social%20Innovation%20Project%20Module%20group%20photo%201.JPG",
    "/sites/default/files/2024-11/Social%20Innovation%20Project%20Module%20group%20photo%203_0.jpg",
    "/sites/default/files/2024-11/Social%20Innovation%20Project%20Module%20student%20booths%202.JPG",
    "/sites/default/files/2024-11/Social%20Innovation%20Project%20Module%20student%20booths%204.JPG",
    "/sites/default/files/2024-11/Social%20Innovation%20Project%20Module%20student%20booths%206.JPG",
    "/sites/default/files/2024-11/Social%20Innovation%20Project%20Module%20group%20photo%202.jpg",
    "/sites/default/files/2024-11/Social%20Innovation%20Project%20Module%20student%20booths%201.JPG",
    "/sites/default/files/2024-11/Social%20Innovation%20Project%20Module%20student%20booths%203.JPG",
    "/sites/default/files/2024-11/Social%20Innovation%20Project%20Module%20student%20booths%205.JPG",
    "/sites/default/files/2024-11/Social%20Innovation%20Project%20Module%20student%20artifacts.JPG",
    "/sites/default/files/2024-05/story-reading.png",
    "/sites/default/files/2021-10/Kwong%20Wai%20Shiu%20Hospital.jpg",
    "/sites/default/files/2020-11/AMK.jpg",
    "/sites/default/files/2021-10/Seniors-corner-project.jpg",
    "/sites/default/files/2024-05/water-for-life.jpg",
    "/sites/default/files/2023-04/1920_blooboxlaunch-1920x1080.jpg",
    "/sites/default/files/2021-10/YES%21Program%202_.jpg"
  ]
}