{
  "url": "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/collaborations/educational-research/publications?page=0",
  "title": "Publications - STLA Research - SIT",
  "meta": {
    "description": "View all works published, conducted or supported by SIT Teaching and Learning Academy (STLA) that are related to educational research and the scholarship of teaching and learning.",
    "keywords": null
  },
  "text_lines": [
    "Skip to main content",
    "Menu primary",
    "About STLA",
    "Dropdown",
    "Teaching Resources",
    "Dropdown",
    "CBE Hub",
    "Academic Development",
    "Dropdown",
    "Collaborations",
    "Dropdown",
    "Grants & Awards",
    "Dropdown",
    "Events",
    "Dropdown",
    "Contact Us",
    "STLA Leaders' Message",
    "What We Do",
    "Our People",
    "Tech-Enhanced Learning",
    "Teaching Guides",
    "Assessment",
    "Learning Environment",
    "Teaching Induction Programme",
    "Teaching Foundation Programme",
    "Teaching Anchoring Programme",
    "Tech 4 Teaching",
    "Coaching & Mentoring",
    "Student Resources",
    "Educational Research",
    "T&L Showcase",
    "Applied Learning and Innovation Grant (ALIGN)",
    "MOE Tertiary Education Research Fund",
    "Teaching Excellence Award",
    "Student Developer Award",
    "Applied Learning Conference",
    "Academic Staff Retreat",
    "Teaching & Learning Conferences",
    "SIT Teaching and Learning Academy",
    "Menu primary",
    "About STLA",
    "Dropdown",
    "STLA Leaders' Message",
    "What We Do",
    "Our People",
    "Teaching Resources",
    "Dropdown",
    "Tech-Enhanced Learning",
    "Teaching Guides",
    "Assessment",
    "Learning Environment",
    "CBE Hub",
    "Academic Development",
    "Dropdown",
    "Teaching Induction Programme",
    "Teaching Foundation Programme",
    "Teaching Anchoring Programme",
    "Tech 4 Teaching",
    "Coaching & Mentoring",
    "Collaborations",
    "Dropdown",
    "Student Resources",
    "Educational Research",
    "T&L Showcase",
    "Grants & Awards",
    "Dropdown",
    "Applied Learning and Innovation Grant (ALIGN)",
    "MOE Tertiary Education Research Fund",
    "Teaching Excellence Award",
    "Student Developer Award",
    "Events",
    "Dropdown",
    "Applied Learning Conference",
    "Academic Staff Retreat",
    "Teaching & Learning Conferences",
    "Contact Us",
    "/* Hide this component */\n    #block-webmastercustomcss {\n        display: none;\n    }\n\n    #block-webmastercustomjs {\n        display: none;\n    }\n\n    /* Page with 50/50 image and text (Use background:contain in CMS) */\n    @media screen and (min-width: 720px) {\n        .layout--suite--twocols.layout--column-gap--remove.layout--background-size--contain .layout__region.layout__region--second {\n            display: flex;\n            align-items: center;\n            justify-content: center;\n            background: #eeeeee;\n            padding: 0 5rem !important;\n        }\n    }\n    @media screen and (max-width: 720px) {\n        .layout--twocol.layout--background-size--contain.layout--column-gap--added.layout--column-width--50-50.layout--align-items--start .grid--layout--suite {\n            display: flex;\n            flex-wrap: wrap;\n            flex-direction: column-reverse;\n        }\n    }\n    .layout--twocol.layout--background-size--contain.layout--column-gap--added.layout--column-width--50-50.layout--align-items--start .grid--layout--suite .layout__region--second {\n        margin-bottom: 1.5rem;\n    }\n    .layout--twocol.layout--background-size--contain.layout--column-gap--added.layout--column-width--50-50.layout--align-items--start .grid--layout--suite .layout__region--first {\n        margin-bottom: 0;\n    }\n    @media screen and (max-width: 720px) {\n        .layout--background--light-grey.layout--top-padding--xl {\n            padding-top: 2.5rem !important;\n        }\n        .layout--background--light-grey.layout--bottom-padding--xl {\n            padding-bottom: 2.5rem !important;\n        }\n    }\n\n    /* Custom External Links */\n    .externalCustomLink {\n        border-bottom: 0;\n    }\n    .externalCustomLink span {\n        border-bottom: 1px solid currentColor;\n    }\n\n    /* Custom Our People Profile Template */\n    .ourPeopleProfiles .mobileView {\n        display: none;\n    }\n\n    .ourPeopleProfiles .desktopView {\n        display: block;\n    }\n\n    @media only screen and (max-width: 769px) {\n        .ourPeopleProfiles .mobileView {\n            display: block;\n            padding-bottom: 30px;\n        }\n\n        .ourPeopleProfiles .desktopView {\n            display: none;\n        }\n    }\n\n    .ourPeopleProfiles .profile-article__description {\n        padding-top: 1rem;\n        white-space: nowrap;\n    }\n\n    /* Global Profile Template */\n    .profile-pad {\n        padding-top: 1rem;\n    }\n\n    .profile-article__description {\n        padding-top: 1rem;\n    }\n\n    .profile-card__avatar img {\n        border-radius: 7.5rem;\n    }\n\n    /* Global Video */\n    video {\n        position: absolute;\n        top: 0;\n        left: 0;\n        width: 100%;\n        height: 100%;\n    }\n\n    /* Testimonial Split Custom */\n    .padContent {\n        padding-right: 1rem;\n        padding-left: 1rem;\n        padding-bottom: 0;\n    }\n\n    .testimonial_split {\n        padding-top: 30px;\n    }\n\n    .testimonial_split ul .quote {\n        margin-bottom: 0px;\n    }\n\n    /* Description below masthead */\n    .descriptionTxt {\n        width: 70%;\n    }\n\n    @media only screen and (max-width: 769px) {\n        .descriptionTxt {\n            width: 100%;\n        }\n    }\n\n    /* Custom CoLEAD Banner on non template page*/\n    .coleadBanner {\n        padding: 64px 0px 64px 0px;\n    }\n    @media only screen and (max-width: 769px) {\n        .coleadBanner {\n            padding: 20px 0px 20px 0px;\n        }\n    }\n\n    @media (min-width: 57.5rem) {\n        .horizontal-tabs .horizontal-tabs-list li {\n            -webkit-box-flex: 0;\n            -ms-flex: 0 0 16%;\n            flex: 0 0 16%;\n        }\n    }\n\t\n\t.background__color--dark-grey::after {\n\t\tbackground-color: #323232;\n\t}\n\t\n\t.align-self-center {\n\t\tpadding: 5rem;\n\t}\n\t@media screen and (max-width: 920px)\n\t{\n\t\t.align-self-center {\n\t\t\tpadding: 0rem !important;\n\t\t}\n\t}\n\t\n\t\n\t/* Coach and mentoring table*/\n\t.candmTable th:first-child {\n\t\twidth: 20%;\n\t}\n\t.candmTable th:nth-child(2) {\n\t\twidth: 10%;\n\t}\n\t.candmTable th:nth-child(3) {\n\t\twidth: 23%;\n\t}\n\t.candmTable th:nth-child(4) {\n\t\twidth: 47%;\n\t}\n\t\n\t@media only screen and (max-width: 769px) {\n        .candmTable th {\n\t\t\twidth: 12rem!important;\n\t\t}\n    }",
    "$(document).ready(function () {\t\n        $(\"#watch-video-colead\").click(function () {\n\t\t\tsetTimeout(function () {\n\t\t\t\tvar vid = document.getElementById(\"colead-video\");\n\t\t\t\t$(\"#cboxClose\").click(function (e) {\n\t\t\t\t\tvid.pause();\n\t\t\t\t});\n\t\t\t}, 500);\n        }); \n\t\t\n\t\tsetTimeout(function () {\n\t\t\tif ($('#ac-item-learning-designers').attr('data-active') == \"true\") {\n\t\t\t\tdocument.getElementById(\"ac-item-learning-designers\").style.height = \"100%\";\n\t\t\t} else if ($('#ac-item-learning-analysts').attr('data-active') == \"true\") {\n\t\t\t\tdocument.getElementById(\"ac-item-learning-analysts\").style.height = \"100%\";\n\t\t\t} else if ($('#ac-item-adventurelearn').attr('data-active') == \"true\") {\n\t\t\t\tdocument.getElementById(\"ac-item-adventurelearn\").style.height = \"100%\";\n\t\t\t} else if ($('#ac-item-admin-and-planning').attr('data-active') == \"true\") {\n\t\t\t\tdocument.getElementById(\"ac-item-admin-and-planning\").style.height = \"100%\";\n\t\t\t} else if ($('#ac-item-director-and-deputy-directors').attr('data-active') == \"true\") {\n\t\t\t\tdocument.getElementById(\"ac-item-director-and-deputy-directors\").style.height = \"100%\";\n\t\t\t} else if ($('#ac-item-educational-media-producers').attr('data-active') == \"true\") {\n\t\t\t\tdocument.getElementById(\"ac-item-educational-media-producers\").style.height = \"100%\";\n\t\t\t} else if ($('#ac-item-quests').attr('data-active') == \"true\") {\n\t\t\t\tdocument.getElementById(\"ac-item-quests\").style.height = \"100%\";\n\t\t\t}\n\t\t}, 500);\n\t\t\n\t\t\n\t\t$( \".accordion__li\" ).on( \"click\", function() {\n\t\t\tsetTimeout(function () {\n\t\t\t\tif ($('#ac-item-learning-designers').attr('data-active') == \"true\") {\n\t\t\t\t\tdocument.getElementById(\"ac-item-learning-designers\").style.height = \"100%\";\n\t\t\t\t} else if ($('#ac-item-learning-analysts').attr('data-active') == \"true\") {\n\t\t\t\t\tdocument.getElementById(\"ac-item-learning-analysts\").style.height = \"100%\";\n\t\t\t\t} else if ($('#ac-item-adventurelearn').attr('data-active') == \"true\") {\n\t\t\t\t\tdocument.getElementById(\"ac-item-adventurelearn\").style.height = \"100%\";\n\t\t\t\t} else if ($('#ac-item-admin-and-planning').attr('data-active') == \"true\") {\n\t\t\t\t\tdocument.getElementById(\"ac-item-admin-and-planning\").style.height = \"100%\";\n\t\t\t\t} else if ($('#ac-item-director-and-deputy-directors').attr('data-active') == \"true\") {\n\t\t\t\t\tdocument.getElementById(\"ac-item-director-and-deputy-directors\").style.height = \"100%\";\n\t\t\t\t} else if ($('#ac-item-educational-media-producers').attr('data-active') == \"true\") {\n\t\t\t\t\tdocument.getElementById(\"ac-item-educational-media-producers\").style.height = \"100%\";\n\t\t\t\t} else if ($('#ac-item-quests').attr('data-active') == \"true\") {\n\t\t\t\t\tdocument.getElementById(\"ac-item-quests\").style.height = \"100%\";\n\t\t\t\t}\n\t\t\t}, 700);\n\t\t});\n    });",
    "Home",
    "Educational Research",
    "Publications",
    "Publications",
    "View some of SIT and STLA-supported publications related to educational research",
    "Highlighted Publication",
    "Coaching Students in Higher Education: A Solution-Focused Approach to Retention, Performance and Wellbeing",
    "Routledge, 2024",
    "May Sok Mui Lim, Nadya Shaznay Patel, Ramesh Shahdadpuri",
    "This practical guide for educators in higher education encourages readers to ask effective coaching questions and apply relevant coaching techniques to empower and engage students to grow and perform at their best.",
    "Filled with authentic examples and handy tips, the book takes readers from the ‘how to’ of coaching, through the practicalities, challenges and honing of existing skills and new capabilities. The authors recognise that in educators’ daily encounters and interactions with students, there are many timely coachable moments for authentic learning. These opportunities can enable students to learn beyond what is squarely in their curriculum and develop their own pathways to become work-ready graduates. Through coaching, educators help students discover more about themselves while guiding them to innovate and generate solutions to perceived and real-world problems. This guide offers in depth discussions along with tools and tips to provide invaluable guidance for educators to get acquainted with the key skills needed to coach students for success in various academic and professional contexts. The content covers multiple varied scenarios, from classrooms and assignments, to internships and group work, and highlights various coaching opportunities with practical strategies.",
    "This is a resourceful text for educators, teachers and professionals working in higher education and learning institutions. It provides training material for institutions that want to conduct faculty development programmes to prepare educators for effective coaching conversations in their universities.",
    "VIEW BOOK",
    "Applied Learning in Higher Education: Perspective, Pedagogy, and Practice",
    "Informing Science, 2020",
    "Sok Mui Lim, Yong Lim Foo, Han Tong Loh, Xudong Deng",
    "Today, “all institutions of higher education almost everywhere in the world have been influenced by the concept of globalisation. The resulting policy changes in each nation-state have, of course, reflected the degree of the impact of globalisation on the country, hence the changes in higher education.” (Banya, 2005, p.147). This points to globalisation shaping knowledge production as well as the spread of intentional and continuous waves of innovation. The effects of globalisation on education can be seen through a) the changing paradigm from a closed system to a more open system, and b) the changing approach from a teacher-centred learning environment to that of a learner-centred environment. This changing approach culminates in the broader ideas of ‘applied learning’ through a) a productive view of learning versus the reproductive view of learning, b) constructivist versus behaviourist, c) learning facilitation versus teaching, and d) process-based assessment versus outcome-based assessment (Rudic, 2016).",
    "VIEW E-BOOK",
    "VIEW E-BOOK (FOR SIT STAFF ONLY)",
    "All Publications",
    "Showing",
    "1",
    "-",
    "6",
    "of",
    "31",
    "results",
    "User engagement with interactive educational videos: Relations with task value, cognitive load, and learning satisfaction",
    "International Journal of Instruction, 2024",
    "Xiao-Feng Kenan Kok, Peng Cheng Wang, Avnit Karin, Shukla Monika",
    "Interactive educational videos have grown in popularity in the higher education setting over the last two decades. This exploratory study investigates the mediating and moderating effects of user engagement (UE) on the relationships between the antecedents of UE (i.e., intrinsic load, extraneous load, germane load, and task value) and learning satisfaction. A cross-sectional survey study was conducted in June 2023. We conveniently sampled 49 year-one undergraduate students, who completed a self-report questionnaire consisting of items pertaining to cognitive load, task value, user engagement, and learning satisfaction. Data was analysed using hierarchical linear regression models. Findings revealed that reward fully mediated the relationship between germane load and learning satisfaction. In addition, reward was also found to moderate the relation between (a) germane load and learning satisfaction, and (b) task value and learning satisfaction. These findings highlight the importance of creating rewarding experiences when designing interactive educational videos.",
    "Launch",
    "VIEW PAPER",
    "Students’ approaches to learning (SAL) and their relations to burnout among university freshmen in Singapore",
    "Discover Psychology, 2024",
    "Xiao-Feng Kenan Kok, Shermain Puah, Ching Yee Pua, Oran Zane Devilly, Sok Mui Lim",
    "Assessing students’ approaches to learning (SAL) is crucial for evaluating their critical thinking abilities and subject domain comprehension. A deep approach and organised studying have been linked to lower study-related burnout, while an unrefective approach is associated with elevated levels of burnout. Despite evidence of the SAL–burnout connection, limited research exists on the bidirectional relationship between the two constructs. This study aims to fll this research gap by analysing changes in SAL and burnout during the freshmen year and determining whether there exists a reciprocal relationship between these constructs. Freshmen data was collected from two cohorts (Cohort 1, n=261; Cohort 2, n=216) at the beginning and end of their frst year. Findings revealed increased overall burnout, exhaustion, cynicism, and inadequacy from T1 to T2 in both cohorts. Deep approach decreased across T1 and T2 in both cohorts, while organised studying decreased in Cohort 1 but remained unchanged in Cohort 2. Conversely, unrefective approach decreased in Cohort 1 but increased in Cohort 2. Bidirectionality between SAL and burnout was observed in both cohorts, indicating that higher unrefective approach could lead to increased cynicism, and vice-versa. These fndings highlight the importance of recognizing the interplay between unrefective approach and cynicism for interventions targeting reduction in unrefective approaches and emphasizes the need to consider the potential unintended consequences of heightening freshmen’s cynical attitudes towards studying when attempting to reduce unrefective approach.",
    "Launch",
    "VIEW PAPER",
    "The longitudinal study on the reciprocal effects between GPA and burnout in university students: exploring grit, self-efficacy, and resilience as moderators",
    "Frontiers in Education, 2024",
    "Shermain Puah, Sok Mui Lim, Xiao-Feng Kenan Kok, Oran Devilly",
    "The current work aims to extend our understanding of the relationship between academic performance and burnout. Using longitudinal data collected from 521 students enrolled in a Singapore-based university from their freshmen year up to the end of year two, we examined the temporal order of the GPA-burnout relation to determine if there is a reciprocal relation between students’ burnout and academic performance. Grit, grit-passion, grit-perseverance, self-efficacy, and resilience were tested as moderating factors that were thought to potentially exacerbate, or protect against, the negative effects between GPA and burnout. Employing a panel analysis by means of SEM revealed that the relationship between GPA and burnout in our data is one where higher GPA contributes to worse burnout. Of all the moderating factors, only grit-passion was found to moderate the relationship between GPA and burnout, indicating that this relationship also depended on whether one has high or low grit-passion. In practice, our findings imply that high-achieving students are at risk of experiencing burnout due to excessive pressure and constant striving for better performance, but cultivating passion and enjoyment for academic activities can serve as a protective factor against burnout.",
    "Launch",
    "VIEW PAPER",
    "Struggles and coping mechanisms of at-risk university freshmen in Singapore: Revisiting Schlossberg’s Transition Theory",
    "Asian Journal of the Scholarship of Teaching and Learning, 2024",
    "Ching Yee Pua, Jamil Jasin, Ingrid M. Wilson, Sok Mui Lim",
    "While adapting to a completely new learning environment, first-year university students who are less academically inclined and lacking emotional regulation can easily be overwhelmed by independent learning, complex subject matter, and a heavy workload. Such challenges of transitioning into university can compound and lead to student disengagement. The current study aims to understand how at-risk students transitioned into a university in Singapore in the months after their transition. Interview data regarding perceptions, support systems, and study strategies of 13 at-risk students were collected and analysed. Schlossberg’s Transition Theory was used as a theoretical foundation to discuss the findings of this paper within the wider literature and propose recommendations for educators. Three themes emerged: (1) the role of peers, (2) struggles of university learning, and (3) coping strategies. Overall, university freshmen were aware of their need to adapt to the demands of university learning, but remained overwhelmed with academic demands, struggled with self-directed learning and time management, and hence, reported a drop in self-efficacy and motivation. This was combatted to an extent by employing solution- and emotion-focused coping strategies. Peers were also highlighted as important sources of support in exchanging knowledge and reducing emotional distress. Implications for educators are highlighted in supporting at-risk students.",
    "Launch",
    "VIEW PAPER",
    "Shaping future-ready graduates with mindset shifts: studying the impact of integrating critical and design thinking in design innovation education",
    "Frontiers in Education, 2024",
    "Nadya Shaznay Patel, Shermain Puah, Xiao-Feng Kenan Kok",
    "In an era marked by rapid change and complex global challenges, Institutes of Higher Learning (IHLs) are tasked with preparing students to navigate and address these evolving demands. This paper explores the critical role of Higher Education (HE) in equipping students with the necessary skills and mindsets to tackle real-world problems through innovative solutions. Integrating critical thinking and design thinking within a Design Innovation module is central to this exploration. The study is undergirded by a conceptual framework that blends critical, design, and futures thinking, focusing exclusively in this paper on applying critical thinking (CT) and design thinking (DT). The research investigates two primary questions: (1) How do students’ DT and CT mindsets change after participation in a Design Innovation module? (2) Is CT a prerequisite for developing DT? This study aims to illuminate the shifts in students’ mindsets from before to after the completion of the module, highlighting the importance of developing key dispositions for ethical and socially responsible problem-solving. Results show a statistically significant increase in CT and DT disposition scores from pre- to post-test, suggesting a shift to more positive CT and DT mindsets after going through the Design Innovation module. In addition, a significant moderation effect of pre-test CT mindset on the relationship between pre-test and post-test DT mindset scores was observed, implying that CT was a prerequisite for DT. The findings offer insights into the module’s effectiveness in fostering future-ready graduates’ thinking capabilities on innovating for real-world challenges and highlight the need for our future-ready students to achieve critical competence and creative confidence. Finally, we conclude the paper with recommendations for educators to integrate CT skill development intentionally and in tandem with DT skill development for a balanced approach to developing critical competence and creative confidence in interdisciplinary courses.",
    "Launch",
    "VIEW PAPER",
    "Evaluating digital and teacher support, student engagement, and learner satisfaction in a flipped engineering mechanics classroom",
    "17th Annual University of Glasgow Learning & Teaching Conference, 2024",
    "Christian Della, Gareth Peevers, Jian Huei Choo, Chee Ming Ong, Xiao-Feng Kenan Kok, Vicki Dale and Jolly Atit Shah",
    "The implementation of a flipped classroom approach in engineering education is gaining prominence, where lectures are delivered online, and in-class time is dedicated to active learning. The effectiveness of this model , however, is dependent on the quality and quantity provided by digital and teacher resources . This study presents the design, implementation, and evaluation of a flipped classroom model within an Engineering Mechanics module, involving 180 first-year students in the Mechanical and Aerospace Engineering Programme jointly offered by the Singapore Institute of Technology (SIT) and the University of Glasgow (UofG). This initiative is a pilot delivery of a blended learning approach for the SIT-UofG programmes in Singapore, that involves a collaboration between the University of Glasgow Singapore (UGS), UofG and SIT. The online learning materials include various learning resources, such as video lectures, online quizzes, readings, and discussion forum. The face-to-face (F2F) components take place in the classroom after students have completed the online learning contents. The F2F components aim to engage learners in the process of internalizing and building their knowledge through teacher facilitated team-based and project-based activities, while encouraging learner-learner and learner-instructor interactions.",
    "Launch",
    "VIEW PAPER",
    "PREV",
    "1",
    "2",
    "3",
    "4",
    "5",
    "6",
    "Next",
    "Learn More With SIT Teaching and Learning Academy",
    "arrow--right",
    "Educational Research",
    "Educational research uses formal approaches to collect, analyse data and share findings.",
    "arrow--right",
    "Contact STLA",
    "Connect with us to request support for or start a discussion about the teaching practice at SIT.",
    "Address",
    "1 Punggol Coast Road Singapore 828608",
    "EMAIL:",
    "SIT-STLA@SingaporeTech.edu.sg",
    "Visiting SIT",
    "Our Campus Locations",
    "Academic Policies",
    "Privacy Policy",
    "Safety and Health",
    "Social Media Guidelines",
    "Terms of Use",
    "Whistleblowing",
    "Copyright ©",
    "2025",
    "Singapore Institute of Technology. All Rights Reserved.",
    ".contact-link2 a:link,  .contact-link2 a:visited {\n    border-bottom:0px;\n}",
    "{\"path\":{\"baseUrl\":\"\\/sit-teaching-and-learning-academy\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/696\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\",\"currentQuery\":{\"page\":\"0\"}},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"colorbox\":{\"transition\":\"elastic\",\"speed\":350,\"opacity\":0.84999999999999998,\"slideshow\":false,\"slideshowAuto\":true,\"slideshowSpeed\":2500,\"slideshowStart\":\"start slideshow\",\"slideshowStop\":\"stop slideshow\",\"current\":\"{current} of {total}\",\"previous\":\"\\u00ab Prev\",\"next\":\"Next \\u00bb\",\"close\":\"Close\",\"overlayClose\":true,\"returnFocus\":true,\"maxWidth\":\"80%\",\"maxHeight\":\"80%\",\"initialWidth\":\"1%\",\"initialHeight\":\"1%\",\"fixed\":true,\"scrolling\":true,\"mobiledetect\":false,\"mobiledevicewidth\":\"480px\"},\"lazyLoadUrl\":\"\\/sit-teaching-and-learning-academy\\/term_reference_fancytree\\/subTree\",\"user\":{\"uid\":0,\"permissionsHash\":\"3bc7ad8576e0696dfffbfe5669f5676386743020d0582b90454e62ec0119381b\"}}"
  ],
  "desc_divs": [
    "Interactive educational videos have grown in popularity in the higher education setting over the last two decades. This exploratory study investigates the mediating and moderating effects of user engagement (UE) on the relationships between the antecedents of UE (i.e., intrinsic load, extraneous load, germane load, and task value) and learning satisfaction. A cross-sectional survey study was conducted in June 2023. We conveniently sampled 49 year-one undergraduate students, who completed a self-report questionnaire consisting of items pertaining to cognitive load, task value, user engagement, and learning satisfaction. Data was analysed using hierarchical linear regression models. Findings revealed that reward fully mediated the relationship between germane load and learning satisfaction. In addition, reward was also found to moderate the relation between (a) germane load and learning satisfaction, and (b) task value and learning satisfaction. These findings highlight the importance of creating rewarding experiences when designing interactive educational videos.",
    "Assessing students’ approaches to learning (SAL) is crucial for evaluating their critical thinking abilities and subject domain comprehension. A deep approach and organised studying have been linked to lower study-related burnout, while an unrefective approach is associated with elevated levels of burnout. Despite evidence of the SAL–burnout connection, limited research exists on the bidirectional relationship between the two constructs. This study aims to fll this research gap by analysing changes in SAL and burnout during the freshmen year and determining whether there exists a reciprocal relationship between these constructs. Freshmen data was collected from two cohorts (Cohort 1, n=261; Cohort 2, n=216) at the beginning and end of their frst year. Findings revealed increased overall burnout, exhaustion, cynicism, and inadequacy from T1 to T2 in both cohorts. Deep approach decreased across T1 and T2 in both cohorts, while organised studying decreased in Cohort 1 but remained unchanged in Cohort 2. Conversely, unrefective approach decreased in Cohort 1 but increased in Cohort 2. Bidirectionality between SAL and burnout was observed in both cohorts, indicating that higher unrefective approach could lead to increased cynicism, and vice-versa. These fndings highlight the importance of recognizing the interplay between unrefective approach and cynicism for interventions targeting reduction in unrefective approaches and emphasizes the need to consider the potential unintended consequences of heightening freshmen’s cynical attitudes towards studying when attempting to reduce unrefective approach.",
    "The current work aims to extend our understanding of the relationship between academic performance and burnout. Using longitudinal data collected from 521 students enrolled in a Singapore-based university from their freshmen year up to the end of year two, we examined the temporal order of the GPA-burnout relation to determine if there is a reciprocal relation between students’ burnout and academic performance. Grit, grit-passion, grit-perseverance, self-efficacy, and resilience were tested as moderating factors that were thought to potentially exacerbate, or protect against, the negative effects between GPA and burnout. Employing a panel analysis by means of SEM revealed that the relationship between GPA and burnout in our data is one where higher GPA contributes to worse burnout. Of all the moderating factors, only grit-passion was found to moderate the relationship between GPA and burnout, indicating that this relationship also depended on whether one has high or low grit-passion. In practice, our findings imply that high-achieving students are at risk of experiencing burnout due to excessive pressure and constant striving for better performance, but cultivating passion and enjoyment for academic activities can serve as a protective factor against burnout.",
    "While adapting to a completely new learning environment, first-year university students who are less academically inclined and lacking emotional regulation can easily be overwhelmed by independent learning, complex subject matter, and a heavy workload. Such challenges of transitioning into university can compound and lead to student disengagement. The current study aims to understand how at-risk students transitioned into a university in Singapore in the months after their transition. Interview data regarding perceptions, support systems, and study strategies of 13 at-risk students were collected and analysed. Schlossberg’s Transition Theory was used as a theoretical foundation to discuss the findings of this paper within the wider literature and propose recommendations for educators. Three themes emerged: (1) the role of peers, (2) struggles of university learning, and (3) coping strategies. Overall, university freshmen were aware of their need to adapt to the demands of university learning, but remained overwhelmed with academic demands, struggled with self-directed learning and time management, and hence, reported a drop in self-efficacy and motivation. This was combatted to an extent by employing solution- and emotion-focused coping strategies. Peers were also highlighted as important sources of support in exchanging knowledge and reducing emotional distress. Implications for educators are highlighted in supporting at-risk students.",
    "In an era marked by rapid change and complex global challenges, Institutes of Higher Learning (IHLs) are tasked with preparing students to navigate and address these evolving demands. This paper explores the critical role of Higher Education (HE) in equipping students with the necessary skills and mindsets to tackle real-world problems through innovative solutions. Integrating critical thinking and design thinking within a Design Innovation module is central to this exploration. The study is undergirded by a conceptual framework that blends critical, design, and futures thinking, focusing exclusively in this paper on applying critical thinking (CT) and design thinking (DT). The research investigates two primary questions: (1) How do students’ DT and CT mindsets change after participation in a Design Innovation module? (2) Is CT a prerequisite for developing DT? This study aims to illuminate the shifts in students’ mindsets from before to after the completion of the module, highlighting the importance of developing key dispositions for ethical and socially responsible problem-solving. Results show a statistically significant increase in CT and DT disposition scores from pre- to post-test, suggesting a shift to more positive CT and DT mindsets after going through the Design Innovation module. In addition, a significant moderation effect of pre-test CT mindset on the relationship between pre-test and post-test DT mindset scores was observed, implying that CT was a prerequisite for DT. The findings offer insights into the module’s effectiveness in fostering future-ready graduates’ thinking capabilities on innovating for real-world challenges and highlight the need for our future-ready students to achieve critical competence and creative confidence. Finally, we conclude the paper with recommendations for educators to integrate CT skill development intentionally and in tandem with DT skill development for a balanced approach to developing critical competence and creative confidence in interdisciplinary courses.",
    "The implementation of a flipped classroom approach in engineering education is gaining prominence, where lectures are delivered online, and in-class time is dedicated to active learning. The effectiveness of this model , however, is dependent on the quality and quantity provided by digital and teacher resources . This study presents the design, implementation, and evaluation of a flipped classroom model within an Engineering Mechanics module, involving 180 first-year students in the Mechanical and Aerospace Engineering Programme jointly offered by the Singapore Institute of Technology (SIT) and the University of Glasgow (UofG). This initiative is a pilot delivery of a blended learning approach for the SIT-UofG programmes in Singapore, that involves a collaboration between the University of Glasgow Singapore (UGS), UofG and SIT. The online learning materials include various learning resources, such as video lectures, online quizzes, readings, and discussion forum. The face-to-face (F2F) components take place in the classroom after students have completed the online learning contents. The F2F components aim to engage learners in the process of internalizing and building their knowledge through teacher facilitated team-based and project-based activities, while encouraging learner-learner and learner-instructor interactions.",
    "Educational research uses formal approaches to collect, analyse data and share findings.",
    "Educational research uses formal approaches to collect, analyse data and share findings.",
    "Connect with us to request support for or start a discussion about the teaching practice at SIT.",
    "Connect with us to request support for or start a discussion about the teaching practice at SIT."
  ],
  "article_texts": [
    "Publications\nView some of SIT and STLA-supported publications related to educational research\nHighlighted Publication\nCoaching Students in Higher Education: A Solution-Focused Approach to Retention, Performance and Wellbeing\nRoutledge, 2024\nMay Sok Mui Lim, Nadya Shaznay Patel, Ramesh Shahdadpuri\nThis practical guide for educators in higher education encourages readers to ask effective coaching questions and apply relevant coaching techniques to empower and engage students to grow and perform at their best.\nFilled with authentic examples and handy tips, the book takes readers from the ‘how to’ of coaching, through the practicalities, challenges and honing of existing skills and new capabilities. The authors recognise that in educators’ daily encounters and interactions with students, there are many timely coachable moments for authentic learning. These opportunities can enable students to learn beyond what is squarely in their curriculum and develop their own pathways to become work-ready graduates. Through coaching, educators help students discover more about themselves while guiding them to innovate and generate solutions to perceived and real-world problems. This guide offers in depth discussions along with tools and tips to provide invaluable guidance for educators to get acquainted with the key skills needed to coach students for success in various academic and professional contexts. The content covers multiple varied scenarios, from classrooms and assignments, to internships and group work, and highlights various coaching opportunities with practical strategies.\nThis is a resourceful text for educators, teachers and professionals working in higher education and learning institutions. It provides training material for institutions that want to conduct faculty development programmes to prepare educators for effective coaching conversations in their universities.\nVIEW BOOK\nApplied Learning in Higher Education: Perspective, Pedagogy, and Practice\nInforming Science, 2020\nSok Mui Lim, Yong Lim Foo, Han Tong Loh, Xudong Deng\nToday, “all institutions of higher education almost everywhere in the world have been influenced by the concept of globalisation. The resulting policy changes in each nation-state have, of course, reflected the degree of the impact of globalisation on the country, hence the changes in higher education.” (Banya, 2005, p.147). This points to globalisation shaping knowledge production as well as the spread of intentional and continuous waves of innovation. The effects of globalisation on education can be seen through a) the changing paradigm from a closed system to a more open system, and b) the changing approach from a teacher-centred learning environment to that of a learner-centred environment. This changing approach culminates in the broader ideas of ‘applied learning’ through a) a productive view of learning versus the reproductive view of learning, b) constructivist versus behaviourist, c) learning facilitation versus teaching, and d) process-based assessment versus outcome-based assessment (Rudic, 2016).\nVIEW E-BOOK\nVIEW E-BOOK (FOR SIT STAFF ONLY)\nAll Publications\nShowing\n1\n-\n6\nof\n31\nresults\nUser engagement with interactive educational videos: Relations with task value, cognitive load, and learning satisfaction\nInternational Journal of Instruction, 2024\nXiao-Feng Kenan Kok, Peng Cheng Wang, Avnit Karin, Shukla Monika\nInteractive educational videos have grown in popularity in the higher education setting over the last two decades. This exploratory study investigates the mediating and moderating effects of user engagement (UE) on the relationships between the antecedents of UE (i.e., intrinsic load, extraneous load, germane load, and task value) and learning satisfaction. A cross-sectional survey study was conducted in June 2023. We conveniently sampled 49 year-one undergraduate students, who completed a self-report questionnaire consisting of items pertaining to cognitive load, task value, user engagement, and learning satisfaction. Data was analysed using hierarchical linear regression models. Findings revealed that reward fully mediated the relationship between germane load and learning satisfaction. In addition, reward was also found to moderate the relation between (a) germane load and learning satisfaction, and (b) task value and learning satisfaction. These findings highlight the importance of creating rewarding experiences when designing interactive educational videos.\nLaunch\nVIEW PAPER\nStudents’ approaches to learning (SAL) and their relations to burnout among university freshmen in Singapore\nDiscover Psychology, 2024\nXiao-Feng Kenan Kok, Shermain Puah, Ching Yee Pua, Oran Zane Devilly, Sok Mui Lim\nAssessing students’ approaches to learning (SAL) is crucial for evaluating their critical thinking abilities and subject domain comprehension. A deep approach and organised studying have been linked to lower study-related burnout, while an unrefective approach is associated with elevated levels of burnout. Despite evidence of the SAL–burnout connection, limited research exists on the bidirectional relationship between the two constructs. This study aims to fll this research gap by analysing changes in SAL and burnout during the freshmen year and determining whether there exists a reciprocal relationship between these constructs. Freshmen data was collected from two cohorts (Cohort 1, n=261; Cohort 2, n=216) at the beginning and end of their frst year. Findings revealed increased overall burnout, exhaustion, cynicism, and inadequacy from T1 to T2 in both cohorts. Deep approach decreased across T1 and T2 in both cohorts, while organised studying decreased in Cohort 1 but remained unchanged in Cohort 2. Conversely, unrefective approach decreased in Cohort 1 but increased in Cohort 2. Bidirectionality between SAL and burnout was observed in both cohorts, indicating that higher unrefective approach could lead to increased cynicism, and vice-versa. These fndings highlight the importance of recognizing the interplay between unrefective approach and cynicism for interventions targeting reduction in unrefective approaches and emphasizes the need to consider the potential unintended consequences of heightening freshmen’s cynical attitudes towards studying when attempting to reduce unrefective approach.\nLaunch\nVIEW PAPER\nThe longitudinal study on the reciprocal effects between GPA and burnout in university students: exploring grit, self-efficacy, and resilience as moderators\nFrontiers in Education, 2024\nShermain Puah, Sok Mui Lim, Xiao-Feng Kenan Kok, Oran Devilly\nThe current work aims to extend our understanding of the relationship between academic performance and burnout. Using longitudinal data collected from 521 students enrolled in a Singapore-based university from their freshmen year up to the end of year two, we examined the temporal order of the GPA-burnout relation to determine if there is a reciprocal relation between students’ burnout and academic performance. Grit, grit-passion, grit-perseverance, self-efficacy, and resilience were tested as moderating factors that were thought to potentially exacerbate, or protect against, the negative effects between GPA and burnout. Employing a panel analysis by means of SEM revealed that the relationship between GPA and burnout in our data is one where higher GPA contributes to worse burnout. Of all the moderating factors, only grit-passion was found to moderate the relationship between GPA and burnout, indicating that this relationship also depended on whether one has high or low grit-passion. In practice, our findings imply that high-achieving students are at risk of experiencing burnout due to excessive pressure and constant striving for better performance, but cultivating passion and enjoyment for academic activities can serve as a protective factor against burnout.\nLaunch\nVIEW PAPER\nStruggles and coping mechanisms of at-risk university freshmen in Singapore: Revisiting Schlossberg’s Transition Theory\nAsian Journal of the Scholarship of Teaching and Learning, 2024\nChing Yee Pua, Jamil Jasin, Ingrid M. Wilson, Sok Mui Lim\nWhile adapting to a completely new learning environment, first-year university students who are less academically inclined and lacking emotional regulation can easily be overwhelmed by independent learning, complex subject matter, and a heavy workload. Such challenges of transitioning into university can compound and lead to student disengagement. The current study aims to understand how at-risk students transitioned into a university in Singapore in the months after their transition. Interview data regarding perceptions, support systems, and study strategies of 13 at-risk students were collected and analysed. Schlossberg’s Transition Theory was used as a theoretical foundation to discuss the findings of this paper within the wider literature and propose recommendations for educators. Three themes emerged: (1) the role of peers, (2) struggles of university learning, and (3) coping strategies. Overall, university freshmen were aware of their need to adapt to the demands of university learning, but remained overwhelmed with academic demands, struggled with self-directed learning and time management, and hence, reported a drop in self-efficacy and motivation. This was combatted to an extent by employing solution- and emotion-focused coping strategies. Peers were also highlighted as important sources of support in exchanging knowledge and reducing emotional distress. Implications for educators are highlighted in supporting at-risk students.\nLaunch\nVIEW PAPER\nShaping future-ready graduates with mindset shifts: studying the impact of integrating critical and design thinking in design innovation education\nFrontiers in Education, 2024\nNadya Shaznay Patel, Shermain Puah, Xiao-Feng Kenan Kok\nIn an era marked by rapid change and complex global challenges, Institutes of Higher Learning (IHLs) are tasked with preparing students to navigate and address these evolving demands. This paper explores the critical role of Higher Education (HE) in equipping students with the necessary skills and mindsets to tackle real-world problems through innovative solutions. Integrating critical thinking and design thinking within a Design Innovation module is central to this exploration. The study is undergirded by a conceptual framework that blends critical, design, and futures thinking, focusing exclusively in this paper on applying critical thinking (CT) and design thinking (DT). The research investigates two primary questions: (1) How do students’ DT and CT mindsets change after participation in a Design Innovation module? (2) Is CT a prerequisite for developing DT? This study aims to illuminate the shifts in students’ mindsets from before to after the completion of the module, highlighting the importance of developing key dispositions for ethical and socially responsible problem-solving. Results show a statistically significant increase in CT and DT disposition scores from pre- to post-test, suggesting a shift to more positive CT and DT mindsets after going through the Design Innovation module. In addition, a significant moderation effect of pre-test CT mindset on the relationship between pre-test and post-test DT mindset scores was observed, implying that CT was a prerequisite for DT. The findings offer insights into the module’s effectiveness in fostering future-ready graduates’ thinking capabilities on innovating for real-world challenges and highlight the need for our future-ready students to achieve critical competence and creative confidence. Finally, we conclude the paper with recommendations for educators to integrate CT skill development intentionally and in tandem with DT skill development for a balanced approach to developing critical competence and creative confidence in interdisciplinary courses.\nLaunch\nVIEW PAPER\nEvaluating digital and teacher support, student engagement, and learner satisfaction in a flipped engineering mechanics classroom\n17th Annual University of Glasgow Learning & Teaching Conference, 2024\nChristian Della, Gareth Peevers, Jian Huei Choo, Chee Ming Ong, Xiao-Feng Kenan Kok, Vicki Dale and Jolly Atit Shah\nThe implementation of a flipped classroom approach in engineering education is gaining prominence, where lectures are delivered online, and in-class time is dedicated to active learning. The effectiveness of this model , however, is dependent on the quality and quantity provided by digital and teacher resources . This study presents the design, implementation, and evaluation of a flipped classroom model within an Engineering Mechanics module, involving 180 first-year students in the Mechanical and Aerospace Engineering Programme jointly offered by the Singapore Institute of Technology (SIT) and the University of Glasgow (UofG). This initiative is a pilot delivery of a blended learning approach for the SIT-UofG programmes in Singapore, that involves a collaboration between the University of Glasgow Singapore (UGS), UofG and SIT. The online learning materials include various learning resources, such as video lectures, online quizzes, readings, and discussion forum. The face-to-face (F2F) components take place in the classroom after students have completed the online learning contents. The F2F components aim to engage learners in the process of internalizing and building their knowledge through teacher facilitated team-based and project-based activities, while encouraging learner-learner and learner-instructor interactions.\nLaunch\nVIEW PAPER\nPREV\n1\n2\n3\n4\n5\n6\nNext\nLearn More With SIT Teaching and Learning Academy\narrow--right\nEducational Research\nEducational research uses formal approaches to collect, analyse data and share findings.\narrow--right\nContact STLA\nConnect with us to request support for or start a discussion about the teaching practice at SIT.\nAddress\n1 Punggol Coast Road Singapore 828608\nEMAIL:\nSIT-STLA@SingaporeTech.edu.sg\nVisiting SIT\nOur Campus Locations\nAcademic Policies\nPrivacy Policy\nSafety and Health\nSocial Media Guidelines\nTerms of Use\nWhistleblowing\nCopyright ©\n2025\nSingapore Institute of Technology. All Rights Reserved.\n.contact-link2 a:link,  .contact-link2 a:visited {\n    border-bottom:0px;\n}"
  ],
  "links": [
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/collaborations/educational-research/publications?page=0#main-content",
    "https://www.singaporetech.edu.sg/",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/cbe-hub",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/contact",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/about-stla/stla-leaders-message",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/about-stla/what-we-do",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/about-stla/our-people",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/teaching-resources/tech-enhanced-learning",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/teaching-resources/teaching-guides",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/teaching-resources/assessment",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/teaching-resources/learning-environment",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/academic-development/TIP",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/academic-development/TFP",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/academic-development/TAPAS",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/academic-development/T4T",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/academic-development/coaching-and-mentoring",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/collaborations/student-resources",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/collaborations/educational-research",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/collaborations/t-and-l-showcase",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/grants-and-awards/ALIGN",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/grants-and-awards/MOE-TRF",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/grants-and-awards/teaching-awards",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/grants-and-awards/student-developer-awards",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/events/applied-learning-conference",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/events/academic-staff-retreat",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/events/teaching-and-learning-conferences",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/search/node",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/about-stla/stla-leaders-message",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/about-stla/what-we-do",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/about-stla/our-people",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/teaching-resources/tech-enhanced-learning",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/teaching-resources/teaching-guides",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/teaching-resources/assessment",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/teaching-resources/learning-environment",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/cbe-hub",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/academic-development/TIP",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/academic-development/TFP",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/academic-development/TAPAS",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/academic-development/T4T",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/academic-development/coaching-and-mentoring",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/collaborations/student-resources",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/collaborations/educational-research",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/collaborations/t-and-l-showcase",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/grants-and-awards/ALIGN",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/grants-and-awards/MOE-TRF",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/grants-and-awards/teaching-awards",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/grants-and-awards/student-developer-awards",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/events/applied-learning-conference",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/events/academic-staff-retreat",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/events/teaching-and-learning-conferences",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/contact",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/collaborations/educational-research",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/collaborations/educational-research/publications?page=0",
    "https://www.routledge.com/Coaching-Students-in-Higher-Education-A-Solution-Focused-Approach-to-Retention-Performance-and-Wellbeing/Lim-Patel-Shahdadpuri/p/book/9781032364698",
    "https://play.google.com/store/books/details?pcampaignid=books_read_action&id=XfzADwAAQBAJ",
    "https://sitsingaporetechedu.sharepoint.com/sites/stla/User%20Guides/Resources/Applied_Learning_in_Higher_Education_eBook.pdf",
    "https://www.e-iji.net/dosyalar/iji_2024_4_26.pdf",
    "https://link.springer.com/article/10.1007/s44202-024-00218-2",
    "https://www.frontiersin.org/journals/education/articles/10.3389/feduc.2024.1408058/full",
    "https://ctlt.nus.edu.sg/ajsotl/ajsotl-volume-14-no-1/pua-et-al/",
    "https://www.frontiersin.org/journals/education/articles/10.3389/feduc.2024.1358431/full",
    "https://easychair.org/smart-program/LTConf24/2024-04-09.html#talk:245901",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/collaborations/educational-research/publications?page=1",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/collaborations/educational-research/publications?page=2",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/collaborations/educational-research/publications?page=3",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/collaborations/educational-research/publications?page=4",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/collaborations/educational-research/publications?page=5",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/collaborations/educational-research/publications?page=1",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/about-stla/what-we-do/educational-research",
    "https://www.singaporetech.edu.sg/sit-teaching-and-learning-academy/contact",
    "https://www.google.com/maps/place/Singapore+Institute+of+Technology+(SIT)+-+Punggol/@1.41364,103.91229,14z/data=!4m6!3m5!1s0x31da1515bfb2d263:0xc71c56458ac08497!8m2!3d1.4136399!4d103.9122896!16s%2Fg%2F11t42h3wb_",
    "mailto:SIT-CoLEAD@SingaporeTech.edu.sg",
    "https://www.singaporetech.edu.sg/campus-locations",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.linkedin.com/company/singapore-institute-of-technology",
    "https://www.youtube.com/user/SingaporeTech",
    "https://www.tiktok.com/@singaporetech",
    "https://www.singaporetech.edu.sg/academic-policies",
    "https://www.singaporetech.edu.sg/privacy-policy",
    "https://www.singaporetech.edu.sg/safety-and-health-policy",
    "https://www.singaporetech.edu.sg/social-media-guidelines",
    "https://www.singaporetech.edu.sg/terms-use",
    "https://www.singaporetech.edu.sg/whistleblowing"
  ],
  "images": [
    "/sit-teaching-and-learning-academy/sites/colead/files/styles/full_width_large/public/2021-02/publications-masthead.jpg?itok=jjehJcwc",
    "/sit-teaching-and-learning-academy/sites/colead/files/2024-08/Coaching%20Students%20in%20Higher%20Education.jpg",
    "/sit-teaching-and-learning-academy/sites/colead/files/2021-06/Applied%20Learning%20in%20Higher%20Education.jpg"
  ]
}