{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/paving%20the%20way.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  09/12\nFuture recipients of the Singapore\nChinese Chamber of Commerce Foundation (SCCCF) Scholarship will not only be getting financial support for their studies at the Singapore Institute of Technology (SIT) – the SCCCF Scholarship also comes with a complimentary year-long membership with the Singapore Chinese Chamber of Commerce & Industry (SCCCI), giving them the opportunity to rub shoulders with local business leaders.\nThis is one of the more unique features\nof the SCCCF Scholarship, which was made possible with an endowed gift from SCCCF in September 2016. Beginning in Academic Year (AY) 2017/18 onwards, two scholarships will be awarded each academic year, and will be tenable for up to three years.\nTo thank them for this gift, Prof Tan\nThiam Soon, President, SIT, hosted Mr Roland Ng, President of the 59th Council, SCCCI, and Mr Adrian Peh, Chairman of the Culture, Education & Community Affairs Committee, SCCCI for a lunch at the SIT@Dover campus on 12 July 2017. Also present for the lunch was Prof Loh Han Tong, Deputy President (Academic) & Provost, and SIT faculty, staff and students. Paving the Way for SITizen Entrepreneurs\nAn endowed gift from the SCCCF allows SIT to establish a scholarship to inspire student excellence and it\ncomes with the opportunity to interact with SCCCI members\nSIT students Ms Arisha Melati bte\nAbdulah and Mr Pang Yao Yi, took part in the Biomedical Engineering Society (Singapore) – Society of Engineers for the Community Students’ Design Competition held at the BES 11th Scientific Meeting, were both rewarded for their efforts to design a low cost and Engineering Students\nDesign Award-Winning\nRehabilitation DevicesSIT students win prizes at the Biomedical\nEngineering Society (Singapore) – Society of Engineers for the Community Students’ Design Competition held at the BES 11th Scientific Meeting\nAt the lunch, Prof Tan said that “the Singapore Chinese Chamber of Commerce Foundation under SCCCI has been very impactful in its work in supporting the Singapore community through education, and SIT is truly honoured to count the Foundation as one of our key philanthropic partners.”\nEstablished in 1966, the SCCCF\ncontributes to the community development of Singapore by promoting educational, cultural, community and charitable activities.\nMs Arisha Melati binte Abdulah (left) and Mr Pang\nYao Yi, with their prizes at the Biomedical Engineering Society (Singapore) 11th Scientific Meeting.Mr Adrian Peh, Chairman of the Culture, Education & Community Affairs Committee, SCCCI (left), is greeted by SIT student, Mr Raymond Lim, from the Sustainable Infrastructure Engineering (Building Services) programme.(from left) SIT students, Ms Cheng Wei Bin, Mr Raymond Lim; Prof Loh Han Tong, Deputy President (Academic) & Provost, SIT, Mr Roland Ng, President of the 59th Council, SCCCI, Prof Tan Thiam Soon, President, SIT,\nMr Adrian Peh, Chairman of the Culture, Education & Community Affairs Committee, SCCCI, SIT student\nMr Derrick Teo and Prof Chiew Sing Ping, Programme Director (Civil Engineering), SIT\nMr Roland Ng, President, SCCCI (left) receives a token of appreciation from Prof Tan Thiam Soon, President, SIT.\neasily deployable device. The former\nreceived a Best Poster Award, and the latter was presented with a Gold Award.\nWorking with the Singapore General\nHospital, Ms Arisha, who is from the Mechatronics programme, designed a wearable device to measure posture deviation in patients with Parkinson’s disease. This will help physiotherapists better monitor and assess the improvements made by their patients. She spent some time observing the physiotherapists at work in the Parkinson’s disease clinic who currently use measuring tapes to estimate the angle of deviation. She said, “This project has sparked a newfound interest in the biomedical engineering industry for me.”\nMr Pang, who is from the Mechanical\nDesign Engineering and worked with Kwong Wai Shiu Hospital to develop a device to strengthen the hip abductor muscle, said what really motivated him was “the fact that a patient could benefit directly” from his hard work. “It gave me a great sense of responsibility – students have a big part to play in shaping the communities around us and I am grateful to have been able to do my part,” he added.\nAsst Prof Desmond Chong, Engineering,\nSIT, who supervised the two students, said, “The scientific meeting is a good platform for our students to learn from their peers and to showcase their projects to a larger audience.”\nAltogether, 10 teams including\nthose from the National University of Singapore, Nanyang Technological University and SIT were shortlisted to present their projects at the competition."
}