{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-09/%5BFA%5D%20SIT%20AR%202024_07_Sustainability.pdf",
  "type": "pdf",
  "content": "Ocean Imagineer – Residency at ArtScience Museum\nBusiness, Communication and Design’s A/Prof Cesar Jung-Harada was offered a\nresidency at the ArtScience Museum, where he hosted a series of workshops centred\naround renewable energy sources, indigenous and cutting-edge naval architecture,\nas well as futuristic and more sustainable seafaring technologies.\nSingapore International Energy Week (SIEW) 2023\nThinktank Roundtable\nCollaborating with the Singapore Green\nBuilding Council, Energy Efficiency\nTechnology Centre’s Prof Lock Kai Sang\nled a roundtable discussion at SIEW 2023\nto explore solutions for achieving net\nzero buildings.Inaugural run of the Minor in Environmental\nSustainability (MES)\nStudents from the Electrical Power Engineering and Engineering Systems programmes\ncompared key environmental indicators, discussed carbon accounting, life-cycle\nassessment and sustainability reporting, and analysed the improvement strategies\nto reach their carbon reduction emission goals.\nInaugural run of the “Introduction to Sustainability\nfor Businesses”\nDeveloped in collaboration with the Association of Small & Medium Enterprises\n(ASME), participating companies were given a comprehensive overview, covering\nthe history of sustainability, why it matters, and the actionable steps in reporting\nand emissions reduction.\nLaunch of sustainability e-Module “Introduction to\nSustainability – Working Towards a Sustainable Future”\nTo educate staff on the Environmental, Social and Governance (ESG) pillars of\nsustainability in SIT, this e-Module was launched to teach practical ways individuals\ncan integrate sustainable practices into their work and personal lives.SUSTAINABILITY\nPhoto: Marina Bay SandsWe are championing sustainability by integrating\nrenewable energy solutions, sustainable food\nsystems and green building practices into our\nteaching, research and campus life./31\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024"
}