{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-09/%5BFA%5D%20SIT%20AR%202024_01_Chairman%27s%20Message.pdf",
  "type": "pdf",
  "content": "EMPOWERING LIFELONG LEARNING\nTHROUGH INNOVATION\nWe are proud to share that SITLEARN, our lifelong learning\ndivision has upskilled and reskilled over 20,000 Continuing\nEducation and Training (CET) learners in 10 out of the 23 sectors\nof the Industry Transformation Maps. Some notable innovations\nby SITLEARN include curating workshops and courses for the\noil, petrochemicals, energy and chemicals sectors, financial\ninstitutions, and healthcare and semiconductors sectors. We\nhave also partnered with MINDEF’s Digital Intelligence Service,\nSMRT, and Kwong Wai Shiu Hospital to train and upskill their\nemployees to meet industry needs. Commissioned by the\nMinistry of Health, we also trained sector-wide occupational\ntherapists, physiotherapists and speech therapists under\nthe National One-Rehabilitation Framework to cater to\nthe clinical needs of the ageing population. We have also\nsupported small and medium-sized enterprises (SMEs) with\ninitiatives such as the Innovation Leadership Programme,\nand a Sustainability-101 workshop with the Association of\nSmall and Medium Enterprises (ASME). The same year also\nsaw us support the National Council of Social Service (NCSS)\nand social service agencies with workplace learning projects.\nOur commitment to innovation in applied learning continues.\nTo address the workforce challenges of companies and\naspirations of in-employment learners, we have successfully 2024 marks a significant milestone for SIT – our 10th\nanniversary as an Autonomous University (AU). It is a testament\nto the collective effort and achievements of our dedicated\nfaculty, staff, and most importantly, our SITizens.\nNURTURING FUTURE-READY LEADERS: A\nLEGACY OF EXCELLENCE\nThe journey hasn’t been without challenges, but we’ve scaled\nnew heights each year. Today, we stand as Singapore’s third-\nlargest AU by full-time undergraduate intake, with graduates\nmaking their mark across diverse industries. Their success\nreflects our well-rounded, industry-oriented education and\nthe impact we have as an institute of higher learning.\nOur students consistently demonstrate their talent and potential.\nTake, for instance, the achievement of five undergraduates\nfrom the Digital Communications and Integrated Media\n(DCIM) programme. Their video, “Reverse the Future”, gained\nrecognition in the “Outstanding PR Student Project” category in\nthe Institute of Public Relations of Singapore’s biennial PRISM\nawards. Another two SITizens made it to the “Singapore Girls in\nTech” category, along with SIT faculty member, A/Prof Jeannie\nLee, who was recognised as one of the Singapore 100 Women\nin Tech in Singapore Computer Systems’ annual list. These\nare just a few examples of the exceptional SITizens who are\nthe fruits of our vision to future-ready learners and leaders. SIT’S SUCCESS HINGES ON OUR UNIQUE APPLIED LEARNING MODEL, FUELLED\nBY STRONG INDUSTRY COLLABORATIONS. THESE PARTNERSHIPS INFORM\nCURRICULUM DEVELOPMENT, ENSURE ITS RELEVANCE TO INDUSTRY NEEDS,\nAND PROVIDE STUDENTS ACCESS TO A VAST NETWORK OF COMPANIES FOR\nPLACEMENTS AND RESEARCH PROJECTS.”“MR BILL CHANG\nChairmanCHAIRMAN’S MESSAGE/08\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024\nCHAIRMAN’S MESSAGE\nrolled out the Bachelor of Science (Honours) in Applied\nComputing via the Competency-based Stackable Micro-\ncredential (CSM) pathway. This caters to the evolving needs\nof industry by allowing working adults to upskill or reskill\nwhile remaining employed. We will continue to expand the\nCSM pathway with new programmes such as the Bachelor of\nEngineering (Honours) in Electrical and Electronic Engineering\nand the Bachelor of Engineering (Honours) in Infrastructure\nand Systems Engineering.\nThe implementation of the CSM pathway coincides with the\nlaunch of the SIT Teaching and Learning Academy (STLA).\nThe academy champions competency-based education (CBE)\nto enhance learning outcomes. A key focus of STLA is the\nRecognition of Prior Learning (RPL) framework, which facilitates\nthe acquisition of new competencies and qualifications.\nThis approach empowers learners to build on their existing\nknowledge and experience.\nEXPANDING EDUCATIONAL HORIZONS\nAND INDUSTRY PARTNERSHIPS\nLooking ahead, we’re excited to launch new programmes\nsuch as the Integrated Bachelor of Science in Nursing (BSN)\n- Master of Science in Nursing (MSN) programme in AY2024.\nThis initiative, developed in collaboration with SingHealth,\nstrengthens our commitment to healthcare by nurturing\nspecialist nurses and future leaders. We are also expanding\npostgraduate offerings with the Master of Health Sciences\n(MHSc) programme in AY2024, specifically catering to graduates\nand experienced healthcare professionals who wish to further\ntheir studies and enhance their skills.SIT’s success hinges on our unique applied learning model,\nfuelled by strong industry collaborations. These partnerships\ninform curriculum development, ensure its relevance to\nindustry needs, and provide students access to a vast\nnetwork of companies for placements and research projects.\nBy strategically focusing on growth sectors aligned with\nSingapore’s future economic roadmap, we empower our\nSITizens with the most sought-after skills.\nREAL-WORLD LEARNING: BRIDGING THE\nGAP BETWEEN THEORY AND PRACTICE\nOur focus on applied learning means that we not only\nblend real-world cases into the curriculum, but also look\nfor opportunities for our students to apply their learning to\nsocietal challenges. Our Social Innovation Project (SIP) module\nallows students to tackle real-world problems, particularly in\nthe areas of sustainability and social innovation. For instance,\nthis year, our students participated in the inaugural Overseas\nImmersion Programme to Indonesia and Cambodia to embark\non their SIP. During their trips, they conducted fieldwork and\nground sensing, engaging with residents to co-create solutions\nfor challenges faced by the local communities.\nENRICHING THE SITIZEN EXPERIENCE\nBeyond academics, the University renamed its Student Life\nDivision (SLD) the Office of SITizen Experience (OSE) to better\nreflect the expanded role of the division in delivering an\nenhanced SITizen experience, which stretches from the day our\nstudents matriculate, to after they graduate and become our\nalumni. An experience which truly delivers on the promise of “Once a SITizen, always a SITizen”. OSE fosters the development\nof well-rounded individuals by nurturing distinct human\nattributes that complement technology. This enables students\nand graduates to be future leaders and change agents who\nwill transform lives and uplift communities.\nLEADING THE WAY IN APPLIED RESEARCH\nThe University is also steadily building its applied research\nactivities, collaborating with other institutions and industry\npartners. We participated in a consortium led by mobility\nsolutions provider Strides to develop and test-bed Vehicle-\nto-Grid (V2G) technologies, the largest V2G testbed in\nSingapore. Additionally, together with tech giant NVIDIA, we\nhave established an Artificial Intelligence (AI) centre that will\ndevelop research talent and collaborate on AI innovation and\ndeployment. The centre will also help to bolster AI adoption\nacross industries by offering comprehensive end-to-end\ntechnological support, innovative solutions, and co-supervision\nby SIT and NVIDIA experts to industry partners.\nGRATITUDE AND LOOKING FORWARD\nWe are able to do all this thanks to our dedicated faculty, staff\nand students, who are the backbone of SIT. Their unwavering\ncommitment to excellence fuels our success. We are also\ngrateful to our industry and community partners, government\nagencies, and all who have supported our journey. As we look\nahead, fuelled by this incredible network of support, we are\nfilled with optimism for the future. We are confident that SIT\nwill continue to thrive and empower future generations to\nmake a positive impact on Singapore and the world./09\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024"
}