{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20220711st-doyouwanttobeaspaceman.pdf",
  "type": "pdf",
  "content": "Do you want to be a spaceman?\nBY KEITH LIM\nSince the first humans reached the moon\non  July  16,  1969,  53  years  ago,\nmankind’s forays into space have only\nexpanded.\nGlobally, there are around 70 countries with\nspace agencies. However, the United States\nspends the most on its space programme at ap-\nproximately US$54.6 billion (S$76.5 bilion) in\n2021.\nThe National Aeronautics and Space Adminis-\ntration (Nasa), which is responsible for the US\nspace programme, also has had the most num-\nber of space missions at 135, sending more than\n355 different people into space.\nSingapore too has some space ambitions, so if\nyou want to join the space race, here are five ar-\neas you need to develop.\nHONE SPECIAL SKILLS\nAstronauts do not all do the same job while in\nspace.\nSome are pilots, who operate the spacecraft.\nOthers are mission specialists, who ensure the\nspacecraft and equipment are in working condi-\ntion. For example, they may have to do a space-\nwalk, which refers to exiting a vehicle in space, to\nrepair or check on the spacecraft’s exterior.\nThere also those who conduct experiments in\nspace. For example, cancer research is done on\nthe International Space Station (ISS). Studying\ncancer cells without gravity’s influence helps re-\nsearchers learn more about the cells’ behaviours\nand properties.\nBE PREPARED FOR HARD WORK\nNasa usually selects people who have a master’s\ndegree in science or mathematics fields.\nAlso, Nasa expects applicants to have at least\ntwo years of professional experience after com-\npleting their degrees or at least 1,000 hours\nclocked as a pilot on a jet aircraft.\nFurthermore, applicants must pass the long-\nduration flight astronaut physical exam, which\ntests eyesight, body coordination and agility.\nIn China, becoming a Chinese astronaut – also\nknown as a taikonaut – is no cakewalk either.\nTo even qualify as a taikonaut, 43 criteria, like age and background, have to be met. Seventeen\nphysical checks are also done to test endurance,\nand the physical training is painfully hard.\nFor example, a taikonaut’s simulated space-\nwalk training involves wearing a 200kg spacesuit\nand being under water for up to four hours each\ntime.\nDEVELOP A RESILIENT MINDSET\nMr Jeffrey N. Williams, 64, a Nasa astronaut who\nholds the record for the longest time spent in\nspace as an American man at 534 days, was re-\ncently in Singapore.\nHe said: “Psychologically and mentally, you\nshould be one that you’re not afraid of heights,\nyou’re not afraid of confined spaces.”\nHe also added that astronauts should aim to\n“maintain a good attitude, to continue to be a\ncontributing member of the team, to continue to\nwork day to day and not get focused on the\nself”.\nAlso, being an astronaut means sacrificing\ntime spent with loved ones, as space expeditions\ntypically last about six months.\nMAINTAIN YOUR FITNESS\nAstronauts have to spend lots of time hitting the\nbooks, but they must also be very fit.\nWhile in space, they have to exercise for at\nleast two hours daily or their bodies will begin to\nlose bone and muscle in a process known as mus-\ncle atrophy, limiting their ability to work.\nThus, astronauts keep fit by doing exercises\nranging from running on the treadmill to ped-\nalling a stationary bike.\nTRY, AND BE PATIENT\nLast year, about 12,000 people applied to be\nNasa astronauts. Yet, only 10 were accepted.\nWith such a large pool of applicants alongside\na strict screening process, there is no guarantee\nthat one can become an astronaut even if one\nhas the right skills.\nSaid Mr Williams: “All we can do is work hard\nto prepare ourselves when that opportunity\ncomes along.”\nNasa, Statista, McKinsey, CGTN\nTurn to the next page to find out what\nastronauts wear to protect themselves\nfrom the extreme conditions of spaceNasa\nastronaut\nJeffrey N.\nWilliams\ntalking\nabout his\nexperiences\nto students\nand staff\nof the\nSingapore\nInstitute of\nTechnology\nat SIT Dover\ncampus on\nJune 8.\nST FILE PHOTO\nPublication: The S traits Times\nDate: 11 Jul 2022\nHeadline: Do you want to be a spaceman?\nSource: The Straits Times © SPH Media Limited. Reproduced with permission."
}