{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2023-10/SIT-Annual-Report-2023_1.pdf",
  "type": "pdf",
  "content": "01\nCover Contents\n32Industry\n54Support for\nStudentsAbout\nSIT\n60\n69Board\nCommittees\nand Internal\nAudit\nContact Us06President’s\nMessage\n14Academic\nYear in\nReview\n56In\nAppreciation\nof SIT’s\nDonors16Applied\nLearning\n62Financial\nStatements40CommunitySIT at a\nGlance02\n08Senior\nManagement04Chairman’s\nMessage\n10Board of\nTrustees\n22Applied\nResearch\n46Sustainability\nat SIT\n58Corporate\nGovernance\n68Road To\nPunggolThis year’s Annual Report is centred around\nthe theme ‘Deepening Applied Learning’.\nAs Singapore’s University of Applied\nLearning, SIT’s unique pedagogy bridges\nlearning and work, placing a strong\nemphasis on authentic experiential\nlearning based on real-world problems.\nThe University continues to evolve its\nprogrammes to strengthen active learning,\noffer students more opportunities for\nauthentic learning, and grow applied\nresearch as a key enabler to deepen\napplied learning.\nThe cover features 3 SITizens: SIT\nundergraduate Leshawn Chan from\nthe Applied Computing (with Fintech\nspecialisation) degree programme,\nHospitality Business student Farisha Low,\nand Royston Guo, who graduated with\nboth a BEng and MEngTech in Sustainable\nInfrastructure Engineering (Land). Through\nthe University’s applied learning pedagogy,\nour SITizens transform into future-ready,\nlifelong learning professionals who are\ncatalysts for transformation in their\nindustry of choice.\nWe Are SIT\nThe Singapore Institute of Technology (SIT) is Singapore’s first University of Applied Learning. Its\nmission is to maximise the potential of learners and to innovate with industry, through an integrated\napplied learning and research approach, so as to contribute to the economy and society.\nSIT@SP\nBuilding\nSIT@NP\nBuilding\nSIT@\nDover\nSIT@TP\nBuilding\nSIT@RP\nBuilding\nSIT@NYP\nBuilding01\nABOUT SIT\nSIT@NP BUILDING\nSIT@SP BUILDING\nSIT@DOVERSIT@TP BUILDINGSIT@NYP BUILDINGSIT@RP BUILDINGSIT at a Glance\n6 CAMPUSESFor the financial year ended 31 March 2023\nSIT also offers four Postgraduate Programmes by Research: Master of Engineering, Doctor of Engineering,\nMaster of Clinical Research in Health Sciences and Doctor of Clinical Research in Health Sciences.\nUNDERGRADUATE AND\nPOSTGRADUATE PROGRAMMES5 ACADEMIC CLUSTERS\nPostgraduate\nProgramme by\ncourseworkPostgraduate\nProgrammes\nby coursework Undergraduate\nProgrammes6 Undergraduate\nProgrammes3\nUndergraduate\nProgrammes71 Undergraduate\nProgrammes12 4Business,\nCommunication\nand Design Food,\nChemical and\nBiotechnology\nHealth and\nSocial Sciences\nUndergraduate\nProgrammes11Infocomm TechnologyEngineering\nSIT-conferred\nUndergraduate\nProgrammes21 SIT-OU Joint\nUndergraduate\nProgrammes14 Overseas University\nUndergraduate\nProgrammes 4\nPostgraduate\nProgrammes by\ncoursework5 Postgraduate\nProgrammes by\nresearch4 SIT-conferred Postgraduate\nProgrammes\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202302\n6 OVERSEAS UNIVERSITY PARTNERS\nGRADUATE EMPLOYMENT\nSURVEY 2021\nemployed within\n6 months of\ngraduation 95.6% Mean Gross\nMonthly\nSalary $3,755\nTechnical\nUniversity of\nMunich\nMassey\nUniversity\nUniversity of\nGlasgow\nNewcastle\nUniversity\nThe Culinary\nInstitute of\nAmerica\nDigiPen\nInstitute of\nTechnology 03\nSIT AT A GLANCE\nChairman’s Message\nI am pleased to present this year’s annual report, themed “Deepening Applied Learning”, which\nhas been the main strategic focus for SIT. I am happy to note that we have made good strides in\nstrengthening our education and research offerings in financial year (FY) 2022.\nSUPPORTING SINGAPORE’S GOALS\nSIT aligns itself with Singapore’s national goals in the\neducation sector, supporting the development of a skilled\nworkforce, driving innovation and economic growth, and\npromoting Singapore as an education hub. Through our\nprogrammes and collaborations, we remain dedicated to\nenhancing applied learning experiences, driving innovation,\nand empowering learners for success in an ever-changing\nworld. According to the 2021 Graduate Employment\nSurvey, 95.6% of SIT graduates secured a job within 6\nmonths of completing their studies, with starting salaries\nthat exceeded pre-pandemic levels.\nAs a testament to our efficacy, SIT’s student enrolment has\nbeen growing year by year. I am pleased to note that we now have an annual intake of over 3,000 and an enrolment\nof over 9,000 undergraduates, making us the third-largest\nautonomous university in Singapore by undergraduate\nstudent intake. These outcomes are a testament that we\nare on the right track. We have continued this momentum\nand continually updated our educational offerings.\nDEEPENING EDUCATIONAL HORIZONS\nSIT places a strong emphasis on experiential learning\nthrough solving real-world problems. In other words,\nour education goes beyond earning a degree — it is also\nabout developing skills that are relevant to industries and\nbacked by deep disciplinary knowledge.\nOur undergraduate and postgraduate degree programmes\nare designed with this aim in mind. In FY2022, we expanded\nour academic offerings for both the pre-employment\ntraining (PET) and continuing education and training (CET)\nsectors to bring the benefits of our pedagogy to even\nmore learners. Our signature Integrated Work Study\nProgramme (IWSP) gives students valuable learning\nopportunities and enhances their employability in an\nincreasingly competitive workforce. To date, about 1,000\ncompanies and agencies partner with SIT to provide\nplacements for our students.\nBeyond IWSP , our Term-In Term-Out (TITO) programmes\nare also gaining traction. TITO offers students the option\nof alternating between the University and the workplace\nas they complete their degree, providing valuable industry\nexposure. It also augments students’ learning experiences\nand distinguishes SIT as a university where learning comes\nto life. Thanks to companies such as AIA, DBS, Infosys,\nOCBC, Prudential, Standard Chartered Bank, ST Logistics,\nUOB and YCH, students on the TITO pathway are spending\nsubstantially more time in industry.\nEven as we continue to develop and expand our\nprogrammes, we must pay attention to the broader\neducational landscape. In keeping with the Ministry of\nEducation’s focus on strengthening lifelong learning by\nmoving to a lifetime cohort participation rate of 60%\nby 2025, we continue to enhance our CET offerings to\ncater to working adults who wish to upskill and gain new\ncapabilities in the workplace.\nOur dedicated unit for lifelong learning, SITLEARN\nProfessional Development, has been hard at work rolling\nout courses for adult learners. In 2022, more than 4,000 CET\ntraining places were made available. During the year, we\nWe believe that\ncollaboration with industry\nis at the heart of applied\nlearning. As such,\nSIT weaves\ncollaboration\nwith industry\npartners\nseamlessly and\nintentionally\ninto all aspects\nof our applied\nlearning and\nresearch\nactivities.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202304\npartnered with companies like semiconductor equipment\nmanufacturer Applied Materials to future-proof their staff’s\ncapabilities in emerging technologies. Over 200 Applied\nMaterials employees were trained in areas such as data\nanalytics, AI and the Internet of Things.\nA notable CET initiative is the provision of practice\nworkshops to prepare rehab healthcare professionals\nto carry out the objectives of the National One-Rehab\nFramework. In FY2022, SIT trained over 500 allied health\nand rehab professionals from over 30 healthcare and\ncommunity institutions, including the National Healthcare\nGroup, SingHealth, Kwong Wai Shiu Hospital, and St\nLuke’s Hospital. Through this programme, the participants\nunderstand how to apply the One-Rehab Framework in\ntheir rehabilitation practice so that their patients have\ntimely access to the right level of care.\nAt SIT, we understand that industry needs are always\nevolving. Our education and training programmes seek\nto evolve along with changing industry needs and equip\nlearners with skills that are applicable and relevant. For\nexample, we have rolled out the Competency-based\nStackable Micro-credentials (CSM) pathway to support\nworking adults to upskill. Such a competency-based\napproach accelerates their professional development.\nThe delivery, which is a blend of both face-to-face and\nasynchronous learning, balances between empowering\nthe learners to learn at their own pace and the benefits of\nin-person and group learning. We continue to engage the\nindustry in the design and delivery of the programme to\nensure that the micro-credentials are aligned with market\nneeds and reflect the latest trends and technologies.\nTo ensure that our educational offerings make a difference\nin the real world, we continue to push for progress on the\napplied research front. We work closely with educational\ninstitutions in Singapore, such as the other autonomous\nuniversities and 5 polytechnics, and industry to achieve\nresearch outcomes that matter to businesses. Some of\nour partners include global companies such as Cargill,\nConveGenius, DNV, Meinhardt and Yinson Holdings, as\nwell as universities such as Japan’s Tohoku University, the\nTechnical University of Munich and the University of Illinois\nUrbana-Champaign.\nCrucially, such partnerships also enable us to provide\nour students with authentic learning experiences in\nareas such as sustainability, digitalisation, food security,\ncommunity healthcare and more. These are critical areas\nof development for Singapore.\nDEEPENING IMPACT ON INDUSTRY\nAND COMMUNITY\nWe believe that collaboration with industry is at the heart\nof applied learning. As such, SIT weaves collaboration\nwith industry partners seamlessly and intentionally into\nall aspects of our applied learning and research activities.\nI am heartened that we have continued to grow our\nnetwork of industry partners in FY2022. We have signed\nnumerous memoranda of understanding and forged\nresearch collaborations in multiple areas. These will go\na long way towards building a strong academia-industry nexus and creating opportunities for work attachments,\nresearch and other joint initiatives for our students to\ndevelop the necessary skills to excel.\nOur commitment to our student community, as well as\nthe community at large, is also a big part of who we\nare. Students are at the core of SIT’s mission, and their\nsuccess and personal growth are key elements of the\nSIT experience. In FY2022, we remained committed to\nfostering an inclusive and conducive campus environment,\nwith comprehensive support services available for students\nshould they need it.\nThis past year, the University actively engaged with\nthe community, working with local organisations and\ncommunity partners to craft outreach programmes to\nhelp individuals and communities. For example, SIT co-\nproduced the Tech for Good 2022 competition to provide\nstudents with the opportunity to contribute to vulnerable\ncommunities. A student team from SIT designed a device\nthat enables wheelchair users to snap photographs using\na motorised arm. Another SIT team modified the bowling\nramp to make it easier and more interactive for those with\ncerebral palsy to bowl.\nOur upcoming SIT Punggol Campus will be critical to\nour engagement efforts. The campus will be co-located\nin the Punggol Digital District alongside enterprises and\nis specifically designed to enable intermingling between\nindustry and academia. This serves to strengthen the bond\nbetween academia and industry, and foster opportunities\nfor collaboration through the exchange of workspaces\nand mutual flow of ideas.\nWe will become the resident university in the North-\nEast region, occupying an important place in the local\necosystem as a knowledge hub. I believe that our state-\nof-the-art facilities and expertise in STEM education will\nprove an invaluable resource to residents in the area. As\nwe share our resources and contribute towards shoring\nup the knowledge base of the community, our staff and\nstudents will have the opportunities to put their academic\nknowledge and industry proficiency to good use in giving\nback to the community.\nFORGING AHEAD\nAs we turn to the future, SIT will continue to redefine the\nhigher education landscape and build upon our applied\nlearning pedagogy to achieve leadership in this key front.\nEven as we build on our successes, we must continue to\nadapt to a changing global environment and keep forging\nstrategic partnerships with industry.\nWith the support of our staff and partners, including the\nMinistry of Education, polytechnics, overseas universities,\nindustry partners, government agencies and community\nleaders, I am confident that SIT will continue to thrive\nand differentiate itself as Singapore’s premier university\nof applied learning.\nMR BILL CHANG\nChairman05\nCHAIRMAN’S MESSAGE\nPresident’s Message\nIn 2022, we took in a record 3,121 new SITizens from\na pool of 13,000 applicants, a 5.7% increase over the\nprevious year. 88% of new SITizens were admitted to\ntheir first choice of degree programmes, a year-on-year\nincrease of 2%.\nWith the easing of pandemic restrictions, our freshmen\nwere welcomed in person at SIT@Dover for their First-\nYear Experience induction programmes. Our annual\ncareer networking event, Career Nexus, drew around\n2,000 SITizens and over 200 company representatives.\nAs part of our Overseas Immersion Programme, we also\nsupported more than 1,000 SITizens in the United States,\nEurope and Asia.\nWe continued to celebrate the achievements of\nour SITizens. More than 2,200 graduates from 47\nundergraduate and postgraduate programmes were\nconferred degree scrolls at SIT’s Graduation Ceremony\n2022. For his contributions to the growth of SIT, Dr Ng\nYat Chung, founding Chairman of SIT’s Board of Trustees,\nwas conferred the University’s first honorary degree.\nAt the same time, we have made our educational offerings\nmore accessible to needy undergraduate students. With\nstrong support from donors, we launched a new Forward\nSITizen initiative that allows eligible students to cover\n100% of their subsidised fees through a combination\nof government-funded public bursaries, donated\nscholarships and bursaries offered by SIT.\nBRIDGING LEARNING AND WORK\nA key focus of our pedagogy is helping students\nconnect what they learn with the workplace. In 2022,\nwe introduced new learning pathways that aim to\nbetter synthesise these elements into a holistic learning\nexperience, enhancing the competitiveness and future\nemployability of our students.\nWe introduced a new Term-In Term-Out structure for\n2 new undergraduate degree programmes — Applied\nComputing (Fintech specialisation) and Digital Supply\nChain. This pathway, which alternated between time\nspent in the classroom and time spent in the workplace, gave students regular opportunities to apply the skills\nand knowledge acquired in a real-world setting. Industry\npartners benefitted by being able to tap talent in areas of\nhigh demand. So far, 15 companies are working with us to\nhost our students during the term-out trimesters, including\nDBS, UOB, AIA, Prudential, YCH and ST Logistics.\nAnother major development was the full implementation\nof the Undergraduate Programme Structure (UPS), which\nformally incorporated interdisciplinary learning and\ntransferable skills components into SIT’s curricula. UPS\nprovides a formal structure for a holistic SIT education that\nprepares our students to be both career- and future-ready.\nFor example, the Social Innovation Project module has\nbeen included in all degree programmes from 2022. This\ngives students an opportunity to work in interdisciplinary\nteams to develop solutions for society in areas such as\nsustainability and caring for the elderly.\nSTRENGTHENING LIFELONG LEARNING\nIn the Continuing Education and Training space, we\ncontinued to partner with companies such as Applied\nMaterials, Rohde & Schwarz, Rotary Engineering and SMRT\nto upskill their employees and build new capabilities.\nIn response to the Ministry of Education’s focus on\nlifelong learning and the goal to raise the lifetime\ncohort participation rate to 60% by 2025, we launched\nSingapore’s first Competency-based Stackable Micro-\ncredentials (CSM) pathway. The pathway, recognising\nthe importance of schedule flexibility for in-employment\nlearners, is designed to be mainly delivered online. It\nsupports individuals seeking to pivot to new roles by\nacquiring specific skillsets, as well as those looking to\nacquire new degrees. The pathway is competency-based\nand will allow for the recognition of prior learning,\nwhether acquired through formal programmes or work\nexperience. In November 2022, we inked memoranda\nof understanding with telecommunications provider\nSingtel and technology services firm NCS to upskill\ntheir employees through CSM. We are on target to start\nwith 150 learners in 2023, partnering with polytechnics\nand industry in the development and delivery of micro-\ncredentials in the field of Applied Computing.2022 has proven to be fruitful. We sustained our strong pedagogical focus on applied learning\nand this is encapsulated in the annual report theme, “Deepening Applied Learning”. The theme\nreflects our commitment to being Singapore’s premier university of applied learning, and our efforts\nto continually find new ways to maximise the potential of our learners and to transform learning.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202306\nA key focus of our\npedagogy is helping\nstudents connect what\nthey learn with the\nworkplace. In 2022, we\nintroduced new learning\npathways that aim to\nbetter synthesise\nthese elements into\na holistic learning\nexperience,\nenhancing the\ncompetitiveness\nand future\nemployability of\nour students.GROWING APPLIED RESEARCH AND\nINDUSTRY COLLABORATIONS\nAs an applied learning university, we focus on translational\nresearch and innovation co-creation with industry. We\nofficially opened FoodPlant, Singapore’s first shared\nfacility for small-batch food production, in April 2022. We\nalso launched InnoHub, a one-stop centre where small\nand medium-sized enterprises can tap resources to help\nthem innovate and move up the innovation value chain.\nDuring the year, we also continued to attract competitive\nresearch grants to work with industry and deepen our\nresearch track record and capacity.\nDuring the year, our network of industry and public agency\npartnerships expanded with engagements with agri-food\nfirm Agrocorp, French energy and services company ENGIE,\nSingHealth and the National Council of Social Service,\namongst others. These partnerships are multifaceted in\nareas of continuing education, applied research and in\nproviding authentic learning experiences for our SITizens.\nNEW OPPORTUNITIES AT PUNGGOL\nCAMPUS\nWe expect to start the new academic year in 2024 in\nour new Punggol Campus — the first time that the SIT\nfamily will be under one roof. We are greatly anticipating\nthe move, and are particularly excited about the new\nopportunities that will come with it.\nIn 2022 we launched our Living Lab initiative in partnership\nwith Singapore Power (SP), SMRT, SingHealth and\nENGIE in the respective fields of energy, transport,\nhealthcare, and district cooling systems. Living Labs\nenhance the authenticity of our students’ learning and\nfacilitate impactful research. For instance, SP has pledged\nadditional funding for the multi-energy microgrid that\nwill power our Punggol Campus, providing learning and\nresearch opportunities in power engineering for both\nour students and academic staff.\nWith a shared space, we see an opportunity to turbocharge\nour community-building efforts, which have already begun\nin 2022. We strengthened and relaunched our Culture\nInduction Programme to enable employees to better\nunderstand our culture and their place in it. We also\nrefreshed our core values to incorporate sustainability, a\nkey priority for SIT. With this inclusion, our 6 core values\nare Purpose and Agility, Respect and Sustainability, and\nIntegrity and Excellence.\nMOVING FORWARD\nAs we embrace the future together, we remain committed\nto enhancing applied learning experiences, driving\ninnovation and preparing individuals for success in an ever-evolving world. The support from our stakeholders\nhas been instrumental thus far and will continue to be\ncritical to our future success.\nI look forward to an even better year ahead, in which SIT\nwill continue to distinguish itself as a premier university\nof applied learning.\nPROFESSOR CHUA\nKEE CHAING\nPresident07\nPRESIDENT’S MESSAGE\nSenior Management\nFor the financial year ended 31 March 2023\nMR RONNIE\nTAY\nDeputy President\n(Administration)\n& Chief Financial\nOfficer\nAppointed 1 Jul 2019\nMR BERNARD\nNEE\nDeputy President\n(Industry &\nCommunity)\nAppointed 1 Jan 2022\nPROFESSOR\nCHUA KEE\nCHAING\nPresident\nAppointed 1 Jan 2022\nPROFESSOR\nJOHN THONG\nDeputy President\n(Academic) &\nProvost\nAppointed 1 Jan 2022\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202308\nDR KWONG\nYUK WAH\nVice President\n(Digital\nTransformation) &\nChief Digital O fficer\nAppointed 3 Jan 2023\nASSOCIATE\nPROFESSOR\nIVAN LEE\nVice President\n(Innovation)\nAppointed 1 Jan 2022\nMR TSOI MUN\nHENG\nVice President\n(Planning)\nAppointed 1 Apr 2015\nASSOCIATE\nPROFESSOR\nSUSANNA\nLEONG\nVice President\n(Applied Research)\nAppointed 1 Jan 2022 09\nSENIOR MANAGEMENT\nBoard of Trustees\nFor the financial year ended 31 March 2023\nDR CHIA TAI TEE\nMEMBER\nFormer Chief Risk\nOfficer\nGIC Pte Ltd\nAppointed 16 Sep 2018\nMR ABU BAKAR BIN\nMOHD NOR\nMEMBER\nGroup Chairman\nM Kapital Holdings Pte Ltd\nAppointed 16 Sep 2015\nDR BENJAMIN KOH\nMEMBER\nDeputy Secretary (Sustainability)\nMinistry of Sustainability\nand the Environment\nAppointed 16 Sep 2018\nPROFESSOR CHUA\nKEE CHAING\nMEMBER\nPresident\nSingapore Institute of\nTechnology\nAppointed 1 Jan 2022\nMR KWEE LIONG\nKENG\nMEMBER\nManaging Director\nPontiac Land Pte Ltd\nAppointed 1 Nov 2017\nMRS MARGARET LUI\nMEMBER\nChief Executive Officer\nAzalea Investment\nManagement Pte Ltd\nAppointed 16 Sep 2015\nMR HAN KWEE JUAN\nMEMBER\nGroup Executive and Singapore\nCountry Head\nDBS Bank Ltd\nAppointed 1 Jun 2022\nMS LIM WAN YONG\nMEMBER\nPermanent Secretary (Education\nDevelopment), Ministry of\nEducation and Permanent Secretary\n(Development), Ministry of Social\nand Family Development\nAppointed 4 Oct 2021\nMR BILL CHANG\nCHAIRMAN\nChief Executive Officer,\nDigital InfraCo\nSingapore\nTelecommunications Ltd\nAppointed 16 Mar 2022\nMR CHAN HIAN LIM\nMEMBER\nDeputy Chief Executive\nOfficer (Corporate,\nIndustry and Technology)\nSingapore Food Agency\nAppointed 16 Sep 2021\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202310\nMS NEO GIM HUAY\nMEMBER\nManaging Director, Centre\nfor Nature and Climate\nWorld Economic Forum\nAppointed 16 Sep 2021\nMS GAIL ONG\nMEMBER\nHead, Equity Capital Markets\nWongPartnership LLP\nAppointed 16 Sep 2018\nMS TAMMIE THAM\nMEMBER\nGroup Chief Executive Officer\nEnsign InfoSecurity Pte Ltd\nAppointed 16 Sep 2018\nMS SUSAN SOH\nMEMBER\nSenior Advisor\nSchroder Investment\nManagement (Singapore) Ltd\nAppointed 16 Sep 2021\nMR RAVINDER SINGH\nMEMBER\nGroup Chief Operating Officer,\nTechnology & Innovation and\nPresident, Defence & Public\nSecurity\nSingapore Technologies\nEngineering Ltd\nAppointed 16 Sep 2018\nMR QUEK GIM PEW\nMEMBER\nSenior R&D Consultant\nMinistry of Defence\nAppointed 16 Sep 2018\nMR NAGARAJ\nSIVARAM\nMEMBER\nFormer Partner,\nAssurance Services\nErnst & Young LLP\nAppointed 16 Sep 2015\nMS JACQUELINE POH\nMEMBER\nManaging Director\nSingapore Economic\nDevelopment Board\nAppointed 1 Jun 2022\nMR SOON SZE MENG\nMEMBER\nChief Executive Officer\nGoNetZero™\nAppointed 16 Sep 2018\nMR WEN KHAI MENG\nMEMBER\nFormer Senior Advisor\nCapitaLand Limited\nAppointed 16 Sep 2015\n11\nBOARD OF TRUSTEES\nAfter graduating from SIT in\n2022 with both a Bachelor of\nEngineering with Honours and a\nMaster of Engineering Technology\nin Sustainable Infrastructure\nEngineering (Land), Royston joined\nSMRT as an executive engineer.\nDriven to help commuters get to their\ndestinations safely and smoothly,\nthe 27-year-old finds fulfilment in\nleveraging the knowledge and\nproblem-solving skills acquired\nduring his university education to\nserve the public effectively.  Engineered\nTo Serve\nCommuters\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2023\n“SIT offers a cohesive applied learning\nenvironment for me to pursue my\nBachelor’s and Master’s programmes.\nWith the help of supportive professors\nwho stood by me every step of the\nway, I was able to overcome the\nacademic rigour of my studies.”\nROYSTON GUO ZHENHAO\nSIT Graduate, BEng and MEngTech SIE Land\nAcademic Year in Review\nSIT is committed to an aptitude-based admissions process that looks beyond just academic\nachievements. Applicants are evaluated holistically, also taking into account their interests, relevant\nwork experience, and achievements related to their programme of choice. This rigorous selection\nprocess ensures that SIT admits the best fit of students that are passionate about their field of\nstudy, and who can thrive in the University’s distinctive applied learning environment.\nThe AY2022 admissions exercise saw 12,902 applications — a 0.7% increase over the year before.\nIntake increased by 5.7% to 3,121. Over 7,000 assessments were conducted during the exercise\nvia face-to-face synchronous interviews, and/or asynchronous video interviews to facilitate a holistic\nand aptitude-based review of selected applicants.\nAPPLICATION VS INTAKE OVER THE\nLAST THREE ACADEMIC YEARS\nAY2022/23 INTAKE BY\nQUALIFICATIONS\nPolytechnic Diploma\n2,858  students\nGCE A LevelOthers\n205  students58 students\n91.6%6.6%1.8%\nTOTAL\n3,121\nSTUDENTS3000\n0600090001200015000\n11,865\n2,90012,818\n2,95212,902\n3,121\nAY2020/21 AY2021/22 AY2022/23Application\nIntake\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202314\nTOTAL MATRICULATED BY ACADEMIC CLUSTER\nIN AY2022/23\nPROFILE OF SITIZENS31.3%16.6%27.4%7.0%\n17.7%Business,\nCommunication and\nDesign\n519  students\n854  students\n217  students553  studentsInfocomm Technology\n978  students\nHealth and Social\nSciencesEngineering\nFood, Chemical and\nBiotechnologyTOTAL\n3,121\nSTUDENTS\nstudents is the first in the family to\ngo to university (defined as those\nwhose parents did not pursue a\nuniversity education)new SITizens to the SIT\nfamily in AY2022/23We welcomed\n3,121\nInfocomm Technology\nis the largest academic\ncluster, admitting followed by\nEngineering at\n31.3 % 27.4 % were polytechnic graduates\nwere the 3 largest programmes,\nadmitting the highest number of\nstudents in the AY2022/23 intake.of students were enrolled into\ntheir first choice of programmes90% Close to91.6 %\nAccountancy Physiotherapy\nInformation and Communications\nTechnology (Information Security)of the\nAY2022/23\nintakeAlmost\n1 out of every 215\nACADEMIC YEAR IN REVIEW\nApplied Learning\nSIT’s unique pedagogy bridges learning and work, with an emphasis on experiential learning\nbased on real-world problems. The University’s degree programmes are designed to deepen\nskill mastery, with interdisciplinary and transferable skills integrated into the curriculum.\nWe aim to develop work- and future-ready, lifelong learning professionals who are catalysts\nin industry transformation.\nTRANSFORMING LEARNERS THROUGH\nNEW ACADEMIC INITIATIVES\nNEW UNIVERSITY-LEVEL MODULES\nFOR INTERDISCIPLINARY LEARNING\nIn AY2022, SIT completed the harmonisation of degree\nprogrammes with the rollout of 5 university-level modules\nunder its Undergraduate Programme Structure that\nemphasise dispositions like curiosity, creativity, critical\nthinking, communication and collaboration. These\nmodules prepare students for life beyond the classroom\nby providing them with the skills to navigate the\nincreasingly volatile, uncertain, complex, and ambiguous\n(VUCA) world.\n• The Critical Thinking and Communication module\nteaches students essential skills to evaluate texts\nand propose innovative ideas specific to their degree\nprogrammes. Students will acquire foundational\nknowledge in writing and speaking through training\nin critical reading, literature reviews, effective report\nwriting and presentation skills.\n• In the Digital Competency Essentials module,\nstudents will complete a series of stackable micro-\nmodules that will equip them with basic digital skills and competencies aligned with the Ministry\nof Education’s digital literacy framework. These\nskills include cybersecurity, cloud computing and\ndata analytics.\n• The Introduction to Design Innovation and\nInterdisciplinary Design Innovation modules train\nstudents to innovate using a multi-disciplinary\napproach focused on user-centred problems. Through\nempathic discovery and iterative solutioning, students\nare equipped with the critical competency and\nconfidence to approach complex problems and\ndevelop creative solutions.\n• Under the Social Innovation Project (SIP) module,\nstudents will identify and address contemporary social,\nenvironmental and sustainability factors. SIP enhances\nstudents’ learning and develops them into effective,\ninclusive and socially attuned individuals. There will be\nopportunities for them to formulate social innovations\nor solutions that can address a variety of challenges,\nsuch as those related to sustainability and sustainable\ndevelopment, or the management of disruptions and\nimpact on seniors.\nINNOVATIVE EDUCATION PATHWAYSSIT has introduced innovative education pathways such as Term-In\nTerm-Out (TITO), which maximise the curriculum time the students\nspend at job attachments. Students alternate between classes and on-\nthe-job training, and at the end of their undergraduate studies, they\nwould have spent almost half of their school term in authentic industry\nsettings without extending the duration of their degree programme.\nThe TITO model enables students to gain a deeper understanding of\nindustry needs and bring these perspectives back to the classroom. Concurrently, sponsoring companies\nwill be able to green-harvest talents. In FY2022, the University secured the commitment of 15 companies\nfor 3 degree programmes in Applied Computing (with Fintech specialisation), Digital Supply Chain,\nand Robotics Systems. These companies will provide work placements for students throughout the\ncourse of study.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202316\nREFRESHED CURRICULA TO NURTURE\nSTEWARDS OF SUSTAINABILITY\nSIT recognises its role in building capability for\nsustainability efforts and has announced the following\nrefreshed curricula:\nIntroduced in AY2022, all Year 1 undergraduates from SIT\nand SIT-joint degree programmes will receive a baseline\nsustainability education through a compulsory Introduction\nto Sustainability micro-module that equips students with the fundamentals of sustainable development. The\nmicro-module also supports future sustainability-related\nmodules and projects.\nIn AY2023, a new Minor in Environmental Sustainability\nwill be available for undergraduates of selected\nprogrammes, such as the Electrical Power Engineering\ndegree programme.\n2 degree programmes will have their names changed to\nbetter reflect their curricula, with effect from AY2023:\n• Bachelor of Engineering with Honours in Sustainable\nInfrastructure Engineering (Building Services) has been\nrenamed Bachelor of Engineering with Honours in\nSustainable Built Environment;\n• Bachelor of Engineering with Honours in Sustainable\nInfrastructure Engineering (Land) has been\nrenamed Bachelor of Engineering with Honours\nin Engineering Systems.\ncontribute to industry advancements and innovation.\nLiving Labs also emphasise interdisciplinary collaboration,\nencouraging the exchange of ideas and knowledge across\ndifferent fields. Ultimately, the initiative aims to bridge\nthe gap between academia and industry to accelerate\nthe translation of research into practical applications\nthat benefit society.\nFor a start, the University has set up 5 Living Labs in\nthe areas of Energy, Transport, Healthcare, Building\nServices and Virtual Campus. SIT students and\nresearchers can tackle real-life projects such as the\nMulti-Energy Microgrid (MEMG) and the District Cooling\nSystem (DCS) implementations. In FY2022, the University\nextended its partnerships with SingHealth and SMRT\nto drive strategic initiatives through new research and\ninnovation opportunities and practice-oriented education\nfor students. Through Living Labs, SIT brings greater\nauthenticity to its educational offerings and catalyses\napplied research opportunities for SIT students and\nfaculty, all while contributing to and solving operational\nchallenges with our partners.In addition to pathways and programmes, SIT is\ntransforming learning through Living Labs, which play\na key role in enabling authentic and active learning for\nstudents, and supporting the nurturing of talents to ESTABLISHING LIVING LABS AS A STRATEGIC\nACADEMIC IMPERATIVE\n17\nAPPLIED LEARNING\nThe second bug bounty challenge was a resounding success.\nThe top 3 teams of The Mapletree Challenge 2022 with MOS\nLow Yen Ling and senior management of SIT and Mapletree.FOSTERING LEARNING AND INNOVATION\nTHROUGH EXPERIENTIAL CHALLENGES\nFY2022 was an exciting year for SIT students as they\nparticipated in a variety of competitions and hackathons,\nproviding them with enriching, hands-on opportunities\nto apply their knowledge and showcase their skills.\nIn August 2022, SIT collaborated with the Cyber\nSecurity Agency of Singapore (CSA), the Association of\nInformation Security Professionals (AiSP), Group-IB and\nJTC to organise the PDD Connecting Smartness Bug\nBounty 2.0 Contest. Held at the SIT@NYP Building,\nthe event challenged cybersecurity experts to find bugs\nand vulnerabilities in real-world systems, such as the\nLiving Lab Network prototype. The winner, Year 3 ICT\n(Information Security) student Justin Lim Keat Hui, was\nable to bypass the authorisation of a network router and\nexpose its technical information. This open innovation\necosystem serves as a Living Lab for industry partners\nto test and pilot their prototypes in a real-world setting.\nSIT and Target Media Culcreative collaborated on the\n‘Beyond the Screen Ideation Challenge’ for students\nand Punggol residents. The challenge aimed to enhance\ncommunity communications and engagements by\nharnessing technology, content creation, the environment\nand ecosystem, and other disruptive strategies. The\nwinning entry by Year 1 student Kieran Chai Si Yuan,\nfrom DigiPen Institute of Technology (Singapore)’s User\nExperience and Game Design programme, featured a\nsmart and interactive repository comprising a directory\nof nearby amenities, wayfinding, weather forecasts and\ncommunity news.spam detection programme. The event was co-organised\nby SIT’s Community Leadership and Social Innovation\nCentre (CLASIC).\nMapletree Investments Pte Ltd and SIT partnered on\nthe third edition of The Mapletree Challenge 2022 .\nThe challenge, comprising masterclass sessions and an\ninnovation and entrepreneurship forum, culminated in\na grand finale that saw 2 SIT student teams emerging\nas joint champions.\nSIT Senior Management and faculty with SIT participants at the\nTech For Good 2022 innovation festival.The Tech For Good 2022 innovation festival by Engineering\nGood provided SITizens opportunities to collaborate and\ntackle community issues. 3 teams from the Engineering\nand Infocomm Technology Clusters made the finals, where\nthey showcased their assistive technology ideas, including\nan Internet-of-Things device that assists people with\nmuscular dystrophy with photo-taking, a modified ramp\nfor an enhanced game of bowling, and an automated\nThe winning entry of the ‘Beyond the Screen Ideation\nChallenge’ by an SIT student featured a smart directory and\nan interactive repository.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202318\nFORGING BONDS AND\nEXTENDING NETWORKS BEYOND\nCAMPUS AND BORDERS\nIn FY2022, SIT resumed most of its mobility programmes\nto offer students international exposure through cross-\ncultural exchanges. The University also facilitated enriching\nnetworking opportunities and activities for students.\nA total of 735 students participated in various Overseas\nImmersion Programme (OIP) activities, including\nindustry visits, projects and lectures.\nIn May 2022, SIT students and faculty collaborated with\nthe Metropolia University of Applied Sciences in Finland\nUniversity of Glasgow Singapore students enjoyed a campus\ntour of the UofG campus in Scotland.\nSIT faculty and students met up with representatives from the\nMetropolia University of Applied Sciences in Finland.The Culinary Institute of America students at Greystone\ncampus in USA.\nDigiPen (Singapore) students visited DigiPen’s home campus\nin Redmond, Washington, USA.on the ‘Artificial Intelligence (AI) Based Solutions in\nDose Management’ project, a cross-university partnership\nfocused on reviewing research on AI applications to dose\nmanagement in medical radiation imaging and radiation\ntreatment. This multidisciplinary project was funded by\nthe Finnish Education Ministry. A 5-year Memorandum\nof Understanding (MOU) was signed in October 2022\nto extend further student and staff exchanges, joint\nworkshops and applied research opportunities.19\nAPPLIED LEARNING\nLearning\nBy Doing\nA passion for technology led Tristan\n(left) and Leshawn (right) to pursue\nthe Applied Computing (with Fintech\nspecialisation) degree programme\nat SIT. The undergraduates are part\nof the pioneer cohort of students in\nthe programme under the Term-In\nTerm-Out (TITO) pathway, where\nstudents spend at least a trimester\nevery year in the workplace. During\ntheir attachment at UOB, they\nexplored emerging technologies like\nblockchain, which helps companies\nenable decentralisation to achieve\ngreater transparency.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2023\n“The TITO pathway is an excellent pathway for\nstudents to learn by doing. Every year in the third\ntrimester, we get to apply what we have learnt in the\nfirst 2 trimesters to the real world. It helps develop my\nprofessional skills and widen my industry experience.\nThis basically gives us a head start.”\n“It was great to have a mentor at\nUOB who guided me during my\nwork attachment. I enjoy both\ntheory and hands-on learning,\nand that is why the TITO pathway\nworks well for me.” TRISTAN RAJ SHANKAR\nBSc (Hons) Applied Computing\n(with Fintech specialisation)\nLESHAWN CHAN\nKHIN MING\nBSc (Hons) Applied Computing\n(with Fintech specialisation)\nApplied Research\nGrowing applied research is key to strengthening SIT’s applied learning. Focusing on translational\nresearch and innovation, we aspire for research outcomes that demonstrate application pathways\nwhich will drive industry transformation and train talent for industry.\nSince ramping up research in 2020, SIT inked close to 150 applied research-related agreements\nwith industry partners to work on research and innovation projects. SIT’s external grants and\nindustry contributions have grown by 4.0 and 3.9 times respectively, from FY2020 to FY2022.\nCommunity Health\nTransformationSustainable\nFood InnovationSustainable\nInfrastructure\nEngineering &\nMaintenanceSustainable\nMaritime\nEngineeringEnergy\nResilience\nTECH ENABLERS\nArtificial Intelligence, Cybersecurity, Augmented/Virtual Reality,\n5G/6G & Future Communications, Robotics and Autonomous SystemsTRANSLATIONAL RESEARCH AND INNOVATION FOCUS\nSIT’s research focuses on 5 domain areas, with Sustainable Maritime Engineering identified as a new domain focus\nin our translational research strategy in FY2022. As we prepare to relocate to our new campus in Punggol, which\nis situated in a digital and coastal district, we look forward to growing our thought leadership in these domains,\nworking with industry partners and leveraging our Living Labs.\nSTRATEGIC TRANSLATIONAL RESEARCH PROGRAMMES AND ENABLERS\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202322\nAPPLIED RESEARCH PROJECTS: KEY HIGHLIGHTS\nIn FY2022, some of our applied research outputs have been adopted by and delivered impact to industry partners.\nDEVELOPING SUSTAINABLE AND SMART\nTECHNOLOGIES FOR SHIPS AND SYSTEMS\nOver the last 3 years, SIT secured $1.5 million in applied\nresearch grants in maritime engineering. Projects included\n(i) digital twinning of electrical harbourcraft for design\nenhancements with Seatech and the Technology Centre\nfor Offshore and Marine, Singapore, as well as (ii) data-\ndriven AI models for estimating ships’ carbon emissions\nwith Wärtsilä and the National University of Singapore.\nPrevious collaborations with PSA Marine and Penguin\nInternational supported maritime sustainability, notably\nwith Greenhouse Gases (GHG) emissions mapping.\nSTRENGTHENING SINGAPORE’S R&D EFFORTS IN\nSUSTAINABLE MARITIME ENGINEERING\nFaculty members from SIT’s Naval Architecture and\nMarine Engineering programme onboard Penguin Tenaga,\nSingapore’s first hybrid-powered vessel.\nDRIVING SUSTAINABLE FOOD INNOVATION\nFoodPlant, a shared food production facility jointly set up by Enterprise Singapore, JTC Corporation and SIT,\nwas officially launched in April 2022 to support innovation in the food manufacturing industry. The facility is\nlicensed by the Singapore Food Agency and equipped with state-of-the-art food processing technologies,\nfeaturing 12 specialised rooms for small-batch food production.\nAs of March 2023, close to 30 companies comprising both MNCs and SMEs have benefitted from this facility,\nproducing more than 100 prototypes, of which 7 have been commercialised. FoodPlant helped a local company,\nFish Soup Paradise, to develop new shelf-stable soup pouches, which could be stored at ambient temperatures\nand ready to be heated up for consumption. To date, Fish Soup Paradise has sold more than 10,000 packs of\nsoup and is building its own food facility to scale production. Another beneficiary of FoodPlant is Sustyfoods,\na direct-to-consumer brand selling healthy, calorie-controlled food products online, which used to outsource\ntheir production. By partnering with FoodPlant, they were able to lower their costs of production by about\n30% and catalyse their own food manufacturing business. Other companies which have developed commercial\nproducts through FoodPlant’s support are Agrocorp International, WellSpent and Green Capsule.\nFoodPlant has conducted 4 customised training courses in collaboration with Workforce Singapore for\n6 companies, as well as another 3 customised training courses to help Singapore food companies adopt\nadvanced food processing technologies.\nADVANCING FOOD INNOVATION\nCommercialised products from FoodPlant. (Photos are sourced from the respective companies)23\nAPPLIED RESEARCH\nIMPROVING PRODUCTIVITY IN THE\nCONSTRUCTION SECTOR\nThe Construction Technology Innovation Laboratory\n(CTIL) serves as a platform for the development of\ninnovative construction technologies to enhance the\nproductivity of the Singapore construction sector. In\nFY2022, CTIL successfully obtained $1.47 million for 3\nresearch projects working with 4 industry partners. CTIL\nalso developed 2 patents during this period.\nSTRENGTHENING SINGAPORE’S\nTUNNELLING AND INFRASTRUCTURE\nDEVELOPMENT CAPABILITIES\nThe Centre for Infrastructure and Tunnel Engineering\n(CITE) was established in collaboration with the Land\nTransport Authority (LTA). The centre focuses on projects\nto enhance productivity and safety throughout the\nlifecycle of infrastructure and tunnels, including design,\nconstruction, operation and maintenance. CITE also plays\na vital role in upskilling civil engineers in these domains.ENHANCING SUSTAINABLE INFRASTRUCTURE\nENGINEERING AND MAINTENANCE\nAn example of an ongoing project is the development\nof high-performance pre-engineered steel concrete\ncomposite beams that offer several advantages over\ntraditional concrete flooring systems, including cost-\neffectiveness, reduced weight and lower embodied\ncarbon emissions. The industry partner is currently\nconducting trials to assess the technology’s feasibility\nand effectiveness.CITE worked with LTA on a project that focuses on\nconcrete reinforcement with steel fibres to make tunnels\nsafer, save man hours and minimise corrosion from water\nseepage. These fibres greatly increase the durability\nof concrete and prevent cracking, which is particularly\ncrucial for transport tunnels such as MRT lines, where\nthe availability of limited operational downtime restricts\nrepair opportunities. CITE provided material tests, design\nreviews, as well as scaled model tests.CITE staff and students conducting lab test for the Fibre Concrete project.\nDevelopment of high-performance pre-engineered steel\nconcrete composite beams by CTIL. (Photo: Prof. Yang Bo,\nChongqing University, China)\nChart comparing embodied carbon emissions volume from\nhigh-performance beam to other conventional beams.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202324\nHELPING COMPANIES TACKLE ENERGY\nCHALLENGES\nThe Energy Efficiency Technology Centre (EETC), a\ncollaboration between SIT and the National Environment\nAgency (NEA), supported more than 25 SMEs to conduct\nenergy sustainability assessments to identify opportunities\nthat can reduce energy-related costs, pollution and\ngreenhouse gas emissions. These initiatives under Phase\n1 will help the SMEs catalyse substantial energy savings\nof up to 12 million kWh (equivalent to about $1.6 million\nin electricity bill savings) and annual carbon abatement of\nup to 4.5 million kgCO2e upon implementation of these\nenergy conservation strategies.\nEETC will train a pipeline of SIT engineering undergraduates\nand upskill existing energy efficiency practitioners in the\nfield. As of FY2022, 70 students have completed their\nattachment in EETC and worked under the supervision\nof Singapore Certified Energy Manager (SCEM)-qualified\nenergy specialists. These training initiatives will grow the\npipeline of talent in the industry.\nWith a recent second tranche of funding from NEA for\nPhase 2, EETC will broaden its impact by establishing a\nspecialised training facility to conduct a hands-on training\nmodule for the SCEM course to support more SMEs ENHANCING ENERGY RESILIENCE\nin developing and upskilling these capabilities in their\nemployees. EETC will also leverage the SIT Punggol\nCampus as a testbed to unlock new opportunities to\ncatalyse applied research projects.\nDRIVING INDUSTRY INNOVATION\nTHROUGH INNOHUB\nInnoHub comprises 4 interconnected innovation centres,\nnamely Design Factory@SIT (DF@SIT), National Additive\nManufacturing Innovation Cluster (NAMIC Hub@\nSIT), Rapid Product Innovation and Development\n(RaPID) Centre, and SIT-Poly Innovation Centre of\nExcellence (SPICE). These centres work synergistically\nto drive innovation and contribute to the development\nof innovative solutions for industry.As of 31 March 2023, InnoHub and its innovation\ncentres have secured nearly $6 million in external\nfunding to set up the innovation infrastructure and\nto support their manpower resources. More than 600\nstudents and Professional Officers actively participated\nin various innovation projects and activities, successfully\ndeveloping 25 innovation projects in collaboration\nwith industry.Training of talent pipeline for the industry.\nTeam members from Innohub and the 4 innovation centres.\n25\nAPPLIED RESEARCH\nPOLLEN-BASED HYDROGEL FILM\nTO PREVENT POST-SURGERY\nCOMPLICATIONS\nA/Prof Cheow Wean Sin from the Food, Chemical and\nBiotechnology Cluster teamed up with local startup\nSporogenics, to develop a fully biodegradable and\nbiocompatible pollen-based hydrogel film to prevent\npost-surgery complications. The hydrogel film acts\nas a membrane barrier against peritoneal adhesion\nand releases a treatment drug at the adhesion site.\nThe prototypes are undergoing clinical trials, and\nSporogenics hopes to introduce hydrogel film to the\nglobal market by 2026.\nA/Prof Cheow Wean Sin developed a hydrogel film that can\nprevent post-surgery complications.CONTRIBUTING TO COMMUNITY\nHEALTH TRANSFORMATION\n(Left) Design for Additive Manufacturing (DfAM) enhanced passive heat sink and the different generated design computational\nresults, a project by NAMIC Hub@SIT.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202326\nCOVID-19 WASTEWATER-BASED\nEPIDEMIOLOGY\nAsst Prof Elisa Ang from the Engineering Cluster\ncollaborated with the Home Team Science and Technology\nAgency (HTX) to develop a robust predictive algorithm\nthat can estimate the prevalence of symptomatic and asymptomatic COVID-19 infection based on measurable\ndata obtained through wastewater monitoring. The\ndeveloped algorithm can take the measured RNA copies\nin wastewater and estimate the prevalence of COVID-19\ninfection. The algorithm can also be utilised for disease\nmonitoring or other applications that require wastewater-\nbased surveillance such as drug detection.\nUNDERSTANDING BEHAVIOURAL MAP\nTO ASSESS QUALITY OF PHYSICAL\nACTIVITY IN STROKE SURVIVORS\nA behavioural map to assess the quality of physical\nactivity in residential stroke survivors across different\ninstitutional settings in Singapore was developed by a\nHealth and Social Science faculty, Asst Prof Choo Pei Ling\nand her team. The behavioural map was validated across\n4 community hospitals and nursing homes to capture a\nmyriad of rehabilitation settings. 11 SIT physiotherapy\nstudents were trained in a real-life healthcare setting and\nemployed by hospitals and polyclinics upon graduation.COVID-19\nwastewater-based\nepidemiology\nwith predictive\nalgorithm.\nMOTIVATE: A MULTI-MODAL TRAINING\nPROGRAMME TO PROMOTE PHYSICAL\nACTIVITY AFTER STROKE\nThe MOTIVATE project, funded by SIT’s Ignition Grant\nand in collaboration with the Singapore National Stroke\nAssociation, developed a multimodal training programme\nto promote physical activity (PA) after stroke in Singapore. A/Prof Kwah Li Khim from the Health and Social Science\nCluster led this initiative, which has since secured a\nSingHealth research grant to test the programme’s\neffectiveness through a randomised controlled trial. This\nproject could potentially lead to the development of an\naffordable and scalable programme that will offer stroke\npatients the same PA opportunities as the able-bodied\npopulation in Singapore.\nLed and facilitated by A/Prof Kwah Li Khim from SIT and A/Prof Shamala Thilarajah from SGH, a workshop was held with stroke\nsurvivors and caregivers from Singapore National Stroke Association to refine the physical activity programme. (Photo: diFilm Pixel\nworks/James Chung)\nAn SIT physiotherapy student assisting a residential participant\nin Ang Mo Kio-Thye Hua Kwan Hospital to put on the\naccelerometer/activity tracker.27\nAPPLIED RESEARCH\nDEVELOPING FIRST-OF-ITS-KIND\nCURATED AUGMENTED REALITY TRAIL\nIN THE HEARTLAND\nSupported by SIT’s Ignition Grant, Prof Lim Boon Huat\nfrom the Business, Communication and Design Cluster\ncollaborated with the South West Community Development\nCouncil, Corporate Alliance for Good Ltd, LDR Technology\nPte Ltd and SG Digital Office to launch the Heartland\nGems @ South West Augmented Reality Trail on\n2 July 2022. This initiative aims to encourage residents\nto appreciate the rich history, culture and heritage of the\nheartlands and learn new digital skills in support of the\nDigital for Life movement. SIT students were involved in\nthe development of the user experience concept and\ndigital content for the trail, as well as the design of a\nheritage logo embedded with a QR code.ADVANCING INFOCOMM\nTECHNOLOGY ADOPTION\nSouth West District Mayor Low Yen Ling (right), with SIT faculty and students at the launch of the Heartland Gems @ South West\nAugmented Reality (AR) Trail on 2 July 2022. (Photo: South West Community Development Council)\nReal-time Risk Assessment Cooperative Mode (ReRAC).\nMobile Camera Acquisition System (MoCAS).ENHANCING ROAD SAFETY THROUGH A\nREAL-TIME RISK ASSESSMENT SYSTEM\nThis 4-party collaborative project is supported by the\nNational Research Foundation, Singapore, and the LTA\nunder its Urban Mobility Grand Challenge Programme, and\nled by Senior Lecturer Dan Chia (Infocomm Technology)\nin partnership with MooVita, Strides Frontiers and the\nUniversity of Glasgow, Singapore. The team developed a\nreal-time risk assessment methodology and created a novel\nSpatial Temporal Risk Estimation Ensemble Technique\n(STREET) algorithm using deep learning embedded with a\nmodel-based risk tagging approach. The outcome product\nis a Mobile Camera Acquisition System (MoCAS) that\nperforms STREET risk tagging of the environment. Building\non this outcome, the team moved on to develop a novel\nReal-time Risk Assessment Cooperative Mode (ReRAC)\nsystem to alert drivers in advance of potentially hazardous\nevents at specific times and locations. The technology\nenables advance notice through Smart Infrastructure,\nincluding 5G communication and edge computing for\ndrivers to avoid risk. This Smart Infrastructure equipped\nwith the ReRAC will be deployed at 6 locations within\nNgee Ann Polytechnic.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202328\nIn addition to securing grants, our academic staff are also\nactively encouraged to leverage SIT’s Industrial Doctorate\nand Industrial Masters (ID/IM) programmes to grow their\nresearch capability through practice-oriented research\nwith industry partners. SIT’s ID/IM programmes have\ngarnered the participation of 21 companies.An example of a successful partnership is NVIDIA,\nwhich currently has 7 employees enrolled in our ID/\nIM programmes.TRAINING MANPOWER FOR INDUSTRY\nTHROUGH APPLIED RESEARCH\nCURRENT ENROLMENT (AS OF FY22)\nFY2020 Enrolment FY2021 Enrolment FY2022 Enrolment05101520253035\n2 261531\n258\n212\n114\n4\nM.Eng M.ClinRes D.Eng D.ClinRes TotalCURRENT ENROLMENT (AS OF FY2022)29\nAPPLIED RESEARCH\n“The CCP is a perfect\nopportunity that melds my\npassion in science and helping\nothers. I did not want to spend\nthe rest of my life lamenting\nthe opportunities that I didn’t\ntake advantage of while I had\nthe chance.”\nIFFAH FARZANAH BINTE\nMOHAMED FAUZAN\nBSc (Hons) Diagnostic Radiography\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2023\nFrom\nNursing To\nRadiography\nA keen interest in healthcare and\ntechnology drove Iffah to make\na mid-career switch from nursing\nto radiography. After working as\na nurse for 4 years, she enrolled\nin SIT’s Diagnostic Radiography\ndegree programme under the\nCareer Conversion Programme\n(CCP). The CCP equips mid-\ncareer switchers with training\nopportunities to help them gain\na footing in their desired career.\nIndustry\nSIT has developed thriving and symbiotic partnerships with industry in formulating and delivering\nits education and research programmes. Industry involvement is evident and sustained in SIT’s\neducational, applied research and innovation activities. The University also works closely with\nindustry partners to support industry’s growth, transform work processes, move up the innovation\nvalue chain, and develop manpower capabilities.\nSIT’s industry-focused learning and research efforts position us well to meet industry demands\nand the lifelong learning needs of the future workforce.\nCHAMPIONING LIFELONG LEARNING\nSINGAPORE’S FIRST COMPETENCY-BASED\nSTACKABLE MICRO-CREDENTIALS PATHWAY\nSIT has partnered with NCS, Singtel, Singapore Computer Society, and 3 polytechnics (Nanyang Polytechnic,\nSingapore Polytechnic and Temasek Polytechnic) to offer Singapore’s first Competency-based Stackable\nMicro-credentials (CSM) degree pathway for in-employment learners.\nThe CSM degree pathway is piloted through the Bachelor of Science with Honours in Applied Computing\nprogramme and comprises micro-credentials, a workforce essentials component and a capstone project.\nThe pathway allows in-employment learners to earn micro-credentials, or qualifications in specialisations\nsuch as cybersecurity, software engineering and network systems, to complete their degree. Separately,\nlearners could also just subscribe to each micro-credential as a standalone, which would equip them with\nthe necessary competencies to start pivoting to new job opportunities.\nThe micro-credentials will be delivered via a combination of asynchronous and synchronous modes, augmented\nby face-to-face sessions for practical and laboratory experiments, allowing learners the flexibility to personalise\ntheir learning journey while managing multiple commitments.\nThe competency-based education approach in the CSM degree pathway ensures learners acquire both\nknowledge and skills, as well as the competency to apply them at work, empowering them to stay\nrelevant in their industries. The first intake in September 2023 comprises mainly in-employment learners\nfrom Singtel and NCS.\nAn MOU signing ceremony was held on 28 November 2022 between SIT and partners — NCS, Singtel, Singapore\nComputer Society, Nanyang Polytechnic, Singapore Polytechnic, and Temasek Polytechnic — to launch the CSM\ndegree pathway.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202332\nALIGNED WITH INDUSTRY NEEDS\nSIT strives to develop relevant and timely courses and\nprogrammes to meet industry needs through its lifelong\nlearning unit, SITLEARN Professional Development. In\n2022, more than 4,000 CET training places were offered\nto upskill/reskill learners.\nPIONEER BATCH: POSTGRADUATE\nDIPLOMA IN SONOGRAPHY\nSIT is the first autonomous university to offer a Postgraduate\nDiploma in Sonography to meet the demand for skilled\nsonographers in allied health. Modules can be taken\nindividually or be stacked towards a Postgraduate Certificate\nor Diploma. Since 2019, over 40 allied health professionals\nhave embarked on this specialised programme. In November\n2022, the pioneer batch of 5 learners graduated with a\nPostgraduate Diploma in Sonography.\nINAUGURAL BATCH: POSTGRADUATE\nCERTIFICATE IN URBAN RAILWAY\nTECHNOLOGY\nIn collaboration with Singapore Rail Academy, SBS Transit,\nand SMRT Corporation, SIT launched the Postgraduate\nCertificate in Urban Railway Technology (PGCert URT)\nin 2021. Designed for engineering professionals in the\nlocal rail industry, the programme equips learners with\nspecialised skills in the planning and management of railway\nassets. The inaugural batch of 11 learners completed the\nprogramme in December 2022, while the second batch of\n15 learners commenced the programme in January 2023.\nSKILLSFUTURE CAREER TRANSITION\nPROGRAMME (SCTP) IN DESIGN\nINNOVATION\nIn 2022, SIT launched the SkillsFuture Career Transition\nProgramme (SCTP) in Design Innovation. The SCTP supports mid-career individuals in gaining industry skills\nand expanding employment prospects through project\nopportunities and career support. The first cohort of 7\nlearners worked on real-life application projects with\nindustry partner Purely Fragrances. They gained skills and\nknowledge on the key drivers of innovation and developed\ninnovative solutions for new product launches.\nELECTRICAL SAFETY SYMPOSIUM 2023\nSIT’s maiden Electrical Safety Symposium held at SIT@\nDover on 4 January 2023 drew over 260 attendees.\nThe event featured industry experts who shared best\npractices in preventing electrical-induced injuries and\nfire hazards. The full-day symposium featured speakers\nfrom the Energy Market Authority, National Fire and\nEmergency Preparedness Council, Ministry of Manpower,\nON Engineers, The Institution of Engineering and\nTechnology, Singapore Civil Defence Force, Singapore\nBattery Consortium, DEHN Asia Pacific, SJ Thames,\nSunlight Electrical and SIT.\nPARTNERSHIP WITH APPLIED\nMATERIALS TO SUPPORT FUTURE-\nREADY WORKFORCE\nApplied Materials South East Asia Pte. Ltd. and SIT\nsigned an MOU to provide CET programmes to Applied\nMaterials employees. The aim is to contribute to the\nmanpower capability building of the local semiconductor\nindustry and its ecosystem. The learning programmes\nare customised and offered through short courses and\nstackable postgraduate modules related to Industry 4.0\nconcepts, such as artificial intelligence, data engineering,\nthe Internet of Things, machine learning and smart\nfactory. To date, over 200 Applied Materials employees\nhave participated in courses offered by SIT.\nMOU signing between Applied Materials and SIT in July 2022. (Photo: Applied Materials South East Asia)33\nINDUSTRY\nGROOMING WORK-READY TALENTS\nA WINDOW OF OPPORTUNITIES\nTHROUGH INTEGRATED WORK STUDY\nPROGRAMME (IWSP)\nThe Integrated Work Study Programme (IWSP) is a\nhallmark feature of SIT’s degree programmes, where\nT-UP EAGLES AWARDS: RECOGNISING\nIWSP EXCELLENCE\nSIT has been partnering with the Agency for Science,\nTechnology and Research (A*STAR) to engage local\nenterprises to provide industry R&D IWSP opportunities\nfor its students. The A*STAR-SIT Technology for Enterprise\nCapability Upgrading (T-Up)/IWSP collaboration enables\nlocal enterprises to build their in-house R&D capabilities\nwith the researchers seconded from A*STAR, while the\nSIT’s Centre for Career Readiness (CCR) grooms students to be work-ready employees who contribute to their\norganisations from day one. It boosts students’ employability through initiatives such as work attachments, career\nevents and career mentorship programmes.\nstudents undertake up to 12 months of work attachment\nrelevant to their course of study. The longer duration\nallows students to apply what they have learned in real\nwork situations. In AY2022, about 1,900 SIT students\nwent for their IWSP with opportunities offered by more\nthan 750 industry partners.\nA*STAR researchers will mentor and work with the IWSP\nstudents attached to the company.\nIn 2022, the newly-introduced T-Up Eagles Awards\ncommended 4 SIT student innovators who have excelled\nin their work attachments at local enterprises under the\nT-Up/IWSP partnership. As of AY2022, the partnership has\nseen 16 completed T-Up/IWSP cases with the participation\nof 21 students from various degree programmes.\nCAREER NEXUS 2023: NETWORKING\nWITH PROSPECTIVE EMPLOYERS\nHeld on 1 February 2023 at the Sands Expo and\nConvention Centre, Career Nexus organised by CCR\ngathered about 2,000 students and representatives from 205 companies, far exceeding the participation\nrate at the last physical event in 2020. The annual career\nfair is a platform for students to network with company\nrepresentatives, explore IWSP options, and seek full-time\nemployment opportunities.  Thriving conversations between job seekers and participating companies at Career Nexus 2023.\nT-Up EAGLES award winners with Ms Chan Lai Fung, Permanent Secretary (National Research and Development) and Chairman,\nA*STAR; Professor Chua Kee Chaing, SIT President; and company representatives. (Photo: A*STAR)\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202334\nNURTURING FINTECH TALENTS\nIn November 2022, SIT inked 7 MOUs with 6 financial\ninstitutions and an IT service provider at the Singapore\nFintech Festival to jointly nurture fintech talents. The\npartners are AIA Singapore, DBS Bank, Oversea-Chinese\nBanking Corporation (OCBC), Prudential Singapore,\nStandard Chartered Bank, United Overseas Bank (UOB)\nand Infosys.\nThis partnership signifies the commitment to jointly\nnurture talents in the Applied Computing (Fintech FORGING STRATEGIC\nCOLLABORATIONS WITH INDUSTRY\nRobust engagement with industry through collaborations is pivotal in exchanging knowledge, deepening applied\nlearning and catalysing innovations. In AY2022, SIT forged several key MOUs and partnerships with the industry in\nvarious areas.INDUSTRY MENTORSHIP\nPROGRAMME (IMP)\nSIT continues to organise the Industry Mentorship\nProgramme (IMP) with Young NTUC to prepare students\nfor their future careers. Through the programme, students are paired with industry mentors for 5 months to receive\nindustry-specific guidance, develop career paths, and\nbroaden their perspectives on career opportunities. Since\nits inception in 2018, the IMP successfully completed\nits 6th run in June 2023, and the programme benefitted\nclose to 500 students from 20 degree programmes.\nspecialisation) degree programme. Through the\nMOU, the industry partners will participate in the co-\ndevelopment of the degree programme and provide\nrelevant work attachments and learning opportunities in\nthe SkillsFuture Work-Study Degree (WSDeg) pathway\nunder the Term-In Term-Out (TITO) model. SIT students\nand faculty can also participate in Fintech projects\nwith industry partners to deliver integrated solutions\nthat address real-world business challenges. A total of\n14 students were awarded placements in the WSDeg\npathway in AY2022.Mentors and mentees from the 6th run of the Industry Mentorship Programme at the IMP Appreciation Night.\nKey representatives at the MOU signing ceremony to collaborate on the WSDeg pathway.35\nINDUSTRY\nDRIVING HEALTHCARE INNOVATION\nIn September 2022, SingHealth and SIT extended their\npartnership to co-develop education programmes and\ncollaborate on healthcare research till 2026. Both parties\nwill focus on solutions to improve healthcare operations\nand processes for early diagnosis and intervention, and\nto bring healthcare services from the hospitals closer to\nhome. The partnership will also look at developing a Living\nSTRENGTHENING R&D EFFORTS IN\nLAND TRANSPORT\nThe SMRT-SIT Transport Living Lab (TLL) was\nestablished in November 2022 to co-create land\ntransport solutions to address SMRT’s operational\nproblems. SIT will be an extension of SMRT’s\nLab in the Punggol and Sengkang estates, leveraging\nSingHealth’s healthcare facilities to provide an authentic\nand hands-on experience for SIT students. Another area\nis the experimentation and co-development of new\nhealthcare innovations. There will be opportunities for\nSIT students and academic staff to work with SingHealth\ninnovators on tackling real-world healthcare challenges\nthrough applied research and innovation.\nengineering arm, while SMRT offers its infrastructure\nand facilities to SIT academic staff and students for\napplied learning and research. The collaboration\nwill also explore applied research opportunities and\nstaff exchange initiatives, thereby strengthening the\ntalent pipeline for SMRT and the land transportation\nindustry, and upskilling the SMRT workforce. The SingHealth-SIT MOU signifies a multi-faceted collaboration to co-develop education and research programmes.\n(Photo: SingHealth)\nThe partnership with SMRT saw the set-up of the Transport Living Lab, which will provide mutual benefits for both organisations.\n(Photo: SMRT Corporation)\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202336\nDEVELOPING EXCELLENCE IN\nDISTRICT COOLING\nGlobal energy and services group ENGIE and SIT inked\nan MOU in July 2022 to jointly develop a district cooling\ncentre of excellence in Singapore. The ENGIE-SIT District\nCooling Centre of Excellence will catalyse innovation in\ncooling solutions across the Asia-Pacific. The partnership\nA BOOST TO SINGAPORE’S MARITIME\nECOSYSTEM\nLeading classification society DNV and SIT signed a 3-year\nMOU in September 2022 to progress net-zero ambitions\nin Singapore’s maritime sector. Both parties will focus on\nadvancing zero-emission and autonomous ships; shore\nremote control and simulation centres; shore charging\nand future fuel bunkering infrastructure.\nincludes joint development and funding of applied\nresearch, as well as knowledge exchange between\nENGIE Southeast Asia, ENGIE Lab Singapore and SIT.\nIt also covers work attachment and commercial district\ncooling system (DCS) development opportunities for\nSIT students. ENGIE is currently building a DCS plant\nat SIT’s Punggol Campus.\nThe collaboration combines SIT’s applied learning\npedagogy and DNV’s Simulation Trust Centre to\nconduct lessons on optimising ship system design for\nhydrodynamics, energy, emissions and safety management.\nStudents will have opportunities to work on final-year\nprojects in maritime technology applications, undertake\nIWSP at DNV, and co-organise student competitions.An MOU signing ceremony was held in Singapore, attended by key representatives from ENGIE and SIT. (Photo: ENGIE)\nThe collaboration between DNV and SIT aims to promote maritime decarbonisation and digitalisation. (Photo: DNV)37\nINDUSTRY\n“As young engineers, our\nimaginations can go wild. We\nare excited to apply what we\nhave learned at SIT to this\nproject. Our mentors kept us\ngrounded and reminded\nus that the best designs\nare those that are the\nsimplest.”\nTHE BLOOBOX\nTEAM\nSherry Low, Ralph Gerald Apostol\nFaller and Axal Ang Yong Sheng\nSustainable Infrastructure\nEngineering (Land)* degree\nprogramme\n*The programme has been renamed\nBachelor of Engineering with\nHonours in Engineering Systems from\nAcademic Year 2023.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2023\nPromoting\nRecycling\nWith\nBloobox\nSITizens (from left) Sherry, Ralph\nGerald and Axal were given a\nmonth to conceptualise, design and\nprototype a recycling receptacle\nfit for use by all households in\nSingapore. Spearheaded by the\nNational Environment Agency,\nthe project threw real-world\nchallenges at these students from\nthe Sustainable Infrastructure\nEngineering (Land) degree\nprogramme. With help from mentors\nat SIT, the team’s efforts paid off.\nIn March 2023, their creation —\naffectionately named Bloobox —\nwas rolled out to the public via\n140 vending machines island-wide.\nCommunity\nSIT aims to build a university ecosystem that provides opportunities, resources and mentorship\nto enable SITizens to serve the community by utilising their knowledge and skills gained through\ntheir studies and job experience. Throughout the year, students, faculty, and staff at SIT were\nactively involved in meaningful collaborations to benefit the social, economic, or environmental\naspects of the community.\nCOMMUNITY PROJECTS AND\nCOLLABORATIONS\nTECH FOR GOOD 2022\nAt SIT, students have ample opportunities to hone their technical and\nindustry-relevant skills while building empathy towards others in society.\nCompetitions such as Tech for Good (T4G), organised by Engineering\nGood and co-produced by SIT, give students the chance to contribute\nto vulnerable communities.\nHeld at the National Library on 1 October 2022, T4G 2022 featured 30\nshortlisted teams, including 3 teams from SIT. Team MECIT from SIT\nclinched the Best Advocate award. Its prototype allows users to position\na mobile phone attached to a motorised arm on a wheelchair, snap\npictures and review them straight away. As users navigate the various\noptions on the app by winking, they can enjoy a more independent\nform of recreation and expression.\nTeam MECIT received the Best Advocate Award at T4G 2022 for their device (right) that helps users capture photos\nconveniently. (Photo: Engineering Good)\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202340\nSIT COMMUNITY CHALLENGE 2022\nThe SIT Community Challenge is an annual competition\norganised by SIT, James Dyson Foundation and\nGreendale Secondary School. Themed ‘Sustainable\nLiving’, the 2022 edition of the challenge involved 300\nsecondary 2 students from Greendale and 10 student\nmentors from SIT’s Yes!Program. The students went\nthrough prototyping workshops to work on designing\nor re-designing a product or service that can promote\nsustainability at home or in their community.\nCOMMUNITY EVENTS\nOn 6 August 2022, visitors to the NDP@Heartlands\ncelebrations in Punggol got a chance to experience\nSIT’s virtual campus through an interactive virtual\nreality experience. The event, which took place in\nPunggol Field, was attended by 30,000 residents from\nPunggol, Pasir Ris, Sengkang and Tampines. In an effort\nto bring healthy living to the community, 80 students\nfrom the Physiotherapy degree programme provided\ncomplimentary sports massages for participants of the\nStandard Chartered Run in December 2022.SIT Community Challenge 2022 brought together students and staff from SIT and Greendale Secondary School to promote\nsustainable living. (Photo: Greendale Secondary School)\nSITizens gave visitors a glimpse of SIT’s Punggol Campus via virtual reality.Students from SIT’s Physiotherapy programme giving sports massages to participants of the run.41\nCOMMUNITY\nFIRST YEAR EXPERIENCE 2022\nWELCOMES NEW SITIZENS\nAfter 2 years of being held online, SIT welcomed over\n3,000 freshmen in person at SIT@Dover for the First\nYear Experience. From 20 to 26 August 2022, freshmen\nlearned more about SIT through a series of induction\nprogrammes — University Life Club Fair, Day Zero and\nHelix. The University Life Club Fair gave freshmen a taste\nof SIT’s vibrant university life through over 100 exhibition\nbooths and 40 student performances and workshops.STUDENT ENGAGEMENT AND DEVELOPMENT\nComplementing SIT’s community efforts is the shaping of future leaders of Singapore through various student activities\nand scholarships.ENGAGING THE MIGRANT WORKER\nCOMMUNITY\nIn January 2023, 3 SIT student groups — Muzeka, Soul\nExtreme and SITintegrates — collaborated with JTC to\norganise a carnival for the migrant worker community.\nActivity booths and performances were held to engage\nand thank the workers who contributed to the construction\nof the SIT Punggol Campus.\nIn addition, SITintegrates partnered with the Ministry\nof Manpower (MOM) and Westlite Papan Dormitory on\noutreach programmes for the migrant worker community.\nIn FY2022, more than 700 migrant workers participated\nin various sports, arts and cultural activities organised\nby SITizens. SIT was recognised as a valued partner of\nthe Assurance, Care and Engagement (ACE) Group at\nan MOM Appreciation Lunch for its efforts in integrating\nmigrant workers into the community.\nSIT students and migrant friends at Punggol Digital District\n(PDD) dormitory having a game of jumbo Jenga.\nDay Zero took place over 7 sessions covering all academic\nclusters and provided a platform for purposeful interaction\nbetween first-year students, seniors, academic staff and\nindustry speakers.\nThe week-long orientation culminated in Helix, where\nfreshmen displayed their talents through performances,\nfostered community resilience and forged new friendships\nthrough various group activities, expanding their social\nsupport for their academic journey.SIT students sharing their cultural game of 5 stones with the\nmigrant brothers.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202342\nFirst Year Experience (FYE) is back as a fully physical event after 2 years of being held in an online/hybrid mode.\nNEW PERFORMING ARTS GROUP\nThe SIT Chinese Orchestra was formed in July 2022\nto celebrate traditional Chinese music and culture and\nfoster a sense of belonging for SIT student musicians on\ncampus. With only 12 initial members, the Orchestra has\n(Left) SIT Chinese Orchestra members with Guest-of-Honour Senior Minister Teo Chee Hean at the Community Chest Fú Dài event.\n(Right) The SIT Chinese Orchestra performing at the Graduation Dinner 2022.\ngrown exponentially to 70 members within 10 months.\nIn their first year, the SIT Chinese Orchestra performed\nat multiple events such as SIT Open House, Student\nLeaders Appreciation Night, Graduation Dinner and the\nCommunity Chest Fú Dài event. 43\nCOMMUNITY\nSINGAPORE UNIVERSITY GAMES (SUNIG)\nSUniG was the highlight of the University sporting calendar\nthat saw SIT pitting its athletes against teams from other\nautonomous universities. The annual sporting affair aims to\nunite students through sports and foster inter-university\nfriendship. SIT was represented by 389 student athletes\nacross 16 sporting categories. The SITizens brought home\n10 medals, including the first gold medal in Men’s Football.\nGROOMING FUTURE LEADERS\nTHROUGH SCHOLARSHIPS\nWe support and nurture our students through a wide\nrange of scholarships made available by the University\nand our partners.\nHeld on 11 November 2022, the annual SIT Scholarship\nAwards and Appreciation Ceremony welcomed 34 new\nSIT Scholars, as well as recognised the contributions\nand achievements of 26 graduating scholars. The SIT\nScholarship aims to cultivate well-rounded individuals\nwho will shape student culture at SIT, contribute to the\ncommunity, assume roles as future leaders for Singapore’s\ngrowing industries, and become responsible global citizens.\nAt the Recognition of Excellence 2022 held on 17\nNovember 2022, a total of 77 Book Prizes, Outstanding\nStudent Awards, Yearly Performance Awards and 198\nScholarships were presented. The awards are made\npossible by the generosity of SIT’s philanthropic partners.\n2 key events were held in November 2022 for scholarship and award recipients.(Top) The SIT Women’s Basketball team received the bronze medal. (Bottom) The SIT Men’s Football Team won the gold medal.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202344\nAt SIT, we believe that a strong culture is essential to align\neveryone toward our mission. While our strategic goals\nestablish where we want to be, culture determines how we\nget there. A shared work culture and values help to keep\nemployees united in purpose, allowing different perspectives\nto help shape and improve outcomes at the workplace.\nBUILDING A STRONG SIT CULTURE\nThe SIT Culture Handbook was launched on SIT Day on\n28 March 2023. The handbook comprises a collection of\nstories contributed by staff that aims to promote a shared\nwork culture in the University.\nThe Culture Induction Programme (CIP) was introduced to\nacquaint employees with SIT’s core values. Commenced in\nNovember 2022, CIP has completed 6 runs of workshops\ninvolving more than 200 participants. The CIP is part of\nSIT’s culture-building effort that introduces new employees\nto the University’s culture, values and mission. EMPLOYEE WELLNESS AND\nWORKPLACE CULTURE\nPROMOTING STAFF WELL-BEING\nWith staff well-being being one of the key pillars of SIT’s\nEmployee Value Proposition, the SIT Staff Well-being\nFramework was launched during the inaugural Staff\nWell-being Day in May 2022. The framework focuses\non 3 areas — mental, physical and social well-being —\nthat will serve as the roadmap for upcoming initiatives\nand programmes.\nLaunched in August 2022, SIT Revitalize is a holistic\nemployee health and well-being programme that\nengages staff through an interactive digital platform\nby a leading corporate health provider, Virgin Pulse.\nWith content spanning physical, emotional, financial and\nmental health, SIT staff have access to evidence-based\ntools and resources that support their health and well-\nbeing needs. To date, 46% of staff have enrolled on SIT\nRevitalize, with half actively engaged on the platform.\nSITIZENS FORM 7 NEW SIT ALUMNI\nGROUPS\nGraduating does not mean having to leave one’s friends\nand interests from university days behind. In 2022,\nmore than 200 SIT alumni came together to form 7 new\nofficial Alumni Groups to stay connected with fellow SITizens who share the same interests. The groups —\nSIT Muzeka Alumni Group, SIT Tennis Alumni Group,\nSIT Running Alumni Group, SIT Handball Alumni Group,\nSIT Air Transport Management (ATM) Alumni Group, SIT\nGlasgow School of Art (GSA) Alumni Group, and SITizen\nAmbassadors Alumni Group — are supported by the SIT\nAdvancement & Alumni Division.\nSIT Culture Handbook and Culture Induction Programme are initiatives to promote a strong workplace culture.45\nCOMMUNITY\nSustainability at SIT\nSIT contributes to Singapore’s sustainability goals with a focus on 3 areas: Building a Sustainable\nCampus, Driving Sustainability Research & Innovation, and Developing Sustainability Talent.\nEach of these focus areas has a dedicated workgroup, chaired by SIT Senior Management members\nto drive SIT’s Sustainability Strategy.DRIVING SUSTAINABILITY STRATEGY IN THREE\nFOCUS AREAS\nSUSTAINABLE CAMPUS\nLed by Deputy President\n(Administration) & Chief\nFinancial Officer and Vice\nPresident (Planning)\nEnsuring sustainability in SIT’s\npolicies, practices and\noperations.\nInculcating strong\nsustainability\nvalues and\npractices among\nour staff and students.\nSUSTAINABILITY TALENT\nLed by Deputy President\n(Academic) & Provost\nProducing graduates who can\nsecure new jobs in sustainability as\nwell as contribute to strengthening\nsustainability in industry sectors.SUSTAINABLE RESEARCH\n& INNOVATION\nLed by Deputy President\n(Industry & Community)\nDeveloping innovative\ncapabilities and solutions for\nindustry and\ncommunity\nthat support\nSingapore’s\nsustainability\ngoals.\nResearch &\nInnovation\nSustainability\nTalentSustainable\nCampus\nSIT Sustainability\nStrategy\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202346\nECO-FRIENDLY OFFICES\nAll offices across the 6 SIT campuses have attained Eco\nOffice Certification awarded by the Singapore Environment\nCouncil. This is a recognition of the University’s efforts\nin implementing and championing sustainability in the\nworkplace by increasing eco-consciousness among staff\nin conserving resources and managing waste.\nSIT enhanced its infrastructure through ensuring water and\nelectricity efficiency, and responsible waste management.\nWe also reviewed existing procurement processes and\nencouraged staff to adopt GreenGov.SG’s latest measures\nwhen organising events and functions.DEVELOPING A SUSTAINABLE CAMPUS\nAT PUNGGOL CAMPUS\nBlock E4 Food Court Building achieved the BCA Green\nMark Platinum and Super Low Energy (SLE) certification.\nThe building features a hybrid cooling system and a\nBuilding Integrated Photovoltaic (BIPV) roof that generates\nrenewable energy. These would result in at least 40%\nenergy savings.\nThe smart building pools data from various building\nsystems. The first smart solution tracks the building’s\nelectrical energy usage to ensure energy consumption\ndoes not exceed the SLE threshold. It also includes a\ncalculator to help track and forecast the annual utility\nbudget. The second smart solution automates the\nbuilding’s ventilation and equipment operation based\non prevailing weather conditions.BUILDING A\nSUSTAINABLE CAMPUS\nThe Block E4 Food Court Building features a Building Integrated Photovoltaic (BIPV) roof that generates renewable energy.47\nSUSTAINABILITY AT SIT\nSUSTAINABILITY ACROSS SIT’S\nRESEARCH DOMAINS\nSustainability is featured across our 5 strategic translational\nresearch domains. These research domains are aligned with national and economic imperatives, and are bolstered\nby technology enablers such as AI. By working closely\nwith private and public sector partners, the outcomes\nfrom these domains will help to contribute to Singapore’s\ngoal of becoming a smart and sustainable nation.\nENSURING SINGAPORE’S FOOD\nSECURITY\nSIT has partnered local companies to develop novel future\nfoods derived from sustainable plant protein ingredients\nand single-cell proteins through fermentation. In our bid\nto lower our carbon footprint, we are also refining our\ntechnology platforms to enable greener plant protein\nextraction processes. GREEN SOLUTIONS WITH INDUSTRY &\nPUBLIC SECTOR\nThrough our Applied Research Centres, such as InnoHub,\nwe also work closely with industry and the public sector\nto develop innovative and viable sustainable solutions.\nSpearheaded by National Environment Agency (NEA),\na group of students, together with mentors from SIT’s\nInnoHub, worked on conceptualising and developing a\nrecycling receptacle — Bloobox — that was subsequently\nmass manufactured and distributed to all households\nin Singapore.DRIVING SUSTAINABILITY\nRESEARCH & INNOVATION\n(From left) SIT Professional Officers Kwong Kwok Kuen and\nRaymond Keh, with SITizens Ralph Faller and Axal Ang at the\nnationwide launch of Bloobox in March 2023 with Dr Amy\nKhor, Senior Minister of State, Ministry of Sustainability and the\nEnvironment & Ministry of Transport, and Mr Wong Kang Jet,\nChief Executive Officer, National Environment Agency.\n(Photo: NEA/Hong Kah North CC/Ms Chan Wai Peng)\nA demonstration of the extrusion machine at the official\nopening of FoodPlant in April 2022, graced by Deputy Prime\nMinister and Coordinating Minister for Economic Policies\nHeng Swee Keat.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202348\nSUSTAINABILITY AS A CORE VALUE\nOur core values support the University’s vision and\nmission. It is the foundation upon how we interact with\none another and engage with industry partners. Last year, we updated our core values to include\nSustainability, given how it permeates all our activities\n— from the education we provide and research we\nundertake — to how it shapes our policies and operations.\n• We are purposeful\nand united in\ndelivering on our\nmission\n• We are agile in\nresponding to\ndisruptions and\nopportunitiesPurpose and\nAgility\n• We respect one\nanother and are open\nto a diversity of views\n• We promote\nsustainability in\nour lifestyle and\noperations, education\nand research\nendeavoursRespect and\nSustainability\n• We maintain\na high level of\nprofessional\nintegrity at all\ntimes\n• We strive for\nexcellence in all\nthat we doIntegrity and\nExcellenceDEVELOPING\nSUSTAINABILITY TALENT\nSUSTAINABILITY EDUCATION FROM\nUNDERGRADUATES TO ADULT LEARNERS\nAll SIT undergraduates will have a baseline understanding\nof sustainability concepts through the ‘Introduction to\nSustainability’ micro-module. From AY2023, SIT will\nalso launch a Minor in Environmental Sustainability for\nundergraduate students of selected programmes, such\nas the Electrical Power Engineering degree programme.\nFor adult learners, they will be able to select from\nover 18 modules that cover sustainability-related\ntopics, from sustainable building engineering to green\ninterior design.49\nSUSTAINABILITY AT SIT\nSUSTAINABILITY EFFORTS\nIN FY2022\nWORLD\nENVIRONMENT\nDAY\nThemed ‘Only One Earth’, SIT organised a series of activities to drive home the\nmessage that we only have one planet to call home.\nAmong the activities organised were a virtual talk, upcycling workshops, a\nguided tour showcasing food composting at SIT@Dover, as well as a trip to the\nSustainable Singapore Gallery.\nThe ‘Getting Ready for the Green Economy’ panel discussion addressed\nsustainability-related challenges faced by industry, and business solutions\nimplemented by organisations. Over 150 staff, students and alumni also learned\nmore about growing job opportunities in sustainability.\nPanellists discussed\nthe impact of\nsustainability\non a company’s\nperformance.Mr Shiddalingeshwar Channabasappa Devihosur, Research\nEngineer (in blue shirt), explained to participants the concept\nbehind SIT’s simulated rooftop hydroponic farm that utilises\nsolar photovoltaics. Participants observed how food waste collected from SIT@Dover\nfood outlets is recycled into compost using a food composter.\nSEPTEMBER\n2022\nJUNE\n2022\nGETTING READY\nFOR THE GREEN\nECONOMY\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202350\nDeloitte conducted the\n‘Carbon Management and\nSustainability Reporting\nTraining’ for SIT staff. The\nworkshop aimed to provide\nan overall understanding of\nsustainability and carbon\nmanagement, and helped\nstaff understand the\nevolving environmental,\nsocial and governance\n(ESG) reporting standards.\nSIT joined in #GoBlue4SG2023 by lighting its building façade in blue and\npromoting the message of water conservation through e-newsletters and\ndigital displays.\nStaff and students also dressed in blue on the day to signal their commitment\ntowards water sustainability.SIT organised the\ninaugural SG Clean\nDay with the aim of\npromoting a clean and\ngreen environment\nfor all to enjoy. Ms\nRachel Ong, Member\nof Parliament, West\nCoast GRC welcomed\nand addressed the\nparticipants before they\nwent about SIT@Dover\nand the neighbouring\nvicinity to pick up litter.Attendees at the training.\nSIT@Dover University Tower was lit up\nin blue for #GoBlue4SG movement.Staff dressed in blue in support of\n#GoBlue4SG movement.\nSIT’s first SG Clean Day saw participation from staff and students.\nDECEMBER\n2022\nMARCH\n2023 CARBON\nMANAGEMENT\nAND\nSUSTAINABILITY\nREPORTING\nTRAINING\nSINGAPORE\nWORLD WATER\nDAY\nFEBRUARY\n2023SIT X SG\nCLEAN DAY51\nSUSTAINABILITY AT SIT\n“Knowing that my lifelong learning\njourney is a shared endeavour made\npossible through the unwavering\nbelief and support of individuals\nwho recognised my potential, as\nwell as NCS who is investing\nin my professional and\npersonal growth, is truly\nhumbling. I am grateful\nfor this opportunity to be\npart of the CSM pathway,\nand looking ahead, I\nam excited to continue\ngrowing in my career.”\nALVINA HO\nNCS employee\nBSc (Hons) Applied Computing\n[Competency-based Stackable Micro-credentials\n(CSM) Pathway]\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2023\nA Pathway For\nCompetency-\nBased Lifelong\nLearning\nAs an analyst at NCS, Alvina Ho\noversees data incidents that are\nreported by users. It is a role that\nrequires her to continually sharpen\nher skills and expand her knowledge.\nThrough the fully sponsored NCS\nFusion work and study programme,\nshe discovered SIT’s applied\nlearning pedagogy that helps bridge\nthe gap between academia and\ntechnical skills. Alvina eventually\ndecided to enrol in the Bachelor\nof Science (Honours) in Applied\nComputing degree programme via\nthe Competency-based Stackable\nMicro-credentials (CSM) pathway.\nSIT’s meticulous application process\nfor enrolment into the CSM pathway\nmade her confident that SIT would\nprovide the ideal environment\nfor her to excel and prepare\nfor her current and future roles.\nSupport for Students\nSIT strives to ensure that deserving students are not deprived of a quality education because of\ntheir financial situations. We offer an extensive range of financial assistance to help students with\ntheir tuition fees and expenses.\nSIT launched the ‘Forward SITizen’ Initiative (FSI) in January\n2023. Supported by SIT and its donors, this initiative will\nhelp top up government-funded public bursaries, so as\nto fully fund tuition fees for SIT’s most financially needy\nundergraduate students. FSI will benefit an estimated 220\neligible students annually, starting from Academic Year 2023.\nAt the launch, 6 donors pledged a total of $8.7 million in\nendowed gifts. The sum included a seed donation of $3\nmillion from the Quantedge Foundation, as well as other\nendowed gifts made through the Dou Yee Enterprises\nBursary, Kewalram Chanrai Group Bursary, KKH Bursary, Kwai\nFong & Raymond Goh Study Grant, and Wilmar Bursary. ‘FORWARD SITIZEN’ INITIATIVE\nThe Class of 2022 made history when they started the\nfirst-ever annual Class Giving drive to support their\njuniors. To commemorate their graduation, 30 Class\nGiving Champions from the 10th graduating cohort\nencouraged their peers to give $20.22 each to support\nthe SIT Bursary for their juniors who are most in need of\nfinancial aid. The Class Champions managed to raise 3\nSIT Bursaries (valued at $3,000 each) from 231 donors,\npaving the way for the future graduating cohorts to\nmake Class Giving a tradition at SIT.SIT’S CLASS OF 2022 PIONEERS\nANNUAL CLASS GIVING TRADITION\n(From left) Mr Suhaimi Zainul-Abidin, Chief Executive Officer, Quantedge Capital and Director, Quantedge Foundation\n(Singapore); SIT President Prof Chua Kee Chaing; Dr Mohamad Maliki Osman, Second Minister for Education; Mr Xie Yao Quan,\nChief Executive Officer, Quantedge Foundation (Singapore); Prof Tan Thiam Soon, Institute Professor, SIT at the launch of the\nForward SITizen Initiative.\n(From left) Ms Janet Lim, Administrator, Diana Koh Foundation,\nand SIT President Prof Chua Kee Chaing, unveiled the Lim Leng\nSwan Seminar Room at SIT@Dover in the interim. The Lim Leng\nSwan Home Living Lab will be named in perpetuity following\nSIT’s move to Punggol in 2024. A naming ceremony for the Lim Leng Swan Home Living\nLab and the Lim Leng Swan Seminar Room was held in\nFebruary 2023. Built like the interior of an HDB flat, the\nLim Leng Swan Home Living Lab at SIT’s future campus in\nPunggol will give SIT’s Allied Health and Nursing students\na good understanding of the living conditions of elderly\nor physically impaired persons and can be used for case\nsimulation. The first for a health sciences facility at Punggol\nCampus, the naming was made possible by an endowed\ngift of $500,000 that the Diana Koh Foundation had\nmade through the Community Foundation of Singapore.\nThe naming is in memory of Madam Lim Leng Swan, the\nmother of the late Ms Diana Koh and a trained nurse.LIM LENG SWAN HOME LIVING LAB\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202354\nThanks to the generous contributions of industry partners, government agencies and organisations,\nour students can benefit from various forms of sponsorships and bonded scholarships.\nACKNOWLEDGEMENTSSPONSORSHIPS AND BONDED\nSCHOLARSHIPS\nLand Transport AuthorityAlexandra Hospital\nAsian Heart and Vascular\nCentre\nContinental Automotive\nSingapore Pte Ltd\nDSO National Laboratories\nEconomic Development\nBoard\nEDB - NVIDIA Corporation\nEnsign Infosecurity\nGovTech\nIHH Healthcare\nInfocomm Media\nDevelopment AuthorityMinistry of Defence\nMinistry of Education\nMinistry of Trade and\nIndustry\nMOH Holdings (MOHH)\nNational Council of Social\nService\nNTUC Health\nOversea-Chinese Banking\nCorporation, Limited\nRainbow Centre\nRen Ci Hospital\nSBS Transit Ltd\nSengkang General HospitalSingapore General Hospital\nSingapore Maritime\nFoundation (SMF)\nSMRT Corporation Ltd\nSociety for the Physically\nDisabled\nSP Group\nTan Tock Seng Hospital\nThye Hua Kwan Hospital\nThye Hua Kwan Moral\nCharities Limited\nWoodlands Health Campus55\nSUPPORT FOR STUDENTS\nIn Appreciation of SIT’s Donors\nFor the financial year ended 31 March 2023\nTheir impactful giving nurtures our students through bond-free bursaries, study grants, scholarships\nand excellence awards, while enabling us to strengthen applied learning and drive industry innovation\nand transformation. We gratefully thank all our donors, including those who wish to remain anonymous.\n8Bit Global Pte. Ltd.\nAbbVie Operations Singapore\nPte Ltd\nAbwin Pte Ltd\nAegis Building & Engineering\nPte Ltd\nAeris Dynamics Pte Ltd\nAero Inspection Asia Pte Ltd\nAerospace Consultancy Pte Ltd\nAGI Freight Singapore Pte Ltd\nAjit Aravind Prabhu\nAlbert Wong\nAlfa Tech Vestasia Pte Ltd\nAllgrace Investment\nManagement Pte Ltd\nAlric MEP Engineering Pte Ltd\nAlteryx Singapore Pte Ltd\nAlvin Yeo\nAmazon Web Services\nSingapore Private Limited\nAng Poon Liat\nAngela Tan Guat Hoon\nAngela Wu Peihui\nAngkasa Daehan Steel Pte Ltd\nApplied Materials South East\nAsia Pte Ltd\nAscendas Funds Management\n(S) Limited\nAshland Singapore Pte Ltd\nAsiaCloud Solutions Pte Ltd\nAssociation of Consulting\nEngineers Singapore\nAssociation of Process Industry\n(ASPRI)\nAssure (Singapore) Pte Ltd\nAY Anaesthesia And Pain Pte Ltd\nAzalea Investment\nManagement Pte. Ltd.\nBaker Tilly\nBeach Road Hotel (1886) Ltd\nBenjamin Toh Tsui Chuan\nBindu Singh\nBlu5 View Pte Ltd\nBoey Jun Hoe, Martin\n(Mei Junhao)\nBoon Swan Foo\nBR Metals Pte LtdBushiroad International Pte Ltd\nCanon Medical Systems Asia\nPte. Ltd.\nCASY Engineering\nConsultancy Pte Ltd\nCBJ Foundation\nCEI Limited\nCentre for Strategic Infocomm\nTechnologies\nChan Chik Weng and\nChong Chow Hah\nChan Mei Hong\nChangi Airport Group\n(Singapore) Pte Ltd\nChau Shing Chi\nChen Teck Shing\nChoo Chiau Beng\nChoo Chong Ngen\nChua Foundation\nCLA Global TS Holdings Pte Ltd\nCommunity Foundation of\nSingapore\nConrac Asia Display Products\nPte Ltd\nContinental Automotive\nSingapore Pte Ltd\nCore Concepts Pte Ltd\nCPA Australia Ltd\nCrimsonLogic Pte Ltd\nCyber Security Agency of\nSingapore\nCybersprout Pte Ltd\nCyclect Electrical Engineering\nPte Ltd\nDBS Bank Ltd\nDecision Science Agency Pte Ltd\nDell Global B.V. Singapore\nBranch\nDeloitte & Touche LLP\nDH RegSys Consulting Pte Ltd\nDiana Koh Foundation\nDiscovering Foundation\nDou Yee Enterprises (S) Pte Ltd\nDr Clear Aligners Pte Ltd\nEdy Hardijana Tjugito\nENGIE Services Singapore\nPte Ltd\nEnGro Corporation LimitedEnviro Gas Pte Ltd\nEPS Computer Systems Pte Ltd\nEstate of Irene Tan Liang Kheng\nEY\nFamily of Loo Shaw Chang and\nTan Hooi Hong\nFamily of Ng Sheng Poh and\nQuek Siew Keow\nFar East Organization\nfinexis advisory Pte Ltd\nFoo Kon Tan LLP\nFoong Yi-Lin and Foong\nSheng-Wei\nGabriel Tan Yong Kai\nGan Hui Ben and Jae Sook Do\nGarena Online Private Limited\nGeneral Filter Pte Ltd\nGeo Energy Group\nGIC Private Limited\nGlaxoSmithKline - EDB HRD\nFund\nGoh Foundation Limited\nGoh Wei Ming Alvin\nGoldbell Financial Services\nPte Ltd\nHarrier Technology Pte Ltd\nHe Hui Foundation\nHiap Chuan Hardware (Pte) Ltd\nHo Bee Land\nHo Han Khoon\nHo Yee Yang Edmond\nHock Seng Hoe Metal Co.\nPte Ltd\nHummingbird Health Pte Ltd\nIES-IStructE Joint Committee,\nThe Institution of Engineers,\nSingapore\nIGG Singapore Pte Ltd\nInfo-Communications Media\nDevelopment Authority of\nSingapore\nIngredion Singapore Pte Ltd\nInstitute of Chemical and\nEngineering Sciences\nInstitute of Materials (East Asia)\nInstitute of Singapore\nChartered Accountants\nInterlocal Exim Pte LtdITSEC Services Asia Pte Ltd\nJCS-Echigo Pte Ltd\nJeff Goh\nJohn Abraham\nJulie Teo Lee Meng\nKampung Spirit Fund\nKaneto Foundation\nKaren Lee Yun Fun\nKaspersky Lab Singapore Pte Ltd\nKat Cat Pte Ltd\nKCTex International Ltd\nKee Sek Huat\nKenmooreland Pte Ltd\nKeppel Care Foundation\nLimited\nKeppel Corporation Limited\nKevin Liang Choon Yee\nKewalram Singapore Limited\nKhoo Chwee Neo Foundation Ltd\nKimly Construction Private\nLimited\nKitchen Haus Group Pte Ltd\nKleen-Pak Products Pte Ltd\nKo Oen Tjiang\nKoh Shirley\nKoufu Group Limited\nKRISfam Fund\nKSF Beverage Holding\nFoundation\nKuang Yong Auto\nKuok Khoon Hong\nKwai Fong and Raymond Goh\nKwee Liong Keng\nKwek Leng Beng\nKwek Muar Kang Alvin\nLam Yi Young\nLand Transport Authority of\nSingapore\nLau Ying Hui\nLearning Access Foundation\nLee Foundation\nLee Kok Keong and Goh Ling\nLing Serene\nLeo Infocomm Pte Ltd\nLeong Kwok Kee Stephen\nLew Foundation\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202356\nLien Ber Luen\nLighthouse Club (Singapore)\nLih Ming Construction Pte Ltd\nLim Daoyi, Moses and\nLee Wen Wen Sandra Jean\nLim Joo Boon\nLim Peng Hun and Vanisa Lee\nLim Siah Mong\nLim Sok Mui\nLim Sze Wee\nLions Community Service\nFoundation (Singapore)\nLo Hock Ling & Co\nLoh Lin\nLoo Tze Kian\nLow Geok Cheng\nLow Ming Wah\nLow Tze Huoy\nLoyang Tua Pek Kong\nL-QuBE Pte Ltd\nLSK Engineering (S) Pte Ltd\nLU Kee Hong and Chan Haw\nNgee\nLum Kok Keong Richard\nM.Tech Products Pte Ltd\nMalaichamy Mani\nMapletree Investments Pte Ltd\nMarina Bay Sands Pte Ltd\nMHC Medical Network Pte Ltd\nMighty Jaxx International Pte Ltd\nMitsubishi Electric Asia Pte Ltd\nMohan K Vaswani\nMohit Maheshwari\nMount Alvernia Hospital\nNaterra Resources\nInternational Pte Ltd\nNational Council of Social\nService\nNational Healthcare Group\nPte Ltd\nNebulas Tree Pte Ltd\nNetLink Management Pte Ltd\n(as trustee of NetLink Trust)\nNet-Source Group Pte Ltd\nNexia Singapore PAC\nNgee Cheng Electric Company\nPte Ltd\nNING Research Pte Ltd\nNippon Express (Singapore)\nPte Ltd\nOctava Foundation Limited\nOhm Energy Pte Ltd\nOng Kiem Kiok\nOUE Limited\nPan Pacific Hotels and Resorts\nPte Ltd\nPARKROYAL on Beach Road\nPARKROYAL KITCHENER\nHOTEL PTE LTDParsing Pte Ltd\nPatrick Lee\nPaul Tseng\nPaul Wong AICM Pte Ltd\nPei Hwa Foundation Limited\nPeter Lim\nPetrochemical Corporation of\nSingapore (Private) Limited\nPFPFA Pte Ltd\nPKF-CAP LLP\nPPC Building Services Pte Ltd\nPrecious Treasure Pte Ltd\nPrima Limited\nQQCK Foundation\nQ’son Kitchen Equipment Pte Ltd\nQuantedge Foundation\n(Singapore) Ltd\nQuantum Inventions Pte Ltd\nQuek Loo Ang\nRacks Central Pte Ltd\nRaytheon Technologies\nCorporation\nRB Corp Pte Ltd\nRidik Pte Ltd\nRohde & Schwarz Asia Pte Ltd\nRosalind Fok\nRotary Club of Bugis Junction,\nSingapore\nRotary Club of Garden City\nRotary Club of Jurong Town,\nSingapore\nRotary Club of Tanglin,\nSingapore\nRotary Engineering Pte Ltd\nRSM Chio Lim LLP\nS C Mohan PAC\nS M Jaleel Foundation\nS.S. Jhunjhnuwala Charity Fund\nSabrina Ong Geok Khim\nSAGE Publications Asia-Pacific\nPte Ltd\nSamwoh Corporation Pte Ltd\nSATS Ltd\nSBS Transit Ltd\nSCAL Resources Pte Ltd and\nmembers of The Singapore\nContractors Association Ltd\nSeagift Food Pte Ltd\nSecurity Systems Association\nof Singapore\nSelect Group Pte Ltd\nSheng Siong Group\nSiemens Pte Ltd\nSIM People Development\nFund Limited\nSingapore Buddhist Youth\nMission\nSingapore Chemical Industry\nCouncil LimitedSingapore Chinese Chamber\nOf Commerce Foundation\nSingapore Computer Society\nSingapore Concrete Institute\nSingapore Food\nManufacturers’ Association\nSingapore Green Building\nCouncil\nSingapore Heart Foundation\nSingapore Hotel Association\nSingapore Leong Khay Huay Kuan\nSingapore Nurses Association\nSingapore Pools (Private) Limited\nSingapore Society of\nRadiographers\nSingapore Sports Council\nSIT Health and Social Sciences\n(HSS) Cluster Faculty and\nAlex Wirianski\nSiti Noorbaiyah Binti Abdul\nMalek\nSMRT Corporation Ltd\nSoon Sze Meng\nSP Group\nSprinkler Fire Systems Pte Ltd\nST Engineering IHQ Pte Ltd\nSt Luke’s ElderCare Ltd.\nStanley Quek through The\nIreland Funds (Singapore)\nSteelaris Pte Ltd\nSteven Wong Kai Juan\nStraits Bunkering Pte Ltd\nStraits Construction Singapore\nPte Ltd\nSTT Communications Ltd\nSugiarta Foundation\nSun Ace Kakoh (Pte.) Ltd.\nSurya Jhunjhnuwala and\nGaurang Jhunjhnuwala\nSYNthesize Pte Ltd\nSystemEngineer360 Pte Ltd\nT T J Design And Engineering\nPte Ltd\nT.E Engineering & Trading\nTa Yoke Kat\nTai Tak Estates Sdn Bhd\nTAK Products & Services Pte Ltd\nTalentsis Pte Ltd\nTammie Tham\nTan Bhing Leet\nTan Hwee Hua @ Lim Hwee Hua\nTan Si Rong\nTan Siew Ooa\nTaylor & Francis Asia Pacific\nTemasek Holdings Pte Ltd\nMr and Mrs Teo Hock Chuan\nTerra Systems Pte Ltd\nTexas Instruments Southeast\nAsia Pte Ltd The Copyright Licensing and\nAdministration Society of\nSingapore Ltd\nThe Estate of Chong Yook Yin\nThe Estate of Lim Doa Hin\nThe Estate of Eng Liat Kiang\nThe Hokkien Foundation\nThe Ireland Funds (Singapore)\nThe Masonic Charitable Fund\nThe Mohan Family\nThe Ngee Ann Kongsi\nThe Polyolefin Company\n(Singapore) Pte Ltd\nThe Silent Foundation Ltd\nThe Tan Chin Tuan Foundation\nThomson Shin Min Foundation\nTiong Seng Contractors\n(Private) Ltd\nTL Whang Foundation Limited\nTME Systems Pte Ltd\nToe Teow Heng\nToh See Kiat\nTong Kok Chiang and Thng\nPoh Choo\nTong Seng Produce Pte Ltd\nTote Board\nTractors Singapore Limited\nTrihatma Kusuma Haliman and\nTsang Kam Heung\nTseng Family Foundation\nTunnelling and Underground\nConstruction Society\n(Singapore)\nTyco Electronics Singapore\nPte Ltd\nUnited Overseas Bank Limited\nUtoc (Singapore) Pte Ltd\nVaibhavkumar Sudhir Dabhade\nVGC Technology Pte Ltd\nVMware Singapore Pte Ltd\nWee Siew Kim\nWilmar International Limited\nWoh Hup Pte Ltd\nWong Chong Yee Kenny\nWong Kai Yun\nWong-Mah Jia Lan\nX-Inc\nYangzheng Foundation\nYeo Jia Hui\nYP Academy Pte Ltd\nYusof Bin Amir Wahid\nZ L Construction Pte Ltd and\nJake Yeoh57\nIN APPRECIATION OF SIT’S DONORS\nCorporate Governance\nINTRODUCTION\nSIT was incorporated in September 2009 as a company\nlimited by guarantee under the Companies Act 1967.\nIt is an Institution of Public Character (“IPC”) under the\nCharities Act 1994.\nSIT is governed by the Singapore Institute of Technology Act\n2014. Its key constituent document is the Memorandum and\nArticles of Association which states that the purpose of the\nUniversity is to promote and undertake the advancement\nof education by providing educational facilities and courses\nof study in all fields of knowledge, promote and engage in\nresearch and scholarships and establish, operate, promote\nand maintain the University as a going concern. SIT has\nthree subsidiaries — Verbosecurity Pte. Ltd. (Company\nRegistration No. 201902376G), which was incorporated\non 18 January 2019, SIT Microgrid Pte. Ltd. (Company\nRegistration No. 201926986H), which was incorporated\non 19 August 2019, and Foodplant Pte. Ltd. (Company\nRegistration No. 202007139N), which was incorporated on\n2 March 2020. The three subsidiaries were incorporated\nto support SIT’s strategic initiatives.\nGood corporate governance is the cornerstone of a\nwell-managed University which is, in turn, critical to SIT’s\nperformance and operations. The focus of its governance\nframework, on which the University’s vision, mission and\ncore values are formulated, promotes accountability\nand transparency and is manifested in the composition\nof the Board of Trustees (“Board”) and its Committees,\ndivision of powers and duties between the Board and\nManagement, adoption of checks and balances, and\nsound measures for internal and corporate controls.\nGOVERNANCE EVALUATION CHECKLIST\nThe University adheres to the Code of Governance for\nCharities and Institutions of Public Character (“Code”).\nThe University has complied in material aspects with the\nprinciples and guidelines set out in the Code. Where\nthere are departures from the Code, these are explained\nunder the relevant sections of the Governance Evaluation\nChecklist (“GEC”).\nAccording to disclosure requirements imposed by the\nCharity Council, Ministry of Culture, Community and\nYouth, all IPCs are required to publicly disclose their\ncompliance with the Code. The University’s GEC is\nmade available on the website of the Charity Portal at\nwww.charities.gov.sg.\nBOARD OF TRUSTEES\nThe Board is the highest governing authority of the\nUniversity and comprises 20 Trustees, chaired by Mr Bill\nChang, Chief Executive Officer, Digital InfraCo, Singapore\nTelecommunications Ltd. The Board oversees the business\nof the University, ensures that it acts in accordance with its\nobjects, that its funds and assets are properly accounted for\nand safeguarded and provides guidance and stewardship\nto Senior Management, conferring regularly with them. For the financial year ended 31 March 2023\nThe Board is accountable to the Minister for Education,\nSingapore for its acts and decisions.\nThe Trustees are eminent persons of good repute and sound\njudgment who possess collective competencies in areas such\nas the public and private sectors, academia, accounting and\nfinance, law, information technology, strategic planning,\nengineering, defence, investment and asset management,\nhealthcare, real estate, and sustainability. New Trustees\nwill continue to be selected and invited to serve on the\nBoard on the basis of the diversity of their experience,\nskills, knowledge, abilities and insight from time to time\nto ensure constant refreshing of the Board. The Trustees’\nprofiles appear on pages 10 and 11 of the Annual Report.\nThere is an objective decision-making process, which\nallows each Trustee to exercise his or her own independent\njudgment. The University has established financial\nauthorisation and approval limits for operating and\ncapital expenditure, the procurement of goods and\nservices, the acquisition and disposal of assets and making\ninvestments. The Board approves the annual budget and\nannual audited financial statements of SIT, amongst other\nresponsibilities. With regard to the reserves policy, the use\nof the reserves is subject to the approval of the Board.\nThe Board is supported by seven Board Committees\nformed in accordance with Article 53 of the Articles\nof Association (“AAs”), namely the Audit, Campus\nDevelopment, Finance, Industry and Research, Investment,\nRemuneration and Nomination, and Sustainability\nCommittees. Each Board Committee has clear Terms\nof Reference setting out their role, authority, powers\nand matters requiring their approval. The list of Board\nCommittees is on pages 60 and 61 of the Annual Report.\nBriefly, the responsibilities of the Board Committees\nare as follows:\na) The Audit Committee oversees and reviews the\nUniversity’s internal controls, integrity of its financial\nreporting, legal and regulatory risks, enterprise risk\nmanagement, internal and external audit functions.\nb) The Campus Development Committee maintains\noversight of the University’s campus development\npolicies and any other matters related to the acquisition,\ncommissioning and management of significant physical\nassets or facilities.\nc) The Finance Committee provides oversight of the\nUniversity’s financial policy management.\nd) The Industry and Research Committee provides strategic\nguidance on the University industry engagement and\ncollaboration and applied research.\ne) The Investment Committee oversees the investment of\nthe University’s endowment and surplus funds.\nf) The Remuneration and Nomination Committee oversees\nand reviews the University’s overall remuneration\nframework and policies, and also oversees succession\nplanning for the Board and the Board Committees.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202358\ng) The Sustainability Committee provides strategic guidance\non the University’s sustainability strategy, policies and\ninitiatives, as well as the development of the University’s\ntalent and applied research capabilities in sustainability.\nEach Board Committee comprises Trustees with\nappropriate qualifications and skills and there is a fair\ndistribution of responsibilities amongst the Trustees.\nWhere required, non-Trustees with relevant areas of\nexpertise are invited to provide advice to the Board\nCommittees to enhance the process of decision making.\nThe Board is kept informed of the key matters discussed\nat each Board Committee meeting.\nNone of the Trustees have general control and\nmanagement of the University’s subsidiaries.\nBOARD ATTENDANCE\nA total of four Board meetings were held during the\nfinancial year from 1 April 2022 to 31 March 2023. The\nattendance of the Trustees at the Board meetings during\nthe financial year is tabulated below:concerns of the other that relate to the programmes\nand administration of the University. He also arranges\nfor the annual budget of the University to be presented\nto the Board annually for approval as part of his duties.\nThe profiles of other members of the Senior Management\nof the University can be found on its corporate web page\nand at pages 8 and 9 of the Annual Report.\nCONFLICTS OF INTEREST\nThe Trustees and staff are required to act in the best\ninterest of the University at all times. Policies have\nbeen developed to prevent or manage situations where\nconflicts of interest could arise, by promoting integrity\nand ethical business conduct.\nThe AAs contain provisions for the management and\navoidance of conflicts of interest by members of its Board\nof Trustees. Such provisions include:\na) permitting a Trustee to be interested in any transaction\nwith the University provided that the Trustee has declared\nthe nature of the interest to the other Trustees of the\nBoard as required under the Companies Act of Singapore\nand complied with the provisions of AAs to abstain from\nvoting on any matter related to the transaction,\nb) permitting a Trustee, or a firm associated with the Trustee,\nto act in any professional capacity for the University\n(except as auditor) and to be remunerated for the\nprovision of professional services, and\nc) permitting a Trustee to be reimbursed for out-of-pocket\nexpenses, travelling and other expenses properly incurred\nby the Trustee in attending and returning from meetings\nof the Board of Trustees, any of its committees, or\nany general meeting of the University or otherwise in\nconnection with the affairs of the University.\nThe AAs also state that Trustees shall not receive any\nremuneration for services rendered by them as Trustees. In\naddition, the University does not have any staff receiving\nmore than S$50,000 in annual remuneration that is a\nclose relative of any Trustee.\nThe University has implemented a Conflict of Interest Policy\nwhich all staff must comply with. In accordance with that\nPolicy, staff must ensure that their private activities and\ninterests do not conflict with their professional obligations\nto the University. Where there is a potential conflict of\ninterest, the staff is required to submit full disclosure and\nrequest for an appropriate exemption. The University will\ngrant such exemptions at its discretion. In addition, staff are\nrequired to declare their compliance with the University’s\nprevailing policy on conflicts of interest annually.\nWHISTLEBLOWING POLICY\nThe University seeks to uphold the highest standards of\ngovernance, ethics, and conduct. To this end, the University\nhas a Whistleblowing Policy which provides individuals with\na confidential avenue to report, in good faith, any wrongful\npractices in the University, without fear of reprisal against\nthe whistleblower. The policy and reporting channels are\npublished on SIT’s website.NamePercentage (%)\nof Attendance\nMr Bill Chang 100\nMr Chan Hian Lim 100\nDr Chia Tai Tee 100\nProf Chua Kee Chaing 100\nMr Han Kwee Juan 100\nDr Benjamin Koh 50\nMr Kwee Liong Keng 50\nMs Lim Wan Yong 100\nMrs Margaret Lui 75\nMr Abu Bakar bin Mohd Nor 100\nMs Neo Gim Huay 25\nMs Gail Ong 75\nMs Jacqueline Poh 50\nMr Quek Gim Pew 100\nMr Ravinder Singh 75\nMr Nagaraj Sivaram 100\nMs Susah Soh 100\nMr Soon Sze Meng 100\nMs Tammie Tham 100\nMr Wen Khai Meng 75\nMANAGEMENT OF THE UNIVERSITY\nThe President of the University, Professor Chua Kee\nChaing, is appointed by the Board and is the Chief\nExecutive Officer and the University’s academic and\nadministrative lead. He is responsible to the Board for the\nconduct, co-ordination and quality of the programmes\nof the University and its future development. He is\nempowered with the authority to perform all acts which\nare necessary to implement the policies, procedures and\nactions of the Board. As a liaison between the Board\nand the University, the President is tasked with the\nresponsibility of informing each party of the views and 59\nCORPORATE GOVERNANCE\nBoard Committees\nand Internal Audit\nFor the financial year ended 31 March 2023\nBoard Committee Composition\nAUDIT COMMITTEECHAIRMAN\nMr Nagaraj SivaramMEMBERS\nDr Chia Tai Tee\nDr Benjamin Koh\nMs Gail Ong\nMr Han Kwee Juan\nCAMPUS DEVELOPMENT\nCOMMITTEECHAIRMAN\nMr Wen Khai MengMEMBERS\nMs Gail Ong\nMs Tammie Tham\nMs Neo Gim Huay\nFINANCE COMMITTEECHAIRMAN\nMr Ravinder SinghMEMBERS\nMrs Margaret Lui\nMr Wen Khai Meng\nINDUSTRY AND RESEARCH\nCOMMITTEECHAIRMAN\nMr Abu Bakar bin Mohd NorMEMBERS\nMr Chan Hian Lim\nMr Quek Gim Pew\nMs Tammie Tham\nMs Jacqueline PohBOARD COMMITTEES\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202360\nBoard Committee Composition\nINVESTMENT COMMITTEECHAIRMAN\nMrs Margaret LuiMEMBERS\nDr Chia Tai Tee\nMs Susan Soh\nCO-OPTED MEMBER\nMr Oo Wooi Cheng\nREMUNERATION AND\nNOMINATION\nCOMMITTEECHAIRMAN\nMr Bill ChangMEMBERS\nMs Lim Wan Yong\nMr Quek Gim Pew\nMr Ravinder Singh\nSUSTAINABILITY COMMITTEECHAIRMAN\nMr Soon Sze MengMEMBERS\nMr Chan Hian Lim\nMr Bill Chang\nMs Neo Gim Huay\nINTERNAL AUDIT\nInternal Audit provides independent, objective assurance and consulting services designed to add value and improve\nthe University’s operations. Internal Audit activity is guided by a value-driven philosophy of partnering with other\ndepartments to enable SIT to meet its business objectives. Its key role is to assist Management in evaluating their\nrisk management, control, and governance processes so that business objectives can be met.61\nBOARD COMMITTEES AND INTERNAL AUDIT\nFinancial StatementsSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202362\nFor the financial year ended 31 March 2023\nImportant Note:\nThe Consolidated Financial Statements, as set out on pages 63 to 67, are extracted from Singapore Institute of Technology and its\nsubsidiaries (“the Group”) Audited Financial Statements for the year ended 31 March 2023. It may not contain sufficient information\nto allow for a full understanding of the results and the state of affairs of the Group. For further information, please refer to the full\nset of the audited financial statements published on SIT’s official website at SingaporeTech.edu.sg.GENERAL FUNDSENDOWMENT AND\nTERM FUNDS TOTAL\n2023\n$’0002022\n$’0002023\n$’0002022\n$’0002023\n$’0002022\n$’000\nRevenue 107,444) 96,234) — — 107,444) 96,234)\nOther Income 1,552) 2,553) 4,536) 4,185) 6,088) 6,738)\nOperating Expenditure\nStaff and Related Expenses (153,022) (128,373) (719) (521) (153,741) (128,894)\nProgramme and Student-Related\nExpenses(73,947) (70,048) (3,652) (3,761) (77,599) (73,809)\nDepreciation and Amortisation\nExpenses(42,082) (44,406) (20) (3) (42,102) (44,409)\nRental and Other Facility Expenses (17,311) (15,664) (16) — (17,327) (15,664)\nInterest Expense (1,258) (1,250) — — (1,258) (1,250)\nOther Operating Expenses (27,027) (24,394) (219) (1,612) (27,246) (26,006)\nTotal Operating Expenditure (314,647) (284,135) (4,626) (5,897) (319,273) (290,032)\nDeficit before Investment Income\nand Government Grants (205,651) (185,348) (90) (1,712) (205,741) (187,060)\nNet Investment Income/(Loss) 4,770) 542) (42,672) 39,866) (37,902) 40,408)\n(Deficit)/Surplus before\nGovernment Grants (200,881) (184,806) (42,762) 38,154) (243,643) (146,652)\nGovernment Grants 248,233) 218,947) — — 248,233) 218,947)\nNet Surplus/(Deficit), representing\nTotal Comprehensive Income/(Loss) 47,352 34,141) (42,762) 38,154) 4,590) 72,295)CONSOLIDATED STATEMENT OF\nCOMPREHENSIVE INCOME 63\nFINANCIAL STATEMENTS\nAs at 31 March 2023STATEMENTS OF FINANCIAL POSITION\nGROUP SIT\n2023\n$’0002022\n$’0002023\n$’0002022\n$’000\nASSETS\nNon-Current Assets\nInvestments in Subsidiaries __ __ __ (a) __ (a)\nProperty, Plant and Equipment 1,024,629 777,031 1,024,223 776,520\nIntangible Assets 1,144 2,627 1,144 2,627\nStudent Loans 589 309 589 309\nOther Non-Current Assets 60,548 63,974 60,514 63,940\nTotal Non-Current Assets 1,086,910 843,941 1,086,470 843,396\nCurrent Assets\nCash and Cash Equivalents 315,334 270,109 315,334 270,098\nFinancial Assets at Fair Value through Profit or Loss 814,476 811,608 814,476 811,608\nDeposits for Investments — 2,584 — 2,584\nFees and Other Receivables 216,122 123,523 218,600 124,652\nStudent Loans 48 81 48 81\nOther Current Assets 10,808 10,505 10,808 10,505\nDerivative Financial Instruments 119 20 119 20\nTotal Current Assets 1,356,907 1,218,430 1,359,385 1,219,548\nTOTAL ASSETS 2,443,817 2,062,371 2,445,855 2,062,944\nLIABILITIES\nCurrent Liabilities\nTrade and Other Payables 114,358 77,383 116,989 77,414\nDeferred Tuition Fee Income 3,647 9,207 3,647 9,207\nGrants Received In Advance 28,165 132,673 28,165 132,673\nLease Liabilities 5,883 4,888 5,879 4,884\nBorrowings 2,317 43 2,317 43\nTotal Current Liabilities 154,370 224,194 156,997 224,221\nNET CURRENT ASSETS 1,202,537 994,236 1,202,388 995,327\nNon-Current Liabilities\nDeferred Capital Grants 767,192 591,652 767,192 591,652\nOther Deferred Grants 63,520 66,847 63,520 66,847\nLease Liabilities 37,258 32,892 36,732 32,371\nBorrowings 264,900 34,000 264,900 34,000\nTotal Non-Current Liabilities 1,132,870 725,391 1,132,344 724,870\nTOTAL LIABILITIES 1,287,240 949,585 1,289,341 949,091\nNET ASSETS 1,156,577 1,112,786 1,156,514 1,113,853\nFUNDS AND RESERVES\nGeneral Funds\nAccumulated Surplus 292,994 245,642 292,931 246,709\nEndowment and Term Funds\nCapital 670,332 631,131 670,332 631,131\nAccumulated Surplus 193,251 236,013 193,251 236,013\n863,583 867,144 863,583 867,144\nTOTAL FUNDS AND RESERVES 1,156,577 1,112,786 1,156,514 1,113,853\n(a) Less than $1,000\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202364\nFor the financial year ended 31 March 2023\nGENERAL FUNDSENDOWMENT AND\nTERM FUNDS TOTAL\n$’000 $’000 $’000\n2023\nAt 1 April 2022 245,642 867,144 1,112,786\nNet Surplus/(Deficit), representing\nTotal Comprehensive Income/(Loss)47,352 (42,762) 4,590\nGovernment Grants and Donations — 39,201 39,201\nAt 31 March 2023 292,994 863,583 1,156,577\n2022\nAt 1 April 2021 211,501 783,370 994,871\nNet Surplus, representing Total\nComprehensive Income34,141 38,154 72,295\nGovernment Grants and Donations — 45,620 45,620\nAt 31 March 2022 245,642 867,144 1,112,786CONSOLIDATED STATEMENT OF\nCHANGES IN FUNDS AND RESERVES65\nFINANCIAL STATEMENTS\n2023\n$’0002022\n$’000\nCash Flows From Operating Activities\nDeficit before Government Grants (243,643) (146,652)\nAdjustments for:\nDepreciation and Amortisation 42,102) 44,409)\nDonations (4,536) (4,185)\nNet Gain on Disposal of Property, Plant and Equipment  (1) (12)\nInterest Income (5,742) (1,230)\nDividend Income (3,635) (4,138)\nForeign Currency Exchange Loss/(Gain)  43) (201)\nFair Value Loss/(Gain) on Financial Assets at Fair Value through Profit or Loss 47,581) (27,650)\nFair Value (Gain)/Loss on Derivative Financial Instrument (229) 52)\nGain on Disposal of Financial Assets at Fair Value through Profit or Loss (116) (7,241)\nInterest Expense 1,258) 1,250)\n(Reversal of Expected Credit Loss Allowance)/Expected Credit Loss Allowance (68) 4)\nOperating Cash Flows before Changes in Working Capital (166,986) (145,594)\nChange in Operating Assets and Liabilities\nFees and Other Receivables (514) (28,428)\nStudent Loans and Other Assets 2,876) 13,325)\nTrade and Other Payables 19,724) 1,624)\nNet Cash Used in Operating Activities (144,900) (159,073)\nCash Flows From Investing Activities\nPurchase of Property, Plant and Equipment and Intangible Assets (260,111) (148,407)\nProceeds from Disposal of Property, Plant and Equipment 3) 17)\nPurchase of Financial Assets at Fair Value through Profit or Loss (87,656) (157,338)\nProceeds from Disposal of Financial Assets at Fair Value through Profit or Loss 39,907) 108,175)\nDeposits for Investments  — (2,584)\nSettlement of Foreign Currency Forwards 130) (90)\nInterest Received 2,546) 1,487)\nDividend Received 3,635) 4,138)\nNet Cash Used in Investing Activities (301,546) (194,602)\nCash Flows From Financing Activities\nOperating Grants Received 173,925) 146,063)\nDevelopment Grants Received 33,932) 72,784)\nOther Government Grants Received 28,819) 27,969)\nMatching Endowment Grants Received 14,143) 41,103)\nDonations Received 20,035) 16,687)\nPrincipal Payment of Lease Liabilities (5,974) (5,916)\nInterest Paid on Lease Liabilities (1,258) (1,250)\nProceeds from Borrowings 230,900) 34,000)\nInterest Paid on Borrowings (2,851)  —\nNet Cash Flows Generated From Financing Activities 491,671) 331,440)\nNet Increase/(Decrease) in Cash and Cash Equivalents 45,225) (22,235)\nCash and Cash Equivalents at Beginning of Financial Year 270,109) 292,344)\nCash and Cash Equivalents at End of Financial Year 315,334) 270,109)For the financial year ended 31 March 2023CONSOLIDATED STATEMENT OF CASH FLOWS\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202366\nNote A: Reconciliation of Liabilities Arising From Financing Activities\n1 April\n2022Principal\nand Interest\nPaymentsProceeds\nfrom\nBorrowingsNon-Cash Changes31 March\n2023Additions Interest Expense\n$’000 $’000 $’000 $’000 $’000 $’000\n2023\nLease\nLiabilities37,780 (7,232)  — 11,335 1,258 43,141\nBorrowings 34,043 (2,851) 230,900  — 5,125 267,217\n1 April\n2021Principal\nand Interest\nPaymentsProceeds\nfrom\nBorrowingsNon-Cash Changes31 March\n2022Additions Interest Expense\n$’000 $’000 $’000 $’000 $’000 $’000\n2022\nLease\nLiabilities42,712 (7,166)  —  984 1,250 37,780\nBorrowings — — 34,000  —  43 34,043\nNote B: Purchase of Property, Plant and Equipment and Intangible Assets\nDuring the financial year, the Group acquired Property, Plant and Equipment and Intangible Assets with an aggregate\ncost of $288,219,000 (2022: $151,838,000). The additions were by way as follows:\nNote 2023\n$’0002022\n$’000\nCash at Bank 260,111 148,407\nPayables for Property, Plant and Equipment 16,773 2,447\nLease Liabilities A 11,335 984\n288,219 151,83867\nFINANCIAL STATEMENTS\nRoad To Punggol\nREDEFINING UNIVERSITY EXPERIENCE FOR\nLEARNERS, INDUSTRY AND COMMUNITY\nThe SIT Punggol Campus is taking shape as a hub for\ntransformative education and innovation.\nComprising 2 plots (‘SIT Campus Heart’ and ‘SIT Campus\nCourt’) in the heart of Punggol Digital District (PDD), the\ncampus is expected to be completed by 2024 and can\naccommodate approximately 12,000 students — bringing\ntogether the SIT community from 6 locations to 1.\nDesigned to integrate with the neighbouring industry\nand community, the new campus will provide a vibrant\nand authentic applied learning environment for students,\nas well as for the wider PDD community. Some facilities\ninclude a Library of the future, Superlab, Lectorial classes and a Smart Playground. We are connected to JTC\nCorporation’s business park via Campus Boulevard and\nthe elevated Collaboration Loop. Students and faculty\ncan test-bed proofs-of-concept across the street, while\nindustry partners innovate at The Hatchery in the campus.\nMore importantly, the Punggol Campus presents\nopportunities for SIT to build a shared organisational\nidentity and culture, enhance inter-disciplinarity in our\neducation and research, strengthen collaborations with\nindustry, drive greater authenticity in our education\nprogrammes, and serve the local Punggol and\nSengkang communities.Artist’s perspective of SIT Campus Court from the waterfront.\nThe Hatchery is a 10-storey building conceived to drive the\ncross fertilisation and incubation of ideas between academia\nand industry.SIT marked a major construction milestone for the new Punggol\nCampus on 22 May 2023 at a Topping Out Ceremony, graced\nby Mr Chan Chun Sing, Minister for Education.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202368\nSINGAPORE INSTITUTE OF TECHNOLOGYContact Us\nTEL 6592 1189 FAX 6592 1190SIT@DOVER, 10 DOVER DRIVE,\nSINGAPORE 138683\nTEL 6592 1136\nEMAIL Adm@SingaporeTech.edu.sgADMISSIONS\nTEL 6592 2723\nEMAIL Innovate@SingaporeTech.edu.sgINNOVATION AND TECHNOLOGY\nTRANSFER\nTEL 6592 2129 / 6592 2114\nEMAIL Alumni@SingaporeTech.edu.sgALUMNI\nTEL 6592 8971\nEMAIL SIT.NACE@SingaporeTech.edu.sgNACE@SIT\nTEL 6592 8150\nEMAIL CareerReadiness@SingaporeTech.edu.sgCENTRE FOR CAREER READINESS\nTEL 6592 2091\nEMAIL Registrar@SingaporeTech.edu.sgREGISTRAR’S OFFICE\nTEL 6592 1138 / 6592 2009\nEMAIL Advancement@SingaporeTech.edu.sgGIVING TO SIT\nTEL 6592 1191\nEMAIL SLD@SingaporeTech.edu.sgSTUDENT EVENTS, ACTIVITIES\nAND CLUBSEMAIL SITLEARN@SingaporeTech.edu.sgSITLEARN PROFESSIONAL\nDEVELOPMENT\nEMAIL SIT.CLASIC@SingaporeTech.edu.sgCOMMUNITY LEADERSHIP AND SOCIAL\nINNOVATION (CLASIC)69\nCONTACT US\n@SingaporeTechREAD ONLINE\nSingaporeTech.edu.sg/annual_report_2023\nSINGAPORE INSTITUTE OF TECHNOLOGY\n10 Dover Drive\nSingapore 138683\nRegistration No: 200917667D\nSingaporeTech.edu.sg"
}