{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Triple%20Celebrations%20for%20New%20Year.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  10/16\nProf Tan Thiam Soon, President, SIT (second from right), together with members of the Singapore Leong Khay Huay Kuan as well as guests at the event.\nTeam Black Wing comprising (from left) Andre Wan, Gibson Tubiba Teo, Ryan Koh Wee\nLun, Yap Thian Hong, Ryan Koh Kok Fong, Glendon Sim and Tin Nilju, with Assoc Prof\nDr Sutthiphong Srigrarom.SITizens beat over 16 international teams to\nclinch top prize at the Autonomous Aerial\nVehicle Challenge (AAVC)Triple Celebrations for the New Year\nFlight to VictoryRecipients of the Singapore Leong Khay Huay Kuan\nBursary at the Singapore Institute of Technology (SIT) were treated to a very special afternoon on 16 February 2019 at the Raffles City Convention Centre. They were among the attendees of a triple celebration held by the Singapore Leong Khay Huay Kuan to celebrate the 80th anniversary of the clan association, the 5th anniversary of the clan’s Education Trust, as well as to usher in the Lunar New Year. Prof Tan Thiam Soon, President, SIT, along with SIT staff were also present at the event.\nFor Ms Ho Sin Yue, who received the Bursary for two\nconsecutive years, the event was an opportunity to say thank you to the clan members she met. The second-year Hospitality Business student said, “I learned just how much the Singapore Leong Khay Huay Kuan has worked\nTeam Black Wing, comprising seven students from\nUniversity of Glasgow’s Aeronautical Engineering and Aerospace Systems programmes, made SIT proud when they clinched the top prize for ‘The Best Platform Innovation’ in the Fixed Wing Category at the AAVC in Chiang Mai, Thailand in November 2018. Competitors were tasked to create a drone that complements search-and-rescue efforts with the ability to drop off a ‘payload’, such as medication or food supplies to people in emergency situations.\nIt was the team’s first time building a drone, but they\novercame technical and unfamiliar environmental challenges to triumph over teams from India, Singapore and Taiwan, as well as those from defence academies of Thailand and Japan. Team member Mr Glendon Sim attributes their success to their daringness to try. “I believe our team dared to attempt something different or even challenging, and always questioned if there were ways to push the limits of innovation without compromising on the flight fundamentals and principles\nto help students cope with their school fees and I am very grateful for the bursaries I’ve received.”\n“It was a wonderful reception, and being able to meet\nand thank the clan members who made the bursary possible in person was a great honour,” added Ms Nurush Shifa’ Binte Kamarul Zaman, a second-year student from Physiotherapy programme.\nThe clan association endeavours to preserve Chinese\nlanguage and culture, promote education and social welfare, as well as benefit the Hokkien community and Singapore society at large. The Singapore Leong Khay Huay Kuan Bursary was established at SIT in 2015. It is applicable to all Singaporean students who come from financially disadvantaged families. This bursary supports 12 financially disadvantaged Singaporean students annually.\nwe learnt,” he said. “We dared to make changes throughout the process of building that put the team’s critical thinking to the test.”\nThe competition is in its sixth year and was hosted by the\nConsortium of Aerospace Engineering (Thailand) and Chiang Mai University. Besides the experience, the team also valued the opportunity to forge international bonds. Said team leader Mr Yap Thian Hong, “The competition made us realise the value of perseverance and hard work. As a bonus, we also made good friends with the rest of the competitors from the other international universities.”"
}