{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Nurturing%20Future%20Degreed%20Professionals%20for%20the%20Hospitality%20Industry.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  07/12\nNursing undergraduates at SIT can now look forward to vying\nfor the Rotary Club of Jurong Town Book Prize in Intermediate & Long Term Care. Thanks to the Rotary Club of Jurong Town, Singapore’s latest endowed gift, SIT will be able to award one book prize to the top student of the Intermediate & Long Term Care module each year, and in perpetuity. The module aims to prepare nursing students for the challenges that may arise from caring for individuals with multiple health care problems that may be managed and controlled but not cured, resulting in complex care needs over a protracted period.\nThis is not the first time that the Club has supported\nundergraduates pursuing a nursing degree at SIT. They have previously made possible the Rotary Club of Jurong Town Book Prize in Care Pathways for Long-Term Conditions in 2014, and in 2015, the Club made possible the endowed Rotary Club of Jurong Town Bursary. Four bursaries have been awarded so far to nurture financially disadvantaged nursing students.\nMr Muhammad Izzulwan, who graduated with a Bachelor\nof Science with Honours in Nursing Practice (University of Manchester) degree in 2014, was the first to receive the Rotary Club of Jurong Town Book Prize in Care Pathways for Long-A Shot in the Arm to Boost\nNursing Excellence\nA new endowed gift from the Rotary Club\nof Jurong Town, Singapore will allow SIT to recognise and encourage academic excellence among nursing students\n(From left) Ms Chew Jia Tian, Ms Evelyn Chua and Mr Muhammad Izzulwan\npresent a cake to Mr Stanley Teo, President of the Rotary Club of Jurong\nTown, Singapore, to express their appreciation.\nterm Conditions in the same year. He was happy that\nthe book prize will now be awarded each year and in perpetuity , recognising the efforts of students to achieve academic excellence.\nHe said, “Receiving the book prize certainly motivated\nme to aspire towards developing my career as a nurse working in Changi General Hospital's Acute Stroke Unit. The award also serves as a reminder for me to contribute what I have back to society and help those who are less fortunate.”\nThe Club was chartered in 1971 and is the fourth\nRotary Club in Singapore. Its primary focus is to provide service to community and encourage goodwill and peace. Nurturing Future Degreed Professionals for the Hospitality Industry\nThe S.S. Jhunjhnuwala-Naumi Hotel Bursary will support women undergraduates from\nthe Hospitality Business programme in perpetuity\nThe 73-room Naumi Hotel is part of Naumi Hospitality\nand is located on Seah Street.\nThe newly established S.S. Jhunjhnuwala\n– Naumi Hotel Bursary at the Singapore Institute of Technology (SIT) has a very specific purpose – it aims to nurture financially disadvantaged women undergraduates pursuing a Hospitality Business degree at SIT.Made possible through philanthropic support from Mr Surya Jhunjhnuwala and Mr Gaurang Jhunjhnuwala, one bursary (valued at $5,000 each) will be awarded each year and in perpetuity to a deserving student from this Academic Year 2017/18 onwards.\nWhen asked why they wanted to support this particular group of students, Mr\nGaurang Jhunjhnuwala, said, “My family has been in the hospitality industry in Singapore for more than 20 years, and we are proud to be able to encourage SIT undergraduates who will be the future of this industry with the S.S. Jhunjhnuwala-Naumi Hotel Bursary.”\n“The bursary is also partly named after my late grandfather, Shyam Sundar, who\nwas passionate about how children must have a proper education, especially girls. My family and I are happy to be able to further that cause and that’s why we are choosing to support women undergraduates at SIT,” he added.\nNaumi Hospitality, managed\nand owned by the Hind Group of Companies, serves to bridge the gap between\nresidence and hotel and\nensure that guests receive the best of home life in a boutique environment away from home. Some of its properties include Naumi Hotel in Singapore and in Auckland.\nThe bursary is also partly named after\nmy late grandfather, Shyam Sundar, who was passionate about how children must have a proper education, especially girls. My family and I are happy to be able to further that cause and that's why we are choosing to support women undergraduates at SIT.\n– Mr Gaurang Jhunjhnuwala"
}