{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2020-10/Annual_Report_2014.pdf",
  "type": "pdf",
  "content": "2Singapore i nStitute of t echnology\nannual  report  2014\nA leader in innovative university education by\nintegrating learning, industry and community.\nTo develop individuals who build on their\ninterests and talents to impact society by\nproviding a nurturing environment that is\nuniquely enriched by world-class partners.ViSion\nMiSS ion\nchairman's message 03\nBOarD OF T rUsTees 04\npresi DenT's message 05\nseniOr managemen T 06\nOrganisa TiOn char T  07\nmiles TOnes  08\nOUr p OlYTechnic an D OV erseas Uni VersiTY par Tners  17\nsiT Degree pr Ogrammes  25\ninTegra TeD WOr K sTUDY pr Ogramme  26\nOUr gra DUaTes  27\nDOn Ors an D sch Olarships  29\ncOrpOraTe gOVernance  32\nFinancial  sTaTemen Ts 34\n01Singapore i nStitute of t echnology\nannual  report  2014\nt\na\nc\ng\nWe are\nSingapore’s n ew u niversityWho  We are\n02Singapore i nStitute of t echnology\nannual  report  2014\nIt has been a landmark year for Singapore Institute of\nTechnology (SIT), marking the year the university was\nofficially awarded the status of an autonomous university.\nIt would also be known as the year when SIT launched\nits inaugural degree programmes in the areas of\nSustainable Infrastructure Engineering (SIE), Information\n& Communications Technology (ICT) and Accountancy.\nAlongside these new programmes, ambitious industry-\nuniversity collaborations were sealed to guide curriculum\ndevelopment, promote joint research and development\nactivities and provide opportunities for students to\nintegrate knowledge and skills gained in the classroom\nwith real-world practice.\nOne such initiative was the establishment of a\nMemorandum of Understanding (MOU) with Land\nTransport Authority (LTA), SMRT Corporation (SMRT), SBS Transit, and Non-Destructive Testing Society of Singapore\n(NDTSS) to jointly develop an industry-relevant curriculum\nfor the university’s SIE programme.\nAnother groundbreaking endeavour was the partnership\nagreement the university signed with Amazon Web\nServices, Inc (AWS), a global leader and pioneer in\ncloud computing services. With this collaboration,\nSIT would establish a Cloud Education, Research and Innovation Centre (CERIC) to bolster research on cloud\ntechnology and educate students pursuing SIT’s BEng\n(Hons) in Information and Communications Technology\n(Software Engineering).On top of this, ICT undergraduates would benefit from a partnership SIT forged with the Cloud Security Alliance\n(CSA) in April to collaborate on education and research\nefforts in cloud security. Through the agreement,\nstudents pursuing the ICT degree programme will have\nthe opportunity to participate as volunteers in CSA events\nin Asia Pacific and be given priority placements to work\nin the CSA both locally and overseas during the course of\ntheir studies.\nThese achievements were in line with the university’s\nvision to be a leader in innovative university education\nby integrating learning, industry and community. SIT\naims to cultivate in its students four distinctive traits,\nor the SIT-DNA, which will prepare them to be ‘thinking\ntinkerers’, develop an ‘ability to learn, unlearn and relearn’,\nbe ‘catalysts for transformation’ and finally, become\n‘grounded in community’.intro Duction\nto Sit\n03Singapore i nStitute of t echnology\nannual  report  2014\nWe are proud to celebrate one of the University’s major\nhistorical milestones – the gazetting of the SIT Act by\nthe Singapore Government on 28 March 2014. SIT is\nSingapore’s NEW University. With our new status as an autonomous university, we look forward to adding diversity\nto Singapore’s tertiary education landscape, and meeting\nthe educational aspirations of our students.\nIn the lead up to the announcement of SIT as an autonomous university, the Board and SIT leadership set out to craft SIT’s\nnew Vision and Mission. Both the Vision and Mission are\ncrucial in guiding the direction that SIT would take, and the choices SIT will make as a new university.\nOur vision is to be a leader in innovative university education\nby integrating learning, industry and community.\nOur mission is to develop individuals who build on their\ninterests and talents to impact society by providing a\nnurturing environment that is uniquely enriched by world-\nclass partners.\nTo stay relevant, tertiary education needs to keep in step\nwith changing industry and societal needs. SIT will stay true to our industry-focus by integrating learning pedagogy\nand content with industry requirements. Our ambition\nis to be the university of choice for industry partners by redefining how industry can impact tertiary education,\nand simultaneously, redefining how tertiary education can\ncreate value to companies.\nLooking forward, SIT will incorporate community as another\nkey facet of the University. As a University embedded within a larger community, SIT plans to amalgamate a powerful\nsynergy with our industry partners and the community as\npart of our service to society.\nWe want to provide an industry-focused and community-\ninvolved university experience to our students. As a university of applied learning, SIT will build on our students’\nunique talents and capabilities. The University has\npartnered a number of key industry leaders in various ways to support our new SIT degree programmes via curriculum\ndevelopment and employment opportunities to students\nunder the Integrated Work Study Programme. Our students have also been actively involved in community projects\nand will continue doing so. Our eventual challenge as a\nuniversity will be to bring these separate spheres together.SIT cannot succeed on this journey alone. SIT’s success\nto date is built on close partnership with our world class\npolytechnics and overseas university partners. This partnership has enriched our students’ experience with SIT.\nAs we pursue our vision and accomplish our mission, SIT\nwill have to evolve and deepen our collaboration with our partners.\nThis year we have also seen changes to the Board of\nTrustees. On behalf of the Board, I welcome two new\nprominent leaders as members: Mr Lam Yi Young and Ms\nTeoh Zsin Woon. I also thank Mr Ng Cher Pong and Mr Lee Kok Choy, who stepped down from the Board this year, for\ntheir dedication and contributions to the University.\nThe University’s progress and early successes are\nthe achievements of the entire SIT family. The Board,\nbenefactors, management and staff, students and alumni, partners have been part and parcel of building SIT in the\nearly years to what it is today as a new university. The future\nlooks bright with such dedicated members of the SIT family.\n04Singapore i nStitute of t echnology\nannual  report  2014\n1 Appointed on 23 Sep 2009\n2 Appointed on 21 Mar 2011\n3 Appointed on 16 Sep 2012\n4 Appointed on 1 Feb 2013\n5 Appointed on 1 Apr 2013\n6 Appointed on 24 Jan 2014\n7 Appointed on 1 May 2010, Stepped down 23 Jan 2014\n8 Appointed on 16 Sep 2012, Stepped down 1 May 2014Mr l am y i young6\nDeputy Secretary (Policy)\nMinistry of Education\nprofessor t an thiam Soon4\nPresident\nSingapore Institute of Technologyprofessor h ang c hang c hieh\n1\nHead\nDivision of Engineering &\nTechnology ManagementNational University of Singapore\nDr richard c harles h elfer\n1\nChairman\nRCH International Pte Ltd\nDr Lim Khiang Wee 1\nExecutive Director, CREATE\nNational Research Foundation\nMs r achel e ng yaag n gee2\nJoint Managing Partner\nWong Partnership LLP\nMr p ek hak Bin1\nPartner\nHead of Energy and Natural ResourcesKPMGMr Michael y ap Kiam Siew\n1\nChairmanSkyvest International Limited\nMs Mary y eo chor g ek\n1\nVice President,\n(Supply Chain Operations forSouth Asia Pacific)United Parcel Services\nSingapore Pte Ltd\nMr thali Koattiath u dairam\n3\nGroup Chief Executive Officer\nEastern Health Alliance\nMs teoh Zsin Woon5\nDeputy Secretary (Development)\nMinistry of Health\nMr tan yew h ua alvin3\nAssistant Managing Director\n(Corporate Development &Human Capital & Contact Singapore)Singapore Economic Development Board\nMr lee Kok c hoy\n8\nManaging Director &\nSingapore Country Manager\nMicron Semiconductor Singapore Pte LtdtruS teeSchair Man Deputy chair Man\nMr n g yat chung1\nGroup President and CEONeptune Orient Lines Limited Mr n g cher p ong\n7\nChief ExecutiveSingapore WorkforceDevelopment AgencyBoarD of\ntruSteeS\n05Singapore i nStitute of t echnology\nannual  report  2014\nOn 28 March 2014, the SIT Bill was gazetted and SIT became\nSingapore’s new autonomous university. With this, SIT has\nentered a new phase of our growth. We have consistently\nbuilt on our strength of providing a high quality education focusing on applied learning to polytechnic graduates.\nThis year, in particular, is special to us. In line with our new university status, we have launched our\nown SIT degree programmes – in the areas of Sustainable Infrastructure Engineering (Land), Information and\nCommunications Technology (Software Engineering), and\nAccountancy – for the first time. We also expanded our health science degree offerings with Trinity College Dublin\nto offer a joint degree in Diagnostic Radiography, and a\ncampus-blind degree in Radiation Therapy. These degree programmes were launched after several rounds of intense\nindustry consultation to ensure that the curriculum is robust\nand rigorous and able to meet the needs of industry. The first intake of students will matriculate in Sep 2014 and we\nare proud to have them join the ever-growing SIT family.\nAdditionally, we developed the SIT-DNA to crystallise our\napplied pedagogy and ensure that our students would\ngraduate future-proof. The SIT-DNA is a set of attributes that requires a holistic approach incorporating the curriculum\nand applied pedagogy, with consistent messaging, and\na nurturing campus environment. It comprises four main tenets:\nthinking t inkerers  who are able to learn, unlearn,\nrelearn  so that they may be c atalysts for t ransformation  in\ntheir companies and to the economy, and remain g rounded\nin community.\nTo infuse the SIT-DNA into students, SIT also introduced\nthe Integrated Work Study Programme (IWSP) as a key component of the SIT educational experience. The IWSP\nis a tangible way to familiarise students with industry, and\nhelps to strengthen students’ applied learning by providing them a platform to apply theoretical concepts to real work\nproblems. At the same time, students will bring back ideas\nfrom work to the University and translate them into study projects that can create value for the company.\nWith these small leaps of progress, I am heartened that the\ndedication and commitment of our students, faculty, and\nstaff have made all this possible. We are also excited by\nour highly passionate students hungry for a high quality education that can lead to good careers. We have also\nbenefitted greatly from the strong support of our key\nstakeholders and industry partners. Thus far, we have started the journey and made some good progress, but the\nhardest (and the best) part is yet to come.\n06Singapore i nStitute of t echnology\nannual  report  2014\nSenior\nManage Ment\nprofeSS or t ing\nSeng Kiong\nDeputy President\n(Academic) & ProvostProfessor Ting was appointed the Deputy President (Academic) of Singapore\nInstitute of Technology (SIT) on 1 October 2009. On 1 January 2013, he was appointed Provost. He was the Associate Dean (Undergraduate Studies) of the College of Engineering at the Nanyang Technological University as well as the founding Director of the Lien Institute for the Environment. He is a registered Professional Engineer in Singapore and has been involved in numerous structural and geotechnical consultancy. He graduated with First Class Honours in Civil Engineering from Monash University, Australia under the President’s and Colombo Plan scholarships. He has a Master of Engineering from the National University of Singapore. He obtained his SMCE and ScD (Structural Engineering) from Massachusetts Institute of Technology.\nProfessor Loh joined Singapore Institute of Technology (SIT) as Vice-Provost on 2 September 2013. Prior to joining SIT, he was Vice Dean of the Faculty of Engineering, Deputy Head of the Department of Mechanical Engineering, Director of Education in the Design Technology Institute Limited and most recently, Director of Bachelor of Technology Programme (BTech Programme) in the Faculty of Engineering at the National University of Singapore. He was also a Visiting Scholar at Stanford University and a Fellow of the Singapore MIT Alliance. A Colombo Plan scholar, he graduated with First Class (Honours) in Engineering from University of Adelaide, Australia. He obtained his Master of Engineering from National University of Singapore, and PhD in Mechanical Engineering from University of Michigan under the NUS Overseas Postgraduate Scholarship.profe SSor loh\nHan Tong\nVice-Provost\nprofeSS or tan\nthiaM Soon\nPresidentProfessor Tan was appointed the President of Singapore Institute of Technology (SIT) on 1 February 2013. He was a Professor of Civil Engineering and held various positions including the Vice-Provost (Education) and Dean of Admissions at the National University of Singapore. He is a registered Specialist Professional Engineer (Geotechnical) in Singapore and is a well-known expert on land reclamation, deep excavation and other geotechnical problems. A Colombo Plan scholar, he graduated from University of Canterbury (New Zealand) and obtained his Master’s degree and PhD from California Institute of Technology.\nAssociate Professor Yee is the Vice President (External Relations) of Singapore Institute of Technology (SIT), appointed on 1 July 2013. Prior to joining SIT, he was the Vice President of Singapore Technologies Engineering Ltd. Within the ST Engineering group of companies, he held senior management positions in technology development and investment, advanced engineering and business development. He was the founding Director of the Precision Engineering and Application Centre and concurrently, Director (Administration) of the Singapore Productivity and Standards Board. He graduated from the National University of Singapore with Bachelor and Master degrees in Mechanical Engineering, and obtained his PhD from the Nanyang Technological University. aSSociate\nprofeSS or y ee\nfooK cheong\nVice President\n(External Relations)\nMr c han\nWing l eong\nDeputy President\n(Administration) &\nChief Financial OfficerMr Chan was appointed Chief Financial Officer of Singapore Institute of Technology (SIT) on 1 July 2009. Subsequently, he assumed appointment as Deputy President (Administration) on 1 January 2013 covering the additional functions of estates, information technology, human resources and administration. Prior to joining SIT, he was Executive Chairman of Easycall Ltd, Chief Financial Officer and President of New Businesses at Sembcorp Ltd, and was Chairman of Pacific Internet and Delifrance while at Sembcorp. Mr Chan graduated with a first in Economics at Singapore University in 1981 and joined the Administrative Service. He also worked at Mindef companies and the Economic Development Board before becoming an investment banker in Schroders and Bankers Trust in Singapore and Hong Kong before joining Sembcorp. He currently sits on private and public listed company boards, and on the boards of charities or institutions of public character, in addition to his appointment at SIT.\n07Singapore i nStitute of t echnology\nannual  report  2014\nOFFICE OF THE PRESIDENT\nADVANCEMENT\n& ALUMNICORPORATE\nSTRATEGIC PLANNING\nOFFICE OF THE DEPUTY PRESIDENT\n(ADMINISTRATION) & CFO\nLEGAL\nLIBRARYHUMAN\nRESOURCESESTATES\nFINANCEOFFICE OF THE VICE PRESIDENT\n(EXTERNAL RELATIONS)\nCAREER\nSERVICES\nINDUSTRY &\nCOMMUNITYCORPORATE\nCOMMUNICATIONSCOMMUNICATIONS\n& ITOFFICE OF THE DEPUTY PRESIDENT\n(ACADEMIC) & PROVOST\nCOLLABORATIONS\nREGISTRAR’S OFFICE\nSTUDENT LIFEADMISSIONSACADEMIC ANALYSIS\n& PLANNINGASSOCIATE\nPROVOST\nFACULTYVICE-PROVOST\nPROGRAMMES\nADMINISTRATION\nFrom welcoming its new students to connecting with the\ncommunity, SIT has had a thrilling ride over the past year.\nWe look forward to surpassing more milestones in the years\nto come.\n09Singapore i nStitute of t echnology\nannual  report  2014\nJune 2013\nHeld on 7 June 2013, SIT Engineering Day was organised for\nthe graduating students from Newcastle University, Technical\nUniversity of Munich (Technische Universität München) and\nUniversity of Glasgow. Students from these universities had the opportunity to showcase their final year project posters and\nnetwork with 52 industry partners, some of whom gave talks on\ntheir respective specialist areas.\nThe event also provided the students with prospective\nemployment opportunities in the form of on-the-spot interviews with industry partners.\nsiT engineering Day (7 Jun)\naugust 2013\nThe inaugural SIT Alumni Movie Screening on 1 August 2013 drew more than 110 SIT alumni and staff who were thrilled to catch the\nscreening of ‘The Wolverine’. Held at Filmgarde at Bugis+, the\nSIT Alumni Leisure Network event turned out to be a fantastic opportunity for SITizens to catch up with each other and bond\nover dinner before the screening.\nsiT alumni movie s creening (1 a ug)\nA signing ceremony was held to commemorate the tripartite\npartnership between SIT, University of Liverpool and Temasek\nPolytechnic, for the Bachelor of Arts with Honours in Criminology\nand Security degree programme.\nM r  S .  I s w a r a n,  M i n i s t e r,  P r i m e  M i n i s t e r 's  O f fi c e  a n d  S e c o n d  M i n i s t e r\nfor Home Affairs and Trade & Industry was guest-of-honour at the signing ceremony. The event also saw the participation of 32\nHome Team officers who were awarded a full sponsorship each by\nthe Ministry of Home Affairs for their degrees.\nsiT-Uol -Tp signing c eremony (2 a ug) august 2013\nAbout 500 freshmen turned up for this fun-filled three-day camp which was held at Sarimbun Scout Camp. Through the numerous\nice-breakers and team-bonding games, SIT freshmen emerged\nfrom the camp with an even greater sense of community.\nsiT student Orientation c amp 2013 (19 - 21 a ug) august 2013\n10Singapore i nStitute of t echnology\nannual  report  2014\nMore than 900 freshmen and guests attended the Welcome\nCeremony 2013 which was held at the Nanyang Polytechnic\nAuditorium. Students and guests were treated to energetic\nstudent performances followed by a delightful tea reception.\nsiT Welcome ceremony (24 a ug)\naugust 2013\n2013 marked the second year of SIT’s participation at the Singapore University Games (SUniG). The number of SIT students\nwho participated in the games tripled from the previous year, as\n179 sportsmen pitted their skills against athletes from the other local universities in 12 sporting events.\nsingapore University g ames ( sUnig) (21 a ug - 5 Oct)\nOver 400 freshmen came together for a night of merrymaking at SIT Welcome Bash 2013 which was held at Wavehouse, Sentosa.\nThe highlight of the night was the SIT Pageant which saw students\ncasting their votes for the university’s Mr and Ms SIT. Students also took part in games such as Treasure Hunt and Beer Pong.\nSome SIT students also won prizes during the Lucky Draw!\nsiT Welcome Bash (28 s ept) September 2013\nOrganised by SIT’s very own Let’s Serve Club, Ride for Rainbows\nwas a fundraising event held in conjunction with Club Rainbow\nSingapore. A total of 104 riders participated in the overnight\ncycling event with two challenges – 100km and 168km.\nThe event turned out to be a success as over $300,000 was raised\nthrough the hard work of student organizers and volunteers. The event was graced by guest-of-honour, Mr Chan Chun Sing,\nMinister for Social and Family Development and Second Minister\nfor Defence.\nride for r ainbows (5 Oct) october 2013august 2013\n11Singapore i nStitute of t echnology\nannual  report  2014\nThe SIT Alumni Sports Network took part in its first sporting\nevent, the Mizuno PAssion Mount Faber Run, which was held on\n13 October 2013. Both SIT alumni and staff took part in the run\nand spurred each other on for the 10km challenge, which included running up steep inclines on Mount Faber.\nmizuno pa ssion mount Faber r un (13 Oct)\nMr Lim Der Shing, CEO and co-founder of JobsCentral, shared with SIT alumni his experience of overcoming the challenges when\nsetting up JobsCentral. The talk, which was jointly organised by\nthe SIT Alumni Career Network and SIT’s Career Services Division, attracted more than 80 alumni and graduating students.\nSIT held a press conference to announce the launch of the university’s three new degree programmes for AY2014. The\nthree new degree programmes, which have a focus on industry\nrelevance, are in the areas of Sustainable Infrastructure Engineering, Information and Communications Technology, and\nAccountancy. To enhance the value of the new programmes\nand shape their curricula, SIT also invited prominent industry leaders to head the programmes’ respective Industry Advisory\nCommittees (IAC).\nOn 30 October 2013, SIT hosted SIT-SME Networking Evening,\nan event which aimed to increase students’ awareness on career\nopportunities with SMEs. SPRING also participated in the event,\nproviding students with an overview of the role of SMEs in Singapore.\nThe evening provided a platform for SIT’s industry partners to learn\nmore about the university and its students. SIT students also took the opportunity to find out more about the various industry sectors\nand SMEs in Singapore.\nsiT-sme n etworking e vening (30 Oct)october 2013\nTackling e ntrepreneurship as a Fresh g raduate (17 Oct) october 2013\nsiT press c onference (24 Oct) october 2013\noctober 2013\n12Singapore i nStitute of t echnology\nannual  report  2014\nSIT held its second graduation ceremony at The Star Performing\nArts Centre Auditorium on November 2013. The graduates from the Technical University of Munich, University of Glasgow, The\nUniversity of Manchester, Newcastle University, DigiPen Institute\nof Technology, Trinity College of Dublin, and The Culinary Institute of America were conferred degrees in two sessions. Ms Indranee Rajah, Senior Minister of State, Ministry of Law and Ministry of\nEducation also graced this celebratory event as guest-of-honour\nfor the morning session. For the afternoon session, Dr Richard Charles Helfer, Member, Board of Trustees was guest-of-honour.\nsiT graduation c eremony 2013 (21 n ov) november 2013\nOne of the most anticipated events on the SIT alumni calendar\nwas the New Alumni Welcome Party, which was held at\nAQUANOVA Restaurant Bar in Clarke Quay to celebrate the\ngraduating class of 2013. Whether new alumni, SIT staff, faculty or senior management, everyone had a great time dancing to the\nlive music from the house band, A-List, and SIT student band,\nMuzeka.\nnew a lumni Welcome p arty (22 n ov)\nEighteen SIT student volunteers travelled to the ancient city of Hue in Vietnam where they reached out to the children of Huong\nVan Kindergarten. During their time there, the SIT students\nchipped in to construct a fence for the kindergarten as well as taught the Vietnamese kindergarten teachers the basics of the\nEnglish language.\nphoject V (21 – 31 Dec) December 2013 november 2013\n13Singapore i nStitute of t echnology\nannual  report  2014\nSIT began the New Year with a Memorandum of Understanding\n(MOU) signing ceremony with four industry partners; the Land\nTransport Authority of Singapore (LTA), SMRT Corporation Ltd\n(SMRT), SBS Transit Ltd (SBS Transit), and Non-Destructive Testing Society of Singapore (NDTSS). The signing marked the first of a\nseries of formalisation of partnerships for the year between SIT and\nits industry partners. The signing ceremony was held to mark SIT’s collaborative efforts with the four industry partners to develop\na rigorous and industry-relevant curriculum for the university’s\napplied degree programmes in Sustainable Infrastructure Engineering (SIE) – Master of Engineering Technology & Bachelor\nof Engineering with Honours in Sustainable Infrastructure\nEngineering (Land).\nMr Tan Cheng Guan, Executive Vice President & Head Group Business Development & Commercial at Sembcorp Industries, witnessed the landmark occasion in his capacity as Chairman for SIT’s Industry Advisory Committee for SIE. Under the agreement, SIE students will also have the unique opportunity to take up the Non-Destructive Testing (NDT) certification\n(ISO 9712) which is validated by the NDTSS, enhancing their industry readiness.\nsiT-lTa-smrT-sBsT-nDTss mOU s igning c eremony (6 Jan) January 2014\nMore than 4,500 guests turned up at the SIT Open House which\nwas held at *SCAPE on 11 and 12 January. The theme of the year’s Open House was ‘Where It All Falls Into Place’, presenting\nSIT as the final piece in a student’s education puzzle, and as a\nplace where one can realise his or her fullest potential. At the Open House, prospective students and their families were able to obtain first-hand information on the various degree programmes\navailable at SIT and interact with faculty, staff as well as existing\nstudents. Stations were set up to allow potential candidates to submit their applications for the upcoming AY2014 intake. SIT also worked with its industry partners and various government agencies to disseminate information on scholarships and career\nopportunities at the ‘One-Stop Centre’.\nThe university unveiled three new SIT degree programmes in the areas of Sustainable Infrastructure Engineering (Land),\nInformation and Communications Technology (Software Engineering), and Accountancy.\nJanuary 2014 siT Open h ouse (11 – 12 Jan)\nSIT ushered in the Year of the Horse with its industry partners at\nthe inaugural Industry Appreciation Dinner which was held at the\nAsian Civilisations Museum. The event was held to recognise the\ncontributions made by the university’s industry partners.\nThe evening was topped off by a grand unveiling of the SIT logo\nMosaic, which symbolises the symbiotic relationship between SIT and its industry partners.\nsiT industry a ppreciation Dinner (7 Feb) february 2014\n14Singapore i nStitute of t echnology\nannual  report  2014\nSome 100 students attended a motivational talk by Mr Raja\nSingh, the founder of DNR Wheels which supplies rehabilitative\nequipment to the disabled and the elderly. Mr Singh addressed\nthe students on how perseverance and positive thinking may overcome all obstacles in life. Truly an inspiring talk!\n‘get inspired’ motivational Talk by m r raja singh (12 Feb) february 2014\nGourmet pies and Chinese New Year’s customary ‘lo hei’ were aplenty at the dinner hosted by the SIT Alumni Team for some\nSIT alumni who helped out at various events during the past\nyear. It was a good chance for the SIT Alumni team to catch up with and show appreciation for the alumni volunteers.\ncnY appreciation Dinner for a lumni Volunteers (13 Feb) february 2014\nA three-day retreat at Kota Rainforest Resort was organised\nfor SIT student leaders in the month of February. There, the 28 students were given lessons on how to hone their leadership\nskills. The retreat also facilitated the exchange of ideas between\nthe student leaders.\nstudent l eaders’ r etreat (21 – 23 Feb) february 2014\n15Singapore i nStitute of t echnology\nannual  report  2014\nFourteen SIT students flew to Penang, Malaysia where they\nparticipated in a floorball friendly match with the local floorball\nclubs, Firebrands and Spearhead.\nFloorball Overseas Friendly in p enang (22 – 23 Feb) february 2014\nThe Singapore Institute of Technology (SIT) signed a Memorandum\nof Understanding (MOU) with Amazon Web Services, Inc. (AWS),\na global leader and pioneer in cloud computing services, to\ncollaborate on education, research and innovation on cloud technology.\nWith this partnership, SIT will establish a Cloud Education,\nResearch and Innovation Centre (CERIC) to bolster research,\nin particular for students who are pursuing the SIT degree\nprogramme in Information and Communications Technology (Software Engineering).\nCERIC will also provide the tools for students and researchers to gain hands-on experience in using cloud technology to develop projects while increasing public awareness on online on-demand computing resources.\nsiT-aWs signing c eremony (6 m ar) March 2014\nThe SIT Canoeing Club organised a half-day sporting event at\nKallang Basin where SIT students showcased their aptitude for running and kayaking. Fifty SIT students formed pairs, as they\ncompeted for the title of the fastest team.\nKr Doubles 2014 (8 m ar) March 2014\n16Singapore i nStitute of t echnology\nannual  report  2014\nThe SIT Alumni Leisure Network kicked off its calendar of events\nin 2014 with a bowling competition held on 15 March 2014 at\nSuperbowl Marina Square. Alumni and graduating students\norganised themselves into five teams and bonded over two rounds of friendly matches. Prizes were awarded to the Best Team\nand Top Bowler of the day.\nsiT alumni Bowling e vent (15 m ar) March 2014\nSIT was officially awarded autonomous university status by the\nSingapore Government with effect from 28 March 2014. The\nuniversity, which aims to provide an industry-focused education\nin Singapore, will henceforth be able to award degrees, diplomas and certificates under the SIT name. SIT’s mission is to develop\nindividuals who build on their interests and talents to impact society\nby providing a nurturing environment that is uniquely enriched by world-class partners. As Singapore’s new autonomous university, SIT\nhas a vision to become a leader in innovative university education by\nintegrating learning with industry and community perspectives and needs.\nsiT act (28 m ar) March 2014\nCycling enthusiasts from the SIT Alumni Sports Network, along with SIT staff, took part in the OCBC Cycle Singapore 2014. While\nsome took up the 40km challenge, others participated in the more\nleisurely 27km Community Ride. It was a wonderful opportunity for SITizens to reconnect with each other as they took in the sights and\nsounds of Singapore.\nsiT alumni s ports n etwork Oc Bc cycle s ingapore 2014 (30 m ar) March 2014Held at Mandarin Orchard Hotel on March 26, Reach for The Stars\nis an annual event held by SIT to acknowledge the contributions\nmade by the university sponsors. The evening also provided an\nopportunity for some 200 scholars to network with the university’s industry partners and socialise with SIT Senior Management.\nThere was plenty of merrymaking during the evening as guests\ntook part in various interactive games and were treated to a series\nof student performances, including a breakdance segment.\nreach for the s tars (26 m ar) March 2014\nAs Singapore’s new university of applied learning, SIT values its partnerships with the five local\npolytechnics – Singapore Polytechnic, Ngee Ann Polytechnic, Temasek Polytechnic, Nanyang\nPolytechnic and Republic Polytechnic – to prepare students for their transition from polytechnic\nto university graduate.\nThe close links with the five polytechnics, whose key strengths are in practical disciplines ranging\nfrom engineering and technology to management and liberal studies, allow SIT to uphold its utmost commitment to providing an education with a focus on work-based learning and\nprofessional relevance.\nteMaSeK polytechnic\nPrincipal & CEO, Mr Boo Kheng Hua“As our education landscape evolves, SIT will play an increasingly\nimportant role in providing industry and market relevant degree\nprogrammes for polytechnic graduates to deepen their knowledge and\nskills in their specialised fields.”ngee a nn p olytechnic\nPrincipal, Mr Clarence Ti“Our congratulations to SIT becoming an autonomous university in March 2014, a milestone in its history. Ngee Ann Polytechnic is also\nproud to be part of SIT’s plans to provide better learning facilities to its\nstudents with the completion of the SIT building in Ngee Ann Polytechnic in May 2014. We look forward to working with SIT as it expands upgrading\nopportunities to polytechnic students.”\nrepuBlic p olytechnic\nPrincipal/CEO, Mr Yeo Li Pheow“Republic Polytechnic congratulates SIT as Singapore’s new university of\napplied learning. We also look forward to the opening of the SIT building\non our campus in 2015. This will expand SIT’s ability to host and support\nits industry-focused degree programmes, and to offer polytechnic graduates exciting learning and career opportunities. I view this as a\npositive development for Singapore’s education landscape.”Singapore p olytechnic\nPrincipal & CEO, Mr Tan Choon Shian“SP congratulates SIT on the first intake of students in its own applied\ndegree programmes. With a focus on industry-centric education, its\nIntegrated Work Study Programme (IWSP) will further strengthen and\ndeepen the skills of polytechnic graduates and enable them to stay relevant and excel in their chosen career.”\nnanyang p olytechnic\nPrincipal & CEO, Mr Chan Lee Mun“As SIT opens its brand new building on Nanyang Polytechnic’s Campus, we welcome it as a partner bringing more opportunities for enriching\nstudent and staff interaction, collaboration and adding to the vibrancy\nof Campus life. Under the SIT umbrella, the Polytechnic now hosts eight degree programmes offered by three renowned universities with the\nlatest being in Diagnostic Radiography and in Radiation Therapy offered\nby Trinity College Dublin. These programmes provide polytechnic graduates with more opportunities to upgrade and build on their\npractice-oriented, industry-relevant education and training received at\nthe polytechnics like NYP.”\nSIT continues to build on its successful partnerships with our world-renowned overseas\nuniversity partners, bringing together the best of higher education in niche disciplines,\nranging from marine engineering to game design and aerospace engineering to culinary\narts management, to help students achieve their fullest potential. Through this network of partnerships, SIT students continue to pursue their highest aspirations and contribute\nto society in meaningful ways, while enjoying the benefits of interacting with faculty and\noverseas counterparts.\nnewcastle u niversity ( uK)\ntechnische u niversität München\nuniversity of g lasgow\ntrinity college Dublin\nthe university of Manchester\nthe g lasgow School of a rt\nDigip en institute of t echnology\nWheelock college\nthe culinary i nstitute of a merica\nuniversity of n evada, l as Vegas\nuniversity of l iverpooloVerSeaS\nuniVerSity\npartner S18Singapore i nStitute of t echnology\nannual  report  2014\n19Singapore i nStitute of t echnology\nannual  report  2014\n“ Newcastle University is bridging academia, industry and government to deliver innovative solutions for Singapore’s\neconomic future and a pool of world-class talent. Newcastle University, one of the UK's most established research-intensive universities, is working in partnership with Singapore Institute of Technology to deliver 7 Newcastle degree programmes to nearly 700 undergraduate students in Singapore.  Newcastle University’s core research strengths in science, technology and engineering are advantageously aligned with Singapore’s strategic challenges. Newcastle University aims to work with\nthe government to help Singapore reach its economic and technological aspirations by developing translational research\nand educating human talent. Newcastle University researchers in Singapore collaborate with top institutions and companies such as A*Star and Keppel Corporation, and work at the forefront of critical areas such as high-tech energy, transport, process and systems. Newcastle University is cultivating future transindustry innovators and leaders through education, and students benefit from NUIS’ deep connections with the public and private sector.“\n- Professor Ehsan Mesbahi, Dean (Singapore Campus), Chief Executive, NUISNewcastle University (NU) is one of the UK’s most reputable higher education institutions. It is a member of the Russell Group, comprising the United Kingdom’s 24 leading research-intensive universities, and it is acclaimed for its multidisciplinary research, teaching excellence, and for the preparedness of its graduates for their professional careers. NU’s work has been recognised by prestigious awards including\nQueen’s Anniversary Prizes for Higher and Further Education.\nNU can trace its origins back to 1834 but it was the founding of Armstrong College\nin 1871 which introduced fundamental subjects such as chemistry, mathematics and physics to the University. Armstrong College also had a focus on the applied sciences, such as agriculture, engineering and naval architecture, which underpinned Newcastle’s economic growth. This focus continues today in NU’s Faculty of Science, Agriculture and Engineering and in the seven degree programmes which NU offers in Singapore.\nEach of these programmes delivers a modern interpretation of the industrially-relevant\ndegree and our students develop skills, knowledge and understanding which allow them to complete successfully in the job market and to build successful and satisfying professional careers.programmes offered in partnership with S it:\n•  Bachelor of Engineering with Honours\nin Chemical Engineering\n•  Bachelor of Engineering with Honours\nin Electrical Power Engineering\n•  Bachelor of Engineering with Honours\nin Marine Engineering\n•  Bachelor of Engineering with Honours\nin Naval Architecture\n•  Bachelor of Engineering with Honours\nin Offshore Engineering\n•  Bachelor of Engineering with Honours\nin Mechanical Design and Manufacturing\nEngineering\n•  Bachelor of Science with Honours in\nFood & Human NutritionneW caStle uniVerSity (nu)\nPhoto credit to: James Fish\n20Singapore i nStitute of t echnology\nannual  report  2014\n“As the partnership between the University of Glasgow and Singapore Institute of Technology continues to flourish,\nhigh quality graduates of our joint programmes are making a difference in the world. Together we are creating fantastic opportunities for international collaboration in learning and teaching to the benefit of our students, staff and the Engineering\nprofession.”\n- Professor Anton Muscatelli, Principal & Vice-ChancellorAs the fourth-oldest university in the English-speaking world, UoG has been inspiring\npeople for over 550 years. It is also part of the United Kingdom’s distinguished Russell Group of leading UK universities and a founding member of Universitas 21 – an international network of universities established as an international reference point and resource for strategic thinking on issues of global significance. It is associated with seven Nobel Laureates and boasts alumni like Adam Smith, Lord Kelvin and James Watt. UoG’s School of Engineering sustains a broad portfolio of leading-edge\nresearch funded by industry, research councils, and governmental agencies around\nthe world.uniV erSity of gla SgoW (uog)\nprogrammes offered in partnership with S it:\n•  Bachelor of Engineering with Honours\nin Aeronautical Engineering\n•  Bachelor of Engineering with Honours\nin Aerospace Systems\n•   Bachelor of Engineering with Honours\nin Mechanical Design Engineering\n• Bachelor of Engineering with Honours\nin Mechatronics\n•  Bachelor of Science with Honours\nin Computing Science\n(Technical University of Munich, TUM)techni Sche uniVerSitÄt MÜnchen\nFounded in 1868 by King Ludwig II, Technische Universität München (TUM) has long established itself as a premier institute of higher\nlearning in Germany. Ranked as Germany’s #1 University for 3 consecutive years - 2011, 2012 and 2013 Shanghai Ranking (Academic Ranking of World Universities, ARWU), TUM has earned itself the reputation of being an institute that produces world-changing technologies. TUM has produced a total of 13 Nobel Laureates to date. In 2002, TUM Asia was set up to bring German academic excellence to Asia. Moving forward, TUM Asia strives to continuously provide industry-focused education offerings in tune with the needs of the global economy.\n“ Through TUM Asia’s collaboration with SIT, the best professors from around the world are able to contribute their industry\nrelevant knowledge to the bright minds in the TUM-SIT programme. The technical knowledge and hands-on experience allows the TUM-SIT graduates to be game changers in the industry.“\n- Dr Markus Wächter, Managing Director, TUM Asiaprogrammes offered in partnership with S it:\n• Bachelor of Science in Chemical Engineering\n•   Bachelor of Science in Electrical Engineering\n& Information Technology\n21Singapore i nStitute of t echnology\nannual  report  2014\n“ Since the inception of the Physiotherapy and Occupational Therapy programmes in 2012, the Trinity degree programmes\nhave received good feedback from students, graduates, and employers. I’m especially glad to see that not only the numbers of students have increased, but we have two more health sciences programmes, namely, Diagnostic Radiography (DR) and\nRadiation Therapy (RT). The DR programme is particularly special because it is a joint degree between TCD and SIT.”\n-  Associate Professor John Gormley, TCD Academic Director for SIT programmes, School of MedicineTrinity College Dublin (TCD) is Ireland’s highest-ranked university with a history that dates back to 1592. Situated in the very heart of\nDublin city, Trinity College Dublin is recognised as a top international centre for research with a high level of international collaboration. TCD shares industrial ties with many global organisations including the National Institute of Health (NIH) in Washington DC, the Dresden Centre for Radiation Research in Oncology, and other prominent international health organisations. The unique combination of TCD’s academic excellence, vibrant student experience, and convenient city-centre location means students, scientists, and scholars from all over the world continue to choose TCD as a study destination.programmes offered in partnership with S it:\n• Bachelor in Science (Physiotherapy)\n• Bachelor in Science (Occupational Therapy)trinity college D uBlin (tcD)\n“ We are delighted with our ongoing working relationship with SIT. I have full confidence that the collaboration will be\ninstrumental in providing the innovation and manpower needs for building a world-class interactive digital media and visual effects industry in Singapore. I believe that in the years ahead, our graduates will form a core group of professionals who will create world-renowned ‘Made-in-Singapore’ products for the global market.“\n- Mr. Claude Comair, Founder & President of DigiPen Institute of TechnologyDigiPen Institute of Technology (DigiPen) is a dedicated, world-renowned leader in education and research in computer interactive technologies. As a leading institute of higher education, DigiPen is committed to fostering academic growth and inspiring creativity in all its students. As the first school in the world to offer a bachelor’s degree in game development, DigiPen has advanced the game industry for more than 25 years by empowering students to become world-class programmers, computer scientists, engineers, designers, and artists. Located in Redmond, Washington, U.S.A., with branch campuses in Singapore and Bilbao, Spain, DigiPen offers undergraduate and graduate degrees in video game design and development, hardware and software engineering applied to simulation, computer science, fine arts and digital art production, and sound design, as well as youth programmes and Continuing Education and Training courses. Over the years, DigiPen has won more awards for its student games at the prestigious Independent Games Festival than any other school in the world. Since 2011, seven out of the 18 total finalists in the IGF China student competition have been games from DigiPen\nInstitute of Technology Singapore. Graduates of DigiPen Institute of Technology Singapore have gone on to work on ground-breaking\ngame franchises, such as Bungie’s Destiny and have joined some of the top game and animation studios in Singapore — including Ubisoft,Lucasfilm, Tecmo Koei, and more.programmes offered in partnership with S it:\n•    Bachelor of Science in Computer Science\nin Real-Time Interactive Simulation\n•    Bachelor of Science in Computer Science\nand Game Design\n•   Bachelor of Fine Arts in Digital Art\nand Animation\n•  Bachelor of Arts in Game DesignDigipen in Stitute of technology (Digi pen)\n22Singapore i nStitute of t echnology\nannual  report  2014\nthe gla SgoW School of art ( gSa)\nThe GSA is internationally recognised as one of Europe's leading university-level institutions for the visual creative disciplines. Our studio-\nbased approach to learning and teaching brings disciplines together to explore problems in new ways to find new innovative solutions. The studio creates the environment for inter-disciplinarity, peer learning, critical enquiry, experimentation and prototyping, helping to addressing many of the grand challenges confronting society and contemporary business.\nSince the School was founded in 1845 as one of the first Government Schools of Design, as a centre of creativity promoting good design\nfor the manufacturing industries, our role has continually evolved and redefined to reflect the needs of the communities we are part of, embracing in the late 19th century fine art and architecture education and today, digital technology. Then as now our purpose remains the same - to contribute to a better world through creative education and research.\nAll GSA degree programmes are validated by the University of Glasgow. Established in 1451, the University of Glasgow is a member of\nthe prestigious Russell Group of leading UK research universities and a founder member of Universitas 21, an international grouping of\nuniversities dedicated to setting worldwide standards for higher education. Students may choose to study honours degree programmes in Communication Design or Interior Design in Singapore.\n“ Staff and students at the GSA share a passion and concern for visual culture. Our education produces graduates who are creative, innovative, and critical thinkers who can be found across the world contributing to the communities and economies they are part of.  2014 was a momentous year as our first cohort of students graduated from The Glasgow School of Art\nSingapore and I am proud to witness to our graduates’ contribution to the creative industries of SE Asia and to the world.“\n- Mr Frazer Macdonald Hay, Director, GSofA Singaporeprogrammes offered in partnership with S it:\n•   Bachelor of Arts with Honours in\nCommunication Design\n•   Bachelor of Arts with Honours in\nInterior Design\n“The UoM degree programme continues to grow from strength to strength. The first 48 graduates from the initial cohort have achieved success both in terms of employment and now as our illustrious alumni. The next cohort to graduate have produced excellent results and we are very proud of their achievements. We look forward to developing and building on ourcollaboration with SIT in the future.”\n- Dr John Costello, Associate Professor, Programme Director BSc (Honours) Nursing PracticeThe University of Manchester (UoM) was established in 1824 as England’s first civic university and is now the largest campus based university\nin the UK. A member of the esteemed Russell group, the UoM has a proud history of achievements with 25 Nobel Laureates among its\nstaff and alumni. The UoM was the first university in England to offer a nursing degree and appoint a Professor of Nursing. The UoM continues to influence health care policy, practice, education, and research by producing national and international nursing leaders. The UoM’s innovative two-year honours degree programme equips graduates to make evidence-based decisions in their practice, meeting the challenges of the changing demographic in Singapore health care. Clinical attachments allow Registered Nurses to develop and apply analytical skills in practice while the Manchester Leadership Programme provides opportunities to develop leadership skills. The UoM Programme Director, Dr John Costello, looks forward to welcoming future cohorts as the SIT-UoM partnership continues to flourish.programmes offered in partnership with S it:\n•  Bachelor of Science with Honours in\nNursing Practicethe uniV erSity of Manche Ster (uoM)\n23Singapore i nStitute of t echnology\nannual  report  2014\nWheeloc K college  (Wlc )\nFor over 125 years, Wheelock College (WLC) of Boston, USA, has been an outstanding institution that seeks to provide a transformational\neducation to students who are passionate about making the world a better place, with a special emphasis on preparing its learners to teach, mentor, and nurture young children and their families. The Wheelock degree balances a deep understanding of theory with the development of real-world skills in its curriculum and internships, guiding its graduates to become skilful, sought-after practitioners and leaders in the profession of Early Childhood Education and related fields. Its broad-based, globally-focused degree provides a distinctly\ninteractive classroom experience for its students, with its unique co-instruction model where most of its courses are taught jointly by\nWheelock’s internationally renowned faculty members and Singapore instructors.\n“ The skills-based economy of the 21st Century demands a strong educational foundation. At Wheelock College, we\nrecognise the importance of highly trained early childhood educators as a crucial building block for countries to remain competitive and dynamic. Our partnership with Singapore Institute of Technology means that our complementary strengths work together to produce graduates who are the highest quality teachers and educational leaders and who are deeply committed to improving the lives of children and families. The rigorous curriculum taught by caring and committed world-\nclass faculty members, together with the immersion programme in Boston and tight bonds formed among students, ensure\nan educational experience that is individualised, life-transforming, and second to none.\"\n- Dr Trisha Craig, Executive Director, WLC Singaporeprogrammes offered in partnership with S it:\n•  Bachelor of Science in\nEarly Childhood Education\nprogrammes offered in partnership with S it:\n•  Bachelor of Professional Studies in\nCulinary Arts Management\n“ SIT is on the cusp of creating a new model of education. Bringing together global partners who are experts in their fields to educate the best and the brightest young people who have a commitment and passion for their careers is the university of the future. The opportunity to share best practices, research and collaborate on initiatives, provides a platform to innovate and meet the current and future needs of the economic drivers of not only the region but the world. SIT serves as an incubator of talent for industries which will have a significant economic impact now and in the future. The CIA is thrilled to\nbe blazing the path for world class industry relevant education with SIT.”\n- Chef Eve Felder, Managing Director, CIA SingaporeSince its establishment in 1946, The Culinary Institute of America (CIA) has set the global gold standard for culinary education. Its proven degree programmes have produced more than 46,000 culinary professionals, including top chefs such as Anthony Bourdain ’78, Cat Cora\n’95, and Roy Yamaguchi ’76. The historic SIT-CIA partnership marks the first time that the CIA is offering its programmes in Asia.the culinary  inStitute  of aMerica  (cia)\n24Singapore i nStitute of t echnology\nannual  report  2014\nuniVerSity of liVerpool  (uol)\nThe University of Liverpool is one of the UK’s leading research institutions with an annual turnover of £410 million, including £150 million\nfor research. Associated with eight Nobel Laureates, Liverpool is ranked in the top 1% of higher education institutions worldwide and is a member of the prestigious Russell Group, comprising the leading research universities in the UK.\nA truly international institution, the University has 27,000 students and 175,000 alumni in 182 countries. Its global focus has led the institution\nto establish a university in the World Heritage city of Suzhou near Shanghai, in partnership with Xi’an Jiaotong University – a top 10 university in China. Liverpool is also the largest provider of 100% online postgraduate degree courses in Europe with some 8,000 students studying for University of Liverpool degrees around the world.\n“ Our first year of collaboration with SIT has been incredibly successful for all involved. Together we have guided the first\ncohort of students through the first year of the first criminology degree in Singapore. We are excited about the high numbers of applicants and we are looking forward to welcoming a further 80 students this academic year. We are confident that our relationship with SIT will continue to flourish and provide a unique opportunity for students interested in learning more about crime and society.“\n- Dr Leon Moosavi, Programme Director, Lecturer in Sociology, University of Liverpoolprogrammes offered in partnership with S it:\n•  Bachelor of Arts with Honours in Criminology\nand SecurityuniV erSity of neVaDa, laS VegaS (unlV)\nFounded in 1957, UNLV offers more than 200 undergraduate, graduate, and professional degree programmes. It is a public, research-\nintensive, and fully accredited institution with about 28,000 students and some 2,800 faculty and staff at its 350-acre main campus, located within view of the famous “Las Vegas Strip” resort corridor. UNLV’s William F. Harrah College of Hotel Administration has been granting the U.S. Bachelor of Science degree in Singapore at its facility in the National Library Building since 2006. Graduates obtain the knowledge to begin their careers in hospitality related sectors, and also gain the advanced skills needed to move into responsible positions in other\nindustries or to further their studies with graduate and professional degrees, such as the MS, JD, or PhD.\n“ By the end of 2015, the University of Nevada, Las Vegas will have awarded some 917 American undergraduate degrees in\nSingapore to our students co-enrolled in the Singapore Institute of Technology. These outstanding women and men will continue to impact and someday lead the hospitality and related industries here in Singapore and across the globe. They form an enduring legacy of the collaboration between UNLV and SIT.“\n- Richard Linstrom, Associate Dean and Managing Director, UNLV Singapore\nprogrammes offered in partnership with S it:\n•  Bachelor of Science (Major in Hospitality\nManagement)\n25Singapore i nStitute of t echnology\nannual  report  2014\nSustainable i nfrastructure\nengineering (S ie)\nmaster of e ngineering Technology & Bachelor\nof engineering with h onours in s ustainable\ninfrastructure e ngineering ( land)\nStudents reading the degree programmes in\nSustainable Infrastructure Engineering will take\nup key engineering modules ranging from Railway\nEngineering and Engineering Design Graphics to\nTotal Preventive Maintenance and Non-Destructive Testing (NDT). The programme’s Integrated Work Study Programme (IWSP) will allow students to pursue work stints with organisations such as Land Transport Authority (LTA), SMRT, SBST, Singapore Technologies, Keppel Group and Sembcorp Industries.\nSIT students will also be able to take part in Regional\nImmersion in Sustainable Engineering (RISE), a work-study scheme which involves visiting key infrastructure facilities and projects in the region. information & c ommunications\ntechnology ( ict)\nBachelor of e ngineering with honours in\ninformation and c ommunications Technology\n(software e ngineering)\nThe SIT Information and Communications Technology (ICT) programme aims to produce the\nbest in-class software engineers for the ICT sector.\nOffering Software Engineering as a major, the\nundergraduate programme has a curriculum which covers the development of software as well as design, operation, analysis, optimisation, security, maintenance and management of software in a holistic manner.\nICT undergraduates will also study subjects such as\nsecured software development, mobile computing, cloud solution architecting. Translational and professional development have also been incorporated into the curriculum to support students’ career advancement in the field of Software Engineering.\naccountancy\nBachelor of a ccountancy with h onours\nSIT’s Bachelor of Accountancy degree is a three-year direct honours programme which will provide students with the requisite knowledge needed for a professional accounting career.\nOne of the highlights of the course is the unique Integrated Work Study Programme (IWSP), a student work placement\nscheme which will allow accountancy students to gain industry experience over an eight-month period. The other is the Regional Exposure to Accounting Practice (REAP) programme, which will facilitate visits by academic faculty and industry partners, as well as study trips in the Asia-Pacific region.Sit Degree\nprograMM eS\n26Singapore i nStitute of t echnology\nannual  report  2014\nintegrate D Wor K\nStuD y prograMM e\nSIT created the Integrated Work Study Programme (IWSP), a salient feature of the university’s\neducational experience, which will provide students with opportunities to integrate the\nknowledge they have gained in the classroom with real-world practice.\nThe programme is win-win for both industry and student – IWSP is an excellent platform for\nstudents to gain work experience, while industry partners gain access to a pool of resources\nin terms of work-ready employees.\nStudents will be immersed in a real work environment for 8 to 12 months, longer than\ntraditional internships, enabling true integration into the workforce. Faculty and company work supervisors will work in concert to achieve the following objectives:\nSustainable i nfrastructure e ngineering (S ie)\nThe SIE IWSP will be held over a span of 12 months, providing students with opportunities\nto gain industry experience and to develop deep specialist skills.\ninformation & c ommunications t echnology ( ict)\nThe ICT IWSP will be conducted during the final year of study for 12 months. Students will manage study followed by IWSP at a host company every afternoon.\naccountancy\nThe Accountancy IWSP will be conducted over eight months. Students will be able to experience at least one peak audit cycle with any one of SIT’s accounting industry partners.3) Developing Skills for i nnovation in c ompanies\nStudents will be challenged during the IWSP to initiate innovation projects. Through such projects, students will have the opportunity to apply innovation skills and develop solutions for\nthe projects identified. 2) integrating Knowledge and p ractice\nStudents will be guided to apply theory to practice, under the close supervision of a faculty member. Learning objectives will be defined to prompt students in reflecting on how the\nknowledge and skills learnt in the classroom relate to real work situations.1) Building c areer and p rofessional Skills\nStudents will go through the experience of the job market-place by applying to participating companies for IWSP positions, and undergoing their employee selection processes and\nsubsequent induction and training in the real work environment. This will prepare them to be\neffective employees in their career and professional life.\n27Singapore i nStitute of t echnology\nannual  report  2014\nour\ngraDuate S\nAt SIT, students are thoroughly engaged in the career planning process through a myriad\nof activities organised by the university such as student career workshops, recruitment\nand industry talks, as well as company visits. The university’s career guidance counsellors\nconduct resume critique sessions for students on a one-on-one basis and through email. These counsellors also support students by conducting mock interviews with them.\nrecruitment and i ndustry t alks\nIn the past year, SIT set up a total of 24 industry talks in collaboration with companies such\nas Baxter and Sembcorp Marine. The division also organised 12 company visits to companies such as Rohde & Schwarz and Continental Automotive to provide students with opportunities to meet with potential employers. At these events, students were able to network with industry experts, and to learn more about the various companies and potential job prospects.career Skills Workshops under the Value-\nadded p rogramme\nCareer Services organises the following workshops under the Value-Added Programme: • Career Planning & Management\n• Self-discovery\n• Personal Branding\n• Job Search Strategies\n• Resume Writing & Cover Letter\n• Interview Skills\n• Business Etiquette & Networking Skills\n• Managing Online Image\nOver the past year, a total of 147 workshops were organised for students across the different degree programmes.\n28Singapore i nStitute of t echnology\nannual  report  2014\nStuD ent\nteStiMonial S\n“I would like to express my gratitude to SIT Career Services for all the hard work they’ve\nput into enhancing students’ employability.\nThrough a career talk, I was able to meet and talk with the HR representative from Baxter. A\nplant visit to Baxter was organised and that was when I managed to gain more insight into the company and the job requirements. This opportunity ultimately led to an interview.\nI would like to thank SIT Career Services for the opportunities they helped set up for students.”Ken li M\nManufacturing e ngineer, Baxter Bioscience\ngraduated from B eng (hons) chemical e ngineering\n“When I was in school, I only focused on my academic performance and did not concentrate\non career planning. When I was about to graduate, I started thinking about my career. It was then when I began to make use of the resume writing, career counselling and mock interview sessions offered by Career Services. These sessions were personalised and they helped me with self-discovery so I was able to decide on the type of career that would suit me. Also, after attending these sessions, I knew exactly what I had to do for interviews. Eventually, I had a few job offers.\nMy advice is: “Don’t be shy or nervous! The SIT Career Services offers a lot of personalised\nhelp and guidance, so start looking early and don’t wait until you are about to graduate.”choc Kalinga M KaSi\nengineer, Jurong Shipyard\ngraduated from Be ng (hons) Mechatronics\n“My Career Guidance Counsellor supported me on the various aspects of my job search. These include reviewing my resume, arranging for interviews which align with my job preferences, and listing prospective roles in relevant companies.\nMy counsellor convinced me to keep pursuing my passion, especially when I expressed\nmy concern to her that I was not outgoing enough to be a nutritionist.\nI am grateful to Career Services and my Career Guidance Counsellor for going the\nextra mile.” yuliana\nnutritionist, MyKenzen n utrition Services p te ltd\ngraduated from BSc ( hons) f ood & h uman n utrition\nThrough the various scholarships, financial assistance is\ngiven to deserving undergraduates from the various degree\nprogrammes as they journey through higher education at SIT.\nThe financial aid granted to SIT students include funding for expenses such as tuition fees, course materials, expenses for\noverseas immersion programmes, and others. SIT remains\nfirmly committed to a policy that strives to ensure students are not denied university admission because of financial difficulties.\n30Singapore i nStitute of t echnology\nannual  report  2014\nagri-food & Veterinary a uthority of\nSingapore\nalexandra health\nasia Pacific Breweries Foundation\nassociation of Singapore Marine i ndustries\nBright Vision h ospital\nearly c hildhood Development a gency\neastern h ealth a lliance\nfar east o rganization\ninfocomm Development a uthority of\nSingaporeJurong health Services\nKeppel o ffshore & Marine\nMaritime one\nMedia Development a uthority of Singapore\nMenDaKi\nMinistry of c ommunications and i nformation\nMinistry of DefenceMinistry of h ome a ffairs\nMoh h oldings p te ltd\nnational council of Social Service\nnational e nvironment a gency\nnational h ealthcare g roup\nnational u niversity h ealth System\nnovartis Singapore p harmaceutical\nManufacturing pte ltd\nntuc  first c ampusoverseas union e nterprise l imited\npublic u tilities Board\nRaffles Medical g roup\nSakae h oldings l td\nSembcorp i ndustries l td\nSembcorp Marine l td\nSingapore c ivil Defence f orce\nSingapore health Services p te ltd\nSingapore- industry Scholarship (Sg iS)\nSingapore p ower limited\nSingapore p olice f orce\nSingtel\nSociety for the p hysically Disabled\nSt luke’s h ospital\ntemasek p olytechnic\nthe Design Society\nthe university of Manchester\nurban g roup p te ltdinDuStry\nScholar ShipS/\nSpon SorShipS\nEvery year, thanks to the support rendered by SIT’s industry partners in the form of scholarships\nand sponsorships, students are able to enrol in degree programmes of their choice.\nthe follo Wing in DuStry partner S ha Ve pro ViDeD Scholar ShipS/Spon SorShip to\nSit StuDentS\n31Singapore i nStitute of t echnology\nannual  report  2014\nalbert Wong\nascendas f unds Management (S) l imited\nchoo c hiau Beng\nchoo c hong n gen\nchua t hian p oh\nDou y ee enterprises (S) p te ltd\nDrilmaco p te ltd\nfeinmetall Singapore p te ltd\ngoh family\ngoh foundation\ngoodrich g lobal p te ltd\nhb glass & a luminium p te ltd\nhome- fix Diy pte ltd\nKeppel c are f oundation l imited\nKeppel c orporation l imited\nKuok Khoon h ong\nKwan i m thong h ood c ho temple\nlian h o lee construction ( private) l imited\nSembcorp i ndustries l td\nSembcorp Marine l td\nSingapore t echnologies engineering l td\nStarhub l td\nthe Singapore i reland f und\nyangzheng f oundation\nthye h ong Management & Services p te ltd\nWilmar i nternational l imited\nDonor\nacKnoWleDgeM ent\nWe wish to convey our deepest gratitude to our donors for their support of non-bonded student\nbursaries and scholarships at SIT. Their purposeful philanthropy is empowering students at SIT\nto create better futures for themselves and their families through a quality university education,\neven as it inspires our students to seek excellence for themselves and the larger community. For this, SIT is truly grateful.\n32Singapore i nStitute of t echnology\nannual  report  2014\ncorporate\ngoVernance\nSIT was incorporated in September 2009 as a Company limited by guarantee under the Companies Act of Singapore. SIT is governed\nby the SIT Act 2014 and its key constituent document is the, Memorandum and Articles of Association. SIT is a registered charity\nand an institution of public character. It has adopted the best practices in the Code of Governance for Charities and Institutions\nof a Public Character.\nThe Trustees and staff are required to act in the best interest of the University at all times. Policies have been developed to\nprevent or manage situations where conflicts of interest could arise, by promoting integrity and ethical business conduct.\nThe Articles of Association contain provisions for the management and avoidance of conflicts of interest by members of its\nBoard of Trustees. Such provisions include:\na)  permitting a Trustee to be interested in any transaction with the University provided that the Trustee has declared the\nnature of the interest to the other Trustees of the Board as required under the Companies Act of Singapore and complied\nwith the provisions of Articles of Association to abstain from voting on any matter related to the transaction,\nb)  permitting a Trustee, or a firm associated with the Trustee, to act in any professional capacity for the University and to be\nremunerated for the provision of professional services, and\nc)  permitting a Trustee to be reimbursed for out-of-pocket expenses, travelling and other expenses properly incurred by\nthe Trustee in attending and returning from meetings of the Board of Trustees, any of its committees, or any general\nmeeting of the University or otherwise in connection with the affairs of the University.\nThe Articles state that Trustees shall not receive any remuneration for services rendered by them as Board members.\nThe Board of Trustees approves the annual budget, the use of operating reserves and annual audited financial statements of\nSIT, amongst other responsibilities.\nThe University has implemented a Conflicts of Interest Policy which all staff must comply with. In accordance with that Policy,\nstaff must ensure that their private activities and interests do not conflict with their professional obligations to the University.\nWhere there is a potential conflict of interest, the staff is required to submit full disclosure and request for an exemption. The University will grant such exemptions at its discretion. In addition, staff are required to declare their compliance with the\nUniversity’s prevailing policy on conflicts of interest annually.\n33Singapore i nStitute of t echnology\nannual  report  2014\nSit Boar D\ncoMMittee S\nfinance\ncoMMitteeacaDeMic\naDViSory c oMMittee\nDr lim Khiang Wee\nMs Mary y eo\nMr t K udairamprof h ang c hang c hieh\nprof tan thiam Soon\nMr t K udairam\nMs Margaret l ui\nMr Steven WonginVeStMent\ncoMMitteeauDit\ncoMMittee\nMr p ek hak Bin\nMs t eoh Zsin Woon\nMr a lvin t an\nMs r achel e ng\nMr a lvin t anpartner ShipS\nappro Val c oMMitteecaMpuS DeVelop Ment\ncoMMittee\nDr richard c harles h elfer\nMr Michael y ap\nMs t eoh Zsin Woon\nState Ment  of coMprehenS iVe inco Me 35\nBalance  Sheet 36\nState Ment of change S in fun DS an D re SerVeS 37\nState Ment of ca Sh flo WS 38\niMportant note:\nThe following Financial Statements are extracted from Singapore Institute of Technology’s (SIT) Audited Financial Statements for\nthe year ended 31 Mar 2014. It may not contain sufficient information to allow for a full understanding of the results and the state of affairs of the Company. For further information, please refer to the complete audited financial statements published on the SIT official website at SingaporeTech.edu.sg.\n35Singapore i nStitute of t echnology\nannual  report  2014\nStateM ent of\ncoMprehenS iVe\nincoM e\nFor the financial year ended 31 March 2014\ngeneral f unds e ndowment a nd term f unds total\n2014  2013  2014  2013  2014  2013\n$ $ $ $ $ $\nrevenue  32,355,018 25,013,702  - - 32,355,018 25,013,702\nother income 296,682 175,661  519,157  976,982  815,839 1,152,643\noperating expenditure\nStaff and related expenses (20,595,642) (13,314,434)  - - (20,595,642) (13,314,434)\nDepreciation and\namortisation expenses  (1,346,944)  (779,431)  - - (1,346,944)  (779,431)\nProgramme and student-\nrelated expenses (52,422,894) (43,593,292) (661,172)  (689,448)  (53,084,066)  (44,282,740)\nRental and other\nfacilities expenses (2,933,764)  (1,488,933)  - - (2,933,764)  (1,488,933)\nOther operating expenses  (3,472,508)  (3,451,561)  - - (3,472,508)  (3,451,561)\ntotal operating\nexpenditure  (80,771,752)  (62,627,651)  (661,172)  (689,448)  (81,432,924)  (63,317,099)\n(Deficit)/surplus before\ngovernment grants  (48,120,052)  (37,438,288)  (142,015)  287,534  (48,262,067)  (37,150,754)\nGovernment grants 54,452,133  41,179,738  - - 54,452,133  41,179,738\nnet surplus/(deficit) and\ntotal comprehensive\nincome/(loss)  6,332,081  3,741,450  (142,015)  287,534  6,190,066  4,028,984\n36Singapore i nStitute of t echnology\nannual  report  2014\nAs at 31 March 2014Balance  Sheet\n2014  2013\n$  $\naSSetS\ncurrent assets\nCash and cash equivalents   401,920,665  42,365,588\nFees and other receivables   71,369,828  21,462,017\nOther current assets    4,125,853 5,670,948\n477,416,346  69,498,553\nnon-current assets\nProperty, plant and equipment    171,133,115  34,062,366\nIntangible assets    691,709  613,209\nStudent loans    313,280  184,133\nOther non-current assets    56,129,695  10,986,896\n228,267,799  45,846,604\ntotal assets    705,684,145  115,345,157\nliaB ilitie S\ncurrent liabilities\nTrade and other payables   45,270,297 15,831,037\nTuition fees received in advance   5,418,158 4,348,444\nGrants received in advance    42,304,459  31,341,805\n92,992,914  51,521,286\nnon-current liabilities\nDeferred capital grants   171,824,824  34,675,575\nOther deferred grants   56,443,787  10,670,142\n228,268,611  45,345,717\ntotal liabilities    321,261,525  96,867,0 03\nnet aSSetS   384,422,620  18,478,154\nfunDS an D re SerVeS\nEndowment and term funds    361,585,550  1,973,165\nAccumulated surplus\n- General funds    22,837,070  16,504,989\n384,422,620  18,478,154\nfunds’ net assets managed on behalf of Ministry of e ducation (“M oe”)  9,149,496 6,072,252\n37Singapore i nStitute of t echnology\nannual  report  2014\nStateM ent of\nchange S in fun DS\nanD reS erVeS\na ccumulated\nSurplus  e ndowment\n(general  a nd term\nfunds)  funds  t otal\n$ $ $\n2014\nBeginning of financial year    16,504,989  1,973,165  18,478,154\nTotal comprehensive income/(loss)     6,332,081  (142,015)  6,190,066\nGovernment grants     - 359,754,400 359,754,400\nEnd of financial year    22,837,070  361,585,550  384,422,620\n2013\nBeginning of financial year    12,763,539 1,196,881 13,960,420\nTotal comprehensive income     3,741,450  287,534  4,028,984\nGovernment grants     - 488,750  488,750\nEnd of financial year    16,504,989  1,973,165  18,478,154For the financial year ended 31 March 2014\n38Singapore i nStitute of t echnology\nannual  report  2014\nStateM ent of\ncaSh floWS\n2014  2013\n$  $\nCash flows from operating activities\nDeficit before government grants   (48,262,067)  (37,150,754)\nAdjustments for:\n- Depreciation and amortisation    1,346,944  779,431\n- Interest income    (261,605)  (133,305)\n- Donations   (405,340) (973,410)\n- Loss on disposal of property, plant and equipment    406 6,911\n(47,581,662)  (37,471,127)\nChange in operating assets and liabilities\n- Fees and other receivables   (1,229,562)  (930,725)\n- Other current assets   1,545,095 (2,183,864)\n- Trade and other payables   7,145,105  2,533,306\n- Other non-current assets    (45,142,799) (10,982,788)\n- Student loans    (129,147)  (157,674)\nCash used in operations   (85,392,970) (49,192,872)\nDonations    405,340 973,410\nnet cash used in operating activities   (84,987,630)   (48,219,462)\nCash flows from investing activities\nPurchase of property, plant and equipment    (114,672,836)  (20,817,122)\nPurchase of intangible assets   (459,896) (204,503)\nInterest received    261,605  133,305\nnet cash used in investing activities   (114,871,127)   (20,888,320)\nCash flows from financing activities\nOperating grants received   65,523,095 49,698,204\nDevelopment grants received   132,846,520  21,765,031\nGrants received from other government agencies    600,237  4,192,961\nEndowment funds received    360,443,982  460,000\nnet cash provided by financing activities   559,413,834 76,116,196\nnet increase in cash and cash equivalents   359,555,077 7,0 08,414\nCash and cash equivalents at beginning of financial year   42,365,588  35,357,174\nCash and cash equivalents at end of financial year   401,920,665  42,365,588For the financial year ended 31 March 2014\n1Singapore i nStitute of t echnology\nannual  report  2014\nSingapore tech.edu.sg\nfacebook.com/Singapore tech\n10 Dover Drive\nSingapore 138683\nRegistration Number:\n200917667D"
}