{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20220705-the-straits-times-thrivinginspace.pdf",
  "type": "pdf",
  "content": "National Aeronautics and Space\nAdministration (Nasa) astronaut\nJeffrey N. Williams, 64, holds the\nrecord for the longest time spent\nin space by an American male. He clocked\n534 days in space across four different\nspaceflights in 16 years.\nMr Williams gave a speech last month\ntitled “What It Takes To Be An Astronaut” at\nthe Singapore Institute of Technology.\nHe shared his experiences as an\nastronaut and the challenges he faced in\nspace to a room of around 30 students.\nAfter being selected as an astronaut in\n1996 when he was 38 years old, he went\non to participate in four space missions in\n2000, 2006, 2010, and 2016.\nBecoming such an accomplished\nastronaut, however, was not easy.\nNasa’s astronaut requirements are strict,\nand it was because of Mr Williams’\nimpressive portfolio – he has several\ndegrees, including a Bachelor of Science\ndegree in applied science and engineering,\na Master of Science degree in aeronautical\nengineering, and a Master of Arts degree in\nnational security and strategic studies –\nthat he was selected. He also served as a\nmilitary test pilot for more than 27 years.\nAnd the challenges do not stop there.\nBecoming an astronaut requires certain\ncharacteristics.\nMr Williams said that they must be able\nto function and work in an extreme\nenvironment.\nFor instance, astronauts must endure\nbeing away from their loved ones for a long\ntime.\nA space expedition normally lasts six\nmonths, so they must be willing to sacrifice\ntime with their family and friends.\nMr Williams also added that potential\nastronauts should not be afraid of heights\nor confined spaces.\nIndeed, astronauts are about 400km\nabove the Earth’s surface when working in\nthe International Space Station and live with other crew members in a small place.\nThis can be intimidating and uncomfortable\nfor many people.\nThe US space agency also looks out for\ntraits like leadership, teamwork, and\ncommunication in astronauts. This is\nbecause a space shuttle crew typically\nconsists of five to seven astronauts, and so\nit is important that the astronauts look out\nfor one another.\nBesides strength of character, astronauts\nmust also be in peak physical condition.\nMr Williams said: “Most of us are very\ndisciplined in terms of physical exercise to\nstay in shape.”\nAstronauts must exercise for two hours\ndaily, from running on a treadmill to\npedalling on a stationary bike. This is to\nprevent muscle atrophy, a process where\nmuscle and bone break down in space due\nto microgravity, which is when there is very\nlittle gravity.\nFurthermore, spacewalks, which\nMr Williams said were “the hardest thing”\nhe has done, require a strong body and\nmind.Spacewalks refer to the act of astronauts\nleaving a vehicle in space to do activities\nsuch as repairing satellites or testing new\nequipment.\nThese activities usually last from five to\neight hours. To prepare for them,\nastronauts train six to seven hours at one\ngo for every hour they will spend on a\nspacewalk. Most training sessions are\nconducted in a large swimming pool known\nas the Neutral Buoyancy Laboratory.\nAlso, after a few hours into a spacewalk,\nastronauts may feel tired and have sore\narms. This is due to the spacesuit being\npressurised, so it takes great effort for\nastronauts to move their fingers and arms.\nDespite the challenges, Mr Williams\nloves being an astronaut. For the devout\nChristian, seeing the grandeur of the\ncosmos reinforced his faith that a divine\nbeing had constructed such an\nawe-inspiring sight.\nHe said: “It reminds you of who the\ncreator is, the infinite God.”\nSources: NYTimes, Nasa\nKeith Lim  finds out what it\ntakes to become an astronaut\nMr Jeffrey N. Williams gave a talk at the Singapore Institute of Technology last month about his experiences as\na Nasa astronaut. ST PHOTO: EUGENE GOHThriving in space\nPublication: The Straits Times\nDate: 5 July 2022\nHeadline: Thriving in space\nSource: The Straits Times © SPH Media Limited. Reproduced with permission."
}