{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-12/Move-to-Punggol-Phase-1_Fact-Sheet_2024Dec.pdf",
  "type": "pdf",
  "content": "9 hectares in total land area—  Nestled in the heart  of the Punggol Digital  Distr ict (PDD),  Singapor e’s up-and- comi ng premier\nsmart  distr ict maste r-planned and developed by JTC,  the Singapor e Instit ute of Technolo gy (SIT)\nstand s as a hub for our SITizens,  industry and community . This award-winning campus is wher e\ninnovation thr ives. Let’s discover SIT’ s brand- new Punggol Campus to gether!\nFacing Coney I sland and designe d with a courtyard at its core, the\ncampus i s integrated with gr een technol ogies  to create cond ucive\nUniversity Tower, Ho Bee Auditorium and indoor spor ts hall.Campus CourtA Glimpse of Our New Home\nSIT Punggol C ampus\nCamp us Heart\nThe “Camp us-in-t he-Park” capitalises on an existing\nsecondary forest by  seamlessly blending lear ning spac es\nacademic blocks, a sheltered event plaza, and the H atchery,\na 10-storey b uilding that facilitates and dr ives the exc hange\nof ideas betwe en academia and industry. N\nTwo Supe r Low En ergy (SLE) b uildin gs\nbuilding s in Singapore, are slated to ac hieve  at least 40% en ergy savings based on prevailing code.\nSIT ha s partner ed with SP Group to build Sout heast  Asia’s\nwith approximate ly 10,000 m2 of p hotovolt aic (PV) solar panels, pr oviding enough electr icity to\nSIT and ENGIE will build the Distr ict Cooling System (DCS)  to provide chilled water for air-\nconditioning that can reduce carbon footpr int and\nmore than traditional cooling methods.\nSIT has imp lemented a w ater managem ent fram ework  and infrastructure to harvest rainwater from  the\nland. The am ount of non-dri nking water saved an nually can\nNo single-use disposables in this house—re member to bring your own (BYO)\ncontainers for takeaways!\nOur Punggol Campus marks the coming together of\nsix different locations into a new space we can call\nhome.  With our united and diverse communi ty of\nstudents and staff, we are excited to build a vibrant\ncampus life, foster connecti ons and create memories\nthat will last a lifetime .\nStudent Enr olment03,0006,0009,00012,000\nAY14 AY16 AY18 AY20 AY22 AY15 AY17 AY19 AY21 AY233,4554,0395,2306,1386,9797,7658,2759,0929,79310,558Growing SIT Co mmuni tyAwarded the Awarded  the BCA Green Mar k\nPlatinum  Award Awarded the BCA Universal Design\nMark Go ldPLUS (Design ) AwardPowered by IoT, the smart campus will have an Integrated Building Manag ement System (IBMS)  that\noversees campus-wide systems such as lighting and securit y to enable holistic facilities management and\nenergy optimisation. A network of over 20,000 sensors collects real-time data on temperat ure, light and\nfootfall to f eed into the IBMS . Sma rter Than You Think Sma rter Than You Think\nSustainably Powered\n03006009001200\n20143124475485966927339381005 1010986\n2016 2018 2020 2022 2015 2017 2019 2021 2023SIT’s co-location in the PDD will enhance our applie d learning and applied researc h endeavours. Students\nwill engage in authentic learning experiences  and proble m-solvin g opportunities through the real-world\nsystems of our on-campus Living Labs and those of our partners . Our collabor ations with indust ry and\ncommunit y to co-develop  solutions via transla tional research, build  impact ful solutions and nurture talent\nwill also a dd to the d istrict’ s buzz.\nSIT has also embar ked on off-campus Living Lab initiatives (Healthcare and Transport)  with our key partners.\nThrough our Living Labs, SIT will leverage our infrastructure and capabilities to bring value to our students,\nindustry and the communit y.\nA Lear ning  Hub for Future Readi ness\nOur Living Labs Initiativ e is aligned with SIT’s education and strategic translational researc h programmes,\nand pro vides applied researc h opport unities that empower st udents and industr y partners.\nSCAN HE RE\nFOR MORE\nINFORMA TION!Getting HereiVIRTUAL\nCAMPUSBUILDING\nSERVICESTRANSPOR T HEAL TH•Brings greater authenticity\nto students ’ learning\n•Catalyses applied resear ch\noppor tunities\n•Facilitate s incubati on of i deas\nbetw een acad emia and indust ry\n•Present s opp ortunities for SIT\nto becom e a University for the\nindustr ySIT’s Living Labs Initiativ eENER GY\nPunggol Coast MRT station, located right at\nthe doorstep of the campus, commenced\noperations on 10 December 2024"
}