{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/celebrate%20generous%20giving%20community.pdf",
  "type": "pdf",
  "content": "A New Year, and a New Way to Celebrate\na Generous Giving Community\nThe Leadership Appreciation, held for the first time at the\nSingapore Institute of Technology (SIT), is a platform for\nthe university to honour its donors for their philanthropic\nleadership in nurturing SIT students through various\nforms of financial aid. Close to 200 people attended the\nafternoon’s festivities, held at the Sports Hall at SIT@Dover\non 17 January 2020.\nIn his welcoming remarks, Prof Tan Thiam Soon, President,\nSIT, highlighted the magnitude of the impact of their\ngenerous giving. Over the past decade since SIT was\nestablished, more than 2,572 bursaries, grants and other\nforms of student financial aid, have been awarded to less\nprivileged students at SIT. Highlighting the larger impact\nof this philanthropic giving, Prof Tan pointed out that for\nmany of these students who are the first in their families to\nattend university, their family income would also increase\ntremendously when they graduate and start a career.\nProf Tan added, “Thank you for empowering these young\npeople to pursue their dreams, and most of all, for leading\nthe way and showing them how even a single act of giving\ncan transform the future for many others.”\nThe committed support shown by donors have inspired\nstudents like Mr Yam Wei Jian, a Year 2 student from the\nSustainable Infrastructure Engineering (Building Services)\nprogramme, to give back to the community. Mr Yam started\nthe Building Information Modelling Club at SIT, which\nprovides members a platform to learn from each other and\nfrom engineering professionals, beyond their curriculum.\nMr Leslie Goh, a first-year student from the Accountancy\nprogramme who received the ICH Gemini Bursary, said,\n“The experience of receiving a bursary – apart from the\nfinancial support, there is the feeling that you are being\nnurtured, and there is a community out there that wants you\nto succeed.”At the inaugural Leadership Appreciation\nceremony, SITizens usher in the Year of the\nRat together with SIT’s donors who support\nstudents through bursaries and grants\nMs Dilys Ho, a Year 3 Physiotherapy student, setting\nthe tone for the celebratory event with a rhythmic\ngymnastics routine.Bursary recipients (from left): Mr Yam Wei Jian, Ms Eunice Toh and Mr Leslie Goh,\nexpressed just how grateful they are to receive support from SIT’s donors.Prof Tan Thiam Soon, President, SIT (on stage), addressing the close to 200\nattendees at the event – organised specially to honour donors who have\nsupported financially disadvantaged SITizens.\nProf Tan Thiam Soon, President, SIT (right) presenting a token of appreciation\nto Mrs Wong Kwok Leong (left). The token, which was personalised with notes from\nthe recipients, and made at SIT’s makerspace, was presented to all donors.Mr Lim Teck Kheng, Executor, The Estate of Lim Doa Hin, speaking to recipients of\nthe Lim Doa Hin Bursary.(From left) Mr Brian Tan, Regional President, South East Asia, Applied Materials\nSouth East Asia Pte Ltd; undergraduate Mr Chua Sai Wei; Prof Tan Thiam Soon,\nPresident, SIT; Assoc Prof Lim Bee Gim, Programme Director, SIT; Mr Keith Chua,\nFounder, Nehemiah Foundation; undergraduate Mr Yong Jian Ming; Ms Sharon\nChua, Nehemiah Foundation.\nProf Ng Siu Choon, Assoc Provost (Students), SIT, speaking to students and guests\nat the event.\nVoices of Philanthropy: Ms Angela Wu, Staff Threat Intelligence Analayst, VMWare\n(left) and Mr Teng Ngiek Lian, Founder & Executive Chairman, The Silent Foundation\nLtd (right) share their reasons for nurturing SIT students.\nMs Reshma Maria, Manager, HR, Singapore, Tyco\nElectronics Singapore Pte Ltd (third from left), Mr Lim\nHorng Huei, Director, T.E. Engineering & Trading\n(fourth from left), Ms Karrie Wong (third from right) and\nMr Derrick Teo (second from right), toss to the Lunar\nNew Year with SIT students.\n(Front row, from left to right) Prof Chua Kee Chaing,\nDeputy President (Academic) & Provost; Mr Lo Ngai\nHung, Director of Taxes & Business Advisory Services,\nLo Hock Ling & Co; Mr Gilbert Tan, Chairman, Lions\nCommunity Service Foundation (Singapore); Mrs\nPearlyn Chong, Managing Partner, Lo Hock Ling & Co\ntogether with SIT students.Mr Soo Ye Wah, Executive Chairman, Dou Yee Enterprises (S) Pte Ltd (front\nrow, middle), with recipients of the Dou Yee Enterprises Bursary.\nTwo donors, Ms Angela Wu, Staff Threat Intelligence Analyst,\nVM Ware, and Mr Teng Ngiek Lian, Founder & Executive\nChairman of The Silent Foundation Ltd, spoke about why\nthey had chosen to support SIT students.\nMs Wu, who had made possible the Wu Peihui Bursary, shared\nhow she did not have any savings for her tuition fees when\nshe started university but did not want to give up on pursuing\na degree as she knew that a university education would help\nher progress in her career. She said, “This bursary is my way\nof encouraging students to pursue undergraduate studies\nin ICT, software engineering or computer engineering. My\nhope is also that that more women would join the IT industry\nand to encourage more locals to pursue cybersecurity jobs. ”\nMr Teng shared his motivations to pave the way for\nminorities through The Silent Minority Bursary. Ms Gloria\nFrancis, who received the Bursary, said that she was glad to\nbe able to meet with Mr Teng and thank him personally. The\nsecond-year Hospitality Business student was especially\ninspired by Mr Teng’s commitment to giving back to society\nand supporting minority students like herself. She added,\n“What Mr Teng has done is truly admirable and I would like\nto follow in his footsteps.”\n(From right) Prof Yaacob Ibrahim, Advisor, Office of the President, SIT with Mr\nMohamed Abdul Jaleel, Founder, S M Jaleel Foundation, and Mr Edmund Cheng,\nChairman, Mapletree Investments.\nSiTIZEN  |  08/16 SiTIZEN  |  09/16"
}