{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20230228-lhzb-sweepawaytheldquoclutterrdquointhebrainandpursuementaldisconnection.pdf",
  "type": "pdf",
  "content": "yingzhen@sph.com.sg陈映蓁／报道\n为了散步在周末早上特地早\n起，没想到天黑黑，大雨\n倾盆……有些人可能因此觉得自己运气不好，但对从事科技行业的李佳忆（30岁，程序经理）来说，这何尝不是一种幸运？　　她说：“我和丈夫都很庆幸自己在这个时间醒来，可以在凉爽的清晨一边喝热咖啡，一边享受焚香的香气。天时地利人和，一切的安排刚刚好，比起普通的散步，这样的早晨其实更难特别安排。”　　对李佳忆来说，知足常乐是简单生活的关键——这是她在2020年本地实施病毒阻断措施期间萌生的想法。当时哪里都不能去，她开始明白自己追求的许多东西其实并不重要，“最新的时装、名牌包包，用心打理的发型……如果只为了‘表现’给其他人看，其实没有意义。行动受限的那段时期强制我慢下来，开始思考我要的究竟是什么？”　　李佳忆认为，在生活水准极高的城市生活，诱惑无所不在，其中包括不必要的物质享受，而禁不起诱惑的代价可能是牺牲精神健康。她举例，购买昂贵的名车，付出的不只是金钱，还有买了车子后随之而来的不安和焦虑，例如担心车子被刮花。　　她诚实面对自己，下定决心过简单生活。过去两三年较难出国旅行，她把注意力转移到身边的小事物，结果发现不必走太远，停下来观察就能留意到很多可激发愉悦之情的小东西，例如城市里处处开满美丽的野花。　　李佳忆说：“很多时候，我们走得太快，双脚还在移动时，思绪已经飞到目的地，没留意到温度变了，或脚下踩着的不同地质，一直在我们周遭的自然景物和声响，我们也不会注意到。”\n2021年11月，李佳\n忆在社媒Instagram创设账号，取名“我们的简单生活”（instagram.com/oursimpleliving_/），记录夫妻俩简单生活的片段与心情，例如早起听鸟鸣，在自然公园散步，照顾家中盆栽，泡壶花草茶，看云吹风，闭眼深呼吸。\n越忙越要给精神大扫除\n连睡觉的时间都不够，怎么还有时间听鸟鸣，看云吹风？其实，这些都是相对容易做到的“精神大扫除”，而且越忙越要腾出时间做好它，就像房子越乱更须要收拾。\n新加坡理工大学保健及社会科学组长陈敏俐副教授指出，在快节奏的社会里，一人肩负多个责任，我们往往必须同时兼顾许多事情。此外，社媒资讯排山倒海地压过来，大脑常塞满各种想法、念头，包括该做的事，在社媒看到的\n内容，或关于现况的想法。　　她说：“正如实体杂物会占据家里空间，精神层面的杂物也会占据大脑空间，以致我们无法拥有清晰的思路和思考空间，也就无法专注于自己重视的人生目标。”　　　　日本收纳专家近藤麻理惠最近接受美国《华盛顿邮报》访问时说了类似的话：“透过整理内心和心神，我们可以清楚看到自己要的是什么。”\n精神层面的杂物会影响我们\n的专注能力，不但工作和日常生活受影响，甚至与亲人在一起的时光，也可能无法全情投入去享受。这种情况长期持续下去，我们不但无法看清生活目标，也无法分辨不同事情的轻重，生活就会缺乏满足感。　　要避免陷入这种困境，我们必须培养精神大扫除（mental\ndecluttering）的习惯，即审视我们置入大脑的“杂物”，过滤不必要或不理想的念头，并且整顿思维过程。陈敏俐副教授说，这么做的时候，我们同时可学习放开情绪包袱，接受日常生活中发生的事，并感觉知足和快乐，情绪健康自然更理想。　　她说：”你试过在杂乱的家居空间里拼命地找喜欢的东西，却怎么都找不到？同样的，如果大脑充满杂物，就很难‘发掘’正面的情绪状态。”\n好好呼吸　沉淀想法情绪\n丢掉杂念，放开包袱，就是精神层面的“断舍离”。这个词汇源自日本作家山下英子在2009年出版的《断舍离》，她在书中解释这个概念：“断”即不买也不收取不需要的东西；“舍”是把堆积在家里没用的东西处理掉；“离”是舍弃自己对物质的执着。做到断舍离，就能拥有更宽敞舒适、自由自在的空间。　　陈敏俐副教授解释，大脑空间的断舍离，并非强迫自己把脑袋清空，而是允许想法和情绪沉淀，别让它们塞满脑袋，模糊了自己的视角。“你会发现可以更容易地发掘心里的‘珍宝’，比如活在当下的愉悦，内心的平静，以及专注于最重要的事情。如此一来，睡眠品质会获得改善，你也会更有动力改善生活方式，培养好的生活习惯，人际关系也会更理想。”　　如何让想法和情绪好好地沉淀？积极推动正念练习的百仁中心总裁周荧柃副教授（Angie  Chew）说，首先必须有意识地注意到这些想法和情绪。“很多人习惯胡思乱想，并且任由这些想法衍生出更多想法和负面情绪，结果火上加油，一发不可收拾，也增加了自己的压力。”\n周荧柃副教授建议的对策有\n两个。　　首先，做几次深呼吸，过程中尽量注意身体哪些部位绷紧，并透过深呼吸放松自己。周荧柃说，想法和情绪都可能造成生理反应，最常见的是下颌、肩膀、双手和腹部等部位会紧绷起来。“开始放松身体，等于把注意力转向内心，有厘清思绪，清除杂念的功效。”　　第二个方法是播放音乐，并跟着哼唱和起舞。周荧柃提醒，别听会让自己情绪更低落的音乐，较理想的选择是能舒缓情绪，或振奋人心的旋律，“让自己忍不住摇摆身体的音乐也不错。最重要的是，每次发现自己的脑海越来越杂乱的时候，就要主动做些什么，避免陷入负面想法和焦虑的恶性循环。”　　胡思乱想的习惯需要时间改变，培养精神杂物断舍离的习惯同样需要时间。周荧柃认为不必过于苛求自己，也不要因为一两次的失败而轻言放弃。她说：“这是一段渐进的旅程，不像拨动开关一样可以轻易改变。打个比方，你原本习惯喝咖啡，忽然要戒掉的话，可能需要几周时间，或许有时会破戒，但少喝就是好的开始。　　“同样的，负面想法可以慢慢减少，正面想法可以渐渐增加，至少要八周左右吧，定期给大脑大扫除的好习惯才会渐渐生根、扎根。”\n学习说不　学会婉拒\n断舍离也适用于不必要的应酬。李佳忆的建议是，时间表排得太满的话，要学会说不，并非所有邀约和活动都要参加，学习婉拒才能让自己有更多时间和空间享受生活。　　周荧柃则认为，要“迎新”（迎接更好的精神健康和更好的自己），就必须“弃旧”，对“旧”的东西说不。她建议不妨适当地婉拒千篇一律的应酬或聚会，特别是每次相聚都谈论一样话题而让自己感觉沉闷，何不考虑结交新朋友，探访新地方，尝试新活动，培养新嗜好？“对新的人事物保持好奇，有助保持思维的‘新鲜度’，也能放松身心。”　　李佳忆提醒，“善待自己，是我们应该为自己做的事，千万不要以忙碌为借口，说自己没有时间放松。”　　她举例，闭上眼睛感受风的吹拂，只需15分钟；练习深呼吸只要5分钟；好好看一看天空，只需30秒。　　李佳忆说：“我很后悔过去常以忙碌为借口。开始改变之后，感觉真的好多了。现在的我会花几秒钟时间点上香薰蜡烛，让自己在工作时闻到最喜欢的香氛，也会花15分钟跑步。我告诉自己，每天工作八九个小时，那15至30分钟的放松时间绝对是应该给自己的。”\n断断\n离离\n舍舍\n陈敏俐副教授：精神层面的“杂物”会占据大脑空间，以致我们无法拥有清晰的思路和思考空间。（受访者提供）\n周荧柃副教授：培养“精神杂物断舍离”的习惯需要时间，可从深呼吸和听音乐减压做起。（档案照）程序经理李佳忆三年前开始简化生活，学习定期给心神“大扫除”，改善精神健康。（受访者提供）日本收纳专家近藤麻理惠最近公开表示自己放弃了整理和收纳，家中非常\n凌乱。比起家居的整洁，现在育有三子的她更重视简化生活和心神的“大扫除”， 简单的日常事物就足以让她怦然心动。我们如何简化生活，才能被简单的事物打动？ 正念专家、心理学家、保健及社会科学学者讲解精神层面的“断舍离”；推崇简单生活 的达人分享心得和感悟，期待更多人在简化生活的同时，深化日常的快乐与幸福感。\n无法外出散步，就在家里照顾盆栽，或泡壶花草茶，闭眼深呼吸，都\n是给大脑“大扫除”的方法。（受访者提供）李佳忆认为，每天工作八九个小时，15至30分钟的放松时间绝对是应该给自己的。（受访者提供）扫除大脑 “杂物”\n开始放松身体，等于\n把注意力转向内心，有厘清思绪，清除杂念的功效。\n——周荧柃副教授追求精神\nPublication:  Lianhe Zaobao\nDate: 28 Feb 2023\nHeadline:  Sweep away the “clutter” in the\nbrain and pursue mental disconnection\nSource: Lianhe Zaobao © SPH M edia Limit ed. Reproduced with permission."
}