{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Heeding%20The%20Call%20Mapletree.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  08/16 SiTIZEN  |  09/16\nHeeding the Call for Sustainability\nat The Mapletree ChallengeThis unique learning initiative, supported\nby Mapletree Investments, promotes spirit\nof innovation and inculcates job interview\nand presentation skills among SIT students\nThe Mapletree Innovation and Entrepreneurship Forum Nursing Students Win The Mapletree Challenge Grand Final with Practical and Innovative DesignEnthusiastic audience members eagerly participating in a quiz segment\nduring The Mapletree Fest.Mr Lionel Lim (third from right), who had trained the students for the Masterclasses, was also present during The Mapletree Fest to give out prizes to winners of the Professional Pitch\nVodcasts, which were submitted by participants after the Job\nInterview & Presentation Masterclasses.\nThe panel dished out much advice on their experiences and how to survive as an entrepreneur. The speakers for the night were: (from left) Mr Shamir Rahim, Founder and CEO, VersaFleet Pte Ltd, Mr Zach Wilson, Managing Director, AlfaTech & DVUCA, Ms\nNancy Ling, Co-Founder, EcoU, Mr Eugene Wong, Founder &\nManaging Director, Sirius Venture Capital, and moderator, Asst Prof Victor Cole, SIT and Co-Chair of The Mapletree Challenge.Prof Tan Thiam Soon, President, SIT (left), presenting a token of appreciation to Mr Edmund Cheng, Chairman,\nMapletree Investments.\nDr Amy Khor, Senior Minister of State, Ministry of Environment\nand Water Resources & Ministry of Health (third from left in front\nrow) was present at The Mapletree Challenge Grand Final to\nhand out the awards to the winning teams.The judging panel grilled each team after their presentation. From left: Dr Reto Callegari, Entrepreneur-in-Residence, SIT, Prof Yaacob Ibrahim, Advisor, Office\nof the President, SIT, Ms Heng Sue Yuan, Vice President,\nCorporate Communications, Mapletree Investments and Prof Ng Siu Choon, Associate Provost (Students), SIT.\nThe six teams presented to a full house at Mapletree Business City. Assoc Prof Deng Xudong, Director, SIT, gives an overview of The Mapletree Challenge\njourney at SIT since October 2018. Students attending the forum asked many\nquestions about the prospects of being an entrepreneur and delved into topics about their respective industries.Team YARJ Green Insight, one of the finalists, after the\nsemi-finals of The Mapletree Challenge with Mr Brad\nBlackstone, Senior Lecturer, SIT, and Co-Chair of The Mapletree Challenge (middle). Taking place for the first time, The Mapletree Challenge (2018-2019) saw\nthe participation of more than 500 students across various programmes at the Singapore Institute of Technology (SIT). Supported by Mapletree Investments, this is the first such learning programme at SIT and aims to equip students at SIT with job interview and presentation skills, while providing them with a test-bed to pitch their entrepreneurial ideas.\nOver the course of seven months, beginning in October 2018, The\nMapletree Challenge consisted of a series of masterclasses on personal\nbranding, interview and presentation skills, a forum discussion on\nentrepreneurship and sustainable innovation, as well as small group mentorship from industry experts on their entrepreneurial ideas.\nTo drum up buzz for The Mapletree Challenge among their fellow\nSITizens, students from the Hospitality Business programme also took it upon themselves to organise The Mapletree Fest on 15 March 2019 – an evening of fun and games which also featured faculty and guest speakers sharing their take on sustainability.\nThe Mapletree Innovation and Entrepreneurship Forum took place on 20 March\n2019, with over 180 participants attending to hear a distinguished panel discuss their perspectives on entrepreneurship and sustainable solutions for today’s world, moderated by Co-Chair of The Mapletree Challenge, SIT’s Asst Prof Victor Cole from the Centre for Communication Skills.\nThe panel consisted of Mr Shamir Rahim, Founder and CEO, VersaFleet Pte\nLtd, Mr Zach Wilson, Managing Director, AlfaTech & DVUCA, Ms Nancy Ling, Co-Founder, EcoU, and Mr Eugene Wong, Founder & Managing Director, Sirius Venture Capital. The speakers discussed emerging trends for sustainable innovations in their respective industries, and offered valuable insights based on their experiences with their own businesses and their journeys as entrepreneurs.\nThe discussion saw many students coming forward during the Q&A Segment to\nask questions about what it takes to become an entrepreneur.\nMr Aloysius Teo, a second-year Criminology and Security student, said, “I learned\nthat failure is mandatory, before one can achieve success. In entrepreneurship, there may not be an original idea that lasts forever. One must keep evolving to remain ahead of the competition.” He added, “The forum was helpful as it showed that despite everyone coming from different industries, there are core traits, characteristics and attitudes that one must have if one wants to be an entrepreneur.”The Mapletree Challenge Grand Final was held at Mapletree Business City on\n2 May 2019. Six teams presented their ideas for sustainable innovations to a\npanel of distinguished judges, consisting of Dr Reto Callegari, Entrepreneur-\nin-Residence, SIT, Prof Yaacob Ibrahim, Advisor, Office of the President, SIT,\nProf Ng Siu Choon, Associate Provost (Students), SIT, and Ms Heng Sue Yuan, Vice President, Corporate Communications, Mapletree Investments. Prior to\nthe Grand Final, the teams had been mentored by industry experts – who\ngave them suggestions on how best to pitch their ideas.\nEmerging as the inaugural champion was Team Trolley, consisting of a group\nof first year students from the SIT-University of Glasgow Nursing programme. The team impressed the judges with a customisable redesign of a laundry trolley, inspired by their observations that nurses were struggling when handling patients’ laundry during their clinical attachment at a nursing home (for more on their innovation, please see Page 12).\nThe team simply hoped to share their innovation with others, and did not\nhave much confidence in winning initially. “I think it was an eye opener for us in the business world. We are nurses with practically zero background in this field,” said team leader Ms Joanne Chua. “It was an opportunity for us to look into techniques for business and marketing.”\nThe Challenge has also given other teams the opportunity to explore their\nprojects further, despite not winning. Team Scooter Power is currently\nMs Chiam Jia Ying, a Year 2 Hospitality\nBusiness student was part of the student organising committee, which also helped to organise the Forum and the Grand Final. She said that her organising team of nine had prepared one month ahead for the festival and was happy to see the fantastic turnout. She added, “We wanted to organise this roadshow to raise awareness for the upcoming Mapletree Challenge events to get students and faculty\nto show their support for the\ncompeting teams.”\nAll of these activities culminated in\nThe Mapletree Challenge Grand Final on 2 May 2019. Prof Tan Thiam Soon, President, SIT,\nsaid, “The Mapletree Challenge is the first learning initiative of its kind at our young university, and it is a great example of a platform that integrates learning, industry and community.”\nMr Edmund Cheng, Chairman of\nMapletree, said, “Aligned to our support for education, which is one of our four Corporate Social Responsibility pillars, it is our aim for The Mapletree Challenge to provide entrepreneurial students with a platform to test their ideas and showcase innovative solutions which could be adapted into real life scenarios.”\nMapletree is a leading real estate\ndevelopment, investment, capital and property management company headquartered in Singapore. It has also made possible the Mapletree Bursary at SIT, in support of financially disadvantaged students at the university.\ncollaborating with SIT and Mapletree\non their prototype of a pedal-powered scooter. Said team leader Mr Chan Xinyin, who is enrolled in the Mechanical Design Engineering programme (UofG) “Mapletree has engaged us for the development of the scooter, and we are hoping to find use for it in Mapletree properties.”\nThe winning team clinched the\nMapletree Gold Award and a cash prize of $5,000. They were followed by first runner-up Team FX1, represented by Samuel Seah from UofG’s Computing Science programme, and second\nrunner-up Team JNL, consisting of Leslie Woon and Tong Jun Hong, also pursuing Computing Science."
}