{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Partners%20in%20Philanthropy.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  06/12\nFor some committed donors of bond-\nfree scholarships, philanthropy does not stop with making a gift to support a bursary or scholarship at the Singapore Institute of Technology (SIT). In recent months, these thoughtful donors have taken it upon themselves to hosting lunches and gatherings to further engage SIT undergraduates.\nThe Singapore Leong Khay Huay Kuan,\nwhich made a gift to establish the Singapore Leong Khay Huay\nKuan Bursary  at SIT in 2015, held a\ngathering for its leaders and bursary recipients on 14 May 2016. The clan association also invited its bursary recipients from various institutions (including SIT students) to its Double Celebration dinner on 18 June 2016.\nMr Ko Oen Tjiang, Chairman, Singapore\nLeong Khay Huay Kuan, said he was touched by the thoughtfulness of the gesture from SIT students when they presented him with a handwritten thank-you card at the May gathering. He added, “We want to do more for needy students at SIT and want to ﬁ nd out from the students how else\nwe can help them.”\nSaid Ms Neo Miao Lin, a recipient of\nthe Singapore Leong Khay Huay Kuan Bursary, who attended both events and even performed at the dinner with Thoughtful donors are taking the initiative to engage bursary and\nscholarship recipients at SITPartners in\nPhilanthropy\nher fellow SITizens, “It was a good\nopportunity to get to know the other bursary recipients and work together as a team to put up the performance.”\nSimilarly, Baker Tilly TFW LLP held a\nscholarship ceremony and lunch on 22 June 2016 for the three recipients (for Academic Year 2015/16) of the Baker\nTilly TFW Scholarship , which was\nestablished to support Accountancy students at SIT. Mr Sim Guan Seng, Managing Partner, Baker Tilly TFW LLP , said, “We are very glad to be able to share our industry experience with the Scholarship recipients and also provide advice on how they can develop their future careers in the Accountancy ﬁ  eld.”\nRecipients of The Applied Materials\nBursary  were invited to the ofﬁ  ces\nof Applied Materials South East Asia Pte Ltd to have tea where Mr Russell Tham, President, Applied Materials (South East Asia), shared with them his experiences of the high-tech industry. “Our hope is for the bursary recipients to use their learnings to contribute to the society by solving real-world problems in creative ways through engineering,” said Mr Tham.\nAnother SIT donor, Mr Kelvin Wong,\nSales Director, McLink Asia Pte Ltd,thought it important that he encourage (From left) Partners at Baker Tilly: Mr Khor Boon Hong,\nMr Joshua Ong; scholarship recipients Mr Tan Yi Ming, Ms Levina Aw, and Ms Joanne Tang; Mr Sim Guan Seng, Managing Partner, Baker Tilly and Mr Joseph Toh, Partner, Baker Tilly.\nMr Kelvin Wong (third from left), Sales Director, McLink Asia Pte Ltd, together with SIT students: Mr Christopher Wong, Ms Chiam Hui Cheang, Mr Kelvin Wong, Mr Law Kiang Hong, Mr Han Wei Chou and Mr Teo Poh Seng.SIT students seized the opportunity to put on a\nperformance at the Singapore Leong Khay Huay Kuan Double Celebration on 18 June 2016.\nnot only the selected McLink\nScholarship  recipient, but also the\nother four shortlisted applicants. He hosted the students to dinner on 17 May 2016 and said, “It must be challenging to manage school, family and ﬁ  nancial difﬁ  culties and I wanted\nthem to persevere. It was an awesome experience speaking to them and I learnt a lot from their sharing.”\nFor the students, these get-togethers\nare providing them with valuable career and industry insights.\nMs Chiam Hui Cheang from the\nBEng (Hons) in Information and Communications Technology (Software Engineering) degree programme (SIT), said she was inspired by the conversation during the dinner with McLink’s Sales Director.  “Mr Wong shared that having a disadvantage at the starting line does not equate to losing the race,” the McLink Scholarship recipient recalled. “It is up to us to ﬁ  ght against the storm, turning\nadversities into opportunities.”\nMs Yvonne Lee, Senior Director at Applied Materials\n(second from left), and bursary recipient Mr Jonathan Lim (second from right) accompanied by SIT staff."
}