{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Empowering%20SITizens%20in%20Need_0.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  10/16\nTiong Seng Holdings, one of\nSingapore’s largest construction and property development groups, has made an endowed gift to establish the Tiong Seng Bursary and support students at SIT, especially those in the field of engineering. From Academic Year 2018/19 onwards, five bursaries will be awarded to SIT students annually, and in perpetuity.\nMr Ong Lay Khiam, Chairman,\nand Mr Pek Lian Guan, Executive Director and CEO, both from\nTiong Seng Holdings, and other\nguests from the company visited SIT@Dover campus on\n4 October 2017 for an appreciation lunch hosted by Prof Tan Thiam Soon, President, SIT, along with SIT faculty, staff and students.\nSaid Mr Pek during the lunch: “We at Tiong Seng are very\nglad to be part of this SIT journey in contributing to the university’s students. As a polytechnic graduate who went on to pursue studies in university, I look at SIT and see an educational route I have walked through before. Knowing Empowering SITizens in Need\nWidening Support\nFor All Tiong Seng, one of Singapore’s largest construction companies, makes possible a bursary\nfor undergraduates at SIT\nThe Singapore Leong Khay Huay Kuan extends\nfinancial aid to more SIT students\nThe Singapore Leong Khay Huay Kuan (SLKHK) has\nincreased its support for SIT undergraduates by making\nmore bursaries available and widening the eligibility criteria for the bursary.\nPreviously, SIT was able to award eight Singapore Leong\nKhay Huay Kuan Bursaries annually to support students of Hokkien descent.\nFrom the upcoming Academic Year 2018/19 onwards, SIT\nwill be able to award 12 Singapore Leong Khay Huay Kuan Bursaries annually. In addition, the bursary will now be open to students of other ethnic and dialect groups.\nSaid Mr Chuah Yip Cheng, second-year Bachelor of\nHospitality Business with Honours student and recipient of the Bursary in Academic Years 2016/17 and 2017/18: “I’m truly grateful for the Huay Kuan’s bursary fund which has helped me greatly in financing my education. With their support, I’ve been able to focus and excel in my studies without being weighed down by financial burdens.”\nThe Singapore Leong Khay Huay Kuan is a Hokkien clan\ngroup whose 220 members trace their roots to a city in China’s Fujian province.\nMr Ko Oon Joo, Chairman (fourth from left), and Ms Chen Teck Shing, Secretary\nGeneral (fourth from right), both of the Singapore Leong Khay Huay Kuan Education\nTrust Fund, at the Singapore Leong Khay Huay Kuan Mid-Autumn Celebration &\nBursary Agreement Ceremony on 8 October 2017. With them were Prof Ng Siu Choon, Associate Provost (Students), SIT (fifth from left), and the Academic Year 2017/18 recipients of the Singapore Leong Khay Huay Kuan Bursary.the SIT vision, we are very excited for SIT graduates who\nwill not just be academically strong, but also very hands-on and capable in their fields of study.”\nEstablished in 1959, Tiong Seng has played a significant\nrole in shaping Singapore’s landscape through the construction of commercial buildings, high-profile residences, expressways and iconic hotels such as PARKROYAL on Pickering and Capella Singapore.Guests from Tiong Seng Holdings with SIT Senior Management, faculty and staff at the future SIT@Punggol campus\nmodel."
}