{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Bringing%20Up%20Excellence.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  08/12\nStarting from this new Academic Year, students with good\nacademic results can look forward to four new bond-free\nscholarships. All are non-bonded scholarships that have\nbeen made possible by generous gifts from SIT’s donors\n– three of which are permanent scholarships as they are\nsupported by endowed gifts.\nTogether, these four scholarships will support students\nfrom the full range of programmes at SIT, and can be used\nto cover their educational expenses, including their tuition\nfees and expenses for international programmes like\nregional study trips or Overseas Immersion Programmes.\nThe endowed Mr & Mrs Ko Seng Gie Scholarship  will\nsupport three talented Singaporean students (with a\npreference for those from financially disadvantaged\nhouseholds) enrolled in any degree programme offered\nat SIT, each year and in perpetuity. The scholarship was\nmade possible by Mr Ko Oen Tjiang in honour of his\nparents, the late Mr & Mrs Ko Seng Gie, and with the\nhope that the scholarship will have a positive impact on\naspiring students from lower-income backgrounds.\nThe Seagift Scholarship  is applicable to academically\noutstanding Singaporean students pursuing either\na Chemical Engineering, Food Technology, or an  Prof Tan Thiam Soon, President, SIT (fourth from right), and Dr Jeyatharan Kumarasamy, President, TUCSS (third from right), along with the Committee Members from\nTUCSS and SIT Senior Management at the signing ceremony and appreciation lunch for TUCSS.Bringing Up Excellence\nFour new scholarships for academically promising students at SIT from Academic Year 2018/19,\nthanks to generous donors\nAccountancy degree. At least three scholarships will be\nawarded annually and in perpetuity. This scholarship\nhas been made possible by an endowed gift from\nSeagift Food Pte Ltd, a frozen seafood business, which\nsources and supplies quality food products to various\nmarket segments.\nEngineering students can also look forward to vying for\nthe TUCSS Engineering Scholarship , made possible\nwith an endowed gift by the Tunnelling and Underground\nConstruction Society Singapore (TUCSS). This scholarship\nwill support students pursuing a Civil Engineering or\nSustainable Infrastructure Engineering (Land) degree\nprogramme at SIT. TUCSS was formed in 1998 to advance\nthe standards of tunnelling and underground construction\npractice. The gift from TUCSS will support at least one\nscholarship each academic year (and two scholarships\nevery alternate year) and in perpetuity.\nThanks to a term gift from Feng Ming Construction Pte\nLtd, a civil engineering expert with nearly 30 years of\nexperience in completing technically challenging projects,\nthe Feng Ming Scholarship  has been established at\nSIT. Applicable to first-year students, this scholarship\nwill be awarded each academic year to nurture the next\ngeneration of leaders in the industry."
}