{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2025-01/Special%20Medical%20Conditions%20to%20note_2025.pdf",
  "type": "pdf",
  "content": "Page 1  of 4\nSpecial Medical Conditions\n(Students applying to Selected Programmes to take note of the programme requirements highlighted in yellow below )\nSingapore Institute of Technology ( SIT) adopts an inclusive and fair approach in assessing applicants without denying an opportunity to an applicant due to his/her\nmedical condition. Applicants are encouraged to disclose any condition to the University at the onset, to help ensure that any necessary adjustment can be planned to\nsupport their education.   At the point of application, applicants will be prompted to answer this question, “ Have you had or do you have any communicable disease,\nmental illness, colour blindness, d yslexia , and/or disability (including but not limited to chronic illness, visual or other physical constraints or limitations), whic h may or\nmay not cause you to require special assistance or facilities while studying the programme at SIT?”\nSpecial Needs/Disability Information:\n• Intellectual Disability  • Visual Disability (Eg. Colour Blindness)\n• Hearing Disability (Eg. High -frequency  hearing loss, use of hearing aids)  • Attention Deficit/Hyperactivity Disorder (ADHD)\n• Learning Disability (Eg.  Dyslexia, Dyscalculia, auditory)  • Autistic Spe ctrum Disorder/Asperger Syndrome\n• Mental Disability (Eg. Depression, Anxiety Disorder, Bipolar Disorder)  • Speech Disorder\n• Physical Disability (Eg.  Use of wheelchair, other assistive device)  • Others\nMedical Conditions :\nHigh-frequency  hearing loss , Hearing\nImpairment.  Applicants  with th ese medical condition s are strongly advised not to take up engineering  and media -related\nprogrammes  (such as  Bachelor of Business with Honours in Communication and Digital Media) .\nEpilepsy  Applicants with this medical condition are strongly advised not to take up engineering  and media -related\nprogrammes.\nVisual Impairment / Colour Vision\nDeficiency\n(Low -sightedness or loss of sight  –\ncomplete/partial ) Applicants  may not be eligible for certain programmes if they are unable to correctly identify:\n• Red and green wires\n• Dosage in different shades of red colour\nApplicants  with any form of visual impairment / colour deficiency are advised not to apply for the Diagnostic\nRadiography programm e and Mechanical Design and Manufacturing Engineering.\nApplicants are also strongly advised not to take up media -related programmes  (such as  Bachelor of Business with\nHonours in Communication and Digital Media) , as they are required to take and work with photographs/videos in\nthe programme.\nPage 2  of 4\nTuberculosis  Applicants  will need to be affirmed by any registered general practitioner that they are no longer contagious.\nMedical condition or allergy to certain\nvaccinations required by the\nprogramme  Applicants  who are unable to clear the medical requirements may not be allowed to enrolled into the offered\nprogramme.\nGlove allergies  Students are to take note that such allergies may pose difficulties in their  future career (e.g glove allergies could\nimpact students future employability in the pharmaceutical  industry  and health care professions .\nOther  medical conditions\nApplicants are required to provide supporting medical documents so that necessary arrangement can be planned\nto render due assistance to them.\nDuring the interview  period, applicants are required to inform the Programme Leader  or interviewing faculties  on the special educational needs or medical condition.\nMatriculation  Medical Examination\nAll admitted students are required to undergo a matriculation medical examination prior to the commencement of their studies at SIT and should be certified physically\nand mentally fit for the programme by the examining medical doctor. Students with any of the following medical conditions should inform their doctor  accordingly\nduring the matriculation medical examination.  Students who do not satisfy the below  requirements may not be eligible to pursue the course of study and should be\nprepared to make alternative educational plans.  Students with special educational needs or medical conditions are required to provide supporting documents\nregarding their special needs/disability to the Registrar’s Office so that necessary arrangements can be planned for them.\nMandatory screening required for ALL programmes :\n• Cardiovascular  • Visual Acuity  • Urinalysis  • Gastro -intestinal  • Musculoskeletal\n• Eyes  (other than myopia)  • Neurological  • Respiratory  • Psychiatric\nPage 3  of 4\nAdditional Mandatory Screening/Immunisation Records/ Additional Forms for the following selected programmes:\nFor more details, please refer to this link .\nHepatitis A^ Hepatitis B^ Hepatitis C^Mumps,\nMeas les  &\nRubella\n(MMR)@Pe rtussis\n+Poliomye\nlitis+Tuberculosis^Varicella\n(Chicken\nPox)@HIV^Full\nBlood\nCount\nte sts^Hearing\nTe stApplication For\nRegis tration as  a\nRadiation\nWorkerHepatitis B^ Hepatitis C^\nBachelor of Engineering in Pharmaceutical Engineering Yes Yes\nBachelor of Science in Occupational Therapy Yes Yes Yes Yes Yes Yes Yes\nBachelor of Science in Diagnostic Radiography Yes Yes Yes Yes Yes Yes Yes Yes Yes\nBachelor of Science in Radiation Therapy Yes Yes Yes Yes Yes Yes Yes Yes Yes\nBachelor of Science in Physiotherapy Yes Yes Yes Yes Yes Yes Yes\nBachelor of Science in Dietetics and Nutrition Yes Yes Yes Yes Yes Yes Yes\nBachelor of Science in Speech and Language Therapy Yes Yes Yes Yes Yes Yes Yes Yes\nBachelor of Science in Nursing (Pre-registration and Specialty Training) Yes Yes Yes Yes Yes Yes Yes Yes\nMas ter of Health Sciences  (s pecialis ation tracks ):\nAdult and Geriatric Rehabilitation Yes Yes Yes Yes Yes Yes Yes\nMusculoskeletal Physiotherapy Yes Yes Yes Yes Yes Yes Yes\nMedical Sonography Yes Yes Yes Yes Yes Yes Yes\nOrgan Transplant Nursing Yes Yes Yes Yes Yes Yes Yes Yes\nRehabilitation Nursing Yes Yes Yes Yes Yes Yes Yes Yes\nBachelor of Engineering in Aircraft Systems Engineering Yes\nSIT-UofG Joint Degree\nBachelor of Science in Nursing Yes Yes Yes Yes Yes Yes Yes Yes\nCIA Degree\nBachelor of Business Administration in Food Business Management\n(Baking and Pastry Arts)Yes Yes\nBachelor of Business Administration in Food Business Management\n(Culinary Arts)Yes YesAdditional Recommended Additional Mandatory Screening                          Screening/Immunisation/special tests required\nProgrammes\n^Students to proceed with the screening for immunity or infection\n+Students to produce the immunisation records for immunity, else to proceed with the vaccination.\n@Student to produce the immunisation records of previous vaccinations (min 2 doses) as proof of immunity OR to  proceed with the screening for  immunity.\nNote for Health Sciences programmes\nMinistry of Health (MOH) has mandated all healthcare students should be fully vaccinated against COVID -19 or certified to be medically ineligible for all COVID -19\nvaccines under the National Vaccination Programme (NVP) or have recovered from COVID -19 within 180 days.\nPage 4  of 4\nMedical Examination for Issuance of Student’s Pass ( International Students Only)\nIn addition to passing the SIT medical examination, it is compulsory for international students who have gained admission to complete the ICA Medical Examination\nReport  for the issuance of Student’s Pass. The ICA medical examination report must be submitted to the Immigration & Checkpoints Aut hority (ICA) upon the\ncollection of the Student Pass.\nThe original copy of the laboratory report for HIV  and the X-ray report must be attached to the medical report only if the medical examination and testing is carried out\noverseas. Please refer to ICA website  for more information."
}