{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2021-09/SIT%20Research%20Integrity%20Policy_Public%20ver_Final06Oct2020.pdf",
  "type": "pdf",
  "content": "1\nResearch Integrity Policy Framework\n[Public Version ]\n___________________________________________________________________\n1. Introduction\nSingapore Institute of Technology (SIT) is committed to upholding ethical and\nresearch integrity of the highest standards, through the promotion of good\nresearch practices and use of fair, and transparent procedures to address\nresearch misconduct.\n2. Principles and Standards\nSIT endorses and refers to the generally accepted internati onal statements on\nresearch integrity and responsibility, scholarly publications and guidelines\nincluding but not limited to the following:\ni. Singapore Statement on Research Integrity (2010)\nii. Montreal Statement on Research Integrity in Cross -Boundary Research\nCollaborations (2013)\niii. The Vancouver Protocol on Authorship  and the Guidelines of the\nInternational Committee of Medical  Journal Editors (ICMJE) .\n3. Good Research Practice s\nSIT requires  Principal  Investigators  (PIs) to take ultimate  responsibility  for the\nintegrity and  responsible  conduct  of research  under their supervision , including\nadherence  to all legislative  guidelines  and regulations.  PIs shall also adhere to\nthe following  practices :\n(a) Submit a Data Management Plan (DMP) regarding how research data and\nrecords will be managed, used and shared, prior to the commencement of\na research project. All members of the research team should adhere to this\nData Management Plan including  on data retention and deposition ;\n(b) Include appropriate attribution of authorship  based on guidelines in   the\nInternational Committee for Medical Journal Editors (ICMJE)  as well as the\nnorm s and standards that may be applicable to the PI’s  discipline ;\n(c) Declare or disclose any possible conflict of interest  i.e. circumstance s in\nwhich  he/she  would have a real, perceived or potential opportunity to prefer\ntheir own interests, or those of any other person or organization to the\ninterests of the Universi ty, to avoid potential misconduct .\n2\n(d) Seek approval from approval   from the SIT Institutional Review Board  (IRB)\nfor research studies involving human subjects prior to commencing work\nto ensure adherence to regulatory requirements outlined under the Human\nBiomedical  Research Act .\n(e) Seek approval from the SIT Institutional Animal Care and Use C ommittee\nfor studies involving the use of animals  prior to initiation of research project\nor experimental procedures  to ensure the work comply to NACLAR\nGuidelines .\n4. Research Integrity in External Collaborati ve Research\nPursuant to  Section 2(i i), SIT seeks to engage  external research partners to\ncommit to standards of research integrity as defined in the Singapore Statement\non Research Integrity  and to cooperat e in investigation(s) on any alleged\nresearch misconduct that may arise from the research collaboratio n as part of\ncollaboration agreement  terms .\n[Disclaimer:  SIT staff and student researchers should refer to the full version  of the official policy found in the SIT\nSharepoint .]"
}