{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2022-08/A%20Spicy%20Treat.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  08/12\nOver 300 SITizens turn up to support the fourth Faculty & Staff Giving Roadshow – and to celebrate\nthe generous giving towards the SIT Bursary by SIT employees A Spicy Treat for the Stomach…\nthat Comes Straight from the Heart\nOn 14 July 2017, more than 300 SIT\nfaculty and staff gathered at the University Tower at the SIT@Dover campus in support of a special occasion – the fourth Faculty & Staff Giving Roadshow, where they were treated to a delicious local breakfast and were hosted by some of the students who received SIT Bursaries, thanks to  their generous giving.\nSince its launch in November 2015,\nthe Faculty & Staff Giving initiative\nin support of the SIT Bursary has raised more than $112,800, and these gifts have made possible 37 SIT Bursaries for financially disadvantaged students at SIT. It is a unique initiative that signals to the university community that SIT faculty and staff are committed to supporting students at SIT. Savoury nasi lemak, fragrant otak-otak and steaming hot teh tarik and kopi tarik were served at the event and among those who enjoyed bonding with fellow SITizens over breakfast was Assoc Prof Indriyati Atmosukarto, Deputy Programme Director for Telematics, who thought the nasi lemak was “really good”.\n“But more importantly, we got a\nchance to chat with some of the bursary recipients at the event,” she pointed out, adding, “It was nice to hear how useful the bursaries are to the students. The students are now able to fully focus on their studies after receiving the bursaries as they don’t have to worry about finding part-time jobs.”\nAlso at the roadshow was Ms Li Jinglin\nwho used her SIT Bursary to pay the school fees for her final year in the Accountancy programme. She said, “Now, I can graduate on time this coming October and I want to thank everyone that made it possible.”Mr Tan Xingjie, another bursary recipient who was present, saw the Roadshow as a “perfect opportunity” to express his gratitude. The first-year student from the Bachelor of Arts (Hons) in Criminology and Security (University of Liverpool) said it gave him a better picture of the support shown by faculty and staff for the SIT Bursary.\nHe added, “I was very touched that\nSIT faculty and staff seemed to care deeply that I have the means to study and to graduate and go on to contribute to the community and nation. They encouraged me to make full use of the opportunity that SIT is offering me.”\nSIT staff showing their support for the Faculty\n& Staff Giving initiative. Steaming hot cups of teh tarik were served.\nSITizens thanking SITizens – SIT Bursary recipients had the chance to say thank you to SIT faculty and staff who have supported them. Staff and faculty forming a long line at the University Tower lobby.Faculty from the Chemical Engineering and Food Technology cluster turned up to show their support.Assoc Prof Indriyati Atmosukarto, Deputy Programme Director, Telematics and Assoc Prof Malcolm Low, Programme Director, Computing Science speak to the recipients who are from the Infocomm Technology programmes.\nSavoury nasi lemak and fragrant otak-otak were also on the menu."
}