{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20210605-bt-tappingthemuslimmarket.pdf",
  "type": "pdf",
  "content": "LLUSTRATION: SIMON ANG\nTAPPING THE\nMUSLIM MARKET\nSingapore is well placed to make its mark on the global halal\neconomy. Are local businesses ready to make the leap?\nBRUNCH 9-11\nBT PHOTO: LIM YAOHUITAPPING THE MUSLIM MARKET\nBy ANNABETH LEOW\nThe Business Times\nSaturday 5th June 2021\n2613 words\nPage 1,9,10,11 | Section: General\n2614cm on the page\nSource: The Business Times (c) Singapore Press Holdings Limited. Reproduced with permission.\nBYANNABETH LEOWTAPPING THE\nMUSLIM MARKET\nSingapore is well placed to make its mark on the global halal\neconomy. Are local businesses ready to make the leap?\nBT PHOTO: LIM YAOHUI\nS\u0000I\u0000N\u0000G\u0000A\u0000P\u0000O\u0000R\u0000E\u0000 \u0000l\u0000o\u0000o\u0000k\u0000s\u0000 \u0000l\u0000i\u0000k\u0000e\u0000 \u0000a\u0000 \u0000m\u0000a\u0000r\u0000k\u0000e\u0000t\u0000 \u0000t\u0000o\u0000 \u0000w\u0000a\u0000t\u0000c\u0000h\u0000 \u0000i\u0000n\u0000 \u0000t\u0000h\u0000e\u0000 \u0000g\u0000l\u0000o\u0000b\u0000a\u0000l\u0000 \u0000h\u0000a\u0000l\u0000a\u0000l\u0000\n\u0000e\u0000c\u0000o\u0000n\u0000o\u0000m\u0000y\u0000.\u0000 \u0000L\u0000a\u0000s\u0000t\u0000 \u0000y\u0000e\u0000a\u0000r\u0000,\u0000 \u0000t\u0000h\u0000e\u0000 \u0000R\u0000e\u0000p\u0000u\u0000b\u0000l\u0000i\u0000c\u0000 \u0000c\u0000l\u0000i\u0000m\u0000b\u0000e\u0000d\u0000 \u0000t\u0000o\u0000 \u00001\u00005\u0000t\u0000h\u0000 \u0000p\u0000l\u0000a\u0000c\u0000e\u0000 \u0000i\u0000n\u0000 \u0000t\u0000h\u0000e\u0000\n\u0000G\u0000l\u0000o\u0000b\u0000a\u0000l\u0000 \u0000I\u0000s\u0000l\u0000a\u0000m\u0000i\u0000c\u0000 \u0000E\u0000c\u0000o\u0000n\u0000o\u0000m\u0000y\u0000 \u0000I\u0000n\u0000d\u0000i\u0000c\u0000a\u0000t\u0000o\u0000r\u0000 \u0000i\u0000n\u0000d\u0000e\u0000x\u0000,\u0000 \u0000a\u0000f\u0000t\u0000e\u0000r\u0000 \u0000g\u0000o\u0000i\u0000n\u0000g\u0000 \u0000u\u0000n\u0000r\u0000a\u0000n\u0000k\u0000e\u0000d\u0000\n\u0000p\u0000r\u0000e\u0000v\u0000i\u0000o\u0000u\u0000s\u0000l\u0000y\u0000  \u0013\u0000 \u0000n\u0000o\u0000 \u0000m\u0000e\u0000a\u0000n\u0000 \u0000f\u0000e\u0000a\u0000t\u0000 \u0000f\u0000o\u0000r\u0000 \u0000a\u0000 \u0000c\u0000o\u0000u\u0000n\u0000t\u0000r\u0000y\u0000 \u0000w\u0000h\u0000e\u0000r\u0000e\u0000 \u0000M\u0000u\u0000s\u0000l\u0000i\u0000m\u0000s\u0000 \u0000m\u0000a\u0000k\u0000e\u0000\n\u0000u\u0000p\u0000 \u00001\u00005\u0000 \u0000p\u0000e\u0000r\u0000 \u0000c\u0000e\u0000n\u0000t\u0000 \u0000o\u0000f\u0000 \u0000t\u0000h\u0000e\u0000 \u0000r\u0000e\u0000s\u0000i\u0000d\u0000e\u0000n\u0000t\u0000 \u0000p\u0000o\u0000p\u0000u\u0000l\u0000a\u0000t\u0000i\u0000o\u0000n\u0000.\n\u0000T\u0000h\u0000a\u0000t\u0000 \u0000i\u0000s\u0000 \u0000g\u0000o\u0000o\u0000d\u0000 \u0000n\u0000e\u0000w\u0000s\u0000 \u0000f\u0000o\u0000r\u0000 \u0000l\u0000o\u0000c\u0000a\u0000l\u0000 \u0000b\u0000u\u0000s\u0000i\u0000n\u0000e\u0000s\u0000s\u0000e\u0000s\u0000 \u0000w\u0000i\u0000t\u0000h\u0000 \u0000a\u0000n\u0000 \u0000e\u0000y\u0000e\u0000 \u0000o\u0000n\u0000 \u0000t\u0000h\u0000e\u0000\n\u0000i\u0000n\u0000t\u0000e\u0000r\u0000n\u0000a\u0000t\u0000i\u0000o\u0000n\u0000a\u0000l\u0000 \u0000I\u0000s\u0000l\u0000a\u0000m\u0000i\u0000c\u0000 \u0000m\u0000a\u0000r\u0000k\u0000e\u0000t\u0000,\u0000 \u0000w\u0000h\u0000i\u0000c\u0000h\u0000 \u0000w\u0000i\u0000l\u0000l\u0000 \u0000b\u0000e\u0000 \u0000w\u0000o\u0000r\u0000t\u0000h\u0000 \u0000U\u0000S\u0000$\u00002\u0000.\u00003\u0000 \u0000t\u0000r\u0000i\u0000l\u0000l\u0000i\u0000o\u0000n\u0000 \u0000b\u0000y\u0000 \u00002\u00000\u00002\u00004\u0000,\u0000 \u0000t\u0000h\u0000e\u0000\n\u0000S\u0000t\u0000a\u0000t\u0000e\u0000 \u0000o\u0000f\u0000 \u0000t\u0000h\u0000e\u0000 \u0000G\u0000l\u0000o\u0000b\u0000a\u0000l\u0000 \u0000I\u0000s\u0000l\u0000a\u0000m\u0000i\u0000c\u0000 \u0000E\u0000c\u0000o\u0000n\u0000o\u0000m\u0000y\u0000 \u0000(\u0000S\u0000G\u0000I\u0000E\u0000)\u0000 \u0000r\u0000e\u0000p\u0000o\u0000r\u0000t\u0000 \u0000f\u0000r\u0000o\u0000m\u0000 \u0000b\u0000u\u0000s\u0000i\u0000n\u0000e\u0000s\u0000s\u0000 \u0000c\u0000o\u0000n\u0000s\u0000u\u0000l\u0000t\u0000a\u0000n\u0000c\u0000y\u0000\n\u0000D\u0000i\u0000n\u0000a\u0000r\u0000S\u0000t\u0000a\u0000n\u0000d\u0000a\u0000r\u0000d\u0000 \u0000a\u0000n\u0000d\u0000 \u0000o\u0000n\u0000l\u0000i\u0000n\u0000e\u0000 \u0000n\u0000e\u0000w\u0000s\u0000 \u0000o\u0000u\u0000t\u0000l\u0000e\u0000t\u0000 \u0000S\u0000a\u0000l\u0000a\u0000a\u0000m\u0000G\u0000a\u0000t\u0000e\u0000w\u0000a\u0000y\u0000.\u0000c\u0000o\u0000m\u0000 \u0000s\u0000h\u0000o\u0000w\u0000e\u0000d\u0000.\n\u0000C\u0000o\u0000n\u0000s\u0000u\u0000m\u0000e\u0000r\u0000 \u0000r\u0000e\u0000s\u0000e\u0000a\u0000r\u0000c\u0000h\u0000 \u0000f\u0000i\u0000r\u0000m\u0000 \u0000E\u0000u\u0000r\u0000o\u0000m\u0000o\u0000n\u0000i\u0000t\u0000o\u0000r\u0000 \u0000I\u0000n\u0000t\u0000e\u0000r\u0000n\u0000a\u0000t\u0000i\u0000o\u0000n\u0000a\u0000l\u0000 \u0000n\u0000o\u0000t\u0000e\u0000d\u0000 \u0000t\u0000h\u0000a\u0000t\u0000 \u0000f\u0000o\u0000r\u0000\n\u0000h\u0000a\u0000l\u0000a\u0000l\u0000-\u0000c\u0000e\u0000r\u0000t\u0000i\u0000f\u0000i\u0000e\u0000d\u0000 \u0000p\u0000a\u0000c\u0000k\u0000a\u0000g\u0000e\u0000d\u0000 \u0000f\u0000o\u0000o\u0000d\u0000 \u0000a\u0000n\u0000d\u0000 \u0000d\u0000r\u0000i\u0000n\u0000k\u0000s\u0000 \u0000a\u0000l\u0000o\u0000n\u0000e\u0000,\u0000 \u0000I\u0000n\u0000d\u0000o\u0000n\u0000e\u0000s\u0000i\u0000a\u0000 \u0000c\u0000l\u0000o\u0000c\u0000k\u0000e\u0000d\u0000 \u0000U\u0000S\u0000$\u00002\u00005\u0000 \u0000b\u0000i\u0000l\u0000l\u0000i\u0000o\u0000n\u0000 \u0000i\u0000n\u0000\n\u0000s\u0000a\u0000l\u0000e\u0000s\u0000 \u0000i\u0000n\u0000 \u00002\u00000\u00001\u00008\u0000,\u0000 \u0000w\u0000h\u0000i\u0000l\u0000e\u0000 \u0000C\u0000h\u0000i\u0000n\u0000a\u0000 \u0000a\u0000c\u0000c\u0000o\u0000u\u0000n\u0000t\u0000e\u0000d\u0000 \u0000f\u0000o\u0000r\u0000 \u0000U\u0000S\u0000$\u00001\u00001\u0000.\u00007\u0000 \u0000b\u0000i\u0000l\u0000l\u0000i\u0000o\u0000n\u0000 \u0000a\u0000n\u0000d\u0000 \u0000t\u0000h\u0000e\u0000 \u0000P\u0000h\u0000i\u0000l\u0000i\u0000p\u0000p\u0000i\u0000n\u0000e\u0000s\u0000 \u0000f\u0000o\u0000r\u0000\n\u0000U\u0000S\u0000$\u00003\u0000.\u00001\u0000 \u0000b\u0000i\u0000l\u0000l\u0000i\u0000o\u0000n\u0000. \u0000 \u0000>\u0000>\u0000>Source: The Business Times (c) Singapore Press Holdings Limited. Reproduced with permission.\n\u0000S\u0000a\u0000y\u0000s\u0000 \u0000F\u0000a\u0000r\u0000a\u0000 \u0000A\u0000b\u0000d\u0000u\u0000l\u0000l\u0000a\u0000h\u0000,\u0000 \u0000m\u0000a\u0000n\u0000a\u0000g\u0000i\u0000n\u0000g\u0000 \u0000d\u0000i\u0000r\u0000e\u0000c\u0000t\u0000o\u0000r\u0000 \u0000o\u0000f\u0000\nSingapore-based mobile app startup BitsMedia:\n“More and more, we’re seeing that investors are\nstarting to realise that the Islamic community is\nunderserved. There is a gap, whether it’s big or\nsmall businesses … and they’re starting to look to\nsee how they can move into this area.”\nSerial entrepreneur Heikal Gani, who ran life-\nstyle businesses in Canada and China before re-\nturning home to Singapore during the Covid-19\npandemic, also notes that there are only so many\npeople living on the one island: “We were conscien-\ntious in the beginning to make sure that our mar-\nkets were not limited to Singapore.”\nBut are small and medium-sized enterprises\n(SMEs) ready to make the leap abroad to carve a\nslice of the pie?\n\u0000R\u0000e\u0000a\u0000d\u0000y\u0000 \u0000t\u0000o\u0000 \u0000e\u0000a\u0000t\nSingapore comes second place in the halal food\nsegment of the Global Islamic Economy Indicator\nindex, and third place in both pharmaceuticals\nand cosmetics, and media and recreation.\nIn fact, food and beverage (F&B) is the domin-\nant industry in the halal economy. It is both the\nlargest non-finance segment and also the fastest-\ngrowing, said AT Kearney partner Hemanth\nPeyyeti.\nNurul Hidayah Abubakar, the Islamic Religious\nCouncil of Singapore (Muis) halal certification stra-\ntegic unit’s assistant head of assurance and en-\nforcement, also told a conference in November\nlast year that “at present, our halal certification’s\nscope is focused on the food and beverage in-\ndustry”. Singapore had  4,385 halal-certified\npremises in 2019, of which 19 per cent were man-\nufacturers, Muis statistics showed.\nJumping on the bandwagon is ngo hiang\nmaker Hock Lian Huat Foodstuff Industry (HLH),\nfounded in 1928, which cottoned on to the size of\nthe global halal market in 2019. It is now set to\nopen a halal-only factory in August for seafood\nproducts, under its internationalisation strategy.\n“The new factory was registered as halal be-cause we’re seeing how the global halal market is\ngetting larger. Being halal-certified, we can sell to\nhalal and non-halal markets, making our business\nmore complete,” says managing director William\nTan, who aims for exports to make up three-fifths\nof sales in the next two years.\n“More importantly, there is increasing demand\nfrom the halal market.”\nNorzulkarnien Nor Mohamad, Islamic banking\nhead at Maybank Singapore, notes a significantly\nhigh demand for halal food products from coun-\ntries with large Muslim populations: Saudi Arabia,\nthe United Arab Emirates (UAE), Egypt, Turkey,\nPakistan, Indonesia and Malaysia.\nStill, Dewi Hartaty Suratty, chief executive of\nMuis’ business development arm Warees Halal, ad-\nvised conference attendees last year that compan-\nies must stand out in markets where all products\nare already halal.\n“Of course, consumer habits are also changing\n… With more working mothers, for example, it\nhas spurred companies to produce more ready-\nto-eat meals and even pre-mixes, to make prepara-\ntion of food even easier,” she remarked.\nFor now, food science associate professor Siti\nNoorbaiyah Abdul Malek from the Singapore Insti-\ntute of Technology says that food exports are still\nlimited to “kinds of products that can be easily\nhalal-certified”, such as oils or pre-packaged\ndrinks.\nBut she adds that “I’ve seen some movement in\nthe frozen food sector”, such as sales of laksa and\nchicken rice to export markets in Europe.\nThe development of alternative proteins is an-\nother emerging trend on the halal food scene,\nsays Prof Siti. She points to cultured meat, as well\nas algae and plant and mushroom proteins, as\nsome examples.\nMeanwhile, Emil Fazira Kamari, senior re-\nsearch consultant at Euromonitor, adds that\n“Singapore has a lot of potential to value-add\nproduct segments” in up-and-coming areas, such\nas milk and meat alternatives.\nTee Yih Jia Food Manufacturing, which is be-hind brands such as Spring Home, is one such in-\nnovator. The frozen food company entered the\nhalal market in 1977 – eight years after opening –\nand recently launched plant-based line ALTN in\n2020.\n“The halal segment is a highly competitive mar-\nket,” notes general manager Laureen Goi. “Consist-\nent quality and food safety is our winning factor.”\nShe says the company is seeing annual sales\ngrowth of 20 per cent to 25 per cent, fuelled in\npart by how exports make up nine-tenths of\nturnover.\nOther opportunities that Ms Goi identified in-\nclude the rise of Muslim travellers worldwide:\n“Most food service groups are moving towards\npurchasing only halal products. For example,\nsales of roti prata for the Western market have in-\ncreased by almost 30 per cent to 40 per cent since\n2018.”\n\u0000Y\u0000o\u0000u\u0000n\u0000g\u0000 \u0000a\u0000n\u0000d\u0000 \u0000h\u0000i\u0000p\nCompanies tapping the Muslim market are capital-\nising on another trend – its youth – even beyond\nthe outsized F&B segment.\nWhile Mr Heikal recently launched an all-pink\nMoroccan-themed cafe in Siglap, he had already\ntried reaching youthful consumers with brands\nsuch as modest fashion line Lasouk and athleis-\nure supplier Sugarmat.\n“There’s a huge chunk of young adults and\nteenagers that is growing at this point in time.\nThey are a bit more sophisticated – they are con-\nnected digitally as well – so we really need to cater\nto this group,” he says.\nPopcorn brand Kettle Gourmet, which manu-\nfactures in Malaysia but is based here, also ap-\npeals to the cool crowd. It dropped its bak kwa\n(pork jerky) flavour and picked up halal certifica-\ntion in 2019, two years after launch, now offering\nflavours such as kaya butter toast and nasi lemak.\n“We have found that by being halal-certified,\nThe Kettle Gourmet has become more attractive\nto more distributors,” says founder Zac Chua.\nHe is prioritising mainland China, Hong Kong,\nIndonesia and the Philippines to drive the com-\npany to its target revenue of S$5 million by 2024.\n“Although Indonesia is the only Muslim-major-\nity country we felt that it was necessary to ensure\nThe Kettle Gourmet is edible to all consumers …\nIt’s an integral part of our business plan,” Mr Chua\nsays, referring to the strategic role of halal certific-\nation.\nSimilarly, two-year-old cosmetics brand Liht\nOrganics is seeking halal certification in Malaysia\nand Brunei, as founder Nerissa Low seeks to ex-\npand in the Arab Gulf region and South-east Asia.\nThe company, which now attributes 90 per cent\nof its sales to international audiences, is already\npresent in the UAE and China too.\n“While the markets we are in do not make it\nmandatory for our products to be halal-certified,\nwe understand that there is a greater appreciation\nfrom the market if they are certified,” she says.\nFirms like Liht may gain ground as the halal\npharma and cosmetics market expands. The SGIE\nreport estimated this segment could grow 2.9 per\ncent a year, to US$76 billion by 2024.\n\u0000S\u0000e\u0000r\u0000v\u0000i\u0000c\u0000e\u0000 \u0000s\u0000t\u0000a\u0000n\u0000d\u0000a\u0000r\u0000d\u0000s\nIndeed, CIMB Singapore Islamic head Sazali Ba-\nharom notes that of the 295 clients that the bank\nhas helped to access the Islamic economy so far,\nfewer than 5 per cent are in F&B manufacturing\nand export. The rest come from industries such\nas finance, fashion, cosmetics and travel.\nThe services sector may have been over-\nlooked, especially as some associate the market\nonly with Islamic banking and finance.\nPHOTOS: LASOUK, FILE PHOTOS\n\u0000T\u0000h\u0000e\u0000 \u0000n\u0000e\u0000w\u0000 \u0000f\u0000a\u0000c\u0000t\u0000o\u0000r\u0000y\u0000 \u0000w\u0000a\u0000s\u0000 \u0000r\u0000e\u0000g\u0000i\u0000s\u0000t\u0000e\u0000r\u0000e\u0000d\u0000 \u0000a\u0000s\u0000\n\u0000h\u0000a\u0000l\u0000a\u0000l\u0000 \u0000b\u0000e\u0000c\u0000a\u0000u\u0000s\u0000e\u0000 \u0000w\u0000e \u0019\u0000r\u0000e\u0000 \u0000s\u0000e\u0000e\u0000i\u0000n\u0000g\u0000 \u0000h\u0000o\u0000w\u0000 \u0000t\u0000h\u0000e\u0000\n\u0000g\u0000l\u0000o\u0000b\u0000a\u0000l\u0000 \u0000h\u0000a\u0000l\u0000a\u0000l\u0000 \u0000m\u0000a\u0000r\u0000k\u0000e\u0000t\u0000 \u0000i\u0000s\u0000 \u0000g\u0000e\u0000t\u0000t\u0000i\u0000n\u0000g\u0000 \u0000l\u0000a\u0000r\u0000g\u0000e\u0000r\u0000.\u0000\n\u0000B\u0000e\u0000i\u0000n\u0000g\u0000 \u0000h\u0000a\u0000l\u0000a\u0000l\u0000-\u0000c\u0000e\u0000r\u0000t\u0000i\u0000f\u0000i\u0000e\u0000d\u0000,\u0000 \u0000w\u0000e\u0000 \u0000c\u0000a\u0000n\u0000 \u0000s\u0000e\u0000l\u0000l\u0000 \u0000t\u0000o\u0000\n\u0000h\u0000a\u0000l\u0000a\u0000l\u0000 \u0000a\u0000n\u0000d\u0000 \u0000n\u0000o\u0000n\u0000-\u0000h\u0000a\u0000l\u0000a\u0000l\u0000 \u0000m\u0000a\u0000r\u0000k\u0000e\u0000t\u0000s\u0000,\u0000 \u0000m\u0000a\u0000k\u0000i\u0000n\u0000g\u0000\n\u0000o\u0000u\u0000r\u0000 \u0000b\u0000u\u0000s\u0000i\u0000n\u0000e\u0000s\u0000s\u0000 \u0000m\u0000o\u0000r\u0000e\u0000 \u0000c\u0000o\u0000m\u0000p\u0000l\u0000e\u0000t\u0000e\u0000.\n\u0000\nWilliam Tan, managing director,\nHock Lian Huat Foodstuff Industry\n\u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/\n\u0000T\u0000h\u0000e\u0000r\u0000e \u0019\u0000s\u0000 \u0000a\u0000 \u0000h\u0000u\u0000g\u0000e\u0000 \u0000c\u0000h\u0000u\u0000n\u0000k\u0000 \u0000o\u0000f\u0000 \u0000y\u0000o\u0000u\u0000n\u0000g\u0000\n\u0000a\u0000d\u0000u\u0000l\u0000t\u0000s\u0000 \u0000a\u0000n\u0000d\u0000 \u0000t\u0000e\u0000e\u0000n\u0000a\u0000g\u0000e\u0000r\u0000s\u0000 \u0000t\u0000h\u0000a\u0000t\u0000 \u0000i\u0000s\u0000 \u0000g\u0000r\u0000o\u0000w\u0000i\u0000n\u0000g\u0000\n\u0000a\u0000t\u0000 \u0000t\u0000h\u0000i\u0000s\u0000 \u0000p\u0000o\u0000i\u0000n\u0000t\u0000 \u0000i\u0000n\u0000 \u0000t\u0000i\u0000m\u0000e\u0000.\u0000 \u0000T\u0000h\u0000e\u0000y\u0000 \u0000a\u0000r\u0000e\u0000 \u0000a\u0000 \u0000b\u0000i\u0000t\u0000\n\u0000m\u0000o\u0000r\u0000e\u0000 \u0000s\u0000o\u0000p\u0000h\u0000i\u0000s\u0000t\u0000i\u0000c\u0000a\u0000t\u0000e\u0000d\u0000  \u0013\u0000 \u0000t\u0000h\u0000e\u0000y\u0000 \u0000a\u0000r\u0000e\u0000\n\u0000c\u0000o\u0000n\u0000n\u0000e\u0000c\u0000t\u0000e\u0000d\u0000 \u0000d\u0000i\u0000g\u0000i\u0000t\u0000a\u0000l\u0000l\u0000y\u0000 \u0000a\u0000s\u0000 \u0000w\u0000e\u0000l\u0000l\u0000  \u0013\u0000 \u0000s\u0000o\u0000 \u0000w\u0000e\u0000\n\u0000r\u0000e\u0000a\u0000l\u0000l\u0000y\u0000 \u0000n\u0000e\u0000e\u0000d\u0000 \u0000t\u0000o\u0000 \u0000c\u0000a\u0000t\u0000e\u0000r\u0000 \u0000t\u0000o\u0000 \u0000t\u0000h\u0000i\u0000s\u0000 \u0000g\u0000r\u0000o\u0000u\u0000p\u0000.\nHeikal Gani, serial entrepreneur, who recently launched an\nall-pink Moroccan-themed cafe in Siglap\n\u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/\n\u0000M\u0000o\u0000r\u0000e\u0000 \u0000a\u0000n\u0000d\u0000\n\u0000m\u0000o\u0000r\u0000e\u0000,\u0000 \u0000w\u0000e \u0019\u0000r\u0000e\u0000\n\u0000s\u0000e\u0000e\u0000i\u0000n\u0000g\u0000 \u0000t\u0000h\u0000a\u0000t\u0000\n\u0000i\u0000n\u0000v\u0000e\u0000s\u0000t\u0000o\u0000r\u0000s\u0000 \u0000a\u0000r\u0000e\u0000\n\u0000s\u0000t\u0000a\u0000r\u0000t\u0000i\u0000n\u0000g\u0000 \u0000t\u0000o\u0000\n\u0000r\u0000e\u0000a\u0000l\u0000i\u0000s\u0000e\u0000 \u0000t\u0000h\u0000a\u0000t\u0000\n\u0000t\u0000h\u0000e\u0000 \u0000I\u0000s\u0000l\u0000a\u0000m\u0000i\u0000c\u0000\n\u0000c\u0000o\u0000m\u0000m\u0000u\u0000n\u0000i\u0000t\u0000y\u0000 \u0000i\u0000s\u0000\n\u0000u\u0000n\u0000d\u0000e\u0000r\u0000s\u0000e\u0000r\u0000v\u0000e\u0000d\u0000.\nFara Abdullah,\nmanaging director\nof Singapore-based\nmobile app startup\nBitsMedia\n\u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/Source: The Business Times (c) Singapore Press Holdings Limited. Reproduced with permission.\nBut Mr Peyyeti says that while halal services re-\nmain “nascent”, Singapore is “very well placed” for\nthe knowledge economy, even if actual produc-\ntion is clustered elsewhere.\nThat is as the SGIE report ranked Singapore in\nthird place worldwide for Islamic media and recre-\nation, and ninth for Muslim-friendly travel.\nSingapore’s best-known digital export for the\nglobal Islamic market may be popular mobile app\nMuslim Pro. From local prayer times and the direc-\ntion of Mecca, Bits Media is now branching out to\nmore community features, such as playlists of\nscriptural verses and group Quranic reading and\nrecitation launched in time for the month of Ra-\nmadan.\nDespite news outlet Vice Media’s allegations\nlast year that user location data might have been\nsold to the United States military by a third-party\ndata broker, Ms Fara, the managing director,\nnotes that the app has some 100 million down-\nloads.\nCiting ongoing investigations by Singapore’s\nprivacy watchdog, she declined to go into details\non the impact of the report. But “it’s made us\nstronger and better equipped to handle issues\nlike privacy”, she says.\nAnother digital player is business-to-business\n(B2B) startup CollabDeen, which was founded in\n2019 to offer Internet-based communication plat-\nform and social media workspace.\nDespite the Muslim branding, co-founder and\nCEO Fateh Ali suggested the platform could be re-\npackaged as a white-label product for churches or\ncommunity organisations too.\nMs Emil from Euromonitor notes that “a strong\nemphasis on traceability in food these days” ex-\ntends to the halal market.\nTwo-year-old startup OneAgrix, a halal B2B\nagri-food trade platform, was set up to plug this\ngap, said founder Diana Sabrain.\n“If you talk about the other competitors, none\nof them have traceability – we do,” she said of B2B\nmarketplaces. “This is what differentiates us from\nthe very beginning.”Granted, some services firms have been\nrattled by the Covid-19 downturn, such as online\nmedia outlet Have Halal, Will Travel, which covers\nregional tourism options.\nBut co-founder Mikhail Goh tells The Business\nTimes  (BT) that revenue has held steady with a di-\nversification in virtual events, such as Chinese\nNew Year and Hari Raya bazaars, as well as collab-\norations with partners “which we never thought\nof working with previously”, such as car brands\nand banks.\nMeanwhile, he is also committed to retaining\nthe brand’s core travel focus and its markets in\nSingapore, Malaysia and Indonesia – while “going\ndown the ranks” from middle- and high-income\nurbanites into other, less affluent consumer seg-\nments.\n\u0000W\u0000o\u0000r\u0000l\u0000d \u0019\u0000s\u0000 \u0000t\u0000h\u0000e\u0000i\u0000r\u0000 \u0000o\u0000y\u0000s\u0000t\u0000e\u0000r\nCompanies are not heading overseas just for new\ncustomers.\nOneAgrix sought angel investors abroad, as it\nwas harder to fund-raise here, says Ms Diana: “It\nwould help if they keep an open mind, that halal\ncan go global and is not just about marketplaces.\nAnd if that changes, it would be easier for us halal\neconomy startups to fund-raise.”But that could be changing.\nSays Mr Peyyeti: “There is clearly interest and\npush by the government towards investment in Is-\nlamic sectors, but so far we are seeing investment\nbeing driven by the private sector.”\nHe cites a strategic tie-up between Elite Part-\nners Capital and the Singapore Malay Chamber of\nCommerce and Industry, as well as seed funding\nfor startups like WhatsHalal.\nAt the same time, Singapore firms have cast a\nwide net internationally.\nSome local businesses prefer to stay in Singa-\npore to enjoy home-ground advantage where cli-\nents have stronger purchasing power, Mr Fateh\ntells BT. But he urged them to look beyond even\nSouth-east Asia, as “Asia is really going to be that\nsuperpower for the global Islamic economy”.\nSimilarly, Bits Media has identified Central and\nSouth Asia as emerging markets for expansion,\nafter capturing Muslim-majority countries Indone-\nsia and Malaysia.\nMeanwhile, HLH’s Mr Tan observes that Singa-\npore manufacturers may have to contend with\nlower-cost production overseas, “so we are doing\nmore premium products, and we may have to go\na little further – markets such as Australia or\nDubai, where they have more spending power”.\nStill, there is a limit to the halal market. Minis-\nter-in-charge of Muslim Affairs Masagos Zulkifli\nnoted this month that the Muslim community\nhere “must be careful not to go overboard” in halal\nobservance.\n“In some countries, halal practices have been\nextended to non-consumable products like refri-\ngerators, slippers, diapers and pet food. These\ntrends are usually motivated by business rather\nthan religious imperatives, and reduce the com-\nmon space that Muslims share with the rest of the\nsociety,” he said at the Muis annual workplan sem-\ninar in May.\nProf Siti notes consumer education is needed –\nso buyers are more aware that not all products\nand services need certification.\n\u0000W\u0000h\u0000i\u0000l\u0000e\u0000 \u0000m\u0000a\u0000r\u0000k\u0000e\u0000t\u0000s\u0000\n\u0000w\u0000e\u0000 \u0000a\u0000r\u0000e\u0000 \u0000i\u0000n\u0000 \u0000d\u0000o\u0000\n\u0000n\u0000o\u0000t\u0000 \u0000m\u0000a\u0000k\u0000e\u0000 \u0000i\u0000t\u0000\n\u0000m\u0000a\u0000n\u0000d\u0000a\u0000t\u0000o\u0000r\u0000y\u0000 \u0000f\u0000o\u0000r\u0000\n\u0000o\u0000u\u0000r\u0000 \u0000p\u0000r\u0000o\u0000d\u0000u\u0000c\u0000t\u0000s\u0000\n\u0000t\u0000o\u0000 \u0000b\u0000e\u0000 \u0000h\u0000a\u0000l\u0000a\u0000l\u0000-\u0000\n\u0000c\u0000e\u0000r\u0000t\u0000i\u0000f\u0000i\u0000e\u0000d\u0000,\u0000 \u0000w\u0000e\u0000\n\u0000u\u0000n\u0000d\u0000e\u0000r\u0000s\u0000t\u0000a\u0000n\u0000d\u0000\n\u0000t\u0000h\u0000a\u0000t\u0000 \u0000t\u0000h\u0000e\u0000r\u0000e\u0000 \u0000i\u0000s\u0000\n\u0000a\u0000 \u0000g\u0000r\u0000e\u0000a\u0000t\u0000e\u0000r\u0000\n\u0000a\u0000p\u0000p\u0000r\u0000e\u0000c\u0000i\u0000a\u0000t\u0000i\u0000o\u0000n\u0000\n\u0000f\u0000r\u0000o\u0000m\u0000 \u0000t\u0000h\u0000e\u0000\n\u0000m\u0000a\u0000r\u0000k\u0000e\u0000t\u0000 \u0000i\u0000f\u0000 \u0000t\u0000h\u0000e\u0000y\u0000\n\u0000a\u0000r\u0000e\u0000 \u0000c\u0000e\u0000r\u0000t\u0000i\u0000f\u0000i\u0000e\u0000d\u0000.\nNerissa Low, founder,\nLiht Organics\n\u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/ \u0000/Top 15 Global Islamic Economy Top 10 Indicator Score (Rank By Sector) Indicator score breakdown for top 15 ranking countries\n1. Malaysia\n2. Saudi Arabia3. UAE4. Indonesia5. Jordan6. Bahrain7. Kuwait8. Pakistan9. Iran10. Qatar11. Oman12. Turkey13. Nigeria14. Sri Lanka\n15.SingaporeHalal\nfood\n1. Malaysia\n2. Singapore3. UAE4. Indonesia5. Turkey6. Iran7. South Africa8. Pakistan9. Brunei10. RussiaIslamic\nfinance\n1. Malaysia\n2. Saudi Arabia3. UAE4. Jordan5. Bahrain6. Indonesia7. Kuwait8. Pakistan9. Qatar10. NigeriaMuslim-\nfriendly travel\n1. Malaysia\n2. UAE3. Turkey4. Thailand5. Tunisia6. Indonesia7. Azerbaijan8. Jordan9. Singapore10. Albania\nModest\nfashion\n1. UAE\n2. Turkey3. Indonesia4. Malaysia5. Spain6. Italy7. Bangladesh8. Canada9. France10. IranPharma &\ncosmetics\n1. Malaysia\n2. UAE3. Singapore4. Iran5. Egypt6. Indonesia7. France8. South Africa9. Turkey10. TunisiaMedia &\nrecreation\n1. UAE\n2. Malaysia3. Singapore4. United Kingdom5. Indonesia6. Brunei7. Bahrain8. Lebanon9. Kuwait10. Netherlands\nGlobal Islamic Economy at a glance\n290.2\n155.1133.0\n91.288.186.973.370.964.063.160.055.953.149.247.4389.0234.2142.5111.6124.6121.9\n99.291.174.080.173.449.976.666.616.998.336.878.345.343.331.927.123.628.836.733.262.714.113.342.643.722.1\n235.6\n57.918.516.717.530.633.520.328.775.119.826.230.680.233.472.147.539.133.533.332.555.932.133.543.321.620.162.959.934.7\n125.3\n43.631.642.340.812.926.640.235.334.616.718.446.8209.8\n51.1\n104.4\n71.539.642.242.254.760.544.347.170.720.727.3\n125.2\nSource: State Of The Global Islamic Economy Report 2020/21GIEI Halal\nfoodIslamic\nfinanceMuslim-\nfriendly\ntravelModest\nfashionPharma &\ncosmeticsMedia &\nrecreation\n1. Malaysia\n2. Saudi Arabia3. UAE4. Indonesia5. Jordan6. Bahrain7. Kuwait8. Pakistan9. Iran10. Qatar11. Oman12. Turkey13. Nigeria14. Sri Lanka15. SingaporeSource: The Business Times (c) Singapore Press Holdings Limited. Reproduced with permission."
}