{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-08/Master%20of%20Science%20in%20AE-%20Module%20Details.pdf",
  "type": "pdf",
  "content": "1\nMaster  of Science  in Aerospace  Engineering\nAll modules  carry  5 ECTS  Credits  each.\nCOMPULSORY  MODULES\n1) Introduction to Aeronautics\nThis module will provide a basic overview of the different systems and processes applied in aviation.\nA general understanding of civil and military aviation will be given to enable basic differentiation of\ndifferent aircraft configurational layouts. In particular, the interaction among different system\nelements, their respective requirements and their impact on conf iguration level will be outlined.\nHours:  45 / Semester:  1\n2) Mechanics for Aerospace Engineers\nMechanics addresses the description and predetermination of the movements of bodies and their\ncorresponding forces. Bodies at rest as a sub -field of mechanics are described in (elasto -)statics, the\nfundamentals of which are taught in this module. After successful participation, students are able to\nrecognize static load -bearing structures in nature and technology and can extract mechanical models\nfrom reality, classify them in terms of analysis and calculate statically determinate as well as\nstatically indeterminate systems using the methods they have learned. The basic methods learned\ncontribute to the development of the ability to formulate mechanical  issues in engineering problems\nand to solve them independently.\nHours:  45 / Semester:  1\nCORE  MODULES\n3) Aerodynamics\nThe module Aerodynamics deals with the basics of calculation and analysis of aerodynamic forces\nacting on aircraft.\nHours:  45 / Semester:  1\n4) Introduction to Flight Mechanics\nThis module will cover topics in flight system dynamics and flight control. Students will be able to\nunderstand relations between aircraft performance and flight control. Through this course, students\nwill be able to apply aircraft performance calculations that are required in the preliminary design of\naircraft and will be able to design basic flight controllers for stabilisation and improvement of flight\nproperties.\nHours:  45 / Semester:  1\n2\n5) Flight Propulsion\nThe module provides basic knowledge about aerospace propulsion systems. The basic governing\nthermodynamic & aerodynamic equations used in the engine design process, Aero engine and gas\nturbine cycle and component performance as well as their interaction wi ll be covered.\nHours:  45 / Semester:  1\n6) Structures and Materials\nThis module covers the essentials of lightweight structures & materials, which provide a basis for\nstructural development including proper material selection. A general view on the basics in\nelasticity, structural stability, vibrations and strength includi ng fatigue problems are given. Design,\nnumerical analysis and test methods are introduced. On the materials side, metal lightweight alloys\nand fiber composites are covered.\nHours:  45 / Semester:  1\nLABORATORY  MODULES\n7) MATLAB Aero Lab\nMATLAB & Simulink for Flight Dynamics & Controls\nEmbark on an exploration of MATLAB and Simulink in the dynamic field of aerospace engineering\nwith the MATLAB Aero Labs course. This comprehensive module is designed to arm you with the\nfundamental skills and advanced techniques essential for modeling, sim ulation, and control in\naerospace applications. Through a hands -on approach, you’ll delve into MATLAB and Simulink\ntoolboxes, discovering their vast capabilities in simulation, system analysis, optimization, and control\ndesign. The course begins with gener al exercises that introduce you to the breadth of tools and\nfunctions available. This foundation will enable you to tackle more complex problems and algorithms\nconfidently. As the course progresses, you’ll engage in specialized exercises that focus on aero space -\nspecific challenges, particularly in flight system dynamics and flight control systems. These exercises\nare tailored to provide a deeper understanding of how MATLAB and Simulink can be leveraged to\nenhance innovation and efficiency in aerospace engin eering tasks. In engineering, proficiency in\nMATLAB and Simulink is essential. From startups to major companies, these tools are the backbone\nof designing control systems, modeling systems, and analyzing dynamics across various engineering\nfields. Masterin g them is essential not only for future aerospace engineers but for any engineer who\naims to contribute in the domain of modelling, system analysis and control.\nHours:  45 / Semester:  2\n8) Structural Modelling Lab\nThe course demonstrates the use of common Finite Element software tools using typical examples\nfrom the field of aerospace structures. The most important basics of FEM, and modelling aspects will\nbe covered. Typical questions in the structural calculation from the areas of statics and dynamics\nserve as examples. With the knowledge gained, aeronautical structures can be modelled, analysed\nand evaluated with regard to their characteristics.\nHours:  45 / Semester:  2\n9) Aerodynamic Modelling Lab\nThe course provides an introduction to  fluid dynamics modelling for aerospace applications. After\nsuccessful participation, students are able to understand different models and methods available in\n3\ncurrent flow simulation tools. The set -up and execution of flow simulations as well as the analysis\nand evaluation of the results are discussed. Upon successful completion, participants will be able to\nanalyse and evaluate aerodynamic properties, such as f orces and pressure distributions, as required\nin the aircraft design process.\nHours:  22.5 /  Semester:  2\nELECTIVE MODULES*\n10) Additive Manufacturing\nThe module is an introduction to additive manufacturing and focuses on additive manufacturing\ntechnologies for both polymers and metals. The entire process chain of additive manufacturing is\ndiscussed, including feedstock materials, part design, production processes, monitoring, post -\nprocesses, and standardization. The module is enriched by a  hands -on printing  exercise , exemplary\napplications, expert talks from industry, and field trips.\nLecturers:  Prof. Dr. Peter Mayr /  Hours:  45 / Semester:  2-310) Advanced Flight Control Systems\nThis module  conveys  complex  control  concepts  for aircraft.  How  the C*-criterion  is derived  and\nmodern  concepts  of adaptive  control  in aviation  are covered.\nHours:  45 / Semester:  2-3\n11) Advanced Fight Control Systems\nThis module conveys complex control concepts for aircraft. How the C* -criterion is derived and\nmodern concepts of adaptive control in aviation are covered.\nHours:  45 / Semester:  2-3\n12) Aerodynamic Design of Turbomachinery\nThis module covers the various types of turbomachinery applications with particular emphasis on\ncompressors. Starting from the fundamental equations in fluid dynamics, the working principle of\nturbomachinery are derived. Moreover, main components, characte ristics and associated flow\nphenomena are explained. For compressors, design methods and processes, topics of operability\nand stability enhancement are covered.\nHours:  45 / Semester:  2-3\n13) Aeroelasticity\nThis module describes basic aeroelastic phenomena arising from the mutual interaction of elastic,\naerodynamic and inertial forces on a structure, with special emphasis on problems related to fixed\nwing vehicles. Aeroelasticity plays a major role in the design, qualification and certification of flying\nvehicles, as it contributes to the definition of the flight envelope and affects various performance\nindicators.\nHours:  45 / Semester:  2-3\n14) Aerospace Structures\nThis module introduces the approaches for the development process of lightweight and aerospace\nstructures, including design, simulation, optimisation and testing aspects. Current structural design\n4\nconcepts for aerospace applications are shown in the context of goals and requirements to be\nachieved. Possible future developments are addressed and reasons are discussed.\nHours:  45 / Semester:  2-3\n15) Aircraft Design\nThis module covers various current design methods & relevant design tools for the applied design of\nsurface aircraft. With the simultaneous introduction to the aircraft design system, students are\nenabled to design both individual components of the aircraf t with regard to the overall aircraft, and\ndefine the overall aircraft configuration so that it complies with the current requirements with\nregard to safety, safety and security economy, comfort, the environment and the performance of\nflights.\nHours:  45 / Semester:  2-3\n16) Boundary Layer Theory\nThis module covers basic phenomenons present in boundary -layers. Physical models and the\nderivation of the boundary -layer equations from the Navier -Stokes equations are discussed for flat\n2-dimensional cases. Temperature, compressible and 3 -dimensional bou ndary -layers are explained.\nThe stability theory explains the laminar -turbulent transition, turbulent boundary -layers and\nexperimental research methods.\nHours:  45 / Semester:  2-3\n17) Flight Control Systems\nThis module introduces the basic operating principle of flight controls. Based on the non -linear\nequations of motion of airplanes and basic control theory principles, control strategies are derived in\norder to improve the handling qualities or stability of  airplanes. In addition, strategies for the\nimplementation of autopilots are presented.\nHours:  45 / Semester:  2-3\n18) Helicopter Engineering\nThe content extends over different design requirements and their classification, the sizing process,\nevaluating the flight performance with respect to power consumption, rotor craft limits and mission\ndesign. Additionally, the lecture will cover tools for the cost and weight estimation of the designed\nrotorcraft.\nHours:  45 / Semester:  2-3\n19) Safety and Certification of Aircraft\nThis module covers Aviation Safety Principles, Basics in Regulations, Airworthiness Code (CS -27, CS -\n29), Loads, Stress & Fatigue, Performance Categories, Safety Analysis & Flight Accident Investigation.\nDuring the presentation of the basic chapters of flig ht safety and certification the students have the\npossibility to discuss the important aspects together with the professor. The module covers\nfollowing chapters such as Aviation Safety Principles, Basics in Regulations Airworthiness Code (CS -\n27, CS -29), Lo ads, Stress and Fatigue, Performance Categories, Safety Analysis, and Flight Accident\nInvestigation.\nHours:  45 / Semester:  2-3\n5\n20) Safety & Certification of Avionics & Flight Control Systems\nThis module addresses the certification process of avionics and flight control systems in commercial\naviation. The focus of this lecture lies in safety analysis methods, taking common approaches of their\nemployment in development projects of safety -critical systems in the industry into account. The\ncourse begins with giving a general overview of the development and certification of flight control\nsystems, along with the contents of relevant development standards and recommended practices\nand the resulting process structure. Based on  this, profound knowledge of the process and methods\nof safety assessment of complex technical systems in aircraft is conveyed.\nHours:  45 / Semester:  2-3\n21) Spacecraft Technology\nThis module covers astronautical and space engineering topics, and relevant theoretical background\nand engineering design methods to find suitable solutions for spaceflight and spaceflight technology.\nThe module will be following the processes and technologies from launch (physics of spaceflight,\nrockets, propulsion, traj ectory, spaceflight environment) to orbit with topics in physics (orbital\nmechanics and dynamics, interplanetary flight, navigation) and engineering subsystem technologies\n(power, thermal, communication, sensors, actuators). The topics and processes will b e presented\nwith practical applications in mind.\nHours:  45 / Semester:  2-3"
}