{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/For%20SITizens%2C%20By%20SITizens.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  07/12\nSIT faculty and staff taking time off their busy schedules to support the SIT Bursary.\nSITizens going for the special otak otak-youtiao sandwich,\nwhich was created just for the SIT Bursary roadshow.\nSIT Bursary recipients get a chance to interact with\nProf Tan Thiam Soon, President, SIT (fourth from right).\nSITizens making full use of the opportunity to mingle.\nBrewing support for the SIT Bursary programme.It was a meeting of hearts – and a generous sharing of ﬁ  nancial resources –\nas faculty members and staff of the Singapore Institute of Technology (SIT) gathered on a beautiful Thursday morning at SIT@Dover to mingle with SIT Bursary recipients.\nThey had turned up at the University Tower foyer at SIT@Dover for the third\nFaculty & Staff Giving roadshow, which was held on 28 July 2016 in support of the SIT Bursary. And as they met, it was evident that faculty and staff attendees were very pleased at how these bursaries were helping to nurture the bursary recipients.\n“I am glad that these bursaries are helping our needy students to continue\ntheir studies without which they may have to work part-time or quit school altogether,” said Assoc Prof Malcolm Low Yoke Hean, who is also Programme Director, Infocomm Technology.\nIntroduced in November 2015, the Faculty & Staff Giving initiative provides\nan opportunity for SIT faculty and staff to invest in the future of ﬁ  nancially\ndisadvantaged students by supporting the SIT Bursary – in other words, it is an initiative that is for SITizens, by SITizens.\nLast year, thanks to collective gifts made by SIT faculty and staff (and many\nof these were made as recurrent gifts through monthly payroll deductions), the University was able to award an additional 18 SIT Bursaries for deserving students in Academic Year 2015/16. Valued at $3,000 each, this is a bursary that is applicable to students (Singapore Citizens and Permanent Residents) who come from households with a per capita income of no more than $850.\nOne of the most accessible student ﬁ  nancial aid instruments made available at\nSIT, the SIT Bursary can help cover some of the recipient’s academic expenses, which range from $13,380 to $28,250 (taking the example of a Singaporean student paying subsidised fees) in the current Academic Year of 2016/17. Every gift is invaluable, as the latest statistics for AY 2016/17 show that 47% of students at SIT would require ﬁ  nancial aid.\nMr Khaleef Mun Seng, a second-year student from the Information and\nCommunications Technology (Software Engineering) programme, received the SIT Bursary in AY 2015/16. He said, “The bursary allowed me to focus on my studies without having to worry about school fees and daily expenses. It was a great help.”\nAlso supporting the initiative was alumnus Ms Sharlene Sou, a graduate of\nthe Bachelor of Science degree in Hotel Administration (University of Nevada, Las Vegas) in 2013. She runs the CoffeeSou coffee catering business and as in the ﬁ  rst roadshow, was on hand\nto provide a steady ﬂ  ow of piping-\nhot coffee and tea that went down well with the youtiao and otak-otak “sandwich” that was specially created for the roadshow.\nThe bursary recipients were touched\nby the friendliness and generosity of the faculty and staff at the Roadshow. Ms Victoria Goh, who is in her second year in the Bachelor of Accountancy (Hons) programme, said, “They were really concerned about my welfare and even provided advice on how I could manage my studies. They were also most willing to share their learning experiences and provided me with much encouragement.”\nFaculty and staff gather to support SIT Bursary over a light breakfast shared with bursary recipientsFor SITizens, by SITizens!"
}