{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/More%20Than%20a%20Recognition%20of%20Excellence.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  08/16 SiTIZEN  |  09/16\nMore Than A Recognition of Excellence\nThe message to close to 540 attendees at the annual Recognition of Excellence presentation: an award doesn’t just recognise great student performance – it is also a token of the faith that\nphilanthropic partners have placed in SIT’s young SITizens\nScholarship recipients and members of SIT Senior Management pose together at the Recognition of\nExcellence ceremony.\nThe Ngee Ann Kongsi Scholarship recipients with Mr Yeo Boon Hon (back row, third from left), Vice Chairman, Education Sub Committee,\nThe Ngee Ann Kongsi.\nProf Loh Han Tong, Deputy President (Academic)\n& Provost, SIT, presenting the RSA Book Prize in\nOperations Security & Incident Management to\nMs Tan Li Ying.EnGro Scholarship recipients with Mr Vincent Loh, Manager, Knowledge Management, EnGro Corporation Ltd (extreme left), Mr Soon Sze Meng, Member, Board of Trustees, SIT (third from left), Prof Tan Thiam Soon, President, SIT and Mr Tan Cheng Gay, Chairman, EnGro Corporation Ltd (fifth and sixth from left respectively).A proud moment for the Tan Sri (Dr) Tan Chin Tuan Scholarship recipients with Ms Yap\nSu-Yin, CEO (extreme right), and Ms Angeline Kwong, Manager (extreme left), of the\nTan Chin Tuan Foundation.Close to 540 guests and recipients attended the ROE presentation this year.Scholarship and book prize recipients (from left) Ms Evangeline\nTan Si Hui, Ms Janelle Tan Jia En and Mr Lewis Tan Ping Jin\nsharing memorable moments in their ongoing SIT journey to the\ndonors, and how the awards they received have motivated them in their pursuits.\nDr Reto Callegari (left), Treasurer, Rotary Club of Bugis Junction (RCBJ) and\nMs Vanisa Lee (third from left), together with Rotary Club of Bugis Junction\nOutstanding Student Award recipient, Ms Kilice Ng, and Rotary Club of Bugis Junction Scholarship recipient Mr Lee Jung Wei.\nBaker Tilly TFW Scholarship recipient, Mr Muhammad Danial Hadi Bin Zainuddin (second from right) with his family members and Prof Yaacob Ibrahim, Advisor, SIT (extreme right). The year 2018 has been especially good\nfor SIT’s students, who have received overwhelming support and encouragement from SIT’s donors.\nSIT’s Recognition of Excellence (ROE)\npresentation celebrates the achievements of high-performing students. At this year’s ROE, which was held at the SIT@Dover\nAuditorium on 1 November 2018, these\nSITizens received their donor-supported\nawards and scholarships in the presence of their loved ones, faculty and staff, SIT’s\nfriends from the industry as well as the\ndonors themselves. A total of 59 Book\nPrizes, Awards and Gold Medals, and 134\nThe Four Seasons Hotel Book Prize in Fundamentals of Hospitality Business recipient,\nMr Sky Quah (left), enjoying the post-ceremony reception with guests from Four Seasons\nHotel Singapore (from left): Ms Audrey Chin, Director of People and Culture; Ms Karene\nLim, Learning Manager; and Mr Richmond Kok, Asst Director of People and Culture.\nMr Sam Chew, Senior Manager, Centre for Strategic Infocomm Technologies, viewing a special sensory exhibit at the ceremony. The exhibit contained\nheartfelt thank you videos and messages from the award recipients.\nMr Tay Thiam Peng, Head, Special Projects, Wilmar International, (third from\nright) speak to recipients of both the KKH and Wilmar Scholarships together\nwith Mr Chan Wing Leong, Deputy President (Administration) & CFO (third\nfrom left).\nnon-bonded scholarships were presented, more than twice the\nnumber presented at last year’s ROE.\nIn his welcoming remarks, Prof Loh Han Tong, Deputy President\n(Academic) & Provost, SIT, said to the recipients, “When you go on stage today, you will be receiving more than a prize or a scholarship; you will also become the custodian of our donors’ shared hopes – that from being excellent yourself, you will then go on to become a multiplier of ability and excellence in the community. Hence,\nI hope you will treasure what you receive today, and aspire to paying it forward in whichever way you can – with your know-how, your influence, or your resources.”\nProf Tan Thiam Soon, President, SIT, talked about how the gifts of\nSIT donors have helped to build a cycle of positive relationships.\n“For our award and scholarship recipients who are here today, their\nrelationship with the community begins sweetly with them being\nat the receiving end of generous support from you – our donors.\nI know they are all looking forward to meeting and thanking you in just a little while.”\nHe said he hoped that this recognition would inspire the recipients\n“to seek excellence throughout life”, adding, “Whether you are a first-year student receiving a scholarship or an award recipient who has just completed your studies, you will remain a SITizen Mr Lewis Tan, second-year Sustainable Infrastructure Engineering\n(Land) student who received the Tan Sri (Dr) Tan Chin Tuan Scholarship, is one of the first students from SIT to win a medal at the WorldSkills Singapore Competition. He said the scholarship has inspired him to achieve more than he ever thought he could. “I would like to express my sincere gratitude to my donors from the Tan Chin Tuan Foundation. Your generosity has inspired me to go even further from my current point in SIT. The reason why I am here today is not because of my success but because of my countless failures I had to go through and the support I had received from the people around me. I’d also like to express my thanks to all the donors whose encouragement has helped inspire students in SIT to reach greater heights in future.”\nfor life and it is my hope\nthat you continue to do us proud.”"
}