{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Recognising_Excellence_at_SIT.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  07/12 SiTIZEN  |  06/12\nFirst-ever event brings together talented SITizens and generous donors, in an intimate celebration of\nstudent achievement and thoughtful philanthropy to support excellence awards at SITRecognising Excellence at SIT\nIn a ﬁ  rst at the Singapore Institute\nof Technology (SIT), 23 awards were presented at the Recognition of Excellence, a new platform created to recognise the excellence of its students and to honour the donors whose generosity had made possible these awards at SIT.\nTaking place on Friday, 16 October\n2015, at the SIT@Dover campus, the special occasion drew more than 120 guests. Mr Ng Yat Chung, Chairman, SIT, presented the awards and among the attendees were members of SIT’s Board of Trustees, SIT Senior Management, representatives from SIT’s Overseas University partners, the award recipients and their loved ones, as well as the University’s donors and friends. SIT students from various\ndegree programmes were on hand to play host to the guests.\nProf Loh Han Tong, Deputy President\n(Academic) & Provost, SIT, said in his welcome address, “We are very proud of all the award recipients ... and this pride I believe belongs equally to their families, and to the private and corporate donors whose collective generosity has made it possible for SIT to establish these 23 book prizes, outstanding student awards and gold medals. On behalf of SIT, I would like to express our grateful appreciation for their philanthropic dedication to promote student excellence.”\nBook Prizes are awarded to students\nwith the highest grade in a particular module. Outstanding Student Awards recognise students who not only do well academically, but have also made contributions to SIT or the community, while Gold Medals are awarded to the top scoring students in their respective degree programmes.\nMr Fou Zi Xuan, who received the most\nnumber of donor-supported awards (the Sembcorp Marine Book Prize in Naval Architecture II, the Sembcorp Marine Book Prize in Ship Design,the Choo Chiau Beng Outstanding Student Award in Naval Architecture and the ST Engineering Gold Medal) and Mr Wong Kai Xian, who received\nthe Rotary Club of Bugis Junction Outstanding Student Award, jointly delivered some words of appreciation to the donors.\nIn his closing remarks, Prof\nTan Thiam Soon, President, SIT, said,\n“I would like to highlight just how important a sense of community is to SIT, and how grateful we are to have the support of a community of friends – our Overseas University Partners, industry and, last though certainly not least, our community of generous donors. Without your involvement, it will be impossible for us to fully realise the SIT dream.”\nDuring the reception that followed,\nguests were entertained by Muzeka, SIT’s student band, and the award winners got a chance to personally thank the donors of their awards.\nMr Sng Guan Kian Ernest was an award\nrecipient who managed to meet with his donor, Mr Gary Lee, Director, Zicom Group. He said, “As a recipient of the Zicom Group Outstanding Student Award in Mechatronics I am ever grateful for SIT and Zicom Group for this opportunity given to me. Having met Mr Lee, the Director for Zicom Group, I have gained an insight on what the industry is looking for and the opportunities that are offered.”\nAward recipients Mr Fou Zi Xuan (left) and Mr Wong Kai Xian (right), share their joy and appreciation at the\nRecognition of Excellence.Prof Loh Han Tong, Deputy President\n(Academic) & Provost, SIT, delivering his welcome remarks. Prof Tan Thiam Soon, President, SIT, (right) gets\nthe request for a selﬁ  e with Mr Kasem Chaisieng\n(middle), who received three awards, and his family. Recognising excellence – the award winners with SIT Senior Management and members of SIT’s Board of Trustees after the event.Mr Sng Guan Kian Ernest (right), recipient of the Zicom Group Outstanding Student\nAward in Mechatronics, got to meet Mr Gary Lee, Director, Zicom Group (left).The student band, Muzeka, entertained the guests with popular hits.\nSome of the recipients of the Sembcorp Marine Prizes had a chance to interact\nwith Ms Koh Guat Siew, Vice President, Human Resource Operations, Sembcorp Marine.\nProf Tan Thiam Soon, President, SIT, and the student hosts after the event.Mr Ng Yat Chung, Chairman, Board of Trustees, SIT (left) presenting the Singapore\nChemical Industry Council Book Prize in Process Safety to Mr Guan Shunfeng Justin (right).\nMs Nurfarahin Bt Mohd Zakaria (left), who received the Rotary Club of Jurong Town\nBook Prize in Care Pathways for Long-Term Conditions, was glad to be able toﬁ nd out more about the Rotary Club of Jurong Town from Mr Rodger Kimpton,\nPast President, Rotary Club of Jurong Town (right)."
}