{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/sit%20procurement%20portal%20-%20vendor%20manual_1.2.pdf",
  "type": "pdf",
  "content": "Vendor Manual\nSIT Procurement Portal\n17 February 2020\nVersion 1. 2\nPage 2 of 21\nUpdated on 13 Feb 2020\nContents\n1 Executive Summary  ................................ ................................ ................................ ....... 4\n2 General Features  ................................ ................................ ................................ ...........  4\n2.1 Navigation Bar  ................................ ................................ ................................ ........  4\n2.1.1  Overview  ................................ ................................ ................................ ..........  4\n2.1.2  Submitted Proposal ................................ ................................ ..........................  4\n2.1.3  New Proposal  ................................ ................................ ................................ .. 4\n2.1.4  Draft  ................................ ................................ ................................ .................  4\n2.1.5  Queries  ................................ ................................ ................................ ............  4\n2.1.6  Change Passwor d ................................ ................................ ...........................  4\n2.1.7  Login ID (V119834)  ................................ ................................ ..........................  4\n2.1.8  Log Out  ................................ ................................ ................................ ............  4\n2.1.9  Post-Tender Clarifications  ................................ ................................ ................  5\n3 Vendor Login  ................................ ................................ ................................ .................  5\n4 Vendor Profile Upd ate ................................ ................................ ................................ .... 5\n4.1 Adding More Contacts  ................................ ................................ ............................  6\n4.2 Edit Contact  ................................ ................................ ................................ ............  7\n4.3 Set a Contact as Main Contact  ................................ ................................ ...............  7\n5 Overview Page  ................................ ................................ ................................ ..............  8\n6 Site Briefing Registrants  ................................ ................................ ................................ . 9\n7 Submit New Proposal ................................ ................................ ................................ ... 10\n8 Resubmitting a Proposal  ................................ ................................ ..............................  11\n9 Edit Proposal Draft  ................................ ................................ ................................ ....... 11\n10 View Submitted Proposal  ................................ ................................ .........................  12\n11 Request to Extend Quotati on Validity  ................................ ................................ ....... 12\n12 Queries – Invitation to Quote  ................................ ................................ ....................  13\n13 Queries – Invitation to Tender  ................................ ................................ ..................  14\n14 Post-Tender Clarifications  ................................ ................................ ........................  16\n15 Change Password  ................................ ................................ ................................ .... 19\n16 Forgot Password  ................................ ................................ ................................ ...... 19\nPage 3 of 21\nUpdated on 13 Feb 2020\nRelease C hange Record\nVer Date  History  Author\n1.0 5 Sep 2014  First copy  Ronny Muliawan  - DC\n1.1 27 Oct 2014  Added new features  Rubenna Chang\n1.2 17 Feb 2017  Added new features  Rubenna Chang\nPage 4 of 21\nUpdated on 13 Feb 2020\n1 Executive Summary\nThis document details the Vendor  features for Procurement System Application Software\ndeveloped for Singapore Institute of Technology.\nThis document is applicable for Vendors who are invited to bid for  published ITQ s or ITT s.\n2 General  Features\n2.1 Navigation Bar\nThis section documents  the lin ks accessible  from the navigation bar.\n2.1.1  Overview\nClicking this menu link would lead you to the Overview  page.\n2.1.2  Submitted Proposal\nClicking this menu link would lead you to Submit ted Proposal  page.  This menu item will only\nbe visible once you have submitted a proposal for the Invitation to Quote or Tender.\n2.1.3  New Proposal\nClicking this menu link would lead you to Submit New Proposal  page .\n2.1.4  Draft\nClicking this menu link would lead you to Proposal Draft  page.  The number in the bubble\nfollowing the text indicates the number of drafts create d for the Invitation to Quote or Tender.\n2.1.5  Queries\nClicking this menu link would lead you to Queries  page.  This will only be applicable for\nInvitation to Quote. This will onl y be applicable for Invitation to Tender.\n2.1.6  Change Password\nClicking this menu link would lead you to Change Password  page.\n2.1.7  Login ID ( V119834 )\nClicking this menu link V119834  on the screenshot above) would lead you to Profile Update\npage.\n2.1.8  Log Out\nClicking this menu would log you out and lead you back to Vendor Login  page.\nPage 5 of 21\nUpdated on 13 Feb 2020\n2.1.9  Post-Tender Clarifications\nClicking this menu link would lead you to Post-Tender Clarifications  page. This menu item\nwill only be visible for Invitation to Tender and will not be visible for Invitation to Quote.  This\nmenu item will only  be visible after tender submission period ends.  The number in the bubble\nfollowing the text indicates the number clarifications sent by SIT .\n3 Vendor  Login\n1. On your browser, please type in the URL  (http://procurement.singaporetech.edu. sg) to\nSingapore Institute of Technology's  Procurement System. Alternatively, please follow\nthe link given on the invitation email  (\"here\" text highlighted on the screenshot below) .\n2. For Vendor ID field, please use your Vendor ID found in your invitation  email (the above\nscreenshot is just for reference) .\n3. For Password field, please use your  Password found in your invitation email (the above\nscreenshot is just for reference) . Please ens ure that no empty space is copied or it\nmight lead to authentication failure .\n4. If login is succes sful, you would  be redirected to profile update page.\n4 Vendor Profile Update\nThe Profile Update page contains the following important elements :\n1. Upon your first successful log in, y ou will be diverted to the Vendor Profile page where\nyou may edit your company's detail, such as Company Name.  If your company is a\nSingapore Registered Company, please prov ide the ACRA No . and indicate whether\nyour company is registere d with Comptroller of GST.  You may also make changes to\nthe contract persons. If you should add more contacts, all the listed contacts will be\nkept informed of\nPage 6 of 21\nUpdated on 13 Feb 2020\n2. You may  add more conta cts, up to 10 maximum contacts and  change the main contact\nperson  (covered in the next sub -section ). Ensure that all emails are correctly entered\nas important emails and reminders will be sent to the contacts' emails.\n4.1 Adding More Contacts\nThe foll owing  are the steps required to add more contacts:\n1. Fill up the Contact Person Name and email.\n2. Click Add More Contacts button.\n3. Repeat 1 and 2 until the limit of 10 contacts is reached.\n4. Click Save Changes to save the contacts.\nPage 7 of 21\nUpdated on 13 Feb 2020\n4.2 Edit Contact\nThe following are the steps required to  edit contacts:\n1. Click Edit button on the contact that you wish to edit.\n2. Edit the contact person name and email.\n3. Click Save.\n4. Click Save Changes to save the contacts.\n4.3 Set a Contact as Main Contact\nThe following are the steps required to set a contact as the main contact:\n1. Click the arrow on the Edit button (as highlighted on screenshot below)  and click on\n\"set as main contact\".\n2. Click Save Changes to save the contacts.\nPage 8 of 21\nUpdated on 13 Feb 2020\n5 Overview Page\nThe Overview page contains the fol lowing important elements:\n1. Invitation to Quote or Tender Details.\n2. Important dates such as Closing Date & Time and Query Submission End Date (for\nTenders).\n3. Site Briefing Details and Site Briefing Registrants.\n4. Invitation to Quote  (ITQ)  or Tender  (ITT)  documents.\n5. Published Corrigenda, if any.\nInvitation to Quote\nor Tender details\nImportant dates to note\nPage 9 of 21\nUpdated on 13 Feb 2020\n6 Site Briefing Registrants\nSite Briefing Registrants section will only be available if site briefing is compulsory .\nTenderers are required to register their personnel who will be attending the site briefing. The\nfollowing are the step s required to add registrants:\n1. Enter Name, Designation, Email and Contact No into the last row and click on “Add” at\nthe end of the row. Registrant will be added in to the row above . More than one\nregistrant can be added by repeating this action.\n2. Once all registrants have been added, click on “Save Registrants” to save the records.\nA pop-up will inform that the registrants are saved.\nSite briefing details will be shown if available\nTo register personnel for site briefing\nAttachments for Invitation\nto Quote or Tender\nClick on Corrigendum\n#1 to view details\nPage 10 of 21\nUpdated on 13 Feb 2020\n3. If there is a need to make changes  to the added registrants, click on “Edit” on the\nselected registrant and changes can be made  to Name, Designation, Email and\nContact No.\n4. Once changes are done, click on “Save” to save the changes and click on “Save\nRegistrants” to save the records.  A pop -up will inform that the registrants are saved.\n7 Submit New Proposal\nThe following are the steps required to submit a new proposal :\n1. Click on \" New Proposal\" located at  the top navigation bar.\n2. Fill up the new proposal form .\na. Quote Validity Days refers to the number of days your submitted proposal and\nquote will remain valid after the Invitation to Quote or Tender has closed.\nb. Total price excl. GST refers to the total value of the proposals excluding GST.\n3. To upload file , pleas e follow these steps:\na. Click Choose File to bring up the Document Browser.\nb. Select a file to be uploaded.\nc. Click Upload File to start the upload process.\nd. Once successfully uploaded, the file will be  added on the Attachments table\n(refer to screenshot below ).\n4. Click Save Draft to save the proposal as draft.\n5. Click Submit to submit the proposal. An email will be sent to your contacts once a\nsucce ssful submission has been made.\nPage 11 of 21\nUpdated on 13 Feb 2020\n8 Resubmitting a P roposal\nPlease follow the steps in the Submit New Proposal  section.  The only additional step would\nbe the overwrite confirmation dialog which you will need to confirm before proceeding with the\nsubmission.\n9 Edit Proposal Draft\nThe following are the steps required to edit an existing proposal draft :\n1. Click on \"Draft \" link located at the top navigation bar.\nPage 12 of 21\nUpdated on 13 Feb 2020\n2. A list of proposal drafts will be shown on the new page.\n3. Click on Continu e Draft to start continue editing t he proposal draft.\n4. Click on Delete Draft to delete the proposal draft.\n10 View Submitted Proposal\nThe following are the steps required to view submitted proposal :\n1. Click on \"Submitted Proposal\" link located at the top navigation bar.\n2. The submitted proposal det ails will be shown on the new page.\n11 Request to Extend  Quotation Validity\nThis feature is only applicable when you receive an email to extend your quote's validity period .\nThe following are the steps required to extend your quotation 's validity  period :\n1. Click on \" Overview \" link located at the top navigation bar.\nPage 13 of 21\nUpdated on 13 Feb 2020\n2. On the Overview page, the following section should be shown at the top. Click on the\nhighlighted link.\n3. On the new page, you may set the new validity expiry date for your submitted proposal\nand quote.\n4. Click “Accept ” to set the new validity expiry date.\n5. Clicking “Reject ” would mean that your submitted proposal and quote's  will maintain at\nits old validity e xpiry date. The risk is that it  might expire b efore an award decision is\nmade, effectively disqualif ying your submitt ed proposal  and quote  from evaluation.\n12 Queries for Invitation to Quote\nThe following are steps required to submit a query for Invitation to Quote:\n1. Enter query into “Message” textbox  and click on “Send” to submit the query.\nPage 14 of 21\nUpdated on 13 Feb 2020\n2. Reply will be directly shown below the query.\n13 Queries  for Invitation to Tender\nQueries posed by potential tenderers must be received by the query closing date and time.\nSIT would consolidate the queries and respond to all via a tender corrigendum . Please note\nthat there will be no replies to queries found in this section.  The following are s teps required\nto successfully submit a query for the tender:\n1. Enter query in “Please enter your query here” textbox and click on “+” to add the query\nto draft.  These queries will be in draft mode until submission is done.\n2. Changes done in entered queries will be saved when clicking outside the textbox.\n3. To submit the queries, select the required queries and click on “Submit” to submit the m.\n4. You may also include  attachments to your queries. After the queries are entered,\nreview to see if the queries are still v alid for submission. Select the quer(ies) you wish\nto submit. Those not submitted will remain as draft.\nPage 15 of 21\nUpdated on 13 Feb 2020\n5. Submitted queries will be moved to “Submitted Queries ” section shown below.\n6. Click on “Submitted Queries” to open the section to view the submitted queries. All\nsubmitted queries and attachments cannot be edited.  There will also be date and time\nto track your queries.\nImportant date to note\nfor query submission\nSection to enter queries\nAttachments for queries\nPage 16 of 21\nUpdated on 13 Feb 2020\n7. Email notification will be sent to Tenderers when corrigendum is created. Refer to\nOverview Page section on how to view corrigendum.\n14 Post-Tender Clarif ications\nThis feature is applicable only to Invitation to Tender  and only applicable for tenderers who\nhad submitted a bid before the closing date and time . The following are steps required to\nsuccessfully post tender clarifications:\n1. Where you received any  post tender clarification queries from SIT, you will be notified\nvia an email notification. Please log on to the SIT E -Sourcing Portal using the same\nuser ID and password issued when you were first invited to participate in the tender\nexercise.\n2. To view queries posted by SIT, click on “Post -Tender Clarifications”.\nClick on Submitted Queries to view details\nPage 17 of 21\nUpdated on 13 Feb 2020\n3. Below are the fields shown in the page.\na. S/No. – Number of clarifications\nb. Clarification No. – Clarifications sent by SIT\nc. Date Received – Dates of clarifications sent by SIT\nd. To Reply By – Dates r equired for the clarifications to be replied\ne. Replied Date – Dates for clarifications that were replied\nf. Status – Status of the clarifications\n• Pending Reply – Clarifications that are pending tenderers’ replies\n• Replied – Replies have been submitted for the clarifications\n4. Click on “Download All Clarifications” to download all clarifications that were replied .\nAll clarifications will be in pdf format and zipped together in one file.\n5. Click on the respective clarifications to  view the details .\na. Reference – Tender reference  posted by SIT  in relation to the tender document\nor tenderer’s submission .\nb. Clarification Question –The q uery posted by SIT.\nc. Reply – For input by Tenderer to r eply in response to the Clarifica tion Question\n6. Enter reply into “Reply” textbox and click outside the textbox to save as draft.\n7. Changes can be made to the replies by repeating step 5.\nClarifications sent by SIT\nPage 18 of 21\nUpdated on 13 Feb 2020\n8. You may wish to include attachments in your  response to SIT’s queries via the Post\ntender Clarification. Take note that attachments that were uploaded, will be submitted\ntogether with your written reply . You may edit/remove the attachments before you click\nsubmission.\nClarifications sent by SIT\nReplies to be\nentered here\nPage 19 of 21\nUpdated on 13 Feb 2020\n9. Click on “Submit” to submit the replies.\n15 Change Password\nThis feature is applicable when you wish to change the default password sent by the system.\n1. Enter current password that was sent to you  in “Enter Current Password” .\n2. Enter new password  in “Enter New Password”  that follows the criteria as stated above\nthe section.\n3. Confirm the new password by entering the new password in “Confirm New Password”\nto ensure that the new password is the same.\n4. Click on “Submit ” to change the current password to  the new password.\n16 Forgot Password\nThis feature is applicable when you wish to reset your password for an ongoing Invitation to\nQuote or Tender.\n5. On the vendor login page, click on the Forgot Password link and you will be prompted\nto input your email add ress.\n6. If your email address is valid, it will send an email with the list of Invitation to Quote  or\nTender  which you have been invited to bid for.\nPage 20 of 21\nUpdated on 13 Feb 2020\n7. Please click on the “Reset ” for the Invitation to Quote or Tender which  credential  you\nwish to reset .\n8. An email containing the new passw ord will be sent to your email.\n9. Login with the new password.\nNOTE:\nIf you should have any further queries on the SIT Procurement Portal, you may contact email\nto SITpurchasing@singaporetech.edu.sg  or call the Procurement line: 6592 1189 followed by\n“2” and “2” for Procurement matters.\nPage 21 of 21\nUpdated on 13 Feb 2020"
}