{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-03/20240303_Berita%20Harian_Budget%202024%20Training%2C%20learning%20key%20to%20future%20jobs.pdf",
  "type": "pdf",
  "content": "Kita kini sedang dalam pr oses menormalkan per alihan di\ndalam dan mer entas k erja y a.\nK e biasaan dan amalan tr adisional – belajar , menda pa tkan\nsijil akademik, mencari pek erjaan, dan k ekal sehingga ber sa-\nr a semakin sukar dipertahankan.\nDengan ek onomi global dan a pa bila permintaan pasar an\nter us ber k embang secar a dinamik, bakal ada pek erjaan y ang\ntidak lama lagi akan menjadi ber le bihan a tau usang mer entas\npelbagai sektor dan industri.\nUntuk k emajuan mer eka sendiri, pek erja di k esemua pe-\nringka t per lu men y esuaikan diri dengan per alihan berter usan\n– belajar dan bek erja sepanjang ha y a t – untuk meningka tkan\nk erja y a pr of esional seseor ang .\nIka tan bek erja-belajar ini akan menjadi kritikal dalam\nmembantu lulusan Institut P endidikan T eknikal (ITE) mema-\njukan diri. La por an menunjukkan ter da pa t perbezaan k etar a\nantar a gaji lulusan ITE dengan lulusan uni v er siti. J ur ang gaji\npermulaan juga semakin mele bar .\nAngg ota P ar limen telah bertan y a tentang langkah tam-\nbahan untuk meningka tkan pengiktir af an k eceka pan dan k e-\nmahir an dalam kalangan lulusan bukan uni v er siti,khususn y a\ndari ITE, dan seter usn y a mengur angkan k etidaksamaan dan\npr ospek k erja y a y ang mungkin wujud antar a pek erja lepasan\nuni v er siti dengan mer eka y ang tidak ber k elulusan sedemiki-\nan.\nSa tu lagi kumpulan pek erja y ang memer lukan sok ongan\nadalah g olongan pertengahan k erja y a. Mer eka ber depan de-\nngan ca bar an iklim penggantian dan pemberhentian k erja\ndalam be ber a pa sektor , dan semakin menda pa ti diri mer eka\ntidak mempun y ai k emahir an y ang diper lukan untuk maju\na tau mencari pek erjaan alterna tif .\nOleh itu, pelbagai langkah dalam Belanja w an 2024 untuk\nmenangani k e bimbangan ini tentun y a dialu-alukan.\nMENINGKATKANPROSPEKKERJAYA\nLULUSANITE\nSalah sa tu pengumuman y ang menonjol ialah Anug er ah\nK emajuan ITE untuk memper kasakan lulusan ITE agar me-\nningka tkan k emahir an k e peringka t diploma le bih a w al da-\nlam k erja y a mer eka.Ini disasar kan k epada lulusan ber usia 30\ntahun k e ba w ah. Mer eka akan mer aih sejumlah $ 1 5,000 da-\nlam nilai tambah pada masa mer eka menama tkan kur sus\ndiploma.\nAnug er ah ini akan membantu lulusan ITE y ang le bih mu-\nda meningka tkan k emahir an dan meng enal pasti peluang un-\ntuk pr ospek pek erjaan y ang le bih baik dan k emajuan a w al\ndalam k erja y a mer eka.\nP akar ber pandangan baha w a ma tlama t utama peningka t-\nan k emahir an adalah untuk menjadi pek erja y ang le bih ber-\nk esan, k ekal r ele v an dan ber da y a saing dalam pek erjaan dan\nsy arika t anda, membuka peluang pek erjaan dan k enaikan\ngaji y ang le bih baik. Kajian dan da ta telah menunjukkan ba-\nha w a di luar k ela y akan akademik, k emahir an le bih penting\nbagi pek erjaan pada masa depan.\nMempun y ai diploma y ang ber asaskan k emahir an, r ele-\nv an secar a langsung dengan pek erjaan dan mena w ar kan mo-\ndel pembelajar an ber asaskan per anti akan meletakkan lulus-\nan ITE setanding dengan pemegang diploma dan juga g r adu-\nan uni v er siti.\nLangkah untuk meningka tkan k emahir an lulusan ITE de-\nngan diploma ber asaskan k emahir an dan ber kaitan pek erja-\nan bukanlah sesua tu y ang bar u. Pr og r am diploma pengajian\nk erja (WSDip) ITE bermula pada 20 1 8, mener usi empa t pr o-\ng r am dan 1 00 pela tih.\nSehingga 2022, WSDip telah men y aksikan 2,400 pela tih\nlulus daripada 36 pr og r am.\nDiploma teknikal ITE bermula le bih a w al, pada 2008. Se-\nhingga kini, hampir 1 ,000 pela tih telah memper oleh diploma\nteknikal ITE.\nMer eka dila tih dalam k emahir an y ang diiktir af industri,\nla tihan dalam per k ongsian dengan institusi antar a bangsa\ny ang ter k enal.K olej-k olej ITE mempun y ai sasar an sekur ang-kur angn y a\n1 0 per a tus lulusan melanjutkan pelajar an k e peringka t diplo-\nma ini.\nBagaimana pun, k eja y aan langkah memberi insentif k epa-\nda lulusan ITE untuk melanjutkan pelajar an k e peringka t\ndiploma ber gantung k epada dua f aktor utama.\nP ertama,lulusan ITE per lu memanf aa tkan peluang ini un-\ntuk meningka tkan k emahir an. Mer eka per lu mener oka ba-\ngaimana mer eka boleh memanf aa tkan la tihan ITE mer eka,\nk emahir an semasa bek erja dan pr ospek pek erjaan dalam\nsy arika t mer eka untuk memetakan per k embangan k erja y a\nmer eka sendiri.\nK edua, sok ongan dan k omitmen majikan adalah penting .\nSejauh mana majikan sedia men y ok ong pek erja lulusan ITE\nmener uskan diploma mer eka, sambil meng embangkan k e-\nmahir an mer eka di tempa t k erja, dan men y ediakan jalan un-\ntuk k emajuan mer eka dalam sy arika t masing-masing?\nP emikir an majikan juga per lu ber k embang – elak men-\njangka pek erja y ang sempurna dan boleh melakukan segala-\ngalan y a dari hari pertama mer eka bek erja.\nDari masa k e masa, majikan dan sy arika t per lu membua t\npela bur an y ang besar dalam pek erja mer eka untuk memba-\nngunkan k emahir an dan k eceka pan y ang r ele v an dan diper-lukan sy arika t, serta memupuk mer eka untuk ber k embang\ndalam dan ber sama sy arika t.\nHan y a dengan per ubahan minda sedemikian,sy arika t bo-\nleh ber k embang maju.\nINDIVIDUPERTENGAHANKERJAYA\nSe bilangan besar per untukan k e w angan dalam Belanja-\nw an 2024 dibua t untuk indi vidu pertengahan k erja y a ber u-\nmur 40 tahun dan k e a tas.\nKr edit SkillsFutur e $4,000 y ang luma y an untuk men y o-\nk ong k emahir an semula g olongan pertengahan k erja y a, se-\nhingga $3,000 elaun la tihan SkillsFutur e bulanan sehingga\n24 bulan dan subsidi y ang dipertingka tkan untuk diploma se-\npenuh masa, adalah isy ar a t kua t baha w a pemerintah men y o-\nk ong pembangunan pr of esional mer eka.\nMa tlama tn y a adalah untuk meningka tkan k e bolehpasar-\nan dan k emajuan k erja y a mer eka, w alaupun mer eka memu-\ntuskan untuk menukar laluan k erja y a dan ber alih k e sektor\na tau industri bar u.\nKita semakin tua dengan cepa t se bagai se buah negar a.Re-\nalitin y a ialah se bahagian besar tenaga k erja kita ter diri dari-\npada indi vidu ber umur 40-an dan k e a tas.\nDi samping itu, kajian telah menunjukkan baha w a dalamkalangan negar a P ertubuhan K erjasama Ek onomi dan P em-\nbangunan, pek erja ber umur 45 tahun k e a tas y ang hilang pe-\nk erjaan, sukar mencari pek erjaan bar u, meskipun hari ini\nmer eka boleh bek erja le bih lama berbanding 20 a tau 30 ta-\nhun lalu.\nP ek erja ber umur 30 hingga 44 tahun le bih ber k emung-\nkinan menda pa t pek erjaan bar u dalam tempoh sa tu tahun\nselepas penganggur an,berbanding pek erja ber umur 45 hing-\nga 59 tahun.\nBan y ak kajian juga menunjukkan baha w a dari umur 44\nhingga 59 tahun, ter da pa t taha p y ang r endah dalam k epuas-\nan hidup .\nIndi vidu pertengahan umur secar a ser entak mengim-\nbangi tugas ber kaitan penjagaan ibu ba pa mer eka y ang sema-\nkin tua, mengur uskan anak-anak mer eka y ang masih belajar\ndan meng ekalkan per k embangan k erja y a mer eka sendiri.\nT indakan mengimbangi ini ber laku semasa indi vidu ini\nmenghada pi per ubahan k esiha tan mental, fizikal dan k ogni-\ntif mer eka sendiri.\nSesetengah pek erja mungkin mener oka peluang k erja y a\nbar u agar da pa t memenuhi tugas k eluar ga mer eka dengan le-\nbih baik dan mempun y ai le bih ban y ak k eseimbangan k erja-\nk ehidupan.\nW or kf or ce Singa por e (WSG) telah memper k enalkan be-\nber a pa skim untuk membantu pek erja pertengahan k erja y a\nseperti Pr og r am P ela tih SGUnited dan Pr og r am Laluan P er-\ntengahan K erja y a SGUnited.\nDa ta dari 202 1 menunjukkan baha w a sekitar 40 per a tus\npenempa tan di ba w ah pr og r am ini adalah pek erja ma tang\nber umur 40 tahun k e a tas, manakala hampir 40 per a tus di-\ntempa tkan dalam sektor pertumbuhan seperti makluma t\ndan k omunikasi, penjagaan k esiha tan dan per khidma tan k e-\nw angan.\nOleh itu, per untukan pemerintah y ang luas untuk indi vi-\ndu pertengahan k erja y a akan membantu men y ok ong pem-\nbangunan pr of esional dan aspir asi k erja y a mer eka, serta me-\nningka tkan k e bolehpasar an mer eka a pa bila mer eka ma tang\nse bagai pek erja.\nIni ama t penting , memandangkan tenaga k erja kita y ang\nsemakin tua, jangka ha y a t y ang le bih panjang dan k ohort pe-\nn y ertaan tenaga k erja kita y ang semakin meng ecil dise ba b-\nkan oleh ber kur angn y a kadar k esubur an dari tahun k e tahun.\nJALANKEHADAPAN\nDi luar bantuan jangka pendek seperti baucar Majlis P em-\nbangunan Masy ar aka t (CDC) dan r e ba t Ba y ar an P er khidma-\ntan dan P en y enggar aan (S&CC), Belanja w an setia p tahun\nmen y ediakan per untukan ber sasar dan pak ej bantuan y ang\nmemanf aa tkan kumpulan indi vidu tertentu.\nP er untukan sedemikian boleh diliha t se bagai penunjuk\nk epada g olongan, sektor dan industri y ang memer lukan so-\nk ongan bagi mendepani ca bar an menda tang .\nDaripada langkah-langkah y ang diumumkan dalam Be-\nlanja w an 2024, adalah jelas tumpuan diberikan untuk mela-\nbur dalam r ak y a t kita.\nSe bagai se buah negar a y ang mempun y ai sedikit a tau tia-\nda sumber asli, sumber manusia kita adalah penting .\nKita juga per lu secar a k olektif mengukuhkan dan me-\nningka tkan tempa t k erja dan pendeka tan kita untuk membi-\nna ka pasiti dan membangunkan kakitangan kita melalui la-\ntihan k emahir an dan pek erjaan inklusif .\nBola itu ber ada di g elanggang pek erja dan majikan,dalam\nmembantu membina tenaga k erja ber da y a tahan, ber k ema-\nhir an dan r ele v an y ang boleh menghar ungi ca bar an masa de-\npan.\nUsaha-usaha ini per lu diter uskan.\n▶ P enulis ialah prof esor mad y a dan pengar ah Pusat\nK epimpinan Masy ar akat dan Ino v asi Sosial di Institut\nT eknolo gi Singapur a. Beliau mantan Angg ota P arlimen\nGRC Ang Mo Kio .Belanjawan 2024: Latihan,\npembelajaran kunci\npekerjaan masa depan\nPara lulusan ITE perlu merebut peluang meningkatkan kemahiran termasuk dalam kursus peringkat Diploma Kerja-Belajar (WSDip)\nbagi prospek pekerjaan yang lebih baik dan kemajuan dalam kerjaya mereka. – Foto fail\nDRINTANAZURAMOKHTARPENULISTAMU\n“Daripada langkah-langkah yang diumumkan dalam Belanjawan\n2024, adalah jelas tumpuan diberikan untuk melabur dalam rakyat\nkita.\nSebagai sebuah negara yang mempunyai sedikit atau tiada sumber\nasli, sumber manusia kita adalah penting .\nKita juga perlu secara kolektif mengukuhkan dan meningkatkan\ntempat kerja dan pendekatan kita untuk membina kapasiti dan\nmembangunkan kakitangan kita melalui latihan kemahiran dan\npekerjaan inklusif .”\nPenulis.Publication: Berita Harian\nDate: 3 March 2024\nHeadline: Budget  2024: Training, learning key to future\njobs\nSource: Berita Harian  © SPH Media Limited. Reproduced with permission."
}