{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Celebrating%20Student%20Excellence_0.pdf",
  "type": "pdf",
  "content": "Celebrating Student Excellence;\nHonouring Nurturing Donors\nStriving for excellence involves doing your very best at\nevery opportunity and it is this commitment that tends to distinguish the achievers at the Singapore Institute\nof Technology (SIT). On 26 October 2017, the University\ncelebrated the achievements of these outstanding students as well as the generous philanthropic support from donors, at the Recognition of Excellence presentation at the Sports Hall at the SIT@Dover campus. Now in its third year, the ceremony\nis a platform where SIT presents donor-supported excellence\nawards and scholarships to its respective recipients.\nIn his welcoming remarks, Prof Loh Han Tong, Deputy\nPresident (Academic) & Provost, SIT, thanked all the donors\nand said, ““Your philanthropic leadership and your generous\ncommitment to supporting a good education for the younger\ngeneration is the best example for our students on what it\nmeans to be ‘catalysts of transformation’ who are ‘grounded\nin the community’.”\nIn the ensuing presentation ceremony, 33 Book Prizes,\n9 Outstanding Student Awards and Yearly Performance\nAwards, 7 Gold Medals and 40 non-bonded scholarships, all\nmade possible by donors, were handed out by Mr Ng Yat Chung, Chairman, Board of Trustees, SIT. Also attending the presentation ceremony were members of SIT’s Board of\nTrustees, Senior Management, faculty and staff, as well as\nrepresentatives from the Overseas University partners along with the recipients’ loved ones.\nIn his closing speech, Prof Tan Thiam Soon, President, SIT,\nsaid, “Thanks to our community of donors who are unafraid to support a young university like ours, and to support young\npeople who dream of attaining a good university education, SIT has been able to nurture more and more students\nthrough scholarships, bursaries and study grants that help\nlevel the playing field for students who face challenging circumstances.”\nAddressing the students and graduates, he said, “To our\nSITizens who are present today – you will always be SIT’s best\nambassadors. I wish you every success, as you go boldly into the industry or community to transform the future.”\nThe Recognition of Excellence presentation was a\nchance for scholarship and award recipients to meet\nwith the donors who made the awards and scholarships\npossible. Scholarship recipients strike a pose with members of SIT’s Board of Trustees and Senior Management.\nScholarship recipient Ms Koko Sia, with Mr John Phua, Managing Director, Safety Systems Engineering\nPte Ltd. She said that receiving the Safety Systems\nEngineering Scholarship is a “golden opportunity.”The SIT Innovation Showcase displayed the projects done by SIT students. Here, Mr Chern Chyi Yang (left)\nshares more about “Past Twelve”, a game he and his\nteam mates worked on.SiTIZEN  |  08/16\nMore than 300 guests including donors as well\nas award and scholarship recipients attended the\nthird Recognition of Excellence presentation at SIT, which also featured performances from SIT’s student groups and an Innovation Showcase\nFirst-year Diagnostic Radiography\nstudent, Ms Anjelina Teh, who received\nthe KKH Scholarship said that to her, the\nscholarship represents much more than\njust a financial boost. She said, “It has\ngiven me the courage to stand up for\nsomething I believe in and because of Mr\nKuok’s generous gift, I am one step closer\nto my dreams of helping the community.”\nMr Lionel Ng Kuan Yuan, who graduated\nthis year, received the CEI Outstanding Student Award in Mechanical Design and\nManufacturing Engineering.\nHe said, “I have never won such an award\nin my studying career before. It proves\nhard work and effort are rewarded. It was\nalso definitely an honour to meet the\ndonor in person. My simple gesture of\nappreciation was the least I could do after\nhe has made this award possible.”\nAt the SIT Innovation Showcase, (from right) SIT student\nMr Benjamin  Chua had the opportunity to talk about his\nproject to Mr Kon Yin Tong, Managing Partner of Foo\nKon Tan LLP and Mr Nagaraj Sivaram, Member, Board of Trustees, SIT.Scholarship and award recipients (from left) Ms Anjelina Teh and Mr Chester Liew represented\nthe students to say a heartfelt “thank you” to SIT’s\ndonors.\nJing King Tech Book Prize recipient Ms Tan Ting (second from left) with guests from Jing King Tech Holdings Pte\nLtd: (from left) Mr Anthony Ong, Group Chief Executive\nOfficer, Mr Foo Tee Meng, General Manager, Digital Payments and Identity, and Ms Jenny Kiah, Group (SG) HR & Admin Manager.Soundbox, SIT’s student performance group, opened the ceremony held in the Sports Hall with a bang.(From left) Singapore Food Manufacturers’ Association Book Prize recipient Mr Daniel Ker Sheng Rong, with Mr\nWong Mong Hong, Immediate Past President, and Mr\nPeter Loo, Executive Director, both from the Singapore Food Manufacturers’ Association.\n(From left) Mr David Lee, Director, Marketing & Business Development, Yeakin Plastic Industry Pte\nLtd, chatting with three of the recipients of the Yeakin\nBook Prize for the Top Student in Product Design Engineering, Mr Chew Kia Leng, Mr Norsatria Asyraf Bin Norman, and Ms Tan Sok Kee.(From left) Mr Liew Kai Kiat, recipient of the RSM\nSingapore Financial Scholarship with Mr Teo Cheow\nTong, Senior Partner, Audit Services, RSM Chio Lim LLP and Prof Tan Thiam Soon, President, SIT.ST Engineering Gold Medal recipient,\nMr Jed Lee Jian Xiong (middle), celebrating with his parents after the ceremony.Scholarship recipients Ms Hazel Lim Jia Qi (left) and Mr Mohammad\nNorfairus Bin Abdul Rahim getting to know Ms Jagjit Kaur, Director\nof Learning & Development, Millennium Hotels and Resorts (right).SiTIZEN  |  09/16"
}