{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-09/%5BFA%5D%20SIT%20AR%202024_02_President%27s%20Message.pdf",
  "type": "pdf",
  "content": "EXPANDING OUR HORIZONS:\nNEW EDUCATIONAL PATHWAYS\nRecognising the evolving and growing needs of learners\nand industry, SIT has expanded our mission beyond pre-\nemployment training. Working closely with industry, we\ndeveloped the Competency-based Stackable Micro-credential\n(CSM) pathway, offering in-employment learners the\nopportunity to acquire in-demand skills just in time. This\nallows for quicker application of knowledge to address industry\nneeds. It also gives learners the option to build towards a\ndegree, catering to their growing need for flexibility when\nembarking on lifelong learning.\nINDUSTRY COLLABORATION:\nA CORNERSTONE OF SUCCESS\nCollaboration with industry continues to be a cornerstone of\nour success. The curriculum for all our programmes, including\nthe upcoming CSM Engineering degree programmes, is\nco-developed with industry partners. This ensures that\nour graduates always possess the skills and knowledge\nmost desired by employers and helps industry build their\ntalent pipeline.A DECADE OF IMPACT:\nCELEBRATING SIT’S 10TH ANNIVERSARY\nAs SIT commemorates its 10th anniversary as an Autonomous\nUniversity (AU) in 2024, I am filled with pride and gratitude\nfor all that our faculty, staff, students, alumni and partners\nhave accomplished together. SIT has witnessed remarkable\ngrowth, achieved significant milestones and most importantly,\nmade a positive impact on the lives of our students, as well\nas industry and community partners.\nFROM STRENGTH TO STRENGTH:\nGROWING OUR STUDENT BODY\nOur student body has grown significantly. From admitting\n1,800 students at the start of our journey as an AU in 2014,\nour current intake exceeds 3,300 – making us the third\nlargest AU for full-time undergraduate intake in Singapore.\nThe achievements of our graduates reflect the quality of\neducation we provide. Graduate employment surveys\nover the years consistently show over 90% employment\nrates, with about half of our students receiving advance\njob offers through our signature Integrated Work Study\nProgramme (IWSP).\nWE ARE DEVELOPING A MODEL FOR ENGAGED LEARNING, PARTNERING WITH\nSECONDARY SCHOOLS IN THE PUNGGOL REGION TO USE STEM SKILLS TO SOLVE\nREAL-WORLD PROBLEMS. THIS WILL NOT ONLY BENEFIT THE COMMUNITY, BUT\nALSO GENERATE INTEREST IN STEM AMONG THE YOUTH, AS WELL AS PROVIDE\nVALUABLE LEADERSHIP AND FACILITATION EXPERIENCE FOR OUR STUDENTS.”PROFESSOR CHUA\nKEE CHAING\nPresident “PRESIDENT’S MESSAGE/10\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024\nRESEARCH THAT MAKES A DIFFERENCE\nOur industry partnerships extend to the realm of applied\nresearch, where we prioritise a close nexus between research\nand education. Since 2020, we have entered into over 150\napplied research agreements with industry partners, tackling\nreal-world challenges in areas like food technologies, AI,\nconstruction technologies and maritime engineering. For\ninstance, through our subsidiary FoodPlant, we have worked\nwith food companies to leverage technology for alternative\nprotein development and spent upcycling. FoodPlant has\nalso expanded its reach overseas, establishing partnerships\nwith FOODBOWL, SEAFAST and SIFT, leading food innovation\nfacilities in New Zealand, Indonesia and Australia respectively.\nThe dynamic multi-project collaboration aims to build\ncapabilities and accelerate commercial outcomes in food\ninnovation, manufacturing and distribution. Another notable\napplied research partnership is the SIT Centre for Artificial\nIntelligence that we have established in collaboration with\nNVIDIA to accelerate the adoption of AI technologies across\nindustries. This centre will also provide research opportunities\nfor SIT students while fostering awareness of AI among\nstudents, companies and the public.\nLOOKING FORWARD:\nBUILDING A BRIGHTER FUTURE\nAs we celebrate the achievements of the past decade, we\nalso look forward to moving to our new Punggol Campus, which will see the coming together of all six of our existing\ncampuses. With the new campus situated in the upcoming\nPunggol Digital District, SIT will be plugged into a vibrant\necosystem for innovation and collaboration, allowing us to\nfurther deepen our industry partnerships. We will capitalise\non our campus Living Labs of real-world systems and those\nof our partners to catalyse authentic learning experiences\nand applied research. Living Labs foster a dynamic learning\nenvironment where students can apply their knowledge to real-\nworld challenges while providing a fertile ground for impactful\nresearch, allowing the University, industry and government\npartners to jointly develop, test and deploy research ideas.\nOur students will benefit from these opportunities to develop\npractical skills and contextualised knowledge that is highly\nsought after by employers.\nWe also envision the campus as a vibrant hub for alumni\nengagement and lifelong learning. With initiatives like “Learn\nfor Life”, which offer our alumni a free course or module every\nfive years, we hope that this will encourage and support our\nalumni to be lifelong learners.\nBuilding a strong connection with the local community is\nanother key focus as we move to our Punggol home. We are\ndeveloping a model for engaged learning, partnering with\nsecondary schools in the Punggol region to use STEM skills\nto solve real-world problems. This will not only benefit the\ncommunity, but also generate interest in STEM among the\nyouth, as well as provide valuable leadership and facilitation\nexperience for our own students.A GENEROUS GIFT:\nEMPOWERING FUTURE GENERATIONS\nAs we reflect on our journey, we must acknowledge the\ntremendous support we have received from our partners\nand donors. I would like to express our profound gratitude to\nMr Kwek Leng Beng, Executive Chairman of City Developments\nLimited (CDL), and CDL for the gift of close to $25 million to SIT.\nThis generous contribution has enabled us to offer a wide range\nof scholarships, bursaries and prizes, significantly enhancing\nour ability to support deserving students in their educational\npursuits. In recognition of Mr Kwek’s transformative gift, we\nhave named the University Tower in our Punggol Campus,\nthe Kwek Leng Beng University Tower. This tower, which will\nhouse our academic and administrative staff offices, will stand\nas a testament to Mr Kwek’s commitment to nurturing the\nnext generation of innovators and leaders.\nA SHARED SUCCESS STORY\nAs we mark our 10th anniversary as an AU with a year-long\ncelebration, I am grateful for the dedication and support of\nour faculty, staff, students, alumni, industry partners and\ndonors. Together, we have built an institution that is making\na positive impact on Singapore and beyond. I look forward\nto the next decade of growth, innovation and continued\nsuccess as we strive to become a premier University of\nApplied Learning.PRESIDENT’S MESSAGE/11\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024"
}