{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Blossoming%20Young%20Talents.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  07/16\nBlossoming Young Talents\nEven more women undergraduates are given the opportunity to shine, thanks to the\nincreased support for the Kewalram Chanrai Group Scholarship\nMade possible by an endowed gift from the Kewalram\nChanrai Group in 2015, the Kewalram Chanrai Group Scholarship at the Singapore Institute of Technology (SIT) is unique as it supports promising women undergraduates at the university. Now, thanks to a new gift made by the Group in 2018, up to 10 students will be nurtured by the Scholarship annually, and in perpetuity.\nThe recipients of the Scholarship had the opportunity\nto meet and thank Mr Narain Girdhar Chanrai at an appreciation lunch hosted by Prof Tan Thiam Soon, President, SIT for the Kewalram Chanrai Group on 16 April 2019. Also present at the event were Mrs Chanrai, Ms Annie Toh, Financial Controller, Kewalram Chanrai Group, as well as SIT faculty and staff.\nAmong the recipients was Ms Lim Pei Shan, who was\namong the first students at SIT to receive the Scholarship when it was first established in 2015. She was only a first-year student then, and received the Scholarship for two consecutive years. She will now be graduating in October 2019. Ms Munirah Begum D/O Mohamed Shariff, a first year student in the Criminology & Security programme, shared during the event how receiving the Scholarship in Academic Year 2018/19 has helped her tremendously. She said, “It made me realise that it is possible for me to strive Ms Joscelin Yu (left), one of the recipients of the Kewalram Chanrai Group\nScholarship, greets Mrs Chanrai. Before the appreciation, the recipients had banded together to prepare a special token of appreciation for Mr and Mrs Chanrai – they had spent two afternoons making paper flowers to express their gratitude for the scholarship.\nThe recipients of the Kewalram Chanrai Group Scholarship, together with Prof\nTan Thiam Soon, President, SIT, Mr & Mrs Chanrai, as well as Ms Annie Toh, Financial Controller, Kewalram Chanrai Group.\nKewalram Chanrai Group Scholarship recipients, Ms Munirah Begum D/O Mohamed Shariff (left), and Ms Dawn Emelia Lee Min Ni, sharing with the attendees how much the scholarship has impacted their lives. Prof Tan Thiam Soon, President, SIT (right), showing the model of SIT’s new campus in Punggol to Mr Narain Girdhar Chanrai (left) and Mrs Narain Girdhar Chanrai (middle).\nfurther and debunk the stereotypes that women especially\ncan’t take up further studies.”\nProf Tan Thiam Soon, President, SIT, thanked Mr Chanrai\nand the Group for having made the scholarship possible. He said that through the scholarship, “The Kewalram Chanrai Group is providing opportunities for promising young women to become future leaders so that they can help create a better life for themselves, their families and the community.”"
}