{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/sitizensjourneyingtogethwithrcjt_1.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  10/16\nDr Leong Horn Kee (right), Advisor, Thomson Shin Min Foundation, presenting a cheque for\nthe gift to Ms Soh Pe Wen, Assistant Manager, Advancement and Alumni, SIT. Behind them\nare Mr Lim Lam Heng, Director, (left) and Mr Philip Tan, Executive Director, Thomson Shin\nMin Foundation.\nSIT staff and SITizens with members of the Rotary Club of Jurong Town, Singapore.\nSITizens Journeying Together with RCJTSteadfast Philanthropic Support from the Thomson\nShin Min Foundation\nSince 2015, the Thomson Shin Min Foundation\nhas been supporting students at SIT with annual\ndonations to build up an endowed bursary fund.\nThis year, the Foundation made an additional\nendowed gift, which will allow a greater number of\nstudents to be empowered by the Thomson Shin\nMin Foundation Bursary in the years ahead and in\nperpetuity.\nOne of the first-ever recipients of the Bursary is\nAcademic Year 2018/19 recipient Mr Chua Chiang\nYuen, a Bachelor of Accountancy with Honours\nstudent. Mr Chua feels grateful that the Bursary\nhas helped lift his financial burden. “I am honoured\nto have received the Bursary as it has lessened my\ndifficulties in paying for my tuition fees,” he said,\nadding that it also gave him more time to focus on\nstudies and participate in co-curricular activities.\nFellow recipient and Bachelor of Engineering with\nHonours in Telematics (Intelligent Transportation\nSystems Engineering) student Ms Nurhidayah Bte\nAbdul Rashid said, “Being awarded this Bursary\nOn 23 July 2019, two alumni and a graduand from SIT’s nursing degree\nprogrammes met with members of the Rotary Club of Jurong Town,\nSingapore (RCJT) for a lunch and catch-up session. RCJT has strongly\nsupported nursing programmes in SIT since 2014, first with a term gift for\nthe Rotary Club of Jurong Town Book Prize in Care Pathways for Long-Term\nConditions, and later with the endowed Rotary Club of Jurong Town Book\nPrize in Intermediate & Long Term Care and the endowed Rotary Club of\nJurong Town Bursary.\nThe award recipients each shared how RCJT’s philanthropy had positively\nimpacted their lives over the years. Mr Muhd Izzulwan Bin Ahmad Salleh,\nwho received an RCJT book prize in Academic Year (AY) 2014/15, spoke\nhas allowed me to pursue my education in SIT with ease. I\nconsider myself lucky as it alleviates my financial worries and\nallows me to fully focus on my academics.”\nof his work in Changi General Hospital’s\nhigh dependency and acute stroke\nunit, and how he was now getting more\ninvolved in meaningful projects at the\nhospital. AY 2017/18 Bursary recipient,\nMs Evelyn Chua, talked about her recently\ncompleted graduation thesis on burnout\nand compassion fatigue among nurses.\nMs An Xin Yun, an AY 2018/19 Bursary\nrecipient and graduate, recounted her\ntough start at SIT. “I’m actually working as\na nurse and I’m proud to say that it’s been\nmy dream job since I was young. During\nmy days in SIT Nursing, I actually had to\nwork three part-time jobs to pay for my\nschool fees. Although I did work for a year\nin a government hospital to save funds,\nit still wasn’t enough,” she said, sharing\nthat she had to give up CCAs, community\nservice and personal time in order to cope.\nReceiving the Bursary however, helped her\nto find balance in her life. “It lessened my\nload in the sense that I didn’t have to focus\non financial issues and could continue to\ndo what I like, and on top of that, striving\nand helping others meet their needs.” She\nconcluded by thanking RCJT for enabling\nher to make a difference in others’ lives\nthrough her dream job today."
}