{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Ticket%20to%20Overseas%20Learning%20in%20Glasgow.pdf",
  "type": "pdf",
  "content": "A team of five SITizens flew the SIT flag high by\nbagging a Commendation Award at the inaugural Smart Bus Challenge organised by the Land Transport Authority (LTA).\nFrom left: Assoc Prof Zheng Jianxin, Mr Kenny Quah, Ms Kwek Yi Huay,\nMr Donovan Koh, Ms Chong Ya Ting, Ms Audrey Lim, and Senior Lecturer\nDan Chia Wei Ming.Prize in Sight\nAn SIT student team makes their mark\nat an inaugural Land Transport Authority\ncompetition with sensors for bus drivers\nto view their blind spots\nThe team‘s proposal earned them a cash prize of $1,000,\nbeating over 90 entrants from post-secondary institutes of learning and emerging amongst the Top 10 Finalists.\nEntitled, ‘Safe Sight System‘, the idea uses smart technology\nlight-display sensors for bus drivers to view their blind spots, increasing their sense of spatial awareness. It is designed for use on buses, given their manoeuvring difficulties due to their large sizes. In addition, the system is able to provide precise visual cues to warn drivers of hazards from all blind spots, which in turn, would significantly reduce driving stress and increase safety on the roads.\nThe team of Year 3 Telematics (Intelligent Transportation\nSystems Engineering) students comprised Ms Audrey Lim Xin Hui, Ms Chong Ya Ting, Mr Donovan Koh Cheng Huang, Mr Kenny Quah Kok Siong and Ms Kwek Yi Huay.\n“Our aim was to put forward an idea that is practical and\neasy to implement, without the need to radically change the existing framework of buses,“ said team leader, Donovan.\nAssoc Prof Zheng Jianxin, who supervised the team together\nwith Senior Lecturer Dan Chia Wei Ming, said, “I am excited that our students were able to apply smart technology and create an innovative idea to minimise risks of accidents for LTA. As Singapore continues to look into introducing autonomous vehicles and smart technology on the road, we have to constantly look into upgrading safety measures.“Mr Teo Hock Chwee, Managing Director, T T J Design and Engineering\nPte Ltd (left) and Prof Tan Thiam Soon, President, SIT, at the Technical\nSeminar on 23 October 2018.Thanks to an endowed gift from T T J Design and Engineering\nPte Ltd, financially disadvantaged students from the Civil Engineering degree programme (offered jointly by Singapore Institute of Technology and University of Glasgow) can count on financial support when they head for their compulsory Overseas Immersion Programme (OIP) in Glasgow.\nThe structural steel specialist with businesses in Singapore,\nMalaysia and the Middle East has made possible the T T J Design and Engineering Overseas Immersion Programme Grant at SIT. Valued at $4,000 each, at least five grants will be awarded annually and in perpetuity. The OIP Grant will help recipients with part of their expenses for the compulsory programme, which is expected to cost between $4,500 and $5,500. The intensive three-week OIP will include workshops to prepare the students for their final-year dissertation projects as well as group project-based subjects covering both conceptual and detailed aspects of design.\nMr Teo Hock Chwee, Managing Director of T T J Design and\nEngineering, said that the company is “very pleased to be able to support SIT.” He added, “It is important to us that young talents are nurtured for the industry so that they can build on our collective experience to bring in new perspectives and new ideas.”\nMr Teo presented the cheque from the company to Prof Tan\nThiam Soon, President, SIT, at the Civil Engineering Technical Seminar on Innovative Design and Construction of Composite Steel-Concrete Structures held at SIT on 23 October 2018. T T J Endowed gift from T T J Design and Engineering Pte Ltd makes possible an Overseas\nImmersion Programme Grant for Civil Engineering studentsTicket to Overseas Learning in Glasgow\nhas also collaborated with SIT on applied research\nto develop a design handbook on HISTEEL, which was launched during the seminar. The half-day seminar, attended by more than 300 industry practitioners, was co-organised by SITLEARN Professional Development and T T J Design and Engineering Pte Ltd.SiTIZEN  |  11/16"
}