{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-11/SIT%20Access%20to%20Personal%20Data%20Request%20Form%20Nov%202024.pdf",
  "type": "pdf",
  "content": "PERSONAL DATA PROTECTION ACT 2012 (No. 26 of 2012)\nACCESS REQUEST FORM\nNotes for Applicants\n1. Under the Personal Data Protection Act of Singapore 2012, an individual is entitled to be\ninformed of the following:  -\na. Personal Data under the possession or control of the Singapore Institute of\nTechnology (“SIT”) about the individual;  and\nb. Information about the ways in which the Personal Data above has been or may have\nbeen used or disclosed by SIT within a year  before the date of the  request.\n2. The request  must  be in writing and  accompanied  by a reasonable  fee. SIT shall inform  the\nindividual of the quantum of the fee at the time the request is made . The method of payment\nwill be provided together with the fee quantum , if applicable .\n3. The request must be accompanied by any necessary information/documentation to identify  the\nenquirer (for example NRIC/ Passport no., student ID or other form of proof of identity) and to\nlocate  the record  of personal data  required.\n4. SIT will comply  with the request  for disclosure  within 30  days  of: (i) receiving  the request ; (ii)\npayment  of applicable  fees; or (iii)receiving  all required information and/or documents,\nwhichever event occurs the latest . SIT will provide an updated timeline s hould SIT require\nmore time to respond to an access request.\n5. Please complete the following form and sign the accompanying declaration and submit, with\nproof of identity, to the Data Protection Officer at the email and/or address given  below.\n6. SIT is not required to provide information under the access requirement  for:-\ni. Opinion data kept solely for an evaluative  purpose;\nii. Any examination, examination scripts and, prior to the release of examination results,\nexamination results;\niii. Documents related to a prosecution if all proceedings related to the prosecution have\nnot been  completed;\niv. Personal Data subject to legal  privilege;\nv. Personal Data which, if disclosed, would reveal confidential commercial information\nthat could,  in the opinion  of a reasonable  person,  harm  the competitive position of the\norganisation;\nvi. Personal Data collected, used or disclosed without consent pursuant to the\nexemptions in the PDPA, for the purposes of an investigation if the investigation and\nassociated proceedings and appeals have not been  completed;\nvii. Any request: -\na. That would unreasonably interfere with the operations of SIT because of the\nrepetitious or systematic nature of the  requests;\nPERSONAL DATA PROTECTION ACT 2012 (No. 26 of 2012)\nACCESS REQUEST FORM\nb. That will create a unreasonable burden  or expense   for the organisation in\norder to provide, or where the burden or expense required is  disproportionate\nto the individual’s  interests;\nc. For information that does not exist or cannot be  found;\nd. For information that is trivial;  and\ne. That is otherwise frivolous or  vexatious.\nviii. Personal Data or other information shall not be provided to an individual if the\nprovision of that Personal Data or information could reasonably be expected  to:\na. Threaten  the safety  or physical  or mental  health  of an individual  other  than the\nindividual who made the  request;\nb. Cause  immediate  or grave  harm  to the safety  or to the physical  or mental  health\nof the individual who made the request;\nc. Reveal Personal Data about another  individual;\nd. Reveal the identity of an individual who has provided Personal Data about\nanother individual and the individual providing the Personal Data does not\nconsent to the disclosure of his/her identity;  or\ne. Be contrary to national  interest.\nix. If Personal Data has been disclosed to a prescribed law enforcement agency without\nthe consent of the individual or pursuant to the exemptions in the PDPA, SIT shall\nnot be required to inform the individual of such  disclosure.\nPERSONAL DATA PROTECTION ACT 2012 (No. 26 of 2012)\nACCESS REQUEST FORM\nA.  The Requesting Party’s Details\nFull Name (Block letters)  :\nNRIC/ Passport Number  /\nStudent ID  :\nTelephone Number(s)\nResidential/ Office/ Mobile  :\nEmail  :\nB. Your status/relationship with the Singapore Institute of  Technology\nIn order to help us verify your identity and locate your personal information, please complete the\nfollowing questions as far as possible: -\n(a) CURRENT STUDENT\n□ Current student\nYear of study: ………………………………………….\nDegree Programme/Course………………………………………………………………………\n(b) STAFF\n□ Current staff\nDepartment/ Division: ……………………………………..... Staff Number: …………………………...\n□ Former staff\nDate employment ceased:  ……………………………….……………\nDepartment/ Division: ……………………………………..... Staff Number: …………………………...\n(c) ALUMNUS\n□ Alumnus\nYear of graduation:  ……………………………………………….\nDegree Programme/Course: ………………………………………………………………………\n(d) OTHER\nIf you are not a student, staff or alumnus, describe the nature of the relationship you had/have\nwith SIT and where possible, provide all other relevant details, including when the relationship\nwas established.\n………………………………………………………………..……………………………………..............\n……………………………………………………………………………………………...........................\nPERSONAL DATA PROTECTION ACT 2012 (No. 26 of 2012)\nACCESS REQUEST FORM\nC. Your  Request\nPlease provide the following information to enable us to respond to your request : -\nA. Detailed   description of\nthe personal  data that you\nare requesting for access\nto\nB. Name of the officer/\nemployee of SIT and\nhis/her   division\nwho collected  the\npersonal  data\nC. Date and purpose(s) for\nwhich the personal  data\nwas provided\nD.  Reasons for your  request\nfor access to your\nPersonal  Data\nPERSONAL DATA PROTECTION ACT 2012 (No. 26 of 2012)\nACCESS REQUEST FORM\nDeclaration\nI …………………..……….…, NRIC/ Passport No / Student ID  ………………………….., certify that\nthe information given on this application form for access to Personal Data for the Singapore Institute\nof Technology (“SIT”)  is correct.  I understand  that I will have  to pay a reasonable  fee and provide\nproof  of my identity (either my NRIC or Passport). I also understand that it may be necessary for\nSIT to obtain  more  detailed  information  in order  to locate  the correct  information.  I am aware that\nreferees and third parties may be contacted in cases where the disclosure of confidential references\nand other third -party information supplied in confidence is concerned.\nSignature: .…………………………………………………….\nDate :  ……………………………………………………….\nPlease return the completed form to the Data Protection Officer : -\nEmail address : dpo@singaporetech.edu.sg .\nPostal address : The Data Protection Officer, 1 Punggol Coast Road, Singapore 828608\n(if you are intending to provide this form and documents via post, which is not mandatory)\nItems  accompany ing your application are: -\ni Proof if identity (for example, NRIC/Passport, university card, other forms of proof of identity)\nii A fee, the quantum of which you shall be notified of at the time the access request is made"
}