{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Not%20Just%20a%20Change%20of%20Scene.pdf",
  "type": "pdf",
  "content": "Ms Sharifah Rawiah binte Matnor, 24, has fond memories\nof weekend travels around Ireland when she was on her\nOverseas Immersion Programme (OIP) as a student from\nthe Bachelor in Science (Occupational Therapy) degree\nprogramme. But more than that, the holistic nature of\nrehabilitation programmes in Ireland has provided her\nwith new perspectives that remain beneficial even after\ngraduation.\n“When I started work, I was able to share about the various\nprogrammes that I saw in Ireland and provide suggestions\nto improve on our current programme structure,”\nsaid Ms Sharifah, who is now working as an Occupational\nTherapist at SPD to help rehabilitate adults who have\nsuffered a stroke or spinal cord injuries, so as to reintegrate\nthem back into the mainstream workforce.\nShe added, “My knowledge with regard to the theoretical\naspects of occupational therapy has improved, and I am\nable to better explain concepts or ideas to my colleagues.\nWith the OIP experience of seeing how some theories have\nbeen applied to programmes that have been running for\nsome time, I have gotten a better picture on how to improve\nmy own interventions with my clients.”\nMs Sharifah was able to benefit from these experiences after\nreceiving The Singapore Ireland Fund Overseas Immersion\nProgramme Grant, which provides support to academically\npromising but financially disadvantaged undergraduates for\ntheir OIP in Ireland.\nThe Grant was established at SIT in 2013 with an endowed\ngift from The Ireland Funds Singapore. Valued at $6,000\neach, it has been awarded to 10 deserving students since\nAcademic Year 2014/15.\nOn 28 February 2017, five of these recipients including\nMs Sharifah were able to express their personal appreciation\nto Dr Stanley Quek, Chairman of The Ireland Funds Singapore. SiTIZEN  |  07/16\nRecipients of The Singapore Ireland Fund Overseas Immersion Programme Grant enjoyed tea with Dr Stanley Quek, Chairman, The Ireland Funds Singapore (back\nrow, middle), along with Prof Tan Thiam Soon, President, SIT (back row, extreme left) and Assoc Prof May Lim, Programme Director, SIT.\nMs Sharifah Rawiah (first row, extreme left), who received The Singapore Ireland\nFund Overseas Immersion Programme Grant, with her classmates at the Trinity\nCollege Dublin campus.Not Just a Change of Scene\nRecipients of The Singapore Ireland Fund Overseas Immersion Programme Grant gain new\nperspectives and deeper understanding on how to apply the knowledge they’ve learnt\nDr Quek was invited to tea at the SIT@Dover campus with the\ngrant recipients alongside Prof Tan Thiam Soon, President,\nSIT, as well as SIT faculty and staff.\nMs Shilin Lim, another grant recipient, said getting to chat\nwith Dr Quek was a great experience. “I don’t come from\na well-to-do family and the Grant has helped to alleviate\nsome of the financial burden my family faced,” she said,\nadding, “I felt fortunate to be able to get the grant and\nI really appreciate the motivation for The Ireland Funds\nSingapore for establishing the OIP Grant.”\nCurrently still on her OIP , Ms Lim is scheduled to return\nto Singapore only in early June. In the meantime, SITizen\nreceived a text message from her, in which she shared the\nexcitement of her learning journey. “During the attachment,\nwe had the chance to see surgery performed in the operating\ntheatres – something that we don’t get to do in Singapore!”"
}