{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/changingliveswiththeactofgiving.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  11/16\nSIT Bursary recipients came down to thank faculty and staff and share how the bursary has\nhelped them in their academic journey in SIT.\nFaculty and staff from across SIT gave a strong show of support at the Faculty & Staff Giving\nroadshow. Left photo: SIT staff getting to know the SIT Bursary recipients.Assoc Prof Ivan Lee (far left), Vice President (Industry & Community),\nSIT; Assoc Prof May Lim (first row, second from right), Director,\nCoLEAD, SIT; and staff from CoLEAD. The CoLEAD team spent the\nafternoon spreading the word about AdventureLearn, a new holistic\nstudent development platform that is attracting support from SIT’s\nfaculty and staff.\nThe CoLEAD team explains the features of AdventureLearn to faculty\nand staff.Participants were treated to coconut ice cream, as well as Ramly burgers\nand iced coffee.\nChanging Lives with\nthe Act of Giving\nLast year, employees at the Singapore Institute of Technology\n(SIT) raised more than $73,000 through the Faculty & Staff Giving\n(FSG) initiative, which allows faculty and staff to offer financial\nsupport to students and student-centric initiatives at SIT.\nTogether, their collective giving made possible 24 SIT Bursaries\nfor Academic Year 2018/19, which were awarded to financially\ndisadvantaged students at SIT.\nTo celebrate the impact of this giving, the FSG Roadshow\nwas held on 20 June 2019 at SIT@Dover campus. Participants\nenjoyed a light lunch of Ramly burgers, coconut ice cream and\niced coffee. They also had a chance to chat with SIT Bursary\nrecipients, who were there to share more on what receiving the\nBursary meant to them.\nThis year, SIT employees have a new option to direct their\ncontributions to the AdventureLearn development fund. Introduced\nat the FSG Roadshow, AdventureLearn is a new holistic student\ndevelopment platform that, once completed, will enable students\nto learn better by helping them understand their personal learning\nstyle and characteristics.\nMr Lim Shao Ming from SIT’s Human Resources Division gave to\nboth the SIT Bursary and AdventureLearn. He hopes his gift will\nplay a small part in aiding the development of students. “Having\nbeen a full-time student myself, I know the tremendous pressure\nstudents can feel from examinations or project deadlines.\nThe last thing they would want is to add on to their stress with\nfinancial worries. I hope the SIT Bursary and AdventureLearn\nwould seamlessly complement each other in helping to provide\na supportive, fun-filled learning environment for our students.”SIT employees come together at the\nFaculty & Staff Giving Roadshow to\ncelebrate the value of giving, and support\nthe new AdventureLearn programme\nSIT Bursary recipient and Food Technology\nstudent, Mr Quek Xing Yu said the bursary is “a\ngreat blessing” as his father is suffering from\nmultiple myeloma and cannot work for extended\nperiods. ”The bursary helps greatly in allowing me\nto focus on taking care of my father and finishing\nmy assignments. I am truly grateful to those who\nhave contributed, and have helped change my\nlife with that act of giving,” he said."
}