{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20110210st-universityofmanchestersitoffernewnursingdegree.pdf",
  "type": "pdf",
  "content": "BYJENNANI DURAI\nNURSING diploma holders who want to\nstudy for a degree now have another ave-\nnue available to them.\nIt comes in the form of a new tie-up be-\ntween the Singapore Institute of Technolo-\ngy (SIT) and the University of Manchester\n(UOM). The British university, ranked\namong Britain’s best for nursing, will offer\na two-year direct honours bachelor’s de-\ngree in nursing in conjunction with SIT\nstarting in September this year. It will take\nin 70 students.\nSpeaking at the signing ceremony at\nNanyang Polytechnic (NYP) yesterday, Ed-\nucation Minister Ng Eng Hen said nurses\nwere “critical to the foundation of daily\nhealth-care operations”, as they make up\nabout 40 per cent of the staff in public hos-\npital groups. He also announced that SIT –\nwhich runs foreign university degree cours-\nes on polytechnic campuses here – had se-\ncured 20 scholarships from health-care\ngroups for students in the programme.\nProfessor Karen Luker, dean of the nurs-\ning school at UOM, said the training of\nnurses worldwide was increasingly being\ndelivered through university degree cours-es. “No one questions that doctors need de-\ngrees, but when you see the complexities\nof what nurses have to do, you have to won-\nder why they don’t either,” she said.\nThe course will be conducted at NYP,\nwhich is one of two polytechnics here that\noffer a nursing diploma course. Together\nwith Ngee Ann Polytechnic, it graduates\naround 1,000 registered nurses a year.\nThe programme will supplement the\ngraduate nurses produced by the National\nUniversity of Singapore’s Alice Lee Centre\nfor Nursing Studies, which takes in 80 to\n90 undergraduates a year. Other ways for\nthose wanting a degree include courses at\nprivate institutions, such as the one by theSingapore Institute of Management with\nthe University of Sydney, and the course\nrun by the Singapore Nurses Association\nwith Australia’s La Trobe University.\nAccording to Ministry of Health figures,\nabout 20 per cent of registered nurses in\nthe public health-care sector hold degrees.\nHaving a degree will put registered nurs-\nes on a fast track to leadership positions,\nsaid Ms Wong Luan Wah, director of the\nSchool of Health Sciences at NYP.\nShe added that the programme was de-\nveloped in consultation with the Ministry\nof Health. This means it will pay special at-\ntention to particular areas of need in Singa-\npore, such as long-term palliative care.\nBYK.C.VIJAYAN\nLAW CORRESPONDENT\nTHE deadlock between the Law Society and some\nunhappy members is finally set to be resolved in\ntwo weeks’ time at a meeting that could force a\nchange of its top leadership.\nThe society sent a circular to members last night\ntelling them an extraordinary general meeting\n(EGM) will be held at the Supreme Court Auditori-\num on Feb 25.\nMembers will debate a motion of no confidence\nin the president, vice-presidents and governing\ncouncil.\nThe no-confidence move – which is tantamount\nto asking them to resign – follows a row over busi-\nness-class travel for the top leaders.\nIt comes less than two months after the newly\nconstituted governing council took over manage-\nment of the Law Society. This is believed to be one\nof the shortest periods of governance by a council\nfollowed by a no-confidence vote.\nBut members of the council, led by its president,\nSenior Counsel Wong Meng Meng, are looking at\nthe EGM as an opportunity to seek a mandate on\ntheir policies.\n“Council members serve as a matter of public\nservice and volunteerism. I personally am looking\nforward to obtaining a clear mandate from the pro-\nfession I serve,” said council member Stephanie\nYuen-Thio.\nThe ongoing dispute began after some members,\nled by prominent criminal lawyer Subhas Anandan,\nvoiced their unhappiness over a move to allow the\nLaw Society president and two vice-presidents to\ntravel business class.\nThis kind of travel was allowed on trips lasting\nmore than five hours while representing the Law So-\nciety at official events overseas, and was subject to\napproval by the council and executive committee.\nForty-four lawyers, mostly from small firms,\ncalled for an EGM to revoke this policy but the Law\nSociety decided the motion was beyond the powers\nof any EGM, after taking independent legal advice.\nUndeterred, the lawyers went on to get 88 signa-\ntures to call for an EGM but with a new motion of\nno confidence in the governing council. The society\nhas about 3,800 members.\nBroadening the move into a no-confidence mo-\ntion will mean that issues to be discussed will not\nbe limited to the business-class travel policy.\nIt is unclear if the members who called for the\noriginal motion will modify their demands during\nthe EGM.\nAsked last night if any ongoing talks would avert\nthe EGM, Mr Anandan said that regardless of any\ntalks, the EGM has to be convened “according to\nprescribed procedures”.\nThe last EGM involving a no-confidence motion\nwas held in 2003 but members voted to adjourn the\nmeeting with no outcome.\nvijayan@sph.com.sgEducation Minister Ng Eng Hen, who was at the signing of the tie-up yesterday, speaking to students\nat a simulated operating theatre in NYP. The new course will offer 70 places. ST PHOTO: ASHLEIGH SIM\nUniversity of\nManchester,\nSIT offer new\nnursing degree\nNo-confidence motion to be\ndebated at Feb 25 meeting; it\ncould force change of leadership\nLaw\nSociety\ncalls EGM\nto end\ndeadlockhome L\nTHE STRAITS TIMES THURSDAY, FEBRUARY 10 2011 PAGE B6"
}