{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-09/%5BFA%5D%20SIT%20AR%202024_03_Impacting%20individuals_0.pdf",
  "type": "pdf",
  "content": "IMPACTING INDIVIDUALSUNDERGRADUATE ADMISSIONS\nWe are Singapore’s third largest Autonomous University by full-time undergraduate intake\nand we are growing.\nUndergraduate Admissions Numbers (AY2021-AY2023)\n14,000\n12,000\n10,000\n8,000\n6,000\n4,000\n2,000\n0\nAY202112,818\n2,952\nAY202212,902\n3,121\nAY202313,053\n3,328Application\nNumbers\nIntake\nNumbers\n96% of\nundergraduates\nadmitted to\ntop choice\nprogrammes*\n*1st or 2nd choice programmesEntry Qualification\nPolytechnic Diploma\nSingapore GCE ‘A’ Level\nOthers\nTotalStudent Numbers\n3,104\n171\n53\n3,328Application\nNumbers\n13,053Intake Numbers\n3,328\nIncluding 332 adult\nlearners and 99\ninternational students6.6% increase\nfrom AY2022As Singapore’s first University of Applied\nLearning, our students enjoy a comprehensive\neducation that includes personal and\nprofessional development, in addition to\ndisciplinary knowledge and skills. This has\nproven to be a winning approach, as the\nAY2023 intake for both undergraduate and\npostgraduate programmes showed a healthy\nincrease from the previous year.\n/16\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024\nPOSTGRADUATE ADMISSIONS\nWe are building a thriving postgraduate community.\n33  students for the Master of Science in Civil Engineering*\n34  students for the Master of Science in Mechanical Engineering*\n25%  higher intake from AY2022\n*As of 31 January 2024\nINDUSTRIAL DOCTORATE AND\nINDUSTRIAL MASTERS PROGRAMMES\n47  enrolments into Industrial Master and Doctorate Programmes*\n•   3 MClinRes  •   5 DClinRes\n•   14 MEng  •   25 DEng\n*As of 31 January 2024STUDENT POPULATION  (AS OF 25 SEPTEMBER 2023)\nUndergraduate Programmes\nPostgraduate Coursework Programmes\nPostgraduate Research Programmes10,426*\n93\n39\n*Includes 46 students in the inaugural Competency-based Stackable Micro-credential (CSM)\npathway in Bachelor of Science with Honours in Applied Computing.Academic cluster intake\nTotal\n3,328\nStudents14.9%   Business, Communication and Design (495 Students)\n27.3%   Engineering (910 Students)\n7.6%  Food, Chemical and Biotechnology (252 Students)\n18.2%   Health and Social Sciences (607 Students)\n32%   Infocomm Technology (1,064 Students)\nTop 3 largest programmes by intake:\nAccountancy, ICT (Information\nSecurity), PhysiotherapyEXPLORING NEW FRONTIERS\nIN APPLIED LEARNING\nWith our focus on applied learning, SIT bridges the gap between academia and industry,\nforging strategic partnerships that fuel our curriculum development. From launching cutting-\nedge programmes to integrating industry internships and projects, we embed students in\nreal-world settings.\nLaunch of new programmes\nPre-employment Training (PET):\nIntegrated Bachelor of Science in Nursing (BSN) – Master of Science in\nNursing (MSN) programme\nDeveloped in collaboration with SingHealth, to nurture specialist nurses\nand the next generation of nurses and leaders to keep ahead of the fast-\nevolving healthcare landscape.\nAgritech and Aquaculture Specialisation in the Bachelor of Engineering in\nSustainable Built Environment (SBE) programme\nDeveloped in response to the transformation in the agri-food sector and\nthe growing global demand for green talent.\nContinuing Education and Training (CET):\nMaster of Health Sciences (MHSc)\nDesigned to address the needs of Singapore’s ageing population with five\nspecialisations anchored by a progressive curriculum./17\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024\nClinical Supervision Programme\nDeveloped to equip Allied Health Professionals (AHP) clinical supervisors\nand educators with intermediate-level competencies for effective training.\nMaintain Workplace Safety & Health (WSH) and Occupational Health &\nSafety Management System\nDeveloped in collaboration with the Social Service Institute to address WSH\nrequirements and establish systematic occupational health and safety risk\nmanagement.\nBusiness Digitalisation and Transformation with Singapore Pools Academy\nDeveloped to enhance the capabilities of the social service sector through\nthe exploration of the digital world, data storytelling, cognitive automation,\ngenerative AI, and strategic digitalisation planning.\nIntroduction to Sustainability for Businesses with the Association of Small &\nMedium Enterprises (ASME) and Masterclass on Maritime Decarbonisation\nwith Society of Naval Architects & Marine Engineers Singapore (SNAMES),\nSingapore Shipping Association (SSA)\nTopics include environmental sustainability for businesses, energy-efficient\ntechnologies, energy storage systems, and green fuels for the maritime sector.\nLaunch of new Competency-based Stackable\nMicro-credential (CSM) pathway\nA flexible learning pathway for working adults to attain competencies to\nassume new or higher job roles through micro-credentials which can be\nstacked towards a degree, with Recognition of Prior Learning (RPL).\nFirst programme: Bachelor of Science with Honours in Applied Computing\n“I have a lot of work\nexperience, but in\ntraditional universities,\nthose experiences don’t\ntranslate very well. So I am\nglad that NCS has provided\nme with this opportunity\nand SIT (for opening) this\nnew course”.United Tech Construction\nContinental\nSIT Photo: Keng Photography/Tan Eng Keng SIT Photo\nPhoto: Rapsodo Photo: Clarence HoonRapsodo\nHeineken Cambodia\nDEEPENING WORK-LEARN INTEGRATION\nThe Integrated Work Study Programme (IWSP) is a signature of an SIT degree. It allows students\nto integrate theory and practice, and develop deep specialist skills in their chosen field.\nIndustry Partners & Positions\n921  Overseas and Local Industry Partners\n8,081  Overseas and Local Industry Positions/18\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024\nStudents\nNumber of students out for IWSP in AY2023: 2,391\n1 in 2  students received job offers from their IWSP companies before graduation.\nIndustry Mentorship Programme\n7th run  of the Industry Mentorship Programme (IMP).\nCollaboration between SIT’s Centre for Career Readiness and Young NTUC to\nprepare SITizens for their foray into the workplace. The programme pairs students\nwith an industry mentor from the relevant industry for industry-specific career\nadvice and guidance.\n77  industry mentors and 94 Engineering, and Food, Chemical and Biotechnology\nSITizens participated.\nEach individual has different needs and different stories.\nI think it’s a really worthwhile experience and I would\nencourage others to do the same.”“Dr James Nobbs\nSenior Scientist A*STAREXPANDING SITIZENS’ HORIZONS\nAt SIT, we encourage SITizens to step out of their comfort zones and embrace new challenges\nto enrich their learning journeys. Our overseas experiences take several forms:\nOverseas Immersion Programme (OIP): Integrated into both joint and OU\nundergraduate programmes, it offers diverse learning experiences, including\nlectures, hands-on project work, workshops and industry visits at our partner\noverseas universities.\nOverseas Exposure Programme (OEP): Specially curated with our international\npartners, it enhances our students’ learning beyond the Singapore context.\nOverseas Social Innovation Projects (OSIP): Students identify and address\ncontemporary social, environmental or sustainability challenges in regional\ncountries to create social impact.\nOverseas Integrated Work Study Programme (OIWSP): Overseas work\nexperiences allow students to acquire global insights and immerse themselves\nin regional industries.\nSIT Photo:\nKeng Photography/\nTan Eng Keng\n1,616 SIT students\nparticipated in\noverseas trips in\nAY2023OIP  1,344\nOEP  186\nOSIP  54\nOIWSP  32\nSITizens embarking on various overseas programmes to expand their horizons and look\nbeyond Singapore’s borders\nSIT Photos: Global Experience Division\n/19\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024\nFrom performances at events held by our community partners to providing\nfood for Sahur and Iftar to Yishun residents, our students have been\nleveraging their expertise to help enrich the lives of the wider community.ENLIVENING STUDENT LIFE\n800 student\nleaders568 student\nevents\norganised\n156 student\ngroupsOur SITizens also benefit from exchanges with students from our\nOverseas University partners, as well as those from other local\nuniversities.\n114 exchange students received from 10 Overseas University partners\nInaugural participation in the Singapore University Student Exchange\nProgramme (SUSEP)\nA local inter-university Student Exchange\nProgramme  where students from other AUs can\ntake selected courses and experience student life at\nSIT for one trimester, while concurrently pursuing\ntheir degree programme in their home university.\nLikewise, SIT students can elect to take selected\ncourses at other local partner universities.\nVarious community events that our students have participated in\nSIT Photos: Office of SITizen Experience\nSIT Bowling and SIT Astronomers – two of the 156 vibrant student\ngroups in SIT\nPhoto: SIT Bowling, SIT AstronomersFive new ASEAN-China-India (ACI) countries (Malaysia, Indonesia,\nThailand, Vietnam and China) were engaged to:\nCo-develop Overseas Immersion Programmes (OIP) with university and industry\npartners in Vietnam, Indonesia and China.\nConduct Social Innovation Projects (SIP) tackling public health and sustainability\nproblem statements with university partners in Malaysia and Indonesia.\nOrganise exchanges of staff and students from BCD and HSS clusters in\nAccountancy, Hospitality Business and Public Health with university partners\nin Indonesia.\nMeeting with Hong Kong Polytechnic\nUniversity (PolyU)  Engaging Chulalongkorn University (CU) in\nThailand\n/20\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024\nCelebrating student\nsuccesses:\nFive undergraduates from the Digital\nCommunications and Integrated\nMedia (DCIM) degree programme\nimpressed judges at the biennial\nInstitute of Public Relations of\nSingapore (IPRS) PRISM Awards.\nTheir “Reverse the Future” project\nwas recognised with a Merit Award\nin the Outstanding PR Student\nProject category.\nSingapore Women in Tech 2023\nSITizens Phoebe Chee (bottom left) and Teoh Mei Ting (bottom right) were recognised\nin the Singapore Computer Society’s 2023 “Singapore Girls in Tech” category. Associate\nProfessor Jeannie Lee was also honoured as one of “Singapore’s 100 Women in Tech”\n(SG100WIT) for her contributions to the nation’s tech industry.\nPhoto: Phoebe Chee Photo: Keng Photography/Tan Eng KengPhoto: Institute of Public Relations of SingaporeCELEBRATING OUR GRADUATES\nOur graduates continue to be highly sought after by industry, achieving high employment\nrates and earning higher starting salaries. Our Graduate Employment Survey for the Class of\n2022 found that:\n9 in 10  SIT graduates were employed within six months of graduation\n86.6%  secured full-time permanent employment\n52.6%  of graduates received advance offers\nOur graduates continue to blaze new trails. Our Class of 2023 saw 2,050 graduands, including\npioneer cohorts of the following programmes:\nBachelor of Science with Honours in Digital Communications and Integrated\nMedia (DCIM)\nBachelor of Science with Honours in Dietetics and Nutrition (DTN)\nMaster of Science in Mechanical Engineering\nAs we celebrated their achievements, we also reinforced our commitment to their learning\nwith the “Learn for Life” initiative – a complimentary course or module, valued at up to S$3,500,\nonce every five years.21.6% accepted offersMean gross monthly\nsalary of $4,160Median gross monthly\nsalary of $3,950\nCelebrating the class of 2023\nSIT Photo: Keng Photography/Wang Zhixiang, Gwen Chew\n/21\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024\nSIT is making a strong commitment to support our alumni\nin their lifelong learning journeys. We recognise that this\nis necessary for them to stay agile in response to the rapid\nchanges and disruptions that are happening in the world of\nwork and for them to upskill as they progress in their careers.\nOur programme offerings are always aimed at addressing\nindustry demands, so they are always relevant and well\nsuited to the needs of our alumni at the different phases\nof their careers and/or in responding to the changes and\ndisruptions in their industry.” “ONCE A SITIZEN, ALWAYS A SITIZEN\nNumber of SIT alumni at the end of FY2023: 18,926\n3,074 SIT alumni participated in 52 events in FY2023\nSIT Photo: Keng Photography/Tan Eng KengMore than 750 SIT alumni and students from the graduating Class of 2023 gathered at Tanjong\nBeach on Sentosa Island for SIT’s inaugural Alumni Reunion on 29 April 2023 at the Hendrick’s\nSunset Cinema.\nSIT Photo: RS PhotographyMore than 90 SIT alumni participated in “Vínculo” (which means “connection” in Spanish), SIT’s\nfirst ever alumni beach sports competition. Held at Palawan Beach in Sentosa on 26 August\n2023, the SITizens competed in games such as such Captain’s Ball, Frisbee and Futsal.\nSIT Photo: Studio Zero (formerly Food & Shelter)/BennyThe first SIT Alumni Mentoring Forum was held in September 2023. More than 70 SIT alumni\nmentors participated to guide and support current students, helping them navigate the transition\nfrom academia to the professional world.Prof Chua Kee Chaing\nGraduation 2023\nSnippets of SIT Graduation 2023\nSIT Photo: Keng Photography/Wang Zhixiang, Gwen Chew\n/22\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024\nEMPOWERING EDUCATORS\nSIT spearheads the applied learning movement in Singapore’s universities. We spark critical\ndialogues and ignite collaborations through targeted initiatives that bring together leading\nminds from academia and industry to share best practices, explore emerging trends, and\nultimately, advance the field of applied learning.\nApplied Learning Conference 2023 (20-21 July 2023)\nAttended by over 300 local and international delegates.\nExplored Competency-Based Education and the key skills and competencies\nneeded in the workforce.\nLaunched the SIT Teaching and Learning Academy (STLA), an academy aimed at\nenhancing the teaching of our learners, in particular, in-employment learners\nlooking to upskill or reskill themselves.\nAligning for growth in teaching\nWe are committed to enhancing teaching and learning. The Applied Learning and\nInnovation Grant (ALIGN) promotes effective applied learning, adoption of education\ntechnology and innovation for teaching and learning at SIT.\nA total funding of $167,000 was allocated to six projects:\nWhat’s the Problem? An e-learning Package to Improve Clinical Reasoning in\nNeurological Physiotherapy.\nDesign and Development of a Virtual High-Voltage Laboratory for Effective\nApplied Learning.\nAn Integrated Approach to Feedback: Automated, Peer, and Teacher Feedback\nfor Improvement in Writing.\nMoBISDeR: An Effective Teaching Methodology for Learning Radio Frequency\nSystems.\nEnhancing Engagement and Learning in Physics Labs through Gamification: A\nPilot Study.\nUsing Immersive Learning for Developing Surface Anatomy Palpation Competency\nAmong Physiotherapy & Occupational Therapy Students.\nInaugural CBExchange Asia Pacific Conference\n(29 Feb – 1 Mar 2024)\nOrganised in collaboration with Competency-Based Education Network (C-BEN).\nAttended by over 500 local and international delegates.\nExplored new approaches to learning that works better for both learners and industry.\nSIT Photo: Keng Photography/Tan Eng Keng/23\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024\nSIT University Awards\n2023 saw the consolidation of the various awards ceremonies to celebrate our people,\nunder the banner of the SIT University Awards. Our inaugural ceremony honoured 51\nfaculty and staff for their achievements in the following categories:\nTeaching Excellence Awards: Honouring academic staff for exceptional\ncontributions in their fields.\nStudent Developer Awards: Acknowledging non-academic staff who significantly\nenhanced student learning experiences.\nApplied Research Excellence Awards: Recognising academic staff whose research\nsubstantially advanced our applied research objectives.\nService Appreciation Awards: Commemorating dedicated employees with five\nor 10 years of service at SIT.\nService Appreciation Awards: 10 Years of Service\nSIT Photo: Keng Photography/Tan Eng KengTeaching Excellence Awards\nApplied Research Excellence Awards Student Developer AwardsService Appreciation Awards: Five Years of Service\n/24\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024"
}