{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-11/SIT%20Personal%20Data%20Withdrawal%20of%20Consent%20Request%20Form%20Nov%202024.pdf",
  "type": "pdf",
  "content": "PERSONAL  DATA  PROTECTION  ACT 2012  (No. 26 of 2012)\nWITHDRAWAL  OF CONSENT  REQUEST  FORM\nNotes  for Applicants\n1. Under  the Personal  Data Protection  Act of Singapore  2012 , an individual  is entitled  to withdraw\nany consent given, or deemed to have been given, in respect of the collection, use or\ndisclosure by that organisation of personal data about the individual for any purpose.\n2. The request  must be in writing and  must  be accompanied  by any necessary\ninformation/documentation  to identify  the enquirer  (for example, NRIC/  Passport  no., student\nID or other form of  proof  of identity)  and to locate  the record  of personal data for which consent\nis withdrawn.\n3. The Singapore Institute of Technology (“ SIT”) will comply with the request for withdrawal of\nconsent within 10 business  days of receiving the request or receiving the information referred\nto in ( 2), whichever is later.  Should SIT require more time to give effect to a withdrawal notice,\nSIT will inform within 10 workings days the timeframe by which the withdrawal of consent\nrequest will take effect.\n4. Notwithstanding  such  withdrawal  of consent,  SIT may continue  to collect,  use or disclose  data\nwithout the consent of the individual if it is required or authorized under the Personal Data\nProtection Act  2012  or any other written law.\n5. To withdraw consent for collection, use of disclosure of your personal data, p lease complete\nthe following form and sign the accompanying declaration and proof of identity, to the Data\nProtection Officer at the address provided in the form .\n6. Please note that when you withdraw your consent to any collection, use and/or disclosure of\nyour personal data, it may affect the services provided by SIT to you when such consent is\nregarded as a condition of providing services from SIT.\nPERSONAL  DATA  PROTECTION  ACT 2012  (No. 26 of 2012)\nWITHDRAWAL  OF CONSENT  REQUEST  FORM\nA. The Requesting  Party’s  Details\nFull Name  (Block  letters)  :\nNRIC/  Passport  Number /\nStudent ID  :\nAddress  :\nTelephone  Number(s)\nResidential/  Office/  Mobile  :\nEmail  :\nB. Your  status/relationship  with the Singapore  Institute  of Technology\nIn order  to help us verify  your identity  and locate  your personal information,  please  complete  the\nfollowing questions as far as possible: -\n(a) STUDENT\n□ Current  student  (please  give year of study)  ……………………………………………….\n□ Former  student  (please  give date last registered)………………………………………….\nDegree  Programme /Course………………………………………………………………………\n(b) STAFF\n□ Current  staff\n□ Former  staff (please  state  date employment  ceased)  ……………………………….……………\nDepartment/  Division  …………………………………….  .... Staff Number  …………………………..\n(c) ALUMNUS\n□ Alumnus  (please  give year of graduation)  ……………………………………………….\n(d) OTHER\nIf you are not a student,  staff or alumnus,  describe  what  relationship  have  you had/have  with SIT\nand when?\n………………………………………………………………..……………………………………..............\n……………………………………………………………………………………………...........................\nPERSONAL  DATA  PROTECTION  ACT 2012  (No. 26 of 2012)\nWITHDRAWAL  OF CONSENT  REQUEST  FORM\nC. Your  Request\nPlease  provide  the following  information  to enable  us to respond  to your request  :-\nA. Detailed  description of  the\npersonal  data for which you\nare withdrawing consent  :\nB.    Name of the officer/ employee\nof SIT and his/her division\nwho collected the personal\ndata :\nC.   Date and purpose(s) for which\nthe personal data was\nprovided  :\nD. Details of your request for\nwithdrawal of consent for\ncollection, use and/or\ndisclosure (please specify) of\nPersonal Data  :\nE.   For withdrawal of consent to\nthe sending of  marketing\nmessages, please specify the\ntelephone (or fax) number at\nwhich you no longer wish to\nreceive marketing  messages\nfrom SIT  :\nF. Reasons  for withdrawal of\nconsent  :\nPERSONAL  DATA  PROTECTION  ACT 2012  (No. 26 of 2012)\nWITHDRAWAL  OF CONSENT  REQUEST  FORM\nDeclaration\nI …………………..……….…, NRIC/ Passport No / Student ID  ………………………….., certify that\nthe information  given  on this Withdrawal  of Consent  application  form to the Singapore  Institute of\nTechnology  (“SIT”)  is correct.  I understand  that I will have  to provide  proof  of my identity (either  my\nNRIC , Passport  or Student ID ). I understand  that it may be necessary  for SIT to obtain  more detailed\ninformation  in order  to locate  the correct  information.  I am aware  that referees  and third  parties  may\nbe contacted  in cases  where  the disclosure  of confidential  references  and other third -party\ninformation supplied in confidence is concerned.\nSigned .…………………………………………………….\nDated  ……………………………………………………….\nPlease  return  the completed  form to the Data  Protection  Officer  :-\nEmail  address : dpo@singaporetech.edu.sg .\nPostal  address : The Data  Protection  Officer,  1 Punggol Coast Road, Singapore 828608 . (if you\nare intending to provide this form and documents via post, which is not mandatory)\nDocuments  which  must  accompany  your application  are:-\ni Evidence  of your identity  (NRIC/  Passport,  University  card,  proof  of identity)"
}