{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-09/%5BFA%5D%20SIT%20AR%202024_05_Impacting%20Communities.pdf",
  "type": "pdf",
  "content": "Inaugural Overseas Immersion Programme (under\nUSI2001 Social Innovation Project module)\nUSI2001 aims to create opportunities for students to address issues and multi-\nfaceted societal challenges by co-creating, prototyping and presenting a socially\ninnovative solution for a specific community group.\n55 students participated in the inaugural OIP, split among 12 multi-disciplinary teams.\nSpent 5-7 days working with counterparts in Indonesia (Depok and Surabaya) and\nCambodia (Phnom Penh) for fieldwork, ground sensing and user engagement.\nCo-created solutions with end-users to address current issues.SIT Community Challenge 2023\nAn annual challenge run by The Community Leadership And Social Innovation\nCentre (CLASIC) that seeks to partner the community to solve problems using\nscience, technology and engineering skills.\nThe 2023 edition saw a collaboration with the James Dyson Foundation and focused\non secondary schools in Punggol.\nFirst CLASIC Overseas Project\nCollaborated with Singapore International Foundation (SIF) on the Water for Life\nProgramme in Siem Reap, Cambodia.\nLed by A/Prof Steven Tay with six Mechanical Engineering Students, the project\nteam installed 30 bio-sand filters in the communities and villages of Siem Reap.\nThe students engaged with the villagers, gaining valuable insights into their\nwater usage patterns and habits, allowing the team to identify the most suitable\nlocations for installing the bio-sand filters and develop effective water management\nstrategies for rural areas.IMPACTING COMMUNITIES\nAs we grow towards our vision of becoming a\npremier University of Applied Learning, we aim\nto be a force for good and drive change in the\ncommunity. SIT’s core value, “Grounded in the\nCommunity” isn’t just a phrase; it’s woven into\nevery aspect of our work.\nSIT collaborates with the community to solve problems using science, technology, and\nengineering, as seen in the SIT Community Challenge 2023.\n/28\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024"
}