{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Meeting%20of%20Minds.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  11/16\nStudents from SIT’s Sustainable Infrastructure Engineering programme learn more about sustainable construction\nat the Centre\nBaker Tilly TFW treats SIT’s Accountancy undergraduates\nto a visit to the firm, a delicious lunch, and nutritious insights\ninto the Accounting industryOn 14 March 2017, a group of 11 SIT students from the Sustainable Infrastructure Engineering (SIE) programmes,\naccompanied by SIT faculty and staff, visited the Samwoh Innovation Centre in Kranji Crescent. Mr Eric Soh, CEO, Samwoh\nCorporation, had invited the group, giving them the opportunity to tour the company’s facilities where new construction\nrecycling technology is tested and researched.\nThe group included the four recipients of the Samwoh Bursary, which is open to students from the SIE (Land) programme.\nThe Bursary was made possible by a gift from Samwoh Corporation in 2014.\nMr Lee Xiang Han, a Bursary recipient who is from the SIE (Land) programme, had never been to a Research & Development\nfacility and found the visit to be “an eye opener”. Said Mr Lee, “I learnt that it is important to innovate and find creative\nnew ways to keep ourselves sustainable in the field of civil\nengineering and construction. One interesting thing was\nlearning about the recycled rubber material they used to\nconstruct the floor of playgrounds now.”\nMr Nathaniel Soh, a student from the SIE (Building Services)\nprogramme echoed this sentiment. He said, “It was inspiring\nto learn about the innovations by Samwoh. Learning how\nSamwoh recycles and reuses demolished construction\nmaterials has broadened my view of recycling techniques and\navailable materials.”\nEarlier this year, Samwoh decided to nurture even more\nstudents at SIT by making a new gift to support the Samwoh\nCorporation Global Immersion Study Grant and the Samwoh\nCorporation Outstanding Student Award in Civil Engineering.\nSamwoh has also deepened its relationship with SIT through\na Collaboration on Agreement to establish an Industry Lab.\nOn 16 March 2017, Baker Tilly TFW hosted a small group from\nthe Singapore Institute of Technology (SIT) to a small ceremony\nat their office and a sumptuous lunch at a Chinese restaurant\nat the Intercontinental Hotel, which included its scholarship\nand award recipients for Academic Year (AY) 2016/17 as well\nas Prof Tan Thiam Soon, President, SIT.\nThe firm has been a strong supporter of SIT’s Accountancy\nstudents since 2015 when it made gifts to establish the Baker\nTilly TFW Scholarship and the Baker Tilly TFW Outstanding\nAward in Accountancy. Six Scholarships have been awarded\nsince AY 2014/15 to academically promising Accountancy\nstudents and the very first Baker Tilly TFW Outstanding\nAward in Accountancy was presented to Mr Sean Ooi in\nFebruary 2017 at the SIT Graduation Ceremony (see pages 2-3 for more on the Graduation Ceremony).\nMr Ooi, who was present at the lunch, said he was “definitely honoured and humbled beyond words” to have been awarded\nthis accolade. The 24-year old, who will start work as an Audit Associate at a Big Four firm in June 2017, added, “I am\ngrateful to Baker Tilly TFW for this award and hope that it too can be an inspiration for my juniors to strive for excellence.”\nMs Ng Kai Lin, who received the Baker Tilly TFW Scholarship this year and  is expected to graduate in December 2018,\nsaid, “I used to work part-time in my polytechnic days but since university started I couldn’t find the time to work, as the\nworkload was quite heavy. Therefore, with this scholarship I was able to focus more on my studies.”\nShe also found the lunch fruitful as the partners from Baker Tilly were very generous in sharing more about the firm and\nother issues surrounding the accounting industry with the undergraduates. She said, “The different conversation topics\nduring lunch such as quality assurance in educational institutions really helped widen my view about how encompassing\nthis field is.”SIE Students Tour Samwoh Innovation Centre\nMeeting of MindsSIT students get a hands-on learning experience at the Samwoh Innovation\nCentre where they had the opportunity to study recycled materials that can be\nused for construction projects.\n(From left) Partners from Baker Tilly TFW, Ms Susan Foong and Mr Khor Boon\nHong; Baker Tilly TFW Scholarship Recipients, Ms Ng Kai Lin and Ms Jasmine\nChiang; Mr Sean Ooi, recipient of the Baker Tilly TFW Outstanding Student\nAward and Mr Sim Guan Seng, Managing Partner, Baker Tilly TFW."
}