{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Uplifiting%20Gift%20Brings%20Cheer%20and%20Goodwill.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  06/16\nUplifting Gift Brings Cheer and Goodwill\nSome Breakfast and a Lot of FellowshipNew gift from Loyang Tua Pek Kong Temple makes possible\nbursaries in aid of SIT students\nAt the Rotary Club of Bugis Junction Breakfast Meeting, SIT\nstudents and alumni expressed their appreciation for the\nClub’s supportOn 17 March, SIT recipients of the Loyang Tua Pek Kong Bursary not only\nreceived much-needed financial support, but also got a chance to enjoy the festivities at the 2019 birthday celebration of Loyang Tua Pek Kong Temple.\nRenowned in Singapore as a symbol of religious harmony, Loyang Tua Pek\nKong Temple is a multi-religious place of worship where Taoist, Buddhist and Hindu devotees can worship side by side. The Temple’s gift to SIT has made possible 10 Bursaries annually for students across all five academic clusters.\nThe recipients were treated to performances and also enjoyed local\nsnacks from booths serving refreshments to the public. Mr Koo Jia Wei, a Year 3 Telematics student and Bursary recipient, thought the event was an\nSeven students and alumni from the Singapore Institute of Technology (SIT) were among the attendees of the Rotary Club of Bugis Junction (RCBJ) Breakfast Meeting held on the Saturday morning of 2 March 2019 at the Holiday Inn Singapore Atrium. They are also recipients of the Rotary Club of Bugis Junction Scholarship, Rotary Club of Bugis Junction Bursary and Rotary Club of Bugis Junction Outstanding Student Award – all of which had been made possible by the Club at SIT.\nDuring the breakfast, the recipients engaged in a fruitful discussion with RCBJ\nmembers in attendance led by Mr Chew Ghim Bok, President, Rotary Club of Bugis Junction. In addition to dispensing professional advice to the recipients, the Club’s members offered to mentor the recipients and help them navigate the workforce.\nIn addition to expressing their gratitude, each of the recipients shared how\nthe support from RCBJ has tremendously impacted their lives. Mr Koo Jia Wei (in grey shirt), receiving the Bursary from\nGuest of Honour Mr Ng Chee Meng, Minister in the Prime\nMinister’s Office, and representatives of the Loyang Tua\nPek Kong Temple.The first-ever batch of Loyang Tua Pek Kong Bursary recipients at SIT come from across all five SIT academic clusters.(From left) Prof Tan Thiam Soon, President, SIT, Mr George Peh, Chairman, Loyang Tua Pek Kong Temple, Mr Teo Chee Hean, Senior Minister and Coordinating Minister\nfor National Security, and Prof Yaacob\nIbrahim, Advisor, Office of the President, SIT.\nRecipients presenting a token of appreciation to\nMr Chew Ghim Bok, President, Rotary Club of Bugis Junction (third from left).Recipients with members from the Rotary Club of Bugis Junction as well as SIT staff.\neye-opener. “I had heard of Loyang\nTua Pek Kong before, but this was my first time there,” he said. “The turnout was huge, and I had no idea such large festive events existed other than Chinese New Year.”\nHe also shared how grateful he was for\nthe Temple’s support. “Due to unforeseen circumstances, the money I had initially set aside for my tuition fees was not sufficient. I had to start thinking about whether or not to take up weekend jobs for my expenses. Luckily, with the Loyang Tua Pek Kong Bursary, I am now able to pay off the remaining fees and spare more time for my assignments and projects.”\nMs Kilice Ng, a third-year Hospitality\nBusiness student and recipient of the Rotary Club of Bugis Junction Outstanding Student Award in Academic Year (AY) 2018/19, is currently the president of SIT’s Community Service Club. She shared during the session about how passionate she was about serving the community.\nShe said, “I want to influence people around me to make a difference in the lives of others.”\nAlso present was Mr Wong Kai Xian, the\nvery first recipient of the Outstanding Student Award in AY 2015/16. The 27-year-old graduated in 2016 with a First Class Honours degree in Aerospace Systems. He now works at Pratt & Whitney as a Purchasing & Solutions Lead. Mr Wong thanked RCBJ for their generous gift and shared that it has left an indelible mark on him as an individual – knowing that there are others who believe in his capabilities. He said, “Receiving the award has motivated me to do better and to pay it forward.”\nThe Rotary Club of Bugis Junction\nOutstanding Student Award at SIT was made possible by RCBJ in 2015. In 2016, RCBJ made permanent its support of SIT students through the Rotary Club of Bugis Junction Endowment Fund, which supports the Scholarship, Bursary and Outstanding Student Award."
}