{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20220517-lianhe-zaobao-keytotheseven-minuteexerciseistohavethecorrectposture.pdf",
  "type": "pdf",
  "content": "⒑弓步蹲\nForward lunges\n做法：双脚合拢，站稳，单脚踏\n步往前，顺势下降身体，直至前脚与后脚膝盖呈约90度。接着，前脚用力蹬回原位。换脚重复。\n上半身\n保持挺直。\n前脚跨\n幅太小，可能给膝关节造成压力。“七分钟运动”可锻炼全身\n主要肌群，关键在于各动作都要维持正确姿势。上周介绍了六个动作，本周介绍其余六个的正确做法及常见错误；完成前半部后可能累了所以容易出错，练习时一定要加倍留意，以免受伤。七分钟运动 关键在于姿势要正确陈映蓁／报道\nyingzhen@sph.com.sg\n龙国雄／摄影\n示范学生：新加坡理工大学物\n理治疗系三年级学生：朱薇璟（左）和梁力宇。朱薇璟示范原地高抬腿和弓步蹲；梁力宇示范三头肌撑体、棒式、伏地挺身加转体和侧棒式。　　“7分钟运动”（7-minute workut）获科学验证，持续练习不但能锻炼全身主要肌群，还可降体脂及提高胰岛素敏感度。　　这项运动共12项动作，每个动作持续做30秒，接着休息10秒，再换下一个动作，运动总时长七分钟。这种“动、停、动、停”的做法即高强度间歇训练（High Intensity Interval Training，简称HIIT）。　　七分钟运动的强度可视练习方法而调整，例如减少重复次数即可降低强度；如果觉得太轻松了，可在练习某些动作时提起哑铃。新加坡理工大学（SIT）物理治疗系的副教授孙智钦博士说，“如果每个动作都在30秒的时间里，尽可能提高重复次数，就能增加强度。重复次数越多，运动强度越高。”\n感觉疼痛前恢复原来位置\n他提醒，要是肩部或膝盖受伤了，其中一些运用相关肌肉的动作可能不太合适。“要是运动时感觉疼痛，那就调整强度，避免疼痛出现。例如深蹲时觉得膝盖痛，就不要蹲得太低，在感觉痛之前就恢复原来位置，就算只能做到半深蹲也可以。”　　一些动作如开合跳和原地高抬腿，会对双脚造成一定冲击，孙智钦博士建议穿上鞋子，或在瑜伽垫上练习。此外，开始运动前应先做暖身，接着按照指定顺序完成12个动作，即开合跳、靠墙深蹲、伏地挺身、卷腹、登阶上椅、深蹲、三头肌撑体、棒式、原地高抬腿、弓步蹲、伏地挺身加转体以及侧棒式。\n留意身体线条和着力点\n要从“七分钟运动”获取更多效益，同时避免受伤，练习时一定要注意身体线条以及着力点。孙智钦博士强调：关节位置有误，可能造成肌肉损伤；收紧背部肌肉，有助保持正确姿势。　　他说：“练习时应把重点放在维持良好姿势，而不是为了重复做更多次，而坏了姿势。”\n⒎三头肌撑体\nTricep dips\n做法：坐在椅子边缘，双手也放在边缘，接着，臀部往前移，弯曲手肘，身体往下。\n脚趾头朝前，以脚跟和手掌\n撑住身体重量，收紧核心肌群。\n上半身不宜弯曲。⒏棒式Plank\n做法：手肘在肩膀下方，用前臂和脚撑起身体。\n收紧腹肌，身体呈直线。\n双脚不宜靠得太近，避免下\n背部下垂。⒐原地高抬腿\nHigh knees\n做法：原地跑步，每一步都抬高膝盖，尽可能抬至髋高。\n脚落地时要\n尽量放轻。\n膝盖抬得\n不够高，可能不足以锻炼髋屈肌（hip  flexors）。⒒伏地挺身加转体\nPush-ups withrotation\n做法：做一次伏地挺身，接着身体往上时转身向右，右手向天花板伸直。再做一次伏地挺身，并且换成向左转。\n转身时要继续收紧核心肌\n群，以免肩膀受伤。\n转身幅度不够大，身体就无\n法保持在同一垂直线上。⒓侧棒式Side plank\n做法：右侧躺下，用右手肘和右脚支撑，身体离地，收紧核心肌群，支撑30秒。休息10秒后换左侧，再撑30秒。\n身体尽量呈直线。\n髋部抬得不够高，或是核心\n肌肉没有收紧，都会给肩膀造成压力。\n注：美国运动学会建议：一天可视体力重复几次“七分钟运动”，一天内30分钟为限。\n七分钟运动关键在于姿势要正确\nBy 陈映蓁／报道 yingzhen@sph.com.sg  龙国雄／摄影\nLianhe Zaobao\nTuesday 17th May 2022\n136 words\nPage 3 | Section: General\n858cm on the pagePublication: Lianhe Zaobao\nDate: 17 May 2022\nHeadline: The key to the seven-minute\nexercise is t o have the correct posture\nSource: Lianhe Zaobao © SPH Media Limited. Reproduced with permission."
}