{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-11/SIT%20Standard%20Terms%20and%20Conditions%20for%20Gifts%20to%20the%20University.pdf",
  "type": "pdf",
  "content": "1 Last Updated:  20 November  2024\nSingapore  Institute  of Technology,  Standard  Terms  and Conditions  for the Provision  of Gifts\n(“Standard  Terms”)\n1. DEFINITION  AND  INTERPRETATION\n1.1 In these  Standard  Terms,  unless  the context  otherwise  requires,  the following  words  and\nexpressions  shall have  the meanings set out below:\n(a) “Business  Day” means  a day on which  commercial  banks  are open  for normal  business\nin Singapore and excludes Saturdays, Sundays and gazetted public holidays.\n(b) “Contribution  Schedule ” means  the day, month  and year of payment,  according  to the\nnumber  of instalments  (if any),  exact  date of payment  and contribution  amount  that has\nbeen  agreed  by the Donor  in the Rules  of Administration  (if relevant)  in accordance  with\nthe Total Financial Contribution.\n(c) “Donor ” means  any one or more individual,  firm, corporation,  association,  foundation  or other\nentity  that makes  a gift to SIT to support  its endeavours  in teaching,  learning,  research,  and\nservice.\n(d) “Endowed Gift ” means any gift to the University where the income from the donated\ncapital sum is used to support the designated gift purpose as intended by the donor,\nwhile the capital sum is preserved. Endowed gifts are meant to provide a permanent,\nstable  income stream that enables SIT to continue to achieve its educational goals.\n(e) “Term Gift ” means any Gift given to the University where the entire donated sum is\nexpended to support the gift purpose. A Term Gift ceases to exist after the donated\nsum is spent.\n(f) “Gift” means a  contribution, grant,  testamentary  disposition  or otherwise,  property and\nmoneys  from a Donor  that the University  receives  without  any commitment  of resources\nor services with a commercial value in return, but excludes naming opportunities and\ncases where a Donor directs how their contribution is to be applied.\n(g) “Gift Account ” means the University’s record, account or other point of reference or\ndocumen t of record  designated,  created  or generated  by the University  for the purposes\nof the management and administration of the Gift.\n(h) “GST” means  goods  and services  tax under  the Goods  and Services  Tax Act 1993.\n(i) “University ” means  Singapore  Institute  of Technology (“ SIT”), including  its successors\nand assigns.\n(j) “MOE ” means  the Ministry  of Education,  Singapore.\n(k) “Parties ” means  the Donor and  the University,  and “Party ” means  either  of them.\n(l) “Recording  Document ” means  such  document  recording  the Gift in question,  whether\nor not in the nature  of a letter  from the Donor,  an acknowledgement  from the University,\na gift form as stipulated  by the University  or a gift agreement  or deed  between  the Donor\nand the University.\n(m) “Rules of Administration” means the Rules of Administration document, which may\nfollow a Recording Document and is also referred to as the “ROA”\n(n) “Standard  Terms ” means  these  terms  and conditions.\n(o) “Total  Financial  Contribution ” means  the total gift amount  made by the Donor.\n2 Last Updated:  20 November  2024\n1.2 In these  Standard  Terms,  except  where  the context  indicates  the contrary:\n(a) “Person ” includes any individual, corporation, company, incorporated or\nunincorporated body of persons, firm, business, institution, trust, association, joint\nventure,  government,  governmental  agency  or department,  any state  or agency  thereof\nor other legal entity.\n(b) “Writing ” or any cognate expression includes a reference to any communication\neffected by mail, facsimile transmission or any other means of electronic\ncommunication.\n(c) Words  importing  the singular  shall include  the plural  and vice versa  and words  denoting\na given gender shall include each other gender.\n(d) Any reference to “ day” shall mean a part or whole period of twenty -four (24) hours,\nending at twelve (12) midnight.\n(e) Headings  are inserted  for ease  of reference  only and should  not affect  the interpretation\nhereof.\n(f) References  to statutory  provisions  shall be construed  as references  to those  provisions\nas respectively amended, consolidated, extended or re -enacted from time to time and\nall statutory instruments or orders made pursuant to them.\n(g) References  to clauses  or sub-clauses  shall have  reference  to clauses  or sub-claus es of\nthese Standard Terms.\n(h) References to party and parties shall be construed as references to a party or the\nparties to the Recording Document in question.\n(i) These  Standard  Terms  may be amended  at any time and from time to time,  to the fullest\nextent permitted by law and shall take effect from  the date of such amendment unless\notherwise stipulated by the University.\n2. DONOR\nAll persons  comprising  the Donor  in the Recording  Document  are deemed  by their execution\nof the Recording Document to:\n(a) Have accepted joint and several responsibility for their obligations as such Donor,\nincluding but not limited to delivering payment in accordance with the Contribution\nSchedule as written in the Rules of Administrati on (if applicable) via the payment\nchannels specified in the Recording Document.\n(b) Agreed that notification by the University to any one of them is deemed notification to\nall of them; that receipts (whether tax deductible or not) delivered to any one of them\nwill be considered delivered to all of them; and that instructions, consents or waivers\nissued  to the University  by any one of them  shall be deemed  to have  been  issued  by all\nof them.\n(c) Unless  otherwise  stated  in the Recording  Document,  have  contributed  such Gift equally.\n(d) May at any time at their own discretion make additional contributions, to increase the\nquantum and/or the number of Gifts to be offered during the term as stipulated in the\nRecording Document.\n3 Last Updated:  20 November  2024\n3. THE GIFT\n3.1 The Donor hereby agrees to give a Gift as described in the Recording Document and for such\npurpose as set out in the Recording Document (the “ Purpose ”), and in the manner set out in\nthe Recording Document and ROA (if applicable).\n3.2 All Gifts, whether immediate, as a commitment, or in instalments, is an irrevocable, binding\nobligation of the Donor, upon which the University is relying.\n3.3 A Gift should  be made  in cash  or cash  equivalents  such  as publicly  listed  shares  or bonds,  which\ncan be readily liquidated into cash.\n3.4 If a Gift is made in any currency other than Singapore (SGD) Dollars, the University will convert\nthe amount to Singapore (SGD) Dollars, and any tax deduction will be determined based on the\nconverted amount. If the Purpose is to divide the Gift amongst a fixed number of recipients, the\nUniversity will round the Gift amount after conversion down to the nearest divisible dollar, with\nthe excess to be contributed to the “SIT Bursary”, a bursary administered by the university.\n3.5 The Donor acknowledges and agrees that eligibility for tax deduction in respect of the Gift is\ndependent  on the prevailing  laws and regulations, including relevant  tax laws at  the date of the\nRecording  Document  and/or  the relevant  date on which  the Gift is made  and that any direction,\ndecision, instruction or determination by the Inland Revenue Authority of Singapore (or any\napplicable  authority)  (the “Tax Authorities ”) shall be conclusive  and binding  on the Parties.  The\nUniversity will abide by and comply with such applicable notifications, procedures and law\nincluding, where required and in the appropriate circumstances, the University will submit all\napplicable tax filings to the Tax Authorities and, where applicable, procure the issuance of a\ntax-deductible receipt. In the event of doubt, the Donor is advised to seek independent\nprofessional advice.\n4. ADMINISTRATION  OF THE GIFT\n4.1 The administration  of the Gift is detailed  in the Recording  Document.\n4.2 The Gift, the Gift Account  and the Purpose  shall be subject  to:\n(a) all applicable  rules,  regulations  and guidelines  issued  by MOE  or the relevant\nauthorities; and\n(b) The Recording  Document  and ROA  (if applicable).\n4.3 If no Purpose  is stated  in the Recording  Document,  the University  shall be entitled  to determine\nthe application and purpose of the Gift in its sole and absolute discretion.\n4.4 If the Purpose  is fulfilled  and there  is surplus of  the Gift (the “Surplus ”), the  Donor hereby agrees\nthat the University is entitled to retain the Surplus and will consult with the Donor in good faith\nto use the Surplus for other purposes. In the event that the University is unable to contact the\nDonor or the parties are unable to reach a mutual decision,  the University retains the right to\nuse the Surplus for other purposes at its sole discretion.\n4.5 In the event that the fulfilment of the Purpose of the Gift becomes unsuitable, ineffective or\ncannot be carried out according to the directions given by the D onor, whether in whole or in\npart, the University may recommend,  subject  to the Donor’s concurrence,  that the Gift  be used\nfor such  purposes  as nearly as  possible  similar  to the original  Purpose  of the Gift, regard  being\nhad to the spirit of the Gift.\n4.6 If the Donor’s  agreement  cannot  be obtained  despite  reasonable  efforts  by the University  to do\nso, the Gift may be used by the University for such purposes as nearly as possible similar to\nthe original Purpose, regard b eing had to the spirit of the Gift.\n4.7 The University’s acceptance of a  Gift shall not  be construed as imposing any obligation  on the\nUniversity to continue to make available any facility, programme, course, activity or event\npertaining to the Purpose, each of which shall be determined by the University in its ordinary\n4 Last Updated:  20 November  2024\ncourse of operations.\n4.8 All decisions in relation to the  selection of the recipients will  be made by an internal  committee\nof the University, which shall have full discretion to select the recipient. The University shall\nselect the Recipient(s) based on the criteria established in the Rules of Administration.\n5. ADMINISTRATION  OF GIFT  ACCOUNTS  (ONLY  RELEVANT  TO ENDOWED  GIFT)\n5.1 For the purposes of  this Clause  5, the gift account  shall comprise of  the Endowed  Gift and any\nrelevant government matching grant (the “ Gift Account ”).\n5.2 The University shall have sole discretion in the management and control of the Gift Account\nand will not be liable to the Donor for any loss, damage, liability or insufficient or inadequate\nprofit made from the Gift Account’s investments.\n5.3 For the avoidance of doubt, the number and/or value of the Awards (e.g., Bursaries,\nScholarships, Study Grants, Book Prizes etc.) to be given out in any Academic Year may be\nvaried  by the University  in its sole discretion  in the event  that the investment  income  at the time\nof the award fall short of the projected value of Awards in that Academic Year. If the actual\nreturns  are consistently  less than the projected  returns,  the University  may,  in consultation  with\nthe Donor,  decide  to reduce  the amount  used  to fund the Awards,  and may consequently  reduce\nthe number and/or value of Awards to be given out in subsequent Academic Years.\n6. PAYMENT\n6.1 The University will only issue a receipt for amounts actually received and cleared, net of all\nbanking charges.\n6.2 Eligibility  for tax deduction  in respect  of a Gift depends  on whether  the applicable  law at the time\nof the Gift; and only for so long as the University remains an Institution of Public Character. The\nUniversity will comply with any procedures (including in respect of the issuance of a tax -\ndeductible receipt, if applicable) required of it under appl icable laws.\n6.3 Where the gift is not tax deductible, the University will not issue a tax -deductible receipt and\ninstead will issue an acknowledgement letter to the Donor.\n7. AWARDS\n7.1 The University’s  obligation  to issue  awards  shall be conditional  upon:\n(a) the suitability  of recipients  under  any selection  criteria  set out by the Donor  in the Rules\nof Administration and otherwise in accordance with the University’s selection criteria\nand/or policy from time to time; and\n(b) the availability of the degree programme concerned; in the case of Endowed Gift, the\nsufficiency of income (and/or capital as the case may be) from the Gift Fund.\n7.2 The number  of awards  stated  in the Rules  of Administration  shall not amount  to a representati on\nor warranty  by the University  that it must  or will be able to make  the requested  number  of Awards\navailable  in each  Academic Year,  solely  that it will use reasonable endeavours  to do  so. In  the\ncase  where  there are no  suitable recipients as may be determined by the University in its sole\ndiscretion in any given Academic Year, the University is not obliged to disburse any awards,\nand awards  not disbursed  in any particular  Academic  Year  may be granted  in future  Academic\nYears.\n8. MATCHING  GRANT  FROM  MINISTRY  OF EDUCATION\n8.1 If the Gift is eligible for matching grant from the MOE, the University will, at its discretion and\nsubject to the relevant laws and regulations, following receipt of the Gift (or each relevant\n5 Last Updated:  20 November  2024\ninstalment  of the Gift),  apply  for a matching  grant  in respect  of the Gift from the MOE.  The Donor\nacknowledges that the provision of such matching grant is at the sole discretion of the MOE\nand is subject to the applicable laws and regulations at the relevant time.\n8.2 In the event that the University’s application for the matching grant is successf ul and the\nmatching grant is received by the University (whether in whole or in part), the University will\ndeal with the matching grant in accordance with MOE’s requirements and guidelines.\n9. NAMING RIGHT\n9.1 In the case  where  the University has  conferred  a naming  right to the Donor  in recognition  of the\nGift (the “Name ”), the University  may withdraw  and discontinue  the use of the Name  or rename\nit after any one or more of the following circumstances:\n(a) in the event  that the Donor  does  not fulfil the Total  Financial  Contribution  as set out in the\nRecording Document;\n(b) to comply  with any applicable  rules and  requirements  of MOE  or the relevant  authorities;\n(c) if the continued  use of the Name  will adversely  affect  the reputation  of University  as a\nwhole;\n(d) following  an acquisition,  merger  or dissolution  of the Donor;\n(e) if the name  of the Donor  falls into disrepute.\n9.2 The University  shall,  where  time permits  and in good  faith,  consult  the Donor  before  any change\nis made.\n10. REPRESENTATIONS  AND  WARRANTIES\nThe Donor  hereby  irrevocably  represents  and warrants  that:\n(a) the Donor has the  full power  and authority  to validly  and legally accept and agree to the\nterms and conditions herein;\n(b) the Donor has full legal capacity to give the Gift to the University, free and clear of all\nclaims, liens, encumbrances and restrictions;\n(c) no other person has any right, title, benefit or int erest (whether proprietary, contractual\nor otherwise) in or to the Gift;\n(d) the Donor is in compliance with (i) applicable financial record keeping and reporting\nrequirements and anti -money laundering statutes in Singapore and of all jurisdictions in\nwhich t he Donor, its holding company, subsidiaries and affiliates conduct business or\noperations; and (ii) any related or similar rules, regulations or guidelines, issued,\nadministered or enforced by any governmental agency or proceeding by or before any\ncourt or  governmental agency; and\n(e) the Donor is not the subject of any action or investigation by any governmental or\nregulatory  entity  with regard  to any actual  or alleged  breach  of any applicable  anti-bribery\nor anti -corruption laws (“ Anti-Bribery and Corruption  Laws ”) or has or will take any\naction,  directly or  indirectly in  connection  with the operation  of the business of  the Donor\nthat would  result  in a violation  by such  persons  of any Anti-Bribery  and Corruption  Laws.\n11. TRADEMARKS  AND TITLES\nThe name and logo of the University are the trademarks and intellectual property of the\nUniversity.  In the event that the Donor desires to use the name or logo of the University, the\nDonor shall  obtain the prior written approval the University prior  to the use of  the name  or logo\n6 Last Updated:  20 November  2024\nof the University in any publicity material regarding the Gift.\n12. DEFAULT\n12.1 The University  is entitled  to withdraw,  discontinue  and/or  cease  all rights  and benefits  of the\nDonor in the event of:\n(a) any breach or default under the Recording Document, Rules of Administration, and/or\nthese  Standard  Terms  by the Donor  (including,  without  limitation,  any failure  by the Donor\nto make  payment  of the Gift (or any part thereof)  in accordance  with the provisions  of the\nRecording Document, Rules of Administration, and/or these Standard Terms);\n(b) reputational or integrity concerns to the University in connection with the Gift and/or the\nDonor; or\n(c) a direction  or order  from the MOE  or the relevant  authorities .\n12.2 Upon  the occurrence  of any event  of default  as described  in Clause  12.1,  the University  shall\n(where applicable):\n(a) cease  any naming  rights granted  to the Donor;\n(b) withdraw  any benefits  which  the Donor  is entitled  to; and\n(c) have  no further  obligation  or liability  to the Donor.\n12.3 The University  shall not be required  to return  any unutilised  portion  of the Gift, and shall have\nthe unfettered right to utilise the Gift at its sole and absolute discretion.\n12.4 Save  as provided  herein,  termination  shall not affect  or prejudice  any rights  or remedies  which\nhave accrued to a Party prior to the effective date of termination.\n12.5 Nothing  in this Clause  12 shall be deemed  to prejudice  any other  rights  or remedies  available  to\nthe University again st the Donor for any breach of the Donor’s obligations.\n13. TERMINATION  OF THE UNIVERSITY’S  OBLIGATIONS\n13.1 The University’s  obligations  shall cease  upon  the earlier  of:\n(a) the completion  of the utilisation  of the Gift by the University;\n(b) the date on which  the Purpose  is achieved  and satisfied  in full;\n(c) the date the Recording  Document  is terminated  in accordance  with its terms  and/or  by\nthe mutual agreement of the Parties in writing;\n(d) the date the Recording  Document  read with these  Standard  Terms  and terminated  by\nthe University in accordance with Clause 9.1; and\n(e) the expiry  of the term of the Gift Account  (if any) stated  in the Recording  Document.\n13.2 Save  as provided  herein,  termination  or cessation  of any obligations  shall not affect  or prejudice\nany rights  or remedies  which  have  accrued  to a Party  prior to the effective  date of termination.\n13.3 Nothing  in this Clause  13 shall be deemed  to prejudice  any other  rights  or remedies  available\nto the University against the Donor for any breach of the Donor’s obligations.\n7 Last Updated:  20 November  2024\n14. INDEMNITY  AND  LIMITATION  OF LIABILITY\n14.1 The Donor  shall at all times fully indemnify and  keep  fully indemnified  the University  against  all\nand any claims, proceedings , actions, liability, loss, damages, costs and expenses (including\nwithout limitation legal costs and expenses on a full indemnity basis) that may be brought\nagainst  or suffered  or incurred  by the University  as a consequence  of any breach  of the Donor’s\nrepresentations and/or warranties.\n14.2 Neither Party will be liable to the other Party for any loss of profits, loss of goodwill, loss of\nbusiness, loss of business opportunities, loss of anticipated savings, loss or corruption of dat a\nor information or business interruption costs, or any indirect, special, punitive, incidental or\nconsequential damages however caused) and under any theory of liability (including but not\nlimited to contract, strict liability and negligence or for breach  of statutory duty or\nmisrepresentation) whether or not such damages are foreseeable.\n15. NO THIRD  PARTY  RIGHTS\nA person  who is not a Party  to the Recording  Document  or Rules  of Administration  has no rights\nunder the Contracts (Rights of Third Parties) Act 2001 to enforce any term of the Recording\nDocument and/or the Standard  Terms,  and the Parties  acknowledge  that no right or benefit  has\nbeen  created  and was intended  to be expressly or impliedly  conferred  upon  any third party under\nthe Recording Document.\n16. CONFIDENTIALITY  AND PUBLICITY\n16.1 All communications between the Parties or all non -public information (“ Confidential\nInformation ”) and other material supplied to or receive d by a Party which is either marked\n“confidential” or is by its nature intended to be exclusively for the knowledge of the recipient\nalone shall be kept strictly confidential and it shall not be disclosed to any other third party\nwithout the other Party’s prior written consent.\n16.2 Publicity of the Gift will be done collectively with other contributions donated to the University.\nIf the Donor requires the University to publicise the Gift separately, the cost and other related\ncharges  of such  publicity  will be borne  by the Donor.  For the avoidance  of doubt,  the University\nmay publicise and make reference to the Gift and/or Donor by name at any time, and in any\nmedia of its choosing.\n17. PERSONAL  DATA\n17.1 The University will comply with its data protection obligation as set out in the Personal Data\nProtection  Act 2012.  Details  of the University’s  personal  data protection  policy  can be found  on\nSIT’s website  and may be  updated from time to time to ensure compliance with the Personal\nData Protection Act 2012.\n17.2 By executing  the Recording  Document,  the Donor  shall have  consented  to the use, collection,\ndisclosure and/or processing of personally identifiable information, held within or outside\nSingapore for the following purposes:\n(a) For administrative purposes, including but not limited to payment processing, anti -\nmoney laundering checks, Gift administration and other compliance and record -\nkeeping purposes;\n(b) For internal analysis purposes, including but not limited to analysing trends in\ndonations, understanding donor preferences, and enhancing the University’s\nfundraising strategies;\n(c) For appr eciation and recognition of Donor and Gift, as well as to improve Donor\nexperience;\n(d) To provide  reports  on the outcome  of the Donor’s  Gift and/or  contributions;  and\n8 Last Updated:  20 November  2024\n(e) Releasing the information to the relevant government and public agencies, or to any\nthird-party, for the purposes of facilitating tax deductions to the Donor.\n18. AMENDMENTS  AND INTERPRETATION\n18.1 These Standard Terms may be amended by the University from time to time, to the extent\npermitted by law, and any amendments shall take effect from the date of such amendment\nunless otherwise stated by the University.\n18.2 In the event that the Recording Docume nt and/or these Standard Terms is prepared in any\nlanguage  other  than English,  the English  version  shall in all events  prevail  and be paramount  in\nthe event  of any discrepancies,  questions  or disputes  concerning  the meaning,  form,  validity,  or\ninterpretation of the Recording Document and/or these Standard Terms.\n18.3 In the event  of any conflict  or inconsistency  between  the Recording  Document  and the Standard\nTerms, the following order of precedence shall apply (in descending priority): (a) the terms in\nthe Recording Document, followed by (b) the Standard Terms.\n19. GOVERNING  LAW  AND  DISPUTE  RESOLUTION\n19.1 The Recording  Document  and/or  these  Standard  Terms shall be governed  by and construed  in\naccordance with the laws of the Republic of Singapore.\n19.2 The Parties agree that each Party will, in good faith, use every effort to resolve promptly any\ndispute or claim concerning the existence, scope, meaning, construc tion, performance,\nenforcement,  termination  or effect  of the Recording  Document  and/or  these  Standard  Terms  or\nany issue arising, whether directly or indirectly, therefrom (“ Dispute ”).\n19.3 In the absence of settlement through negotiation, any Dispute shall be referred to and finally\nresolved by  arbitration  administered by  the Singapore International  Arbitration  Centre  (“SIAC ”)\nin accordance  with the Arbitration  Rules  of the SIAC  for the  time being  in force,  which  rules  are\ndeemed to be incorporated by reference in this clause. The tribunal shall consist of one (1)\narbitrator. The place of arbitration shall be Singapore and the arbitration shall be conducted\nwholly in the English language.\n20. NOTICES\n20.1 Any notice  to be issued  pursuant  to the Recording  Document  and/or  these  Standard  Terms  shall\nbe in writing and in English.\n20.2 Any notice  to be given  by a Party  to the Recording  Document  and/or  these  Standard  Terms  shall\nbe in writing and shall be deemed duly served if delivered personally or by prepaid registered\npost, or by e -mail to the addressee at the address or e -mail address of that Party as set out in\nthe Recording  Document,  or at such  other  address  or e-mail address  as the Party  to be served\nmay have notified the other Party for the purposes of the Recording Document and/or these\nStandard Terms.\n20.3 Any notice  given  pursuant  to Clause  20.2 shall be deemed  to have  been  received:\n(a) in the case of delivery  by hand,  when  delivered;  or\n(b) in the case of sending  by post:\n(i) where  posted  in the country  of the addressee,  on the third (3rd) Business  Day\nfollowing the day of posting; and\n(ii) where  posted  in any other  country,  on the seventh  (7th) Business  Day following\nthe day of posting; or\n9 Last Updated:  20 November  2024\n(c) if sent by email  on a Business  Day and at a time which  is during  business  hours  on a\nBusiness Day, at the time it is transmitted to the relevant email box specified above.\n21. INDEPENDENT  PROFESSIONAL  ADVICE\nThe Donor acknowledges that the University has no responsibility to provide any advice or\nrecommendations  to the Donor in connection  with the Gift, the Recording  Document  and/or  these\nStandard Terms and, accordingly, the Donor acknowledges and agrees that:\n(a) it has had, or has had the opportunity to obtain, independent legal and other professional\nadvice  in connection  with the Gift, the Recording  Document  and/or  these  Standard  Terms;\nand\n(b) it has not/will not rely on any advice or recommendations made or purported to be made\nby the University (including its officers, employees, agents and contractors) in connection\nwith the  Gift, the Recording Document and/or these Standard Terms.\n22. SEVERANCE\nIf, at any time, any provision of the Recording Document and/or these Standard Terms is or\nbecomes illegal, invalid or unenforceable in any respect, neither the legality, validity or\nenforceability of the remaining provisions nor the legality, validity or enforceability of such\nprovision will in any way be affected or impaired.\n23. ENTIRE  AGREEMENT\nThe Recording Document, together with these Standard Terms, constitutes the entire\nagreement of the Donor and the University in relation to the subject matter of the Recording\nDocument.\n24. NO PARTNERSHIP\nNothing in the Recording Document and/or these Standa rd Terms are intended to, or shall be\ndeemed  to, establish  any partnership  or joint venture  between  the Parties,  constitute  any Party\nthe agent of another Party, or authorise any Party to make or enter into any commitments for,\nor on behalf of, the other P arty.\n25. SUCCESSORS  AND ASSIGNS\nThese Standard Terms shall be binding upon the Donor, estate, trusts, heirs, legal\nrepresentatives and successors and assigns and upon the successors and assigns of the\nUniversity.\n<The  remainder  of this page  is intentional ly left blank>"
}