{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/ApplicationGuideForInternationalQual.pdf",
  "type": "pdf",
  "content": "(Updated as of 13 January  2020)\nPage 1 of 3\nUNDERGRADUATE APPLICATION GUIDE FOR APPLICANTS PRESENTING INTERNATIONAL QUALIFICATIONS\nApplicants presenting an international qualification from an overseas educational institute, who have completed\nat least 12 years of formal education may apply for admission.\nApplications are assessed holistically taking into consideration academic results (e.g. A Level, High School\nCertificate), additional qualifications or test results submitted (e.g. SAT, SAT Subject Tests, Advanced Placem ent,\nIELTS, TOEFL), relevant work experience/internship/competitions/awards, and personal statement. Admission is\ncompetitive, and shortlisted applicants will be required to attend an admission interview.\nPlease refer to Table 1 for more information on th e academic results and test scores required.\nTable 1\nHigh School (Year 12)\nQualification  Year 12 Results/ Additional Test Scores Required\nA Level (AQA, Cambridge, Edexcel,\nOCR)  ‘A’ Level results\nBrunei A Level  ‘A’ Level results\nAustralian High School  High School Certificate (Year 12)\nATAR/OP\nCanadian High School Diploma  High school diploma transcript\nEuropean Baccalaureate Diploma  European Baccalaureate results\nAn acceptable English language test score if English is not taken as an\nexam subjec t\nFrench Baccalaureate Diploma  French Baccalaureate results\nAn acceptable English language test score\nGao Kao\n(National College Entrance\nExamination) (China)  Gao Kao results\nAn acceptable English language test score\nGerman Abitur  German Abitur exam results\nAn acceptable English language test score\nHong Kong Diploma of Secondary\nEducation  HKDSE results\nIndian Standard 12 (CBSE)  Year 12 exam results\nIndian Standard 12 (ISC)  Year 12 exam results\nIndian Standard 12 (Others)  Year 12 exam results\nSAT/SAT Subject Tests are recommended\nIndonesian SMA UAN  SMA UAN exam results\nSAT/SAT Subject Tests are recommended\nAn acceptable English language test score\nInternational Baccalaureate\nDiploma (IB)  IB Diploma results. Refer to\nhttps://www.singaporetech.edu.sg/international -baccalaureate\nNew Zealand National Certificate\nof Achievement (NCEA) Level 3  Record of Achievement with NCEA Level 3/ University Entrance\n(Updated as of 13 January  2020)\nPage 2 of 3\nSijil Tinggi Persekolahan Malaysia\n(STPM)  STPM exam results\nAn acceptable English language test score\nSri Lanka A Level  ‘A’ Level results\nUnified Exa mination Certificate\n(UEC) (Malaysia)  UEC results\nAn acceptable English language test score\nVietnamese High School\nGraduation Examination  National high school graduation exam results\nSAT/SAT Subject Tests are recommended\nAn acceptable English language test score\nOthers  High school transcript\nSAT/SAT Subject Tests are required\nEnglish Language Requirement\nApplicants presenting an international qualification where the language of instruction is not English are required to\nsubmit an acceptable  English language test score (refer to Table 2).\nThere are programme -specific English language requirements for some programmes, and applicants are required\nto fulfil whichever is the higher requirement. For programme -specific requirements, please refer to the respective\nprogramme web pages .\nTable 2:\nEnglish Language Test  Acceptable Score\nIELTS (Academic)  6.5\nTOEFL\n(Internet -based Test)  90\nCambridge ‘O’ Level English/ EL1119  C6\nCambridge English\nC1 Advanced or C2 Proficiency  C1 Advanced or C2 Proficiency\nSAT\nPlease refer to Table 1 for whether SAT is required for your application.\nApplicants may submit either SAT or ACT with Writing.\nThe following scores are provided as a guide.\nTable 3\nSAT 600 for Evidence -Based Reading and Writing, 650 for Math\nACT with Writing  Composite score of 29\n(Updated as of 13 January  2020)\nPage 3 of 3\nSAT Subject Tests\nPlease refer to Table 1 for whether SAT Subject Tests are required for your application.\nApplicants are required to submit three SAT Subject Test  scores, including Math Level 2. The other two subjects\nshould be chosen with respect to relevancy to the programme(s) applied for.\nAlternatively, applicants may submit Advanced Placement (AP)  scores in three subjects, includin g Calculus. The\nother two AP subjects should be relevant to the programme(s) applied for.\nApplying to SIT\nSIT's annual admissions period is held from January to March each year. Applicants presenting international\nqualifications should submit the followi ng when applying to SIT.\n- ‘A’ Level/ Year 12 examination results (Entry Qualification)\n- ‘O’ Level/ Year 10 examination results\n- High school transcript with explanation of grading system\n- For applicants whose language of instruction in high school is not English, an acceptable English language\ntest score (e.g. IELTS, TOEFL) should be submitted. Refer to Table 2.\n- Additional test results where required (e.g. SAT, SAT Subject tests). Refer to Table 1 and Table 3.\n- Documents that are not in English should be ac companied by a certified English translation\nIn the online application form, you will be required to select your Entry Qualification, which is usually your ‘A’ Level/\nHigh School Year 12 qualification if you have obtained your qualification overseas. You m ay provide information on\nadditional qualifications/ test results (e.g. Degree, TOEFL/IELTS, SAT, SAT Subject Test or other certificates) under\nthe Supplementary Qualification section.\nFor more information on applying to SIT, please refer to https://www.singaporetech.edu.sg/applying -to-\nSIT/admissions -overview"
}