{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-08/Master%20of%20Science%20in%20RTL-%20Module%20Details.pdf",
  "type": "pdf",
  "content": "1\nMaster  of Science  in Rail,  Transport  and Logistics\nAll modules  carry  5 ECTS  Credits  each.\n1) Decision Support Systems for Transport and Logistics Processes\nThis module equips students with the latest mathematical modelling approaches and computer -based\nsupport to address common logistical decision problems companies face today. Students will gain the\nnecessary proficiency in problem -solving models and algorithms to represent different problem types\nand address real -world situations. They w ill be able to discern problem types, understand the limits\nof optimisation and appreciate the importance of having a decision support system in logistics.\nHours:  45 / Semester:  1\n2) Public Transport Planning\nThis module equips students with the foundational knowledge in public transport planning and\norganising of public transport networks, beginning with an in -depth discussion about the advantages\nand disadvantages as well as the functional characteristics of transit modes and their capacity. The\ngeometry and types of transit lines and transit networks will be closely examined during this module.\nIn addition, students will also be acquainted with public transport schedules, learn how to plan an\nintegrated public transport system with a seamless tr ip / travel experience of the passengers, how to\naccelerate bus operation, and improve the efficiency of the public transport operation.\nHours:  45 / Semester:  2\n3) Statistical Methods for Transport and Logistic Process\nThis module introduces students to transportation science, which involves analysing empirical data\nand applying statistical methods in real -world situations. Students learn to analyse data by deploying\nthe suite of analytical tools and software to identify patterns, gaps, and opportunities to make\nscientifically founded business decisions. Through this module, they would be able to gain a deep level\nof understanding of probability and statistical concepts.\nHours:  45 / Semester:  1\n4) Traffic Impacts, Evaluation of Transport and Logistic Process\nThe module focuses on sustainable transport solutions by deepening students’ understanding of the\nintimate relationship between transport and its environment. Through interactive discussions, hands -\non exercises and group activities, students will learn mor e about the various strategies for achieving\na sustainable transport system. In addition, students will also acquire the necessary knowledge of the\nprinciples and concepts to assess and evaluate transport and logistics systems while gaining deeper\ninsights  into the advantages and drawbacks of different assessment methods, including application\nareas and constraints of assessment procedures.\nHours:  45 / Semester:  1\n5) Transport and Urban Planning\n2\nThis module offers the foundational knowledge of transport, mobility, and urban planning, in which\nstudents advance their understanding of the reasons for traffic, spatial and temporal traffic\ndistribution, the relationship between infrastructure planning and design, the assignment of functions\nin cities  and conurbations, and dependencies between supply and demand. Students will also learn to\napply travel demand modelling using the 4 -step algorithm to estimate travel demand.\nHours:  45 / Semester:  1\n6) Introduction to Business Logistics\nThe course will provide basics in the core principles of business logistics, where students gain insights\ninto the functional logistics process and the pivotal role logistics play in a competitive landscape.\nProviding an incisive portrait of the various as pects of logistics processes, students engages in\ndiscussions and lessons to explore ways of optimising logistics in small groups working with real -life\ncase studies to apply theory in practice, including also the opportunity to develop their critical thin king\non the potential of information technology and digitisation in logistics.\nHours:  45 / Semester:  1\n7) Introduction to Supply Chain Management\nThis module provides students with an insightful overview of supply chains’ fundamental concepts,\ntheories, and applications, covering its main challenges and planning methods. It aims to stimulate\ncritical thinking and equips students with the strategic ability to find the insights behind theories that\nwill help them to match the right supply chain for different ty pes of products, align their supply chain\nplanning in inventory management, procurement and sourcing as well as risk management to create\nvalue in supply chains.\nHours:  45 / Semester:  2\n8) Airport and Harbour Design\nThis module gives an in -depth insight into the necessary components of airports and harbours and the\nplanning processes for developing these sites. Students will enjoy the intellectual stimulation as the\nmodule reviews the various methods for operating airports and harbours through the  lens of multiple\naspects of the pre -planning process, such as environmental impacts leading to the ultimate choice of\nthe location. Students will also learn about the essential components of airports, including the\nfundamental design concepts and operatio n and maintenance procedures necessary to manage key\ninfrastructures successfully.\nHours:  45 / Semester:  3\n9) Basics of Traffic Flow and Traffic Control\nThis module offers the foundational knowledge of transport, mobility, and urban planning, in which\nstudents advance their understanding of the reasons for traffic, spatial and temporal traffic\ndistribution, the relationship between infrastructure planning and design, the assignment of functions\nin cities and conurbations, and dependencies between supply  and demand. Students will also learn to\napply travel demand modelling using the 4 -step algorithm to estimate travel demand.\nHours:  45 / Semester:  1\n10) Consumer Industry Supply Chain Management\n3\nThe transformation that the consumer industry underwent over the past years has ushered in a new\nwave of technologies, such as analytical demand planning or integrated sales and operations planning,\nto ensure their operations are well integrated from suppliers through to customers with decisions\nmade from an end -to-end perspective. This module addresses the key issues of logistics and supply\nchain management from the perspective of national and international consumer goods producers,\nwholesalers, retail chains and e -commerce companies from the fast -mov ing consumer goods, lifestyle\nand retail sectors. Students will be able to gain a solid understanding of the logistics framework across\nthe value chain by analysing each step from the producer to the consumer. Students will also closely\nexamine and analyse  the possibilities of designing and integrating supply, engaging in close discussions\non real -life case studies to apply theory in practice.\nHours:  45 / Semester:  2\n11) Design and Applications of Material Handling Systems\nThis module provides an incisive portrait of the issues that happen throughout the various stages of\nthe supply chain. From the movement, storage, handling, and control to the protection of materials,\ngoods, and products throughout the manufacturing, distr ibution, consumption and disposal process,\nstudents will closely study every stage of evaluating and selecting systems, mechanical equipment,\nsystems and related controls. In addition, the module will also cover the principles of material handling\nsystems and gain appreciation of leveraging internet of things technologies and ambient intelligence\nto optimise processes.\nHours:  45 / Semester:  3\n12) Green Supply Chain and Risk Management\nAt the intersection between sustainability and productivity, organisations find their competitive edge\nas they navigate the new revolutionary wave of business in this 21st century. This module aims to\nprovide students a rigorous insight into green supply chains, their drivers and objectives emphasising\non innovative methodologies and techniques to reduce its carbon  footprint while increasing the\ncompany’s short - and long -term profits. Students will also gain an in -depth understanding of the\nthreats and growing vulnerability of global and local supply chains and strategies for mitigating and\navoiding these risks.\nHours:  45 / Semester:  3\n13) Healthcare Logistics\nHigh stakes in nature, managing healthcare logistics is practically a life -and-death scenario. This\nmodule emphasises the multifaceted and unique aspects of managing logistics and the supply chain\nin the healthcare industry undergoing disruptive changes by  first introducing students to the\nfundamentals of healthcare management before deep -diving into the strategic aspects of\nprocurement and logistics in healthcare. The industry is currently undergoing a phase of deregulation,\nwhich leads to privatisation, p rofessionalisation and internationalisation. This framework will be\nintensively discussed, raising several pertinent decision situations that enable students to appreciate\nthe sophistry in planning its logistics. In addition, students will also advance the ir understanding of the\nmechanisms of the healthcare value chain, develop a sound knowledge of appropriate tools and\ntechniques in managing the slew of supply chain activities and evaluate the logistics processes in this\nparticular field.\nHours:  45 / Semester:  2\n14) Highway Design\n4\nThe module covers comprehensive insight into highway planning design of safe, highly efficient and\nsustainable. It covers knowledge of road transport networks, the driver vehicle - infrastructure\ninteractions which served as guiding principles for road geometric design and pavement design,\nstructural and functional performance, Nature -Based Solutions (NBS) transport infrastructure,\ntransport infrastructure for electromobility, and Pa vement Management Systems. The students will\nstudy and apply road planning strategies and tools by designing the road alignment for a new project\nthrough a case study.\nHours:  45 / Semester:  1\n15) Industrial Logistics\nWith an increasing number of logistics functions being outsourced to third -party logistics service\nproviders (LSPs), a new set of challenges emerge that are different from traditional industrial\nmanagement practices in many respects. The successful management of one’s supply chain is critical\nto understanding LSP’s complementary role in a company and how it can make a positive impact by\nimproving efficiency and generating economic value. This module offers a critical insight into the\nglobal LSP industry, its key players and best manage ment practices. Students are also introduced to\nthe relevant theoretical concepts of advanced service management. In addition, students will\nunderstand the typical business models and management issues relevant to successful dealings with\nlogistics outsour cing partners, thus preparing them for a successful career in the logistics services\narena.\n16) Logistics Service Provider (LSP) Management\nWith an increasing number of logistics functions being outsourced to third -party logistics service\nproviders (LSPs), a new set of challenges emerge that are different from traditional industrial\nmanagement practices in many respects. The successful management of one’s supply chain is critical\nto understanding LSP’s complementary role in a company and how it can m ake a positive impact by\nimproving efficiency and generating economic value. This module offers a critical insight into the\nglobal LSP industry, its key players and best management practices. Students are also introduced to\nthe relevant theoretical concept s of advanced service management. In addition, students will\nunderstand the typical business models and management issues relevant to successful dealings with\nlogistics outsourcing partners, thus preparing them for a successful career in the logistics serv ices\narena.\nHours:  22.5 /  Semester:  1\n17) Planning of Intralogistics System\nThis module provides students with a solid foundation of some of the key methods and procedures\nin the field of material flow and logistics planning. Students will learn to apply the range of tools and\nassessment methods to develop different planning alternatives by beginning the module with the\nactual collection of data for detailed analysis. Students will also gain proficiency in applying qualitative\nand quantitative evalua tion methods to select the best planning alternative. The course will also place\nan emphasis on intensifying students’ theoretical foundation through working on a practical case\nstudy conducted in small groups.\nHours:  45 / Semester:  2\n18) Transportation Modelling and Simulation Tools This module deepens students’ skills and\nknowledge in using macro - and micro -simulation to assess traffic engineering and transport\n5\nplanning measures. The theoretical background of the methods implemented in the tools\nwill be reinforced through extensive practical exercises using state -of-the-art software,\nfollowed by systematic analysis and discussions on how real -world simulation pro jects are\nstructured. Students will learn to demonstrate their capability to set up a realistic simulation\nby gathering real -life data within the Singapore road network.\nHours:  45 / Semester:  1\n19) Rail Transport and Rail Planning\nThis module emphasises the foundational requirements and procedures for rail infrastructure\nplanning on the premise of running behaviour and the performance of rail vehicles. Through\ndiscussions and in -person lessons, students will examine closer into the specific wheel -rail interface,\nthe effective forces guiding the wheel sets (equivalent conicity), the determination and evaluation of\ntrack quality, the requirements for designing track alignment and layout, the tools to determine cant\nand cant deficiency,  the procedures to design transition elements, the tilting train technology, the\noperational demands and respective track arrangements. Through this lesson, students will be able to\nconfidently plan and design rails for passenger comfort and safety.\nHours:  45 / Semester:  1\n20) Rolling Stock\nThis module advances students’ knowledge of rolling stock, focusing on the various rail concepts, such\nas high -speed trains and their interior designs, freight trains and freight wagons, and Mass Rapid\nTransit. The course pays particular attention to the wheel -rail interaction, running behaviour in curves\nand straight tracks, propulsion concepts, running gear and vehicle construction, body shells, bogie\ndesign, safety issues and environmental aspects such as energy e fficiency and greenhouse gas\nemission in rail transportation. Existing and emerging applications of various engineering concepts\nthrough case studies will also be discussed in closer detail.\nHours:  45 / Semester:  1\n21) Trackworks\nThis module advances students’ knowledge of trackworks, emphasising their understanding of forces\nacting between vehicle and track, the load distribution within the track superstructure into the\nsubstructure (Earthworks or civil structure), environmental i mpacts on the track performances, as well\nas the requirements for the design and construction of rail infrastructure. This module will pay\nparticular attention to track design, the construction, maintenance and renewal of tracks for a variety\nof rail infra structures (conventional and high -speed). In addition, students will also engage in intensive\ndiscussions on the conceptual design and structural performance of both traditional and ballastless\ntrack systems in learning about the logics and rationales behi nd the concepts.\nHours:  45 / Semester:  2\n22) Train Control and Signalling Systems\nThis module enables students to form a solid foundation in train control and signalling systems, in\nwhich the benefits and challenges of techniques used will also be closely analysed in lessons. The\nmodule will also deep dive into turnout, signals, track -based equipment, facilities, electronic\ninterlocking and train control systems. Students will gain greater insights as the risk analysis and\nassessment of electronic systems and management of train schedules and transport risk are discussed\nin closer detail  in this module.\n6\nHours:  45 / Semester:  2\n24) Ballastless Track Systems\nOne of the ground -breaking innovations in the railway infrastructure space, ballastless tracks are\nincreasingly adopted globally due to their superior ride comfort, safety and low levels of care and\nmaintenance. In this module, students learn in depth the requirements and procedures for ballastless\ntrack system design for high -speed and conventional mainline rail infrastructure. This specialised\ncourse also deep dives into the special features of Metro and light rail systems, traintrack interactions,\nalignm ent and track layout for urban rail systems, the sources, propagation and effects on surrounding\nbuildings and measures to counteract noises and vibration. Through this lesson, students will learn to\ndesign a variety of state -of-the-art tracks, such as spe cial floating slab tracks, green tracks, tram tracks\nand embedded track systems, and assess their environmental impacts.\nHours:  45 / Semester:  2\n25) Modelling of Rail Infrastructure Using CAD -FEM -MBS\nThis module introduces students to some of the most important computational tools and methods of\nplanning infrastructure. Using Computer Aided Design (CAD) software, students will be able to apply\nthese tools, requirements and rules set for railway plannin g proficiently on a student’s project.\nStudents will also learn about Finite Element Method (FEM) for the modelling and analysis of track\nstructures, subsystems and components used for the design and evaluation of performance. Different\napproaches to creat ing Geometry models of these elements will be explored, particularly for\nrail/sleepers using ANSYS. Students will also learn about the basics of importing geometry files for FE\nanalysis using ANSYS Workbench, applying simple analysis meshing methods, and u nderstanding the\ncompatibility of data transfer across different platforms in depth. The module will also use Multi -Body\nSimulation to simulate and analyse dynamic effects activated by vehicles running along\ntracksequipped with different track geometry and  quality.\nHours:  45 / Semester:  2\n26) Traffic Operation and Control (ITS)\nThis module enhances students’ understanding of the general approach to traffic control and\nIntelligent Transportation Systems (ITS) in the urban and motorway context. It offers a critical\nunderstanding of the principles of different systems and their technical approaches while placing\nemphasis on the analysis of ITS applications in urban, extra -urban and integrated systems. The module\nwill also deep dive into the objective, measure s, methods, and algorithms of implementing ITS,\nbuilding on students’ knowledge gained in the modules “Basics of Traffic Flow and Traffic Control and\n“Transportation Modelling and Simulation Tools”.\nHours:  45 / Semester:  2\n27) Transportation Modelling and Simulation Tools\nThis module deepens students’ skills and knowledge in using macro - and micro -simulation to assess\ntraffic engineering and transport planning measures. The theoretical background of the methods\nimplemented in the tools will be reinforced through extensive practical exercises using state -of-the-\nart software, followed by systematic analysis and discussions on how real -world simulation projects\nare structured. Students will learn to demonstrate their capability to set up a realisti c simulation by\ngathering real -life data within the Singapore road network.\nHours:  45 / Semester:  1\n7\n28) Tunnel Works and Geotechniques\nIn this module, students gain a comprehensive overview of tunnel works and geotechniques, covering\nthe key aspects of the investigations conducted prior to the start of the project. Students will learn\nabout the fundamentals of soil investigation, the basi cs of foundation, and earth construction in traffic\nways. The course will also dive into the tunnelling methods and the techniques covering the various\ncalculating methods and the prediction of settlements by tunnelling in loose soils.\nHours:  45 / Semester:  2\n29) Urban Road Design\nThis module provides students with foundational knowledge and analytical skills on urban road design\nin megacities by beginning with a detailed evaluation and discussion of the characteristics of various\nmodes of transport and their advantages and disadvan tages. Students will be able to appreciate the\ndesign rationale behind every single road design as they learn to analyse the challenges and needs of\ntransport infrastructure in urban areas of big cities and agglomerations and consider correlations such\nas land use, capacity of passenger transport and environmental issues. Through this module, students\nwill be able to proficiently apply the knowledge they have learned in planning, designing,\nandorganising urban streets as spaces for living and develop soluti ons to organise transport efficiently\nfor all modes and mobility needs.\nHours:  45 / Semester:  2"
}