{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-09/%5BFA%5D%20SIT%20AR%202024_06_Empowering%20our%20future.pdf",
  "type": "pdf",
  "content": "EMPOWERING OUR FUTUREFinancial Assistance\n1 in 2  students received a scholarship or financial assistance.\n35  awarded inaugural ASEAN Scholarships from MOE.\nForward SITizen Initiative (FSI)\n•    Launched in January 2023, this initiative aims to complement government bursaries to\nensure full tuition fee coverage for financially disadvantaged undergraduate students.\n•    Nine donors committed $10.3 million in endowed gifts, which enabled the support\nof 36 students in Academic Year 2023, and up to 69 students in Academic Year 2024.\nGifts received in FY2023\n$17.66 million\n(received from 1 April 2023 to\n31 March 2024)\n30%\n22%\n2%46%\nLegend:\nStudent Support include\nscholarships, bursaries, study grants,\nemergency fund and OIP grants.\nStudent Performance Awards\ninclude  book prizes, gold medals,\noutstanding student awards,\nperformance awards and yearly\nperformance awards.Applied Research or Innovation\nProgrammes/Projects include\napplied research and CLASIC\nprogrammes and projects.\nOthers include gifts that support a\nphysical naming in PunggolAt SIT, we are committed to empowering our\nstudents’ futures. We provide robust financial\naid programmes that open doors to a quality\neducation which puts SITizens on the path to\nsuccess. We also take steps towards ensuring\na more sustainable future by incorporating\nsustainability into all we do.\nSIT Scholar Valerie Lee, Class of 2025 and SIT Mid-Term Scholar Marcus Foo Qi Fa, Class of 2024\nPhoto: Jacqueline Ho\n/29\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024\nNew namings at SIT Punggol Campus\nKwek Leng Beng University Tower\nSIT named its University Tower – the University’s administrative brain and nerve centre\nat its Punggol Campus – the Kwek Leng Beng University Tower, in recognition of Mr\nKwek Leng Beng and City Developments Limited (CDL)’s endowed donation of $24\nmillion. The gift – one of the largest gifts that the university has received – will support\nstudents and academic activities at SIT.Mrs Wong-Mah Jia Lan Human Performance Lab\nSIT named its Human Performance Lab at its Punggol Campus, the Mrs Wong-Mah Jia\nLan Human Performance Lab, in recognition of an endowed gift of $1 million from Mrs\nWong-Mah Jia Lan. The Lab is important in capturing and understanding of human\nperformance in both rehabilitation recovery as well as sports performance.\nAM Family Capital Foundation S.E.E.D.-Digital\nSIT named the innovative and transformative S.E.E.D.-Digital space, located within\nthe Learning Hub in its Punggol Campus, the AM Family Capital Foundation S.E.E.D.-\nDigital in recognition of the AM Family Capital Foundation’s endowed gift of S$500,000\nto the University.\nThe Kwek Leng Beng University Tower at the SIT Punggol Campus\nProfessor Chua Kee Chaing and Mr and Mrs Wu Ching-Hsin, with representatives from AM\nFamily Capital Foundation and Community Foundation of Singapore, SIT students, as well as\nfaculty and staff at the unveiling event.\nSIT Photo: Keng Photography/Tan Eng Keng/30\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024"
}