{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/researchreport-crowdlending.pdf?10000",
  "type": "pdf",
  "content": "Crowdlending in Asia:\nLandscape and Investor\nCharacteristics\nNovember  2020\nTable of Contents\nOverview                                                                                  3\nMethodology Overview                                                         4\nMethodology Statement                                                       4\nCrowdlending  in As ia                                                            5\nText Analytics and Insight s                                           7\nCrowdlending  Investor Characteristics                             15\nSurvey Analysis and Insight s                                      16 2\nOverview\nMultiple issues arise with the emergence of crowdlending; these pertain to\nregulation, risk management and investors’ behaviour.  Compared to the\nnon-investment crowdfunding model, crowdlending is the dominant model\nin the world. As of 2019, crowdlending accounted for more than 95% of the\nfunds raised worldwide, with A sian countries  – particularly China  – in the\nlead. In early 2020, China had the largest volume of money -raising\ntransactions from crowdfunding totalling more than 200 billion USD.\nHowever, given the industry’s potential growth in Asian countries, multiple\nissues with crowdfunding practices need to be resolved.\nMedia coverage on crowdlending is increasingly widespread, as seen from\nhow it has become a buzzword within the last few years. Media attention on\ncrowdlending can help us understand media awareness,  media framing, and\npublic understanding of the topic. Further, there is a lack of information on\ndistinct characteristics and decision making of crowdfunding investors in the\nfield of investor behaviour.\nWe analysed the news coverage on crowdlending in Asia spanning a ten -year\nperiod from 2009 to 2019. We also surveyed crowdlending investors to\nunderstand their behaviours when interacting with crowdlending platform s.\nOur analyses  provide insights into the challenges and opportunities of the\ncrowdlending industry in Asia . They also  reveal crowdlending investors’\nbehaviour. Understanding this behaviour is critical for  the crowdlending\nindustry to survive and thrive.\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n3\n4\nMethodology  Overview\nSingapore Institute of Technology supported by Crowdo undertook the\nresearch from July 2019 to March 2020. The research comprise d text\nanalysis of major newspapers in Asia and survey o f Crowdlending investors\nin Singapore. The aim s of the research were  (1) to understand how\ncrowdlending has been diffused in Asia within the last 10 years , and (2) to\ngain greater insights into Crowdlending investors ’ behaviour. The text\nanalysis in this document reveal s diffusion of  information on  crowdlending\nin the media . This diffusion could potentially help the public, practitioners\nand governments to be aware of the crowdlending platform’s potential risks\nand ways to mitigate them.  In addition, our survey data present investors’\nperceptions to ward crowdlending platform.  For questions or\nmore information about the text analysis, survey analysis and findings,\nplease contact  the Singapore Institute of Technology research team\n(Arif.Perdana@Singaporetech.edu.sg ). Crowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\nMethodology  Statement\nTo understand crowdlending diffusion in Asia, a sample of electronic news\npublished in Asian countries was collected from Factiva  (database ) between\nDecember 2019 and March 2020. The news coverage on crowdlending in\nAsia spanned a ten -year period from 2009 to 2019. For a manageable news\nsearch, a pre -determined list of news media was created, spec ifically major\nnewspapers and major global business newspapers (in terms of circulation)\navailable on Factiva containing representative news on crowdlending in Asia.\nThe newspapers were: South China Morning Post  (Hong Kong), China Daily\n(China), The Asahi Shimbun Asia & Japan Watch  (Japan), The Straits Times\n(Singapore), The Jakarta Post  (Indonesia), The Nation  (Thailand), Mint\n(India), Korea Economic Daily  (South Korea), Financial Times  (Global – Asian\nRegion), Wall Street Journal  (Global – Asian Reg ion), and The Australian\nFinancial Review  (Global – Asian).\nThe dataset comprised 1,269 English language news articles containing a\ntotal of 951,030 words. Computer -assisted textual analysis (Wordij 3.0 ) was\napplied to understand media coverage on crowdlending challenges ,\nopportunities,  emergence, and diffusion over this period.  The words  were\ncounted based on the frequency of occurrence.  Nodes that were distant and\nunconnected to other clustered nodes were automatically discarded.\nTo understand c rowdlending investors’ behaviour , the research team\nsupported by Qualtrics research panel provider conducted an online survey\nbetween February and March 2020. Prior to the survey  distribution , the\nteam spent six months (from July 2019 to January 2020) to develop , test and\nvalidate the questionnaire. The survey polled a sample of 222 crowdlending\nindividual investors residing in Singapore.\nCrowdlending  in Asia\nCrowdlending is increasingly popular as a means of alternative\ninvestment or for raising capital. This platform emerged in Asia in\n2009, with China being one of the earliest countries to introduce\ncrowdlending. Since its inception ove r a decade ago, the industry has\ngrown significantly . Yet, multiple unresolved issues remain.\nOur findings centre on  around two main themes: diffusion of\ncrowdlending in China and diffusion outside China.  Overall, the\ndevelopment of crowdlending in Chin a dominated media coverage\nduring the period 2009 -2014. By publishing crowdlending related\nnews positively,  the media helped to raise public awareness of the\npotential of the platform. Media attention at this time resulted from\ncircumstances in China, thus allowing crowdlending to flourish. In\nparticular, media coverage on two factors contributed to the rapid\ngrowth of crowdlending, namely, interest rate l iberalization and\nfinancial disintermediation. While these two factors were the initial\ncatalysts of crowdlending, in the years following, they were misused\nby crowdlending companies engaged in fraudulent and criminal\nactivities. These companies attracted lenders with promises of high\nreturn while charging borrowers high interest rates. In other words,\ninstead of making borrowing more convenient and flexible for small\nbusinesses and individual borrowers, these crowdlending companies\nbecame loan sharks to th eir customers.\nIn spite of that, crowdlending continued to see rapid growth. Media ,\ntoo, continued to report positive news about crowdlending to the\nwider public audience.  Prior to 2015, regulators in China took a lenient approach, which\nallowed crowdlending companies to surge. In 2016, however, media\npaid close attention to the fraudulent activities of crowdlending\ncompanies in China . Government crackdown, Ponzi schemes, hi gh\ninterest rates, and regulatory clampdown became  common themes in\nmedia reports. Customers were swindled by fraudulent crowdlending\npractices, and the Chinese government imposed strict regulations to\ncurb these practices. Many crowdlending companies ceas ed\noperation, leaving only a small number of companies which complied\nwith the regulations. Until 2019, as the Chinese government\ntightened regulations, the crowdlending crisis in China showed no\nsign of weakening. Unlike mainland China, Hong Kong adopted a\ndifferent approach to potential crowdlending risks with its regulatory\nsandbox. The crowdlending landscape in Hong Kong, therefore, was\nrelatively stable compared to that in mainland China. Overall,\ncrowdlending in China experienced a dramatic rise follo wed by an\nordeal.\nMedia coverage on the crowdlending landscape outside China\nbecame increasingly  visible in 2016. Media reported the development\nof crowdlending in India, Indonesia, Singapore, and Thailand.\nFavourable news , such as  crowdlending market growth, venture\ncapital investment support and regulatory sandbox , has been\nreported in the media si nce 2016. Unlike the crowdlending landscape\nin mainland China , which encountered tumultuous times over the\nyears 2014 to 2019, crowdlending outside China was apparently\npromising and gaining momentum.  Crowdlending in Asia: Landscape and Investor Characteristics | Findings and Ins ights\n| Findings and insights\n5\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n6\nTwo implications can be drawn from our findings. First, the lesson\nlearned from the rise and fall of the crowdlending industry in China\nshould caution other governments in Asia to have judicious policies\non regulating the industry. T he dev elopment of crowdlending in Asia\ncan be considered in two ways: development within China and\ndevelopment outside China. Within China, the crowdlending\ndevelopment in Hong Kon g is somewhat different from that in\nmainland China, which initially allowed crowdlending to rapidly\nsprout unregulated, resulting in the collapse of a significant number\nof crowdlending companies. In contrast, Hong Kong took a more\ncautious approach to pr ovide a safe environment for crowdlending to\ngrow , as did countries o utside China, such as S ingapore, Indonesia,\nand Thailand.  Second, similar to the diffusion of other innovations,\ncrowdlending diffusion in Asia is influenced by both favourable and\nunfavo urable news. The media can represent public reactions and\nsentiments toward crowdlending. Considering that crowdlending\nencompasses technology, finance and legal issues, relevant\nstakeholders may observe media coverage on crowdlending to better\nunderstand its ecosystems and risks. Media coverage could also help\nauthorities to better regulate the industry. At the same time,\ncrowdlending practitioners could resolve potential impediments from\ncrowdlending practices. For individuals, media coverage on\ncrowdlend ing practices could help them obtain multiple perspectives\nrelated to the se practices. Consequently, media coverage could\nbenefit society as a whole.\n7\nText Analytics and Insights\n1. Semantic Network of Concepts from Crowdlending News (2009 -2013)\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n8\nWithin the period 2009 to 2013, media coverage on crowdlending\nfocused on promoting peer -to-peer lending to a wider public\naudience.  Crowdlending emerged as a result of the booming Internet\nfinance. The pervasiveness of the Internet enables innovation in\ndelivering finance products which previously could not be effectively\nmanaged by traditional financial institutions. Apart from this e nabling\ntechnology, crowdlending became increasingly attractive due to\nfirms’ small businesses and  the micro credit target market, given that\npeer -to-peer lending facilitates small businesses to have access to\nbusiness funding much more quickly than the tr aditional bank, while\nat the same time ,  lenders from the crowd are rewarded with decent\nreturns. Crowdlending was, therefore, viewed as a potential game\nchanger: for borrowers, such platforms were loan sources, and for\nlenders, they were loan -based invest ments. Despite this potential,\nbetween 2009 and 2013, the media cautioned the public regarding\nthe unreasonably high interest rates which could potentially increase\nthe defaulted risks for borrowers .\n2. Semantic Network of Concepts from Crowdlending News (2014)\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n9\nThe 2014 sample data revealed that the topic of crowdlending\ncontinued to captivate media attention. News about the growth of\ncrowdlending in China frequently appeared in the media due to its\nquick emergence, for example, Renrendai and Dianrong. Interest r ate\nliberalization could have helped accelerate crowdlending growth in\nAsia. As we know, China has two types of interest rates: the first is for\ndeposits, which is controlled by the government, while the second is\nfor loans , which is determined by market p layers. While crowdlending\ngained  momentum in this year, this sector in China remained\nunregulated. Lack of regulation could lead to potentially huge risks for\nindividual investors. Hence , both optimism and scepticism  toward\ncrowdlending existed, which cou ld account for the rise in both\npositive and negative sentiments in 2014. Furthermore, apart from\nbroadcasting the emergence of crowdlending in China, media in 2014\nalso began to report the emergence of crowdlending in India (i.e.,\nFaircent) and Singapore (Moolahsense).\n3. Semantic Network of Concepts from Crowdlending News (2015 )\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n10\nThe year 2015 saw an escalation in media coverage on crowdlending .\nThe semantic network analysis showed more single words were\nconnected to “lending”, which suggests that the scope related to\ncrowdlending had widened. In this year, too, venture capital\ncompanies  were  investing substantial sums  of money in\ncrowdlending.  While the number of crowdfunding platforms\nmultiplied, fears became apparent in the media regarding the number\nof fraud cases related to crowdlending. Such misbehavior and the lack\nof regulatory oversight were thought  to have caused the  collapse of\ncrowdlending companies. At the same time, in the face of continued\ngrowth of crowdlending, governments in Asia, for example, China,\nIndia and Singapore, had begun to regulate crowdlending to mitigate\npotential risks and criminal activities. Re gulation included establishing\nthe legal status of the crowdlending business, market entry\nrequirements, interest rates, business rules, and a regulatory\nframework .\n4. Semantic Network of Concepts from Crowdlending News (2016)\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n11\nThe rapid expansion of crowdlending supported by venture capital\nand Internet giants (e.g., Ant Financial) continued to dominate media\nheadlines in 2016. Despite this, unfavourable news related to\ncrowdlending became more visible than in previous years. This was\ndue to heightened criminal activities in China involving crowdlending.\nSmall businesses and individuals were offered high intere st rates,\nwhich could lead to them suffering disastrous consequences . Such\nunfavourable news in 2016 could have led to increase d negative\nsentiments toward crowdlending , in spite of the Chinese authorities’\nefforts to close down several illegal and fake peer -to-peer lending\ncompanies, such as Ezubao and Zhejiang Yinfang Investment and\nManagement Co. The appearance of Ezubao in the semantic network\nanalysis reflects this unfavourable turn of events , as at that time,\nEzubao wa s China’s biggest peer -to-peer online lending firm, which\nhad operated illegally through the Ponzi scheme and had fabricated\n95% of their projects. In total , Ezubao successfully collected almost 60\nbillion yuan from 900,000 investors .\n5. Semantic Network of Concepts from Crowdlending News (2017)\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n12\nCrowdlending  troubles in China continued in to 2017. This time, the\nChinese government kept the crowdlending industry under scrutiny.\nIt required local regulators to oversee crowdlending and report any\nwrongdoing to the financial watchdog authorities. The authorities set\nthe limit on crowdlending inte rest rates and financing fees.\nCrowdlending was also banned from offering consumer loans to\nstudents and any unqualified borrowers. Consequently, the Chinese\ngovernment ordered a crackdown on crowdlending companies. While\na substantial number of these  comp anies were closed due to  the\nstricter regulations, others, like Lufax and Dianrong, continued to\nprosper . Lufax expanded its business to Singapore, whereas Dianrong\nwas supported by Singapore’s sovereign wealth fund. While the\nnumber of crowdlending compan ies in China  declined  due to the\ntightened regulations, the regulations remain ed ineffective  to\naccelerate the development of the companies. In this year, Hong\nKong took a progressive approach, unlike its central government in\nmainland China, by providing a regulatory sandbox for Fintech,\nincluding crowdlending companies. A regulatory sandbox permits\ncrowdlending companies to launch their products to real customers.\nThe authorities and companies can then assess the risks of the newly\nlaunched crowdlending p roducts from multiple perspectives\n(customers, companies, and financial stability). Overall crowdlending\nbegan  to flourish outside China, in Asian countries like Singapore,\nThailand, Indonesia, and Malaysia. In fact, Singapore, Thailand,  and\nIndonesia had begun to implement their respective Fintech regulatory\nframeworks and had created regulatory sandboxes to foster the\ngrowth of the crowdlending industry .\n6. Semantic Network of Concepts from Crowdlending News (2018)\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n13\nBy 2018, the collapse of crowdlending companies in China had\nreached its peak. The total outstanding balance from crowdlending\ncompanies also soared at 1.3 trillion yuan (188 billion  USD ) in the first\nquarter of 2018. The regulatory crackdown continued in China,\nresulting in the shutdown of thousands of crowdlending companies.\nThe Chinese authorities continued to enforce tight regulations,\nincluding stricter requirements for registration and operating license,\nand prevented crowdlending companies from setting high interest\nrates. At the same time, 2018 marked the start of the crowdlending\nrace in South -east Asian countries. While the crowdlending markets\nin Indonesia, Singapore and Thailan d were quickly progressing,\nneighbouring markets  in the Philippines and Vietnam were catching\nup. In 2018, crowdlending start -up penetration in these two countries\nintensified .\n7. Semantic Network of Concepts from Crowdlending News (2019 )\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n14\nUnfavourable news coverage related to crowdlending continued\nunabated in 2019. At the same time, as seen from the semantic\nnetwork of 2019, words such as China , crackdown , and risks  appeared\nin the media . The Chinese government continued to enforce strict\nregulations for crowdlending companies, some of which encountered\nliquidity issues when overburdened by regulatory requirements. Such\nunfavourable news may help explain why negative sentiment peaked\nin 2019. Elsewhere in Asia, crowdlending similarly suffered a\nmeltdown due to various reasons . The slow approach to regulate\ncrowdlending companies in Vietnam, for example, could have led to\nserious risks for the companies and their customers. Similarly, in\nIndonesia, fears about crowdlending could have arisen  due to\ninadequate regulation to govern crowdlending companies  as well as\nconsumer and data protection .\nCrowdlending Investor\nCharacteristics\nWhile crowdlending has attracted substantial research interest, one\narea that requires more study is investor behaviour. Similarly,\nattention should be on the distinct characteristics of crowdfunding\ncompared to traditional investment platforms. Currently,\ncrowdfunding investors rely largely on scant viable information .\nIn crowdlending, investors rely heavily on the information provided\nfrom the crowdfunding website or applications. While crowdfunding\ninvestors can directly invest their money via the Internet, they have\nno direct access to the companies they invest in. Investor behaviours\naffect how decisions are made and how those decisions might affect\nthe investment return s. A relatively new school of thought, or what is\nknown as behaviour finance, assumes that investors are not rational\nat information processing . To illustrate, one influencing factor is risk\nappetite, which  affects investors’ investment decision making when\nattending to particular financial information in their portfolios.\nInvestment decisions made on the part of funders and investors are\nsubject to many forms of investor bias , which include overconfidence,\ndisposition effect, herding behaviour as well as home bias, also\nknown as familiarity bias.   Crowdlending campaigns that promise monetary or physical  rewards\nmay pose financial risks to investors. Accessibility of informa tion\nwhich facilitates the mitigation of financial risk positively influences\nfunding decisions. Crowdlending investors may act on impulse or\ninstinct rather than mak e decisions centred around verifiable\ninformation. While investors may evaluate opportunit ies based on\nthe perceived benefit s and risk s, weightage may also be placed on the\nbenefits of a transaction. In this case the evaluation of an investor’s\nrisk tolerance should be conducted by the crowdlending platform.\nConsequently, lenders could be match ed with loan requests that are\nin accordance with their risk appetite.  A campaign’s information such\nas its status and statistics has an influence on an investor’s decision.\nWhen there is a lack of information relating to financial cues as well\nas the pro ject, the subjective judgment  of project founders or firms’\nmanagerial team s is often used as a substitute.\nOur study reveals eight factors related to crowdlending investor s’\nbehaviour : Loan, Borrower, Lending Platform, Perceived Benefits,\nProcess Quality, Financial Risk , Preference o f Accessing Platform, and\nSocial Relationships & Endorsement.\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n15\nSurvey Analysis  and Insights  16\n1. Gender, Age, Risk Preference and Duration of Investments\nA vast majority of the survey respondents  are males . Thirty -nine percent aged 26 -35 years old  and 75 percent of respondents have been investing in P2P or P2B\nlending platforms for 1 to 5 years .\nQ: What is your gender?\nQ: What is your age?\nQ: How long have you been investing in P2P or P2B lending platforms?   Crowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n17\nN = 222\n1. Gender, Age, Risk Preference and Duration of Investments\nThe majority of survey respondents have a risk preference of “mostly towards higher  risk” from 2015 -2019.\nQ: State your risk preference (e.g. acceptance of loss and uncertainty of return) from 2015 -2019 .\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n18\nN = 222\n2. Asset Size, Salary and P2P Investment Proportion\nA significant majority of respondents have asset s with a size of “<SGD 1 Million”  followed by “SGD 1 Million to SGD 5 Million”  and “SGD 10 Million to SGD 50\nMillion” under their management .\nQ: What is the size of your asset under your management?\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n19\nN = 222\n2. Asset Size, Salary and P2P Investment Proportion\nThe vast  majority of respondents  would  spend 10 to 15 percent of their monthly salary on investment. De spite the high  monthly  salary  proportion for investment ,\na significant number of  respondents would  allocate only 10 to 15 percent  or 4 to 5 percent of the ir invest ment fund  to P2P  or P2B lending platforms.\nQ: What proportion of your monthly salary will you spend on investment?\nQ: What percentage of your investment fund would be allocated to P2P or P2B lending platforms?\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n20\nN = 222\n3. Potential Countries for P2P/P2B Investment Expansion\nCountries  that survey respondents are interested in  expanding their  P2P or P2B  lending platforms investment  – ranking from highest to lowest  – are: S ingapore,\nMalaysia, Thailand, Indonesia, Vietnam, Myanmar, Brunei, Cambodia , Laos and East Timor.\nQ: Which countries are  you interested in expanding your investment in P2P or P2B lending platforms?\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n21\nN = 222\n4. Occupation, Industries, Investment Analysis, and Financial Understanding\nA majority of survey respondents stated their occupation as Engineer , Finance , and Director .\nQ: Please state your occupation .\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n22\nN = 222\n4. Occupation, Industries, Investment Analysis, and Financial Understanding\nFinancial and insurance is the largest industry represented in the survey responses.\nQ: Which industry are you working in?    Crowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n23\nN = 222\n4. Occupation, Industries, Investment Analysis, and Financial Understanding\nAn overwhelming  majority of respondents are willing to spend time and effort on investment analysis .\nQ: Are you willing to spend time and effort on investment analysis?\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n24\nN = 222\n4. Occupation, Industries, Investment Analysis, and Financial Understanding\nSixty percent of  respondents  have a financial understand ing of  the meaning of  a trade -off between risk and return.  This percentage reflects that the respondents\nare likely novice investors , as s ophisticated investors are more willing to analyse companies’ financial statements and diversify their investment.\nQ: Pick the sentence that best describes you .\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n25\nN = 222\n5. Experience in Investment\nThe significant majority of  respondents had investment s in the year 2018 and have been  investing mostly in Fixed Assets,  followed by  Shares and Bonds.\nQ: What investment channels have you been investing in?\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n26\nN = 222\n5. Experience in Investment\nFor this question, respondents could  choose more than one option. According to s urvey respondents , an attractive investment platform is the reason for investing\nin P2P or P2B lending platforms.\nQ: Reason for investing in P2P or P2B lending platforms.\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n27\nN = 222\n5. Experience in Investment\nOnly P2P/P2B lending platforms such as Capital Match and Funding Societies are popular among the survey respondents.\nQ: In what P2P or P2B lending platforms do you currently allocate (or have allocated) your investment fund?\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n28\nN = 222\n6. P2P/P2B Influencing Factors on Investor Behaviour\nOverall , the most  significant  influenc ing factor  on P2P/P2B investors’ behaviour  is Loan. This is followed  by Borrower , which has an overall average score of 4.06 ,\nwhile Lending Platform and Perceived Benefits have the same average score of 4.02 . Sub-sections  6.1 to 6.8 explain each influencing factor .    Crowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n29\nN = 222\n6. P2P/P2B Influencing Factors on Investor Behaviour\n6.1 Loan\nThe aspects  most likely to influence  the respondents to lend are information on the repayment period (average score of 4.25) and loan interest rate (average\nscore of 4.24). (The colors in the bar chart reflects the Likert -scale score s from 1 to 5).\nQ: My decision to lend  is influenced by the following types of information on loan requests.\n6.2 Borrower\nThe aspects  that would have the most influence on the lender are the borrower’s credit score (average score of 4.18), accumulated transaction and repayment\nhistory (averag e score of 4.14) , and financial capabilities (average score of 4.10).\nQ: My decision to lend is influenced by the following aspects about the borrower.   Crowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n30\nN = 222\n6. P2P/P2B Influencing Factors on Investor Behaviour\n6.3 Lending Platform\nSurvey respondents would most likely lend when the lending platform is registered with the Government or Monetary Authority ( average score of 4.18), when\nthe transaction information is protected (average score of 4.13) , and when it is  user friendly/easy to  navigate (average score of 4.10). This suggest s that investors\nwould lend when the lending platform is safe, secure  and user friendly.\nQ: My decision to lend is influenced by the following aspects about the lending platform.\n6.4 Perceived Benefits\nThe survey respondents are generally influenced to lend when the y view the  lending platform as an alternative way of investing.\nQ: My decision to lend is influenced by the benefits that I perceive are being offered by the lending platform.   Crowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n31\nN = 222\n6. P2P/P2B Influencing Factors on Investor Behaviour\n6.5 Process Quality\nThe survey respondents are generally influenced to lend when the y know they can obtain help in the process, such as having a relationship manager manage\ntheir fund.\nQ: My decision to lend is influenced by the process quality that I perceive are being offered through the lending pl atform.\n6.6 Financial Risk\nIn terms of financial risk and campaign statistics, the respondents would be willing to lend when the lending platform will communicate with investors in the\nevent of late payment or default risks .\nQ: My decision to lend is influenced by the financial risks and campaign statistics that I perceive are being offered through th e lending platform.\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n32\nN = 222\n6. P2P/P2B Influencing Factors on Investor Behaviour\n6.7 Preference o f Accessing Platform\nMost of the respondents prefer to use their mobile phone to check their investment portfolio.\nQ: I prefer a certain way of accessing the platform.\n6.8 Social Relationships & Endorsement\nRespondents are influenced to lend due to the success stories of friends and family who have invested through the lend ing platform.\nQ: My decision to lend is influ enced by the social relationships and endorsement that I perceive important when investing through the lending platform.\nCrowdlending in Asia: Landscape and Investor Characteristics | Findings and Insights\n| Findings and insights\n33\nN = 222\nAnnex\nCrowdfunding is the use of small amounts of\ncapital from a large number of individuals to\nfinance a new business venture. Crowdfunding\nmakes use of the easy accessibility of vast\nnetworks of people through social media and\ncrowdfunding websites to bring in vestors and\nentrepreneurs together, with the potential to\nincrease entrepreneurship by expanding the\npool of investors beyond the traditional circle of\nowners, relatives and venture capitalists .\n(investopedia.com)\nPeer -to-peer (P2P) lending  enables indivi duals\nto obtain loans directly from other individuals,\ncutting out the financial institution as the\nmiddleman. Websites that facilitate P2P lending\nhave greatly increased its adoption as an\nalternative method of financing.  P2P lending is\nalso known as “soc ial lending” or “crowd\nlending.” It has only existed since 2005, but the\ncrowd of competitors already includes Prosper,\nLending Club, Peerform, Upstart, and\nStreetShares . (investopedia.com)\n34\nAuthors *\nArif Perdana\nAssistant Professor\nPrincipal Investigator\nSingapore Institute of Technology\nArif.Perdana@Singaporetech.edu.sg\nHwee Hoon Lee\nAssistant Professor\nCo-investigator\nSingapore Institute of Technology\nHweeHoon.Lee@Singaporetech.edu.sg\nPearpilai Jutasompakorn\nAssistant Professor\nCo-investigator\nSingapore Institute of Technology\nPearp ilai@Singaporetech.edu.sg\nAlex Qiang  Chen\nAssistant Professor\nCo-investigator\nSingapore Institute of Technology\nAlex.Q.Chen@Singaporetech.edu.sg\nCollaborator\nReona Shimada\nCo-founder and Group CEO , Crowdo\nContributors\nWe thank the following Research Assistants :\nNixon Sng\nBenedict Lim Yong Jie\nTan Sheng Yi Timothy\nHong Chee Ming\nPeh Wen Hao\nAlex Ng Xianshuo\n* We acknowledge that all errors in the report\nare our own.\n35"
}