{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20221105-lhzb-passioncardholdersmustdownloadnewyuuapptoearnpoints.pdf",
  "type": "pdf",
  "content": "许翔宇　黄俊贤　报道\nhsiangyu@sph.com.sg\nnjunxian@sph.com.sg\n自10月底开始，持有实体百\n盛卡（PAssion Card）的消费者在冷藏公司和佳宁药房等指定超市或零售店购物时，必须下载新的手机应用并设立账号，才能累积和兑换奖励分数，不像过去那样“扫卡”就行。　　由于事先没有接到通知，有消费者认为，这个名为yuu  Rewards Club的新奖励计划对没有智能手机和不谙科技的年长顾客造成诸多不便。　　设计yuu应用的是科技公司minden.ai，公司首席执行官孙仁勇回复《联合早报》询问时澄清，顾客如果无法下载yuu应用，也没能完成将百盛卡连接到yuu账号的步骤，仍可以在结账时扫描实体百盛卡，累积积分。　　但这些顾客最迟要在2023年4月30日注册为yuu会员，才能继续查看和兑换奖励积分，他们间中不会损失任何积分。　　孙仁勇也说，年长者如果有疑问或没有智能手机，可以到合作伙伴DFI零售集团旗下店面或民众俱乐部询问，有关人员会在线下为他们注册yuu账号，以及完成将百盛卡连接到账号的步骤。　　新的yuu奖励积分平台是在上周四（10月27日），由淡马锡创立的本地科技公司minden.ai与经营冷藏公司超市、巨人超市、7-Eleven便利店和和佳宁药房的DFI零售集团，以及百盛卡和星展银行等伙伴合作推出。　　消费者免费下载yuu应用，并注册账号，就能在指定超市或零售店付款时，扫描应用上的条码或QR码，累积积分，消费时享有折扣或换取赠品。　　百盛卡或百盛储蓄银行转账卡持有者，下载yuu应用并注册账号，再把百盛卡连接到账号，就能扫描应用累积积分。只要将百盛卡连接到yuu账号，消费者可继续在指定零售店扫描实体卡。\n无人讲解应用操作\n年长消费者感失望\n然而，有年长消费者向《联\n合早报》反映，由于不谙科技，他们过渡到新的奖励计划时碰到障碍。　　家庭主妇陈丽心（70岁）到怡丰城的佳宁药房购物，总会在结账时扫描百盛卡，赚取积分。她对新计划并不知情，也不清楚新的应用如何操作。“收银员只告诉我要下载应用，没有教我怎么下载，后面还有人排队，我就没有多问。这个做法挺麻烦……我平时不常用智能手机，只会使用基本的通讯应用，需要有人帮我下载和讲解应用的功能。”　　记者星期五（11月4日）下午也走访盛港勘宝坊冷藏公司超市，只见门口设有一个咨询台，上面摆放了一叠有关yuu应用的宣传册子。　　家庭主妇陈亚妹（77岁）没有智能手机，她认为新安排对她来说更不方便。“我有点失望，也觉得说改就改，没有考虑到像我们这样的年长者。”　　新的安排对年轻消费者则毫无障碍。广告业从业员陈俊豪（31岁）向来使用百盛储蓄银行转账卡，已下载新的应用。“以往累积的积分只能在几间超市或药房使用，现在可使用的地方更多；新的应用结合不同商家的促销，奖励也更多元化。”　　新加坡理工大学商业、传播及设计学院助理教授黄毅凯认为，我国虽步入数码时代，但不能认定每个人的数码素养（digital literacy）都很高。“尤其像百盛卡持有者，各年龄层都有。如果要广泛地推出某种新科技，事先应去了解，数码素养不高的人会碰到什么障碍，并且策划一些有效的对策，帮他们解除这些障碍或适应转变。”　　孙仁勇回复本报询问时指出，公司已培训参与计划的零售店人员和增聘促销员，协助顾客下载应用和解答疑问。此外，公司也在社区和合作伙伴店面举办路演等活动，向公众宣传yuu应用。 百盛卡持有者 须下载新应用攒积分\n受访消费者：对不谙科技年长者造成不便\n由于事先没有接到通知，有消费者认为，这个名为 yuu\nRewards Club 的新奖励计划对没有智能手机和不谙科\n技的年长顾客造成诸多不便。\n自1\n0月27日起，\n本地科技公司\nminden.ai与经营冷藏公司超市等零售店的DFI零售集团，以及百盛卡和星展银行等伙伴合作推出yuu Rewards Club新奖励平台。部分消费者认为，新计划对没有智能手机和不谙科技的年长顾客造成不便。图为世界城的冷藏公司超市。\n（周国威摄）\nPublication: Lianhe Zaobao\nDate: 5 Nov 2022\nHeadline: PAssion Card Holders must\ndownload new Yuu app to earn point s\nSource: Lianhe Zaobao © SPH Media Limited. Reproduced with permission."
}