{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2025-03/EEE%20ISE%20CSM%20Info%20Kit.pdf",
  "type": "pdf",
  "content": "Last updated: 5 March 2024\nPage 1 of 5\nBachelor of Science (Honours) in Electrical and Electronic Engineering (EEE) /\nInfrastructure and Systems Engineering (ISE)\n(via the Competency-based Stackable Micro -credential Pathway)\nRegistration Information Kit\nDear Applicant ,\n1. The Bachelor of Science (Honours) in EEE / ISE [via the Competency -based Stackable Micro-\ncredential (CSM) Pathway] is a three- year direct honours programme  (the “Programme”)  offered by\nSingapore Institute of Technology (S IT). This P rogramme is designed to provide an upgrading pathway\nfor in -employment individuals.  You may wish to access th e SIT webpage\nfor more details of the\nProgramme.\n2. We thank you for your interest in the Programme. Please read through this  Information Kit  and the\nSIT Applicant Guide carefully prior to accessing the SIT Application Portal  for registration.  For\navoidance of doubt, the URL for the SIT Application Portal  is: https://learner.singaporetech.edu.sg/\n3. This Information Kit  comprises two sections:\na) Annex A – Key Conditions of the P rogramme\nb) Annex B – Further supplementary FAQs  to the SIT Applicant Guide  on account creation,\nApplication ID, submission of supporting documentations , etc.\n4. Do note the following:\na) The registration window ( 3 Jun to 14 Jun 2024) using the SIT Application Portal\nas found in the\nSIT webpage .\nb) Please ensure that payment  for the  prevailing  registration fee for the Year of Application is\nmade as part of the application  process . You may refer to the following e-payment link  to make\npayment.  The payment link is  also found in the SIT Application Portal .\nc) Please make a screen shot of your payment outcome  to be included in the application as\none of the  supporting document s. There may be delays in application processing or release of\noutcome if you fail to pay the registration fee.\nd) If you encountered any payment issues (e.g. , double payment), please email\nAdm@SingaporeTech.edu.sg citing your full name as in your application and the Application ID .\nAttach any supporting screenshots that may help us in our review.\n5. Please ensure you have all the following supporting document s, as indicated in Table 1 , ready\nin softcopy  before registering for the Programme. It is advisable that\na) You properly label your supporting documents . If any documents in your application require further\naction, you will be notified via the email provided in your application submission. Please check your\nemail regularly.\nb) Scanned soft copies should be of  at least  300 dpi resolution .\nLast updated: 5 March 2024\nPage 2 of 5\nTable 1. Supporting documentation  Acceptable File\nFormat\n(i) Personal statement – in within  300 words, please share with us “ Why do you\nwant to take up this CSM pathway programme? ”  This is an expression of\nyour motivation to apply to SIT and should be taken seriously.  DOC, DOC X, PDF\n(ii) Resume/CV (if applicable)\n(iii) Scanned copy of NRIC / FIN / Passport / LTVP+ card (if applicable)\n(both sides front and back for NRIC / FIN) .\nJPEG, JPG, PNG,\nPDF, OA*\n*Academic\ntranscripts can also\nbe submitted using OPENCERT  “.oa”\nformat if possible.  (iv) Scanned copy of Academic Transcripts and Certificates (Polytechnic Diploma,\nSingapore- Cambridge GCE A levels, Singapore- Cambridge GCE O levels,\nInternational Baccalaureate (IB) Diploma, other local Diplomas)  as applicable.\n(v) [For self-sponsored Applicants only] Employment Verification Letter from your\nemployer indicating your employment status.\n(vi) Any other relevant supplementary documents (e.g. , other international or local\nqualifications including university degree or advanced diploma, or letters of\nrecommendation or testimonials (include up to three ) that you wish to include\nin your application.\n(vii) Registration fee payment screenshot .\n6. Applicants are advised to print in pdf format and keep a copy of your application summary\nbefore submitting your  application. You will not be able to view your application details upon\nsubmission of application.\n7. Your application, together  with all the relevant supporting documents , will be reviewed upon\nsuccessful submission of your application.\n8. During the processing phase, we may invite you to attend an in- person interview and/or Academic\nAptitude Assessment, via the email provided in your application submission .\n9. Only accepted Learner s will receive a Letter of Offer  from SIT  via the email  provided in your\napplication submission.\n<No signature is required>\nSingapore Institute of Technology\nLast updated: 5 March 2024\nPage 3 of 5  Annex A\nKey Conditions of the Programme\n1. To gain final acceptance into the Bachelor of Science (Honours) in EEE / ISE (via the CSM Pathway ) and\nremain in the Programme as an adult  learner  (“Learner ”) under SIT, the person must:\na) Accept the Letter of Offer from SIT , and\nb) Be in employment (see para 3 of Annex A) .\n2. All accepted Learner s will subsequently  be required to sign a Letter of Undertaking from SIT to agree to\nabide to all of SIT Policies and Procedures.\n3. The Learner  will need to be employed throughout his/her candidature. The Learner will need to inform SIT\nif there is a change of employer or he/she is not in- employment at any time regardless of any underlying\nreason(s). SIT shall reserve the final right to terminate the Learner’s enrollment in the Programme.\n4. Should the Learner  withdraw from the Programme regardless of any underlying reasons , the Learner  could\nopt to take the micro -credential pathway as stackable or standalone course.\n***\nLast updated: 5 March 2024\nPage 4 of 5  Annex B\nFurther FAQs  to the SIT Applicant Guide\nQuestion  Answer\nWho should I\ncontact if I\nencounter any\nissue?  For Technical or Login -related matters, please contact\nsitlearn@singaporetech.edu.sg .\nFor Application- related matters, please contact\nAdm@SingaporeTech.edu.sg\nPlease provide the following details:\n• Your full name\n• Registered Email Address\n• Your application number  (if available)\nWe will assess the issue and notify you accordingly.\nSIT Operating Hours:\nMondays to Thursdays: 8:30 am to 6:00 pm\nFridays: 8:30 am to 5:30 pm\nClosed on Saturdays, Sundays, and Public Holidays\nHow do I create\nan account?   To start your application with SIT, navigate to the SIT Application Portal  and\nselect the ‘ Not a Member?’ option.\nProceed to create an account by providing your preferred email and a password. This will serve as your login Application ID .\nFor guidance on resetting your ID or password, please refer to the FAQ titled “I\nforgot my ID / Password. How do I reset?”\nPlease ensure that the email address you have used to create an account will\nbe the same email address that should receive email notifications from SIT on your application progress.\nHow do I access\nthe Authenticator\nto access my\napplication?  For security purposes, please download either Salesforce Authenticator or\nMicrosoft Authenticator from the Apple App Store or Google Play Store.\nThis app will be used to generate an authentication code required for accessing\nyour application. This is a security requirement.\nYou can refer to the SIT Application Guide  for comprehensive instructions on\ndownloading and utili sing the Authenticator.\nI forgot my ID /\nPassword. How\ndo I reset?   To reset your password, visit the  SIT Application Portal  and click the ‘Forgot Your\nPassword’ button. A new password will be sent to your registered email.  The\nApplication ID corresponds to the email you provided during account\nregistration for application submission.\nIn case you forget your Application ID, kindly contact\nsitlearn@singaporetech.edu.sg , and we will assist you in retrieving it.\nLast updated: 5 March 2024\nPage 5 of 5  Question  Answer\nCan I save my\napplication and\ncomplete it later?  To save your application draft, click the ‘Save for later’ button located at the bottom\nof the application form.\nAfterwards, you will receive an email notification containing a link to your saved\ndraft. You can access and complete it at your convenience.\nAre all my\nrequired\ndocuments\nsuccessfully\nuploaded?  Before submitting your application, please review the ‘Upload Document’ tab on\nthe application page to ensure that all necessary documents have been included.\nHow do I submit\na new version of\na rejected\ndocument?  During your application, you can submit relevant documents within the ‘Document\nUpload’ tab on the application page.\nIf the Admissions team requests that you resubmit specific documents after\napplying, please follow these steps:\n1. Access the link provided in the email sent to you.\n2. Navigate to the 'Rejected Document' tab.\n3. Click on the relevant item.\n4. Upload the new document.\n5. Click the ‘Submit’ button to complete the process.\nHas my\napplication been\nreceived?  Upon successful submission of your application, you will receive an email\nnotification via the preferred email address you have indicated in your Application\nForm. If you did not receive the notification, please check your spam/junk folder.\nIf you still have not received the notification, please email\nAdm@SingaporeTech.edu.sg  with the following details:\n• Your full name\n• Registered Email Address\n• Your application number\nWe will check your application and notify you accordingly.\nWhat is the\nstatus of my\napplication?   To check the status of your application, simply log in to the SIT Application Portal\nusing the email address you used to register your account. Once logged in, you\nshould be able to check the status of your application.\nHow do I submit\nadditional\ndocuments for\nmy application,\nafter\nsubmission?  If you need to submit additional documents after finali sing your application, please\nemail Adm@SingaporeTech.edu.sg  with the following details:\n• Your full name\n• Registered Email Address\n• Your application number\nWe will inform you of any further steps that may be necessary.\n***"
}