{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/For%20SITizens%20Gifts%20That%20Keep%20on%20Giving.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  08/16\nFor SITizens, New Gifts that Keep on Giving\nImpactful endowed gifts from donors advance a diverse range of support for students at SIT\nSIT students can look forward to a growing range of philanthropic support which nurtures undergraduate learning.At the Singapore Institute of Technology (SIT), a range of endowed gifts was recently made possible by generous donors\nwith a strong belief in the transformative power of education. These three gifts, made in support of student excellence, research, and financial aid at SIT, will permanently enable SIT undergraduates to make the most of their education, and realise their potential to the fullest.\nThe Abang Scholarship\nThe Abang Scholarship has been made possible by an\nanonymous donor, who hopes to provide aid to financially needy but deserving students in the same way that an elder brother (or Abang in Malay) would gladly offer help to a sibling in the family.\nIn this spirit of communal and familial support, two\nscholarships will be disbursed in Academic Year (AY) 2020/21 and from AY 2021/22 onwards, three to four scholarships will be given out annually.\nThe awards will be given to academically talented and\nall-rounded students, including students from the Malay community or those in need of financial assistance.\nJSP Study Grant\nThanks to a new endowed gift from Mr Jeff Goh, the JSP\nStudy Grant that he has made possible at SIT since 2015 was recently endowed to support academically promising undergraduates at SIT in perpetuity.The Study Grant was realised out of a wish to nurture talented undergraduates who need some financial support. Thanks to this new and permanent philanthropic commitment, one Study Grant will be awarded annually – and in perpetuity – to academically talented but financially needy students from SIT-conferred or joint degree programmes.\nThe JSP Study Grant will help shape their future through\neducation, and inspire them to pay it forward to the community when they one day have the ability to do so.\nMs Jasmine Lee, a Year 2 Physiotherapy student who\nreceived the Study Grant in AY 2017/18 said that the Study Grant has given her the opportunity to continue her studies as well as have extra time to learn new things through her CCAs. “I would like to thank Mr Goh for being a role model to many of us, and one day I hope that I’ll be able to help others in the same way that he has,” she added.\nK M Quek Applied Research Grant\nMade possible through Dr Stanley Quek and The Ireland\nFunds (Singapore) in support of the health sciences, the K M Quek Applied Research Grant will support research projects involving undergraduate participation and learning at SIT’s Centre of Health Sciences Research & Innovation (CHeSRI) from the next academic year (AY 2019/20) onwards.\nCHeSRI was set up within the Health and Social Sciences\n(HSS) Cluster in 2017, as a strategic initiative to consolidate all health and social sciences research activities within the university.\nThe CHesRI projects funded by the Research Grant will\nopen up new possibilities in making improvements in patient care, physical rehabilitation and the promotion of healthier living in other areas; as well as giving SIT’s HSS undergraduates greater exposure to these areas of applied research."
}