{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20220723-the-straits-times-howhe039smakingamarkonhisownterms-2.pdf",
  "type": "pdf",
  "content": "Scoring an E8 for English\nmeant that he could not apply for\nany of the polytechnic courses. But when Nanyang Polytechnic granted him entry on the condition that he improve his English grade during his diploma programme in Mechatronics, he knew he had been given a chance to turn his academic fortunes around.\nUpping his grade steadily by\nputting his shoulder to the wheel If Mr Francis Swee had taken his O-level results at face value, he would not be\nwhere he is today. He is close to completing his engineering\ndegree and kicking off his career\nat a multinational company as a\nsoftware engineer.\nIn 2013, when he first received his\nresults, he immediately thought that going to a polytechnic was out of the question, let alone university.\nVisit singaporetech.edu.sg/\nadmissions/undergraduate/\nscholarships/sit-scholarship for more information. Mr Francis\nSwee, holding a Smart Mobile Manipulator robot that he programmed and wired, wants others who did not “excel in academics” to know that it is possible to achieve your dreams.\nPHOTO:\nFRENCHESCAR LIM\nship as a way to show others\nthat just because you didn’t get the grades required to get into the schools of your choice doesn’t mean you can’t get ahead later in life,” he shares.\n“If I had given up then and\nbelieved that university wasn’t meant for me, I wouldn’t have put in the effort to press on. It was through hard work and perseverance that I managed to achieve results.”\nBEYOND ACADEMICS\nHaving discovered a preference for practical, hands-on lessons while at polytechnic, the 26-year-old gravitated towards SIT, which specialises in applied learning and equipping students to integrate knowledge and skills in the real world.\nDuring his studies, he also\nlearnt that being a scholar not only meant maintaining good grades, but also developing the skill sets required to become an effective future leader. To help him flourish in that area, he was given opportunities to attend professional development workshops, such as for communication skills, and motivational tea sessions with guest speakers.\nIn his third year, he spent\neight months on attachment with information and communications technology firm AIT Technologies for the Integrated Work-Study Programme (IWSP), designed to prepare undergraduates for the working world.\nThere, Mr Swee found that\nhe had even more to learn. “During my IWSP , I took the opportunity to practise a ‘growth mindset’ when I had to pick up new programming languages or develop software I was unfamiliar with. I saw it as a way to grow and acquire skills that could be important or could come in handy one day.”\nA PROMISING FUTURE\nWhile his path to university was not “smooth sailing”, the road ahead looks bright.\nRecalling a time at poly\nwhen he and a teammate built a “social robot” called Ruth to interact with seniors living alone, Mr Swee says that was when he knew he wanted to use his interest and expertise for good.\n“Back when we were\ndeveloping Ruth, we were unable to make her move around the house,” he says. “Now, armed with more knowledge and experience, I can enhance my designs with more autonomous features.”\nLater this year, Mr Swee\nwill embark on a career with multinational information technology company NCS\nas a software engineer.\nHe adds: “With my skill\nsets, I hope to be able\nto contribute to the community and help to lighten people’s loads.” gave him the confidence to apply for a scholarship at his university of choice, Singapore Institute of Technology (SIT), in 2018.\nToday, Mr Swee, an SIT Scholar,\nis graduating with a Bachelor of Engineering in Systems Engineering (ElectroMechanical Systems). This four-year direct honours programme has since been renamed Bachelor of Engineering in Mechatronics Systems.\n“I decided to apply for the scholar- How he’s making a mark\non his own terms\nSIT scholar Francis Swee proves that perserverance and a growth\nmindset make it possible to overcome initial setbacks\nTEXT BY EMMY ABDUL ALIM\nIf I had given up then\nand believed that university\nwasn’t meant for me, I\nwouldn’t have put in the\neffort to press on. It was\nthrough hard work and\nperseverance that I managed\nto achieve results.MR FRANCIS\nSWEE\nrecipient of\nthe SIT\nScholarship\nScholars’ Choice 2022: Part 4\nPublication:The Straits Times\nDate: 23 Jul 2022\nHeadline: How he's making a mark on his own\nterms\nSource: The Straits Times © SPH Media Limited. Reproduced with permission."
}