{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2025-03/20240228%20Applied%20Computing%20CSM%20InfoKit.pdf",
  "type": "pdf",
  "content": "Last updated: 28 Feb 2024\nPage 1 of 5\nSIT Restricted  SIT Restricted\nBachelor of Science (Honours) in Applied Computing\n(via the Competency -based Stackable Micro -credential Pathway)\nRegistration Information Kit\nDear Applicant ,\n1. The Bachelor of Science (Honours) in Applied Computing [via the Competency -based Stackable\nMicro -credential (CSM) Pathway] is a three -year direct honours programme  (the “Programme”)  offered\nby S ingapore Institute of Technology (S IT). This Programme is desi gned to provide an upgrading\npathway for in -employment individuals.  You may wish to access th e SIT webpage  for more details of\nthe Programme.\n2. We thank you for your interest in the Programme. Please read through th is Information Kit  and the\nSIT Applicant Guide carefully prior to accessing the SIT Application Portal  for registration.  For\navoidance of doubt, the URL for the SIT Application Portal  is: https://learner.singaporetech.edu.sg/\n3. This Information Kit  comprises two sections:\na) Annex A – Key Conditions of the Programme\nb) Annex B – Further supplementary FAQs  on account creation, Application ID, submission of\nsupporting documentations, etc  to the SIT Applicant Guide .\n4. Do note the following:\na) Please ensure that payment  for the registration fee is made as part of the  application\nprocess .  You may refer to the following e-payment link  to make payment.  The payment link is\nalso found in the SIT Application Portal .\nb) The registration fee for Year 2024 will be $16.35 (inclusive of GST).\nc) Please  make a screen shot of your payment outcome  to be included in the application as\none of the  supporting document s. There may be delays in application processing or release of\noutcome if you fail to pay the registration fee.\nd) If you encountered any payment issues (e.g. , double payment), please email\nAdm@SingaporeTech.edu.sg  citing your full name  as in your application  and the Application ID .\nAttach any supporting screenshots that may help us in our review.\n5. Please e nsure you have all the following supporting document s, as indicated in Table 1 , ready\nin softcopy  before registering for the Programme . It is advisable that\na) You properly label your supporting documents.   If any documents in your application require further\naction, you will be notified via the email provided in your application  submission . Please check your\nemail regularly.\nb) Scanned soft copies should  be of  at least  300 dpi resolution .\nLast updated: 28 Feb 2024\nPage 2 of 5\nSIT Restricted  SIT Restricted\nTable 1. Supporting documentation  Acceptable File\nFormat\n(i) Personal statement – in within  300 words, please share with us “ Why do you\nwant to take up this CSM pathway programme? ”  This is an expression of\nyour motivation to apply to SIT and should be taken seriously.  DOC X, PDF\n(ii) Resume/CV (if applicable)\n(iii) Scanned copy of NRIC / FIN / Passport / LTVP+ card (if applicable)\n(both sides front and back for NRIC / FIN) .\nJPEG, JPG, PNG,\nPDF, OA*\n*Academic\ntranscripts can also\nbe submitted using\nOPENCERT  “.oa”\nformat if possible.  (iv) Scanned copy of Academic Transcripts and Certificates (Polytechnic Diploma,\nSingapore -Cambridge GCE A levels, Singapore -Cambridge GCE O levels,\nInternational Baccalaureate (IB) Diploma, other local Diplomas)  as applicable.\n(v) [For self-sponsored Applicants only] Employment Verification Letter from your\nemployer indicating your employment status.\n(vi) Any other relevant supplementary documents (e.g. , other international or local\nqualifications including university degree or advanced di ploma , or letters of\nrecommendation or testimonials (include up to three ) that you wish to include\nin your application.\n(vii) Registration fee payment screenshot .\n6. Applicants are advised to print in pdf format and keep a copy of your application summary\nbefore submitting your  application . You will not be able to view your application details upon\nsubmission of application.\n7. Your application , together  with all the relevant supporting documents , will be reviewed upon\nsuccessful submission of your application.\n8. During the processing phase, we may invite you to attend an in -person interview and/or Academic\nAptitude Assessment , via the email provided in your application  submission .\n9. Only accepted Learner s will receive a Letter of Offer  from SIT  via the email  provided in your\napplication submission .\n<No signature is required>\nSingapore Institute of Technology\nLast updated: 28 Feb 2024\nPage 3 of 5\nSIT Restricted  SIT Restricted\nAnnex A\nKey Conditions of the Programme\n1. To gain final acceptance into the Bachelor of Science (Honours) in Applied Computing (via the CSM\nPathway ) and remain in the Programme as a n adult  learner  (“Learner ”) under SIT , the person must:\na) Accept the Letter of Offer from SIT, and\nb) Be in employment (see para 3 of Annex A) .\n2. All accepted Learner s will subsequently  be required to sign a Letter of Undertaking from SIT to agree to\nabide to all of SIT Policies and Procedures.\n3. The Learner  will n eed to be employed throughout his/her candidature. The Learner will need to inform SIT\nif there is a change of employer or he/she is not in -employment at any time regardless of any underlying\nreason(s). SIT shall reserve the final right to terminate the Le arner’s enrollment in the Programme.\n4. Should the Learner  withdraw from the Programme regardless of any underlying reasons , the Learner  could\nopt to take the micro -credential pathway as stackable or standalone course.\n***\nLast updated: 28 Feb 2024\nPage 4 of 5\nSIT Restricted  SIT Restricted\nAnnex B\nFurther FAQs  to the SIT Applicant Guide\nQuestion  Answer\nHow do I create an\naccount?   To start your application with SIT, navigate to the SIT Application Portal\nand select the ‘ Not a Member? ’ option.\nProceed to create an account by providing your preferred email and a\npassword. This will serve as your login Application ID .\nFor guidance on resetting your ID or password, pleas e refer to the FAQ titled\n“I forgot my ID / Password. How do I reset?”\nPlease ensure that the email address you have used to create an\naccount will be the same email address that should receive email\nnotifications from SIT on your application progress.\nHow do I access the\nAuthenticator to\naccess my\napplication?  For security purposes, please download either Salesforce Authenticator or\nMicrosoft Authenticator from the Apple App Store or Google Play Store.\nThis app will be used to generate an authentication code required for\naccessing your application. This is a s ecurity requirement.\nYou can refer to the SIT Application Guide  for comprehensive instructions\non downloading and utili sing the Authenticator.\nI forgot my ID /\nPassword. How do I\nreset?   To reset your password, visit the  SIT Application Portal  and click the\n‘Forgot Your Password’ button. A new password will be sent to your\nregistered email.\nThe Application ID corresponds to the email you provided during\naccount registration for application submission.\nIn case you forget your Application ID, kindly contact\nAdm@SingaporeTech.edu.sg , and the Admissions team will assist you in\nretrieving it.\nCan I save my\napplication and\ncomplete it later?  To save your application draft, click the ‘Save for later’ button located at the\nbottom of the application form.\nAfterwards, you  will receive an email notification containing a link to your\nsaved draft. You can access and complete it at your convenience.\nAre all my required\ndocuments\nsuccessfully\nuploaded?  Before submitting your application, please review the ‘Upload Document’ tab\non the application page to ensure that all necessary documents have been\nincluded.\nLast updated: 28 Feb 2024\nPage 5 of 5\nSIT Restricted  SIT Restricted\nQuestion  Answer\nHow do I submit a\nnew version of a\nrejected document?  During your application, you can submit relevant documents within the\n‘Document Upload’ tab on the application page.\nIf the Admissions team requests that you resubmit specific documents after\napplying, please follow these steps:\n1. Access the link provided in the email sent to you.\n2. Navigate to the 'Rejected Document' tab.\n3. Click on the relevant item.\n4. Upload the new document.\n5. Click the ‘Submit’ button to complete the process.\nHas my application\nbeen received?  Upon successful submission of your application, you will receive an email\nnotification via the preferred email address you have indicated in your\nApplication Form.\nIf you did not receive the notification, please check your spam/junk folder.\nIf you still  have not received the notification, please email\nAdm@SingaporeTech.edu.sg  with the following details:\n• Your full name\n• Registered Email Address\n• Your application number\nWe will check your application and notify you accordingly.\nWhat is the status of\nmy application?   To check the status of your application, simply log in to the SIT Application\nPortal  using the email address you used to register your account. Once\nlogged in, you should be able to check the status of your application.\nHow do I submit\nadditional\ndocuments for my\napplication, after\nsubmission?   If you need to submit additional documents after finalizing your application,\nplease email Adm@SingaporeTech.edu.sg  with the following details:\n• Your full name\n• Registered Email Address\n• Your application number\nWe will inform you of any further steps that may be necessary.\nI have issues\naccessing the SIT\nApplication Portal,\nwhom should I\ncontact for\nassistance?  For any issues encountered with accessing the SIT Application Portal ,\nplease email Adm@SingaporeTech.edu.sg  and provide the following details:\n• Your full name\n• Registered Email Address\n• Your application number\nWe will assess the issue and notify you accordingly.\n***"
}