{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-11/PBDisbursement.pdf",
  "type": "pdf",
  "content": "Why is the award\nquantum disbursed on\ntrimester basis?\nCan I claim full award\nquantum in lump sum?\nCan it be disbursed\nto me in cash?if I graduate in\ntrimester 2, do i\nstill get the full\namount?\nwhat if i have no modules in\nTrimester 3 but i am graduating with\nthe rest of cohort, do i still\nconsider as an active student?\nWhat does active student\nstatus mean? If I am on IWSP,\nwill i still receive the award\namount?\nPublic Bursary\nAWARD AND DISBURSEMENT\nTo illustrate...\nMelissa is a Year 3 student (Final year student, graduating in Trimester 3) and had\napplied for financial aid for the current academic year. She was awarded the\nHigher Education Community Bursary (Tier 1) based on her PCI of <$750. The\naward quantum is $6,300.\nMelissa received her invoice and the amount offset from the Public Bursary was\nnot the full amount. She only received $2,100.\nWHY?  From AY2024, award quantum will be disbursed on trimester basis and\ntherefore, Melissa receives $2,100 for her first trimester and subsequently receive\nthe remaining in the next 2 trimesters.\nOr...\nNicholas is a Year 3 student (Final year student, graduating in Trimester 2) and had\napplied for financial aid for the current academic year. He was awarded the Higher\nEducation Bursary (Tier 2) based on his PCI of >$1,876 to <$2,500. The award\nquantum is $1,350.\nNicholas received his invoice and the amount offset from the Public Bursary was only\n$450.\nWHY?  From AY2024, award quantum will be disbursed on trimester basis and\ntherefore, Nicholas receives $450 for his first trimester and subsequently receive\nanother $450 in his second trimester but will not be receiving the remaining $450 as\nhe will be graduating in Trimester 2 and will not have an active student status. Hence,\nthe amount received is prorated for the Academic Year.\nOr...\nAtiqah is a Year 2 student and had applied for financial aid for the current academic\nyear. She was awarded the Higher Education Community Bursary (Tier 2) based on her\nPCI of >$751 to <$1,100. The award quantum is $5,100.\nAtiqah received her invoice and the amount offset from the Public Bursary was only\n$1,700. She would like to request for lump sum payment like previous year, instead of\npayment per trimester.\nWHY?  Similarly, Atiqah will be receiving $1,700 in each trimester for the academic\nyear. With effect from AY2024, the award will be disbursed on a trimester basis instead\nof a lump sum payment. This change is to adhere to the latest guidelines and aims to\nensure that bursary funds are distributed more effectively throughout the academic\nyear.\nActive Student status\nLeave of Absence (LOA)\nStudents who are on LOA or have deferred studies will receive a\nprorated bursary amount based on the no. of trimesters that they are\nactively studying within the Academic Year.\nGraduationThings to take note...\nThe bursary award will only be disbursed to students with an active\nstudent status during the trimester.\nStudents who graduate early will receive a prorated bursary amount\nwithin their academic year of graduation. For example, if students are\ngraduating by end of Trimester 2 in Academic Year 2024/25, they will\nreceive two-thirds of the bursary for Trimester 1 and Trimester 2 of\nAcademic Year 2024/25.\nDisbursement\n*The bursary will be used to offset any outstanding fees (where\napplicable) at the point of disbursement. Any balance will be credited\nto your bank account."
}