{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2022-09/SIT_Cluster_ENGG.pdf",
  "type": "pdf",
  "content": "2022\nENGINEERING\nSIT AT\nA GLANCE\n95%\n$3,6755 6\n6 38\n>135\n>200\n^Source: 2020 Graduate Employment Survey of Students Secured a\nJob Within Six Months of Completing Their Final Exam\n^\nAverage Starting Salaries of Our Graduates\n^Programme ClustersCampuses\nOverseas University Partners Undergraduate Degree Options\nStudent Clubs, Committees, and Chapters\nStudent Events and Activities\n01\nEngineeringSITizen-DNA\nThinking Tinkerers\n• Fundamentally Sound\n• Practice-oriented\nAble to Learn,\nUnlearn and Relearn\n•Embracing Change\n• Learning Beyond University\nCatalysts for Transformation\n•Improving Efficiency\n• Creating Value Through Innovation\n•\nChallenging Status Quo\nGrounded in  the Community\n• Serving the Community Through\nKnowledge and Skills\n02\nSingapore Institute of TechnologyAPPLIED\nLEARNING PEDAGOGY\nApplied learning requires active learning.\nYou will be exposed to a range of learning techniques such as experiential learning, ﬂipped classrooms, problem-based learning with real-industry context, gamiﬁcations, and sharing sessions by experienced industry players. With the technical skills and knowledge attained, you can apply what you have learnt to actual work situations in the Integrated Work Study Programme (IWSP).WHY PURSUE\nSPECIALIST AND\nTRANSFERABLE SKILLS\nWhile training to become a specialist in your\nrespective engineering discipline, you will also acquire skill sets, such as critical thinking, problem-solving, decision-making, project management, and communication skills, which will enable you to stay agile and navigate across industries in the ever-evolving future.Engineering?\n03\nEngineeringCAREER PROGRESSION\nOPPORTUNITIES\nA specialised and industry-focused\nengineering education at SIT will enhance\nyour adaptability and employability, as you contribute to the growth of Singapore’s future economy\n1.\n1 Source: Engineering Matters for Singapore’s Future, Says PM Lee Hsien Loong. The Straits Times . (2 Jul 2016). Available from:\nhttps://www.straitstimes.com/politics/engineering-key-to-singapores-future-as-smart-nation-pmSYMBIOTIC RELATIONSHIP\nWITH INDUSTRY\nOur engineering programmes at SIT\nhave been developed through extensive consultation with industry, thus creating a curriculum that supports the industry’s needs in manpower development and innovation.\n04\nSingapore Institute of TechnologyApplied Research\nOur students have the opportunity to embark on cross disciplinary applied research projects\nwith our faculty and industry partners in areas such as healthcare, urban farming, sustainable infrastructure, arti\nﬁ\ncial intelligence (AI), and many others. Our cutting-edge projects, linked to\nlocal and overseas companies, attract significant government funding.\nInnovative Ankle Brace Project\nOne of our Mechanical Design and Manufacturing Engineering students was given the opportunity to work in a multidisciplinary team to fabricate an innovative ankle brace prototype that will help those with foot and ankle injuries recover better. The team comprises SIT students and professors, as well as clinicians from SingHealth and Duke NUS.\n05\nEngineeringAn App Way to Reduce Waste\nTo reduce food wastage, our very own Mechanical Engineering\nstudent and his teammate developed a prototype app that enables users to keep tabs on their food expiration dates, and help them plan their meals better. Their app, Freshify, has clinched the team a spot in the Top 15\nﬁ\nnalists of the IKEA\nSoutheast Asia’s Young Designer Award!\n06\nSingapore Institute of TechnologyMachine Learning Enhances Network\nReliability at Substations\nElectricity powers nearly every aspect of our lives. You can\nimagine the inconvenience a blackout can cause to your daily life. SIT researchers have collaborated with SP Group to develop a machine learning platform that detects insulation failures to ensure a more reliable electricity distribution grid for Singapore. The machine learning platform developed by SIT increases ef\nﬁ\nciency by ten-fold, which allows SP engineers to focus on\nother pressing operational matters.\n07\nEngineering\nBoosting Innovation in the Construction Industry\nSIT launched the Construction Technology Innovation Laboratory (CTIL)\nin collaboration with construction and civil engineering company Woh Hup (Private) Limited to boost applied research efforts and develop innovative construction technologies for building structures and sub-structures. Our Civil Engineering students will gain practical hands-on experience in industrial environments and be exposed to applied research and innovation projects.\nTinkering with Disruptive Technologies\nBoston Dynamics, a US-based robotics company best known\nfor its ‘Spot’ robot, will partner SIT and local startup dConstruct Technologies on learning and applied research of robotics systems as they set up their base at the upcoming Punggol Digital District. Our students will be able to use the Spot robot and dConstruct’s software programming tool to develop robotics solutions for the Punggol Digital District.\nSaving Water and Energy Through Innovation\nThawing frozen food under running water is wasteful and expensive. In an innovation project, students are trained to examine human behaviours and motivations of this practice and provide a solution to the problem. For this project, students came up with innovative ideas working alongside industry partners such as The Regent Singapore, paving the way for more ef\nﬁ\ncient water and energy saving practices.\n08\nSingapore Institute of Technology\n09\nEngineering\nVictor Lee Guo Wei\nGraduate (2020)Sustainable Infrastructure\nEngineering (Land)\nExecutive Engineer\nLand Transport AuthorityOne fictional character I wish to be\nCaptain America! I admire his strong values and leadership skills.\nMy job\nI am an engineer with Land Transport Authority (LTA). At LTA, we review and\nassess trains and depot equipment specifications. My team also looks into various innovative engineering technology\nto enhance our train systems.\nMy IWSP experience\nMy IWSP experience was at LT\nA’s Rail Asset\nOperation Maintenance (RAOM). I had the opportunity to better understand the current technical systems in the Railway Transit System.MEET VICTOR\nMemorable campus moment Organising the student orientation camp. We planned the logistics for all the activities and ensured that there were food choices. We looked out for everyone who participated!\nProudest moment/achievement in SIT\nRepresenting SIT at Singapore International Energy Week, where we showcased our project on a smart lighting system in the park.\nClick here to watch my video.\nThroughout their internship, the\nstudents have shown that they take initiative and are good team players and have what it takes to make a project successful.\nMS IRENE YONG\nDirector (Building Services)\nBeca Carter Hollings &\nFerner (SEA) Pte Ltd\nWe are excited to embark on this programme with SIT and look forward to welcoming future IWSP participants for a mutually rewarding experience.\nMR YONG DERONG\nExecutive Director\nWoh Hup (Private) Limited\n10\nSingapore Institute of TechnologyThrough regular engagements with industry partners, SIT has successfully created the IWSP . We are con\nﬁ\ndent that\nthis will be a fruitful platform for the industry to gain bright talents from the university. This programme is also SIT students are dedicated,\nindustrious, and highly responsible. The IWSP allows the students to fully immerse themselves in the company culture, while providing them with the opportunity to experience the working life of an engineer.\nhighly beneficial for the students,\nwho will have a clear perspective\nprior to entering the industry. Built Environment\n11\nEngineeringCivil Engineering\nCampus Location\nSIT@Dover\nCareer Opportunities\nYou can look forward to careers in these areas: •\nBuilding and Construct\nion\n•Engineering Design Consultancy Firms\n•Facility Operator\n•Government Agencies\n•Property Developer\nWit\nh a strong industry-focused curriculum, the\nSIT and University of Glasgow joint degree\nwith honours in Civil Engineering will equip you with practical knowledge and skills to plan, design, construct, maintain, and operate infrastructures, including roads, rails, bridges, buildings, canals, ports, and underground structures. You will also acquire deeper skill sets by specialising in structural engineering and geotechnical engineering at the graduate level.\nUpon successful completion of the BEng Civil\nEngineering programme, you may continue with the MSc Civil Engineering, which will qualify you to sit for the professional registration examinations, conducted by the Professional Engineers Board Singapore.\nThe MSc Civil Engineering with BEng Civil\nEngineering has been granted Provisional Accreditation by the Engineering Accreditation Board. Strong emphasis is placed on the industrial relevance in the curriculum development of the Civil Engineering programmes, which are developed in consultation with government agencies and companies from the construction sector.Curriculum Highlights\n•\nStructural and Geotechnical Design\n•Construction T\nechnology\n•Building Informat\nion Modelling (BIM) for\nCivil Engineers\n•Hydraulics and Hydr\nology\n•Capstone Project\n•Eight-month Integrated W\nork Study\nProgramme (IWSP)\n•Overseas Immersion Programme (OIP)\nClick here\nto find out\nmore.\n12\nSingapore Institute of TechnologySustainable Infrastructure\nEngineering (Building Services)\nCampus Locations\n•SIT@Dover\n•SIT@SP Building\nC\nareer Opportunities\n•Design Engineer (with focus on HV\nAC\nand other relevant building mechanical\nengineering areas)\n•BIM Manager\n•Facility Manager (Mechanical)\n•Sustainable Building Consul\ntant\nThe Sustainable Infrastructure Engineering (SIE) (Building Services) programme is developed in consultation with the Building and Construction Authority (BCA), Singapore. The direct honours degree programme provides mechanical engineering training with specialisation in sustainable buildings to prepare you to become a building mechanical engineer.\nYou will also develop lifelong skills to ensure\nyou stay relevant in the building services engineering industry in Singapore and beyond. You will go through rigorous academic training, conducted by highly quali\nﬁed pr\nofessors and\nprofessional of ﬁcers, as wel\nl as an eight-month\nIntegrated Work Study Programme in the industry. As a trained SIE (Building Services) student, you will be eligible for the Professional Engineering (Mechanical) quali\nﬁcat\nion.\nIf you perform well in the programme, you may pursue the MEngTech Sustainable Infrastructure Engineering (Building Services). You may also obtain professional certi\nﬁcat\nions in Fire\nServices Safety Management and Workplace Safety and Health. You can independently pursue certi\nﬁcat\nion in Green Mark with the\nknowledge gained from the programme.Curriculum Highlights\n•Building Informat\nion Modelling (BIM)\n•Sustainable Building Engineering\n•Heating, V\nentilation and\nAir-Conditioning (HVAC)\n•Fire Engineering and Management\n•Building Ener\ngy Simulation\n•Eight-month Integrated W\nork Study\nProgramme (IWSP)Click here\nto find out\nmore.\nThese competencies are immediately\nrelevant to the semiconductor industry in Singapore and worldwide. Equipped with the fundamentals, up-to-date applied knowledge, specialised skill sets, and more importantly, connections with the host company through the eight-month IWSP , graduates will be clearly well-positioned on a launch-pad ahead of their peers in the industry.\nMR LEE TACHYANG\nSenior Director\nTechnology Development & Introduction\nSTMicroelectronics Pte LtdThe programme reinforces the\nfundamentals of engineering and instils\nstrong power engineering knowledge\nand skill sets among its students.The Electrical Power Engineering programme offered by SIT is practical and relevant to the demands in the industry.\nThe four-year joint degree programme in Electronics and Data Engineering offered by SIT and Technical University of Munich is exciting and well-balanced.\nIt encompasses a good spectrum from\ncircuit design to robotics and automation\nto data analytics to smart manufacturing. It also offers students with excellent IWSP opportunities with leading players in the industry. More importantly, students are able to select industry electives from relevant specialisation tracks based on their interests.\nMR SIAH KENG BOON\nHead\nAdvanced Engineering & Technology\nSembcorp Industries LtdElectrical and\nElectronic Engineering\n13\nEngineering\n14\nSingapore Institute of Technology\nElectrical Power\nEngineering\nCampus Location\nSIT@NYP Building\nCareer Opportunities\nYou can look forward to careers in these areas: •\nPower Generation and Ut\nilities\n•Energy Market Management\n•Transportat\nion and Mobility\n•Marine and Aerospace\n•Sustainable and Renewable Energy\n•Electronic Systems Design\n•Electrical Services and Consultancy\n•Research and Development\nAs t\nhe ﬁrst ded\nicated Electrical Power\nEngineering programme with honours in\nSingapore, this joint degree offered by SIT and Newcastle University aims to produce a special breed of engineers who will be able to provide a substantial and lasting contribution to their profession.\nThe curriculum is customised to meet\nlocal industry demand that is aligned with Singapore’s Smart Nation initiative. This degree will equip you with the necessary technical competence, tools, and personal skills, as well as develop your understanding, expertise, and professionalism as you progress through your career.\nGraduates of this programme who have\ngood academic results and relevant working experience may also pursue the MSc Electrical and Electronic Engineering, with Electrical Power Engineering specialisation. This provides further learning needed for Chartered Engineers or Professional Engineers registration.\nCurriculum Highlights\n•\nIndividual Industry or Resear\nch\nCapstone Project\n•Critical Thinking and Innovat\nive Design\n•Digital Transformat\nion Skills\n•Power & Energy Special\nisation Track\n•Transportat\nion Electri ﬁcat\nion\nSpecialisation Track\n•Social and Community Ground\ning Modules\n•Eight-month Integrated W\nork Study\nProgramme (IWSP)\n•Overseas Immersion Programme (OIP)\nClick here\nto find out\nmore.\n15\nEngineering\nElectronics and\nData Engineering\nCampus Locations\n•SIT@Dover\n•SIT@SP Building\nC\nareer Opportunities\n•Electrical and Electronics Engineer\n•Applicat\nion Engineer\n•Data Engineer\n•Data Analyst\n•Process Engineer\n•Product\nion and Test Engineer\nThe Electronics and Data Engineering\nprogramme is a four-year honours degree programme, jointly offered by SIT and Technical University of Munich. Combining electronics and data engineering, this unique programme will equip you with the necessary skills and competencies for the emerging digital workforce.\nThis programme encompasses a broad-\nbased curriculum, which focuses on essential knowledge in semiconductor technology, sensors, and related electronics, as well as practical applications of data science, including aspects of data collection and analytics. You will learn the fundamentals necessary for the electronics industry, as well as the foundations of data engineering – both built over a structured and rigorous curriculum that includes mathematics, physics, electronics, circuits, programming, databases and algorithms, internet of things (IoT), automation and control, machine learning, data mining, and more.Curriculum Highlights\n•\nBioelectronics\n•Industrial Electronics\n•Semiconductor Fabrication\n•Internet of Things\n•Data Analytics\n•Machine Learning\n•Automation and Robot\nics\n•Eight-month Integrated W\nork\nStudy Programme (IWSP)\n•Overseas Immersion Programme (OIP)\nClick here\nto find out\nmore.\n16\nSingapore Institute of Technology\nSIT students have gained good exposure,The IWSP is a very good programme\nthat gives students an early\nexposure to the marine industry,\nDedicated to a job well done, the students have proven\nthemselves to be industrious, with the right focus on their jobs. With an exuberant outlook, they have integrated well into our organisation and contributed in ways, big and small.\nMS JOYCELIN ANG\nHR Manager\nEastern Hemisphere\nAmerican Bureau of Shipping (ABS) Their learning ability to excel at the workplace is evident in their\ndiverse skills and we are proud to have them on our team!Maritime\nworking with different nationalities at the shipyard, interacting with\nco-workers, supervisors, and even clients in t\nhe different projects they\nare participating in.\nMR TEO SOON HENG\nProject Manager\nKeppel Offshore & Marineenabling them to anchor themselves in various specialties on real projects. This is desirable for the company and helpful for the students’ learning. They have been able to apply what they have learnt from the classroom directly to the industry.\nMS AUDREY KOH\nZone HR Business Partner\n(Marine & Offshore, South Asia Zone)\nBureau Veritas Marine (Singapore) Pte Ltd\n17\nEngineering\nNaval Architecture and\nMarine Engineering\nCampus Locations\n•SIT@Dover\n•SIT@NP Building\n•SIT@SP Building\nC\nareer Opportunities\nYou can look forward to careers in:•\nShipbuilding and Rigbuild\ning Yards\n•Classi ﬁcat\nion Societies\n•Republic of Singapor\ne Navy\n•Oil and Gas Companies\n•Maritime Port Aut\nhority\n•Shipping and Ship Management Companies\nEngineers and naval architects in t\nhe\nmarine and offshore industry need the right\nset of skills to perform effectively in a\nfast-changing environment. The abil\nity to\naddress development proactively and utilise a comprehensive knowledge of the industry is needed to retain a competitive edge.\nThe joint degree programme with honours in\nNaval Architecture and Marine Engineering, offered by SIT and Newcastle University, will equip you with the expertise and skills necessary for the highly competitive global maritime industry.Curriculum Highlights\n•\nNaval Architectur\ne\n•Marine Engineering\n•Marine Structures\n•Ship Resistance and Propulsion\n•Marine Transport Business\n•Advanced Ship and Offshor\ne\nHydrodynamics\n•Offshor\ne Renewables\n•Internal Combustion Engines\n•Capstone Project\n•Eight-month Integrated W\nork\nStudy Programme (IWSP)\n•Overseas Immersion Programme (OIP)Click here\nto find out\nmore.\n18\nSingapore Institute of Technology\nSesto Robotics have found\nstudents from SIT to have a sound understanding of engineering fundamentals. They have been able to quickly apply themselves to tasks and have a methodical approach to problem-solving. They were able to quickly assemble proof of concepts to determine the feasibility of ideas and understand the variables involved in the system.\nStudents were also exposed to a variety\nof interdisciplinary skills and knowledge during their course, which proved useful for their IWSP projects.\nMR MAZHER NAJEEB ANWAR\nChief Technical Officer\nSesto RoboticsParticipants from the IWSP readily absorbed\nnew ideas and methods introduced to\nthem and adapted to best practices.\nThis programme will help learners acquire the necessary skill sets across multiple facets of a largely new medium – Immersive Media. The programme positioning provides a holistic curriculum, allowing students to gain a competitive edge from its alignment with skill competencies in demand and nurturing a capable, future-ready workforce. I strongly believe that the university is taking the right step forward to play hosts in our VUCA world. This course will be especially effective in the grooming of much-needed talent.\nMR KEE CHENG HENG\nManaging Director\nHelloHolo Pte LtdI am very pleased to see how SIT’s\nMechanical Engineering programme\nis continually forward-thinking in its\ncurriculum development. Mechanical\n19\nEngineering\nMechanical Design and\nManufacturing Engineering\nCampus Location\nSIT@NYP Building\nCareer Opportunities\n•Engineer in a diverse range of industries\n•Consultant in commer\ncial and public sectors\n•Project manager in engineering ﬁelds\nThe SIT and Newcast\nle University joint\ndegree with honours in Mechanical Design\nand Manufacturing Engineering (MDME) will provide you with a multidisciplinary mix of core and specialised engineering skills sought after by the industry.\nThe curriculum covers the foundational\ndiscipline of mechanical engineering that is enriched with the integration of innovative design, mechatronics, digitalisation, robotics, and automation technologies for smart manufacturing.\nAt the end of the programme, you will be\nwell-equipped to perform in-depth analysis and solve engineering problems, as well as to develop practical solutions for the manufacturing economy.\nCurriculum Highlights\n•\nMaterials and Manufacturing\n•Lean Manufacturing and Six Sigma\n•Robotics and Industrial Automat\nion\n•Design of Mechanical Systems\n•Applicat\nions of Thermo ﬂuids\n•Eight-month Integrated W\nork\nStudy Programme (IWSP)\n•Overseas Immersion Programme (OIP)Click here\nto find out\nmore.\n20\nSingapore Institute of Technology\nMechanical Engineering\nCampus Location\nSIT@NP Building\nCareer Opportunities\n•R&D Engineer\n•Development Engineer\n•Automation Engineer (CAD/Automat\nion/AI)\n•Project Engineer\n•Software Engineer\n•Mechatronics Engineer\n•Mechanical Design Engineer\nThe SIT and University of Glasgow joint degree\nin Mechanical Engineering is a t\nhree-year\nhonours degree programme that provides a solid foundation in mechanical engineering and digital skill sets. You will have a choice of specialisation in either Design or Mechatronics.\nWith the need to keep up with the industrial\nchallenges of today, you will be equipped with the knowledge, understanding, and skills for mechanical engineering. You will acquire advanced knowledge in Industrial Internet of Things (IIoT), data analytics, and digital designs through project-based multidisciplinary learning and direct industrial immersion.\nThe degree aims to train graduates to meet\nthe growing manpower demands in key industry sectors in Singapore, including healthcare engineering, automation/robotics, smart designs using 3D printing, and digital design tools for manufacturing and maritime.Curriculum Highlights\n•\nSmart Designs\n•Industrial Internet of Things (IIoT)\n•Healt\nhcare Systems Engineering\n•Automation and Robot\nics\n•Co-bot Design and Build\n•Data Analytics\n•Eight-month Integrated W\nork\nStudy Programme (IWSP)\n•Overseas Immersion Programme (OIP)Click here\nto find out\nmore.\nAs a member of the programme’s Industry\nAdvisory Committee, I am heartened and privileged to witness the transformational journey of our graduates from students to working adults.\nMR SIMON KUIK SOW HONG\nVice President & Head\nResearch & Development\nSembcorp Marine Ltd\nWe have received students from SIT since 2019 who have worked with our IT team on several projects while providing essential daily support to other business functions. The students possessed strong abilities, demonstrating initiative and drive during their internship. We are pleased with their contributions and will certainly welcome suitable candidates to return for permanent employment at Go-Ahead Singapore.\nMR ANDREW THOMPSON\nManaging Director\nGo-Ahead Singapore\n21\nEngineeringThese future-ready young talents will continue to embark on\nnew challenges, boosting Singapore’s digitalisation culture.In recognising the role that technology, robotics and automation play in delivering the demand for more ef\nﬁcient and ef\nfective logistics, SIT has proven to showcase\ntheir students with ready knowledge and in-demand skill sets into the industry.\nYCH is glad and will continue to provide SIT students with opportunities to gain\nrelevant experiences in the work environment.\nMS ANNIE LAM\nHead\nGroup Human Resources\nYCH GroupThe IWSP provides an authentic\nexperience and timely exposure for\nstudents to prepare them for the\ndemands of today’s workforce.The Mechatronics Systems programme integrates theory and practice, equipping students with knowledge and skills of digitally connected physical systems. Undertaking a rigorous curriculum that encompasses model-based systems engineering approach, SIT students are trained to think of products and processes as inter-related systems and apply their expertise in complex scenarios.\nGraduates will be equipped with the\nthe Industry 4.0 world and contribute to\ndeveloping their respective domains.necessary know-how and soft skills to thrive inMultidisciplinary\n22\nSingapore Institute of Technology\nComputer Engineering\nCampus Location\nSIT@Dover\nCareer Opportunities\n•Engineer (Design/Applicat\nion/Network/\nTelematics/Technology Integration)\n•Software Engineer\n•Engineer (Intell\nigent Transportation\nSystems)\n•Project Manager/Of ﬁcer/Engineer\n•Technology Consul\ntant\nA ﬁrst-of-its-kind d\nirect honours degree offered\nin Singapore, the Computer Engineering\nprogramme was developed in partnership with various organisations in the land transport industry, including LTA, Singapore Technologies, National Computer Systems, and other companies in the automotive industry, such as Continental Automotive Singapore Pte Ltd.\nYou will be equipped with electrical\nengineering and computer science core skills, as well as intelligent transportation systems (ITS) knowledge, through rigorous academic training by highly quali\nﬁed pr\nofessors, while\nhaving work-study stints with established organisations. In line with Singapore’s efforts to become a Smart Nation, you will train to become deep specialists in the relevant areas that are much needed in the industry to support this vision.\nCurriculum Highlights\n•\nSensors and Control\n•Embedded System Design\n•Wireless Communicat\nion\n•Transport Management\n•Design Project\n•Eight-month Integrated W\nork Study\nProgramme (IWSP)Click here\nto find out\nmore.\n23\nEngineering\nDigital Supply Chain\nCampus Location\nSIT@NYP Building\nCareer Opportunities\nYou can look forward to careers in these areas: •\nSupply Chain Solutions Engineer\n•Supply Chain Analyst\n•Data Scientist\n•Software Engineer\n•Business Process Analyst\nThe Digital Supply Chain (DSC) is a t\nhree-\nyear direct honours, interdisciplinary supply\nchain degree programme that cuts across the domains of ICT, Engineering, and Supply Chain Management. Digital transformation, driven by Industry 4.0 and national digitalisation initiatives, has given rise to demand for DSC graduates. E-commerce and COVID-19 have disrupted traditional supply chains, accentuating the need for digital transformation.\nSupply chain and logistics companies are\nincreasingly adopting new technologies and developing new capabilities in arti\nﬁcial\nintel\nligence (AI), internet of things (IoT), and\nrobotics as part of the transformation efforts. You will possess a competitive advantage given that supply chain and logistics business models and operations are fast evolving with emerging digital technologies\n1. You will\nacquire interdisciplinary knowledge in three focus areas:\n•\nSupply Chain Management wil\nl equip you\nwith knowledge and skill sets in designing\ndigital supply chain solutions.•ICT forms t\nhe bedrock of foundational\ncomputer science and software engineeringis essential for mastery of digital skills.\n•\nSystem and Engineering wil\nl equip\nyou with knowledge and skill sets inconducting systems modelling, simulation,and managing the digital supply chainintegration projects.\nUpon graduation, you could take on technical roles in digital transformation, Industry 4.0, systems and solutions development, and systems and project management in the public or private sectors, or embark on further postgraduate study and join research institutions or academia.\nCurriculum Highlights\n•\nSupply Chain 4.0\n•Supply Chain Solutions Design\n•E-commerce Logist\nics\n•Cyber-physical Digital T\nwins in Supply Chain\n•Industrial Internet of Things and Data Analytics\n•Introduct\nion to Software Engineering\n•Machine Learning\n•Capstone Project\n•Eight-month Integrated W\nork Study\nProgramme (IWSP)\n1Source: Singapore Logistics Association.Click here\nto find out\nmore.\n24\nSingapore Institute of Technology\nMechatronics Systems\nCampus Locations\n•SIT@Dover\n•SIT@SP Building\nC\nareer Opportunities\n•Embedded Systems Engineer\n•Systems Engineer\n•Project Engineer\n•Mechatronics Engineer\n•Software Engineer\nThe Mechatr\nonics Systems programme\nwith honours, jointly offered by SIT and\nDigiPen Institute of Technology Singapore, encompasses two complementary\nﬁelds\nof study\n, i.e. Mechatronics and Systems\nEngineering. Mechatronics is a multidisciplinary branch of engineering that focuses on mechanical engineering, electronics, control and automation, and software technology, in order to design, develop, put into operation, and optimise systems.\nSystems engineering is an interdisciplinary\nﬁeld\nof engineering and engineering management\nt\nhat focuses on how to design, integrate, and\nmanage complex systems over their life cycles. You will acquire multidisciplinary engineering knowledge while grounded with systems-level engineering management know-how, giving you a competitive advantage and the\nﬂexibil\nity\nto move across industries upon graduation.Curriculum Highlights\n•Foundation Stud\nies in Physics, Mathematics,\nand Computer Science Skills\n•Mechatronics and Softwar\ne Engineering\n•Systems Engineering and Project Management\n•Exposure to Real-world Engineering Scenarios\n•Hands-on Projects\n•12-month Integrated W\nork Study\nProgramme (IWSP)\n•Overseas Immersion Programme (OIP)\nClick here\nto find out\nmore.\n25\nEngineering\nRobotics Systems\nCampus Location\nSIT@Dover\nCareer Opportunities\n•Robotics Engineer\n•Systems Engineer\n•Software Engineer\n•AI Engineer\n•Mechatronics Engineer\n•System Integrator\nRobotics Systems is a special\nised engineering\nprogramme that focuses on the design and\ndevelopment of service or ﬁeld r\nobotic\nsystems as well as the enterprise where these systems operate. The direct honours degree programme aims to ful\nﬁl t\nhe demand for\nrobotics engineers, as automation moves out from the factory shop\nﬂoor to service\nt\nheir human counterparts in various ﬁeld\nappl\nications.\nThe integration of multiple engineering disciplines, via systems engineering through its project-based pedagogy, is a unique feature of the programme. Software and arti\nﬁcial\nintel\nligence (AI) are used as integrative\nelements that connect multiple mechatronics elements together to form a complete system.\nA signi\nﬁcant amount of pr\noject-based learning\nthat connects academic knowledge and\nskills with real-world applications has been incorporated into the programme. These projects will allow you to simultaneously experience systems and software engineering, project management, as well as systemic integration of knowledge from multiple disciplines. The 12-month Integrated Work Study Programme and the capstone project will serve as the culmination and integrative experience of the programme.Curriculum Highlights\n•\nRobotics Development\n•Systems Engineering\n•Software Engineering\n•AI Robotics\n•Artiﬁcial Intel\nligence and Machine Learning\n•Project Management\n•Mechatronics\n•12-month Integrated W\nork Study\nProgramme (IWSP)Click here\nto find out\nmore.\n26\nSingapore Institute of Technology\nThe IWSP provides an opportunity\nfor students to be exposed to a real industrial project with\nﬁeld act\nivities\nand not just administrative tasks.\nMR JULIEN JOUVE\nProject Commissioning Manager\nAlstom Transport (S) Pte LtdThey are enthusiastic in understanding\nthe nuts and bolts of these systems\nand their inner workings.SIT students show a keen interest in understanding how the various aircraft systems operate.\nI feel these are traits necessary to build\na strong foundation and will put them in good stead for their future careers as Licensed Aircraft Engineers.\nMR TEO TAIYONG\nMaintenance Training Instructor\nSIA Engineering CompanyStudents can learn to integrate theory\ninto practice, which makes them real\nassets to the project team.\nThe IWSP provides a suitable platform for students to directly apply the attained academic knowledge into the industry.\nThis experiential exposure drives interaction, initiative, and\ninnovation in the students, and these attributes will serve\nthem well in their preparation to enter the workforce.\nMR ALVIN ZHANG ZHICONG\nAssistant Vice President\nPermanent Way & Civil Structure\nSBS Transit Limited, SingaporeTransportation\n27\nEngineering\nAerospace Engineering\nCampus Location\nSIT@NP Building\nCareer Opportunities\nYou can look forward to careers in these areas: •\nUnmanned Aerial Systems and Robotics\n•Aircraft Engine Design and Servicing\n•Production, Pr\nocess and Test Engineer\n•Engineering Design\n(Aerodynamic and Structural)\n•Airworthiness and Quality Assurance\n•Air Traf ﬁc Control\nThe Aer\nospace Engineering programme\nis jointly offered by SIT and University of Glasgow. This unique three-year direct honours degree will help you build a sound foundation in aerospace engineering through a curriculum that merges fundamental engineering knowledge with specialised topics in unmanned aerial systems (UAS).\nThrough this programme, you will be able to\nstudy and understand the behaviour of aerial vehicles, predict their performance, be familiar with their on-board avionics systems, and perform structural and aerodynamic analyses. Practical project work in the area of UAS will allow the application of the learnt material in the context of real engineering problems.\nThe programme has a strong industry focus,\nnot only limited to UAS application, but also covers a wide range of other aerospace applications. You will develop relevant industry skills and experience during an eight-month Integrated Work Study Programme with our industry partners in the broad aerospace engineering sector.\nThe degree provides further opportunities\nfor you to experience the aerospace sector in the UK during the three-week Overseas Immersion Programme. With valuable industrial experience, technical expertise and transferable skills – such as oral and written communication, teamwork, analytical abilities, and time management – you will have a sound background for employment in the industry.\nCurriculum Highlights\n•\nAircraft Performance and Propulsion\n•Aerodynamics and Computational Fluid\nDynamics (CFD)\n•Aircraft Structures and Composite Materials\n•UAS Design and Build Projects\n•Flight Systems and Avionics\n•Eight-month Integrated WorkStudy Pr\nogramme (IWSP)\n•Overseas Immersion Programme (OIP)\nClick here\nto find out\nmore.\n28\nSingapore Institute of Technology\nAircraft Systems\nEngineering\nCampus Location\nSIT@Dover\nCareer Opportunities\n•Licensed Aircraft Engineer\n•Process, Qual\nity, and Product Engineer\n•Maintenance Planner\n•Fleet Manager\n•Technical or Cabin Service Engineer\n•Repair Development Engineer\nThe Aircraft Systems Engineering pr\nogramme\nwith honours is developed in collaboration\nwith SIA Engineering Company (SIAEC), which provides extensive Maintenance, Repair, and Overhaul (MRO) services to more than 80 international airlines worldwide.\nBuilt on an interdisciplinary curriculum with a\npractical hands-on approach that cuts across engineering and science, you will be trained to be theoretically-grounded and practice-oriented for the Aerospace and MRO industries. The curriculum incorporates an intensive eight-month Integrated Work Study Programme training at SIAEC’s workshops and hangars.\nIn addition to a degree awarded by SIT, you\nare able to obtain a Certi\nﬁcate of Recognit\nion\n(CoR) by SIAEC upon meeting their requirements.This CoR is recognised by the Civil Aviation Authority of Singapore (CAAS), and certi\nﬁes t\nhat the holder has completed a\nSAR-147 Approved Basic Course.\nShould you decide to embark on a career as a\nLicensed Aircraft Engineer (LAE) with an MRO organisation in Singapore, you will acquire your Aircraft Maintenance License (AML) in a shorter time, as compared to your peers. If you perform well in your second year, you may be awarded the SIAEC Trainee Aircraft Engineer (TAE) Scholarship, which includes a 28-month training programme (TAE Programme) upon graduation, to qualify as an LAE. TAE scholars will be required to serve a bond with the SIAEC Group.\nCurriculum Highlights\n•\nAircraft Materials and Fl\night Mechanics\n•Human Factors and Aviat\nion Legislation\n•Fixed Wing Systems\n•Aircraft Electrical and Cabin Systems\n•Capstone Project\n•Eight-month Integrated W\nork Study\nProgramme (IWSP) at SIAEC\nClick here\nto find out\nmore.\n29\nEngineering\nSustainable Infrastructure\nEngineering (Land)\nCampus Locations\n•SIT@Dover\n•SIT@SP Building\nC\nareer Opportunities\nYou can look forward to careers in various land\ntransport organisations, such as:\n•LTA\n•SMRT\n•SBS Transit\n•Railway Original Equipment Manufacturers\n(OEMs) and Suppliers\n•Singapore T\nechnologies\nThe Sustainable Infrastructure Engineering (SIE) (Land) programme is multidisciplinary, comprising various fundamental engineering disciplines, such as railway, mechanical, electrical, and electronic engineering. This direct honours degree programme will enable participants to achieve excellence in the ever-changing world of the land transport industry.\nYou will undergo rigorous academic training\nprovided by highly quali\nﬁed pr\nofessors, while\nimmersing yourself in the land transport industry through work-study stints with established organisations, such as LTA, SMRT, SBS Transit, Singapore Technologies, Railway OEMs, and suppliers, etc.\nIf you perform well in the programme, you\nmay pursue the MEngTech Sustainable Infrastructure Engineering (Land). With the MEngTech quali\nﬁcat\nion, you will be eligible for\nfuture registration as a Professional Engineer (PE) (Singapore) or Chartered Engineer (UK and Commonwealth countries). This unique curriculum design also allows you to attain the professional NDT Level II or NDT Level III (Partial) certi\nﬁcat\nion.\nCurriculum Highlights\n•Railway Signall\ning and Communications\n•Roll\ning Stock and Permanent Way Systems\n•Total Pr\neventive Maintenance\n•Non-Destructive T\nesting (NDT)\n•Lean Management in Engineering\n•Capstone Project\n•Eight-month Integrated W\nork\nStudy Programme (IWSP)\nClick here\nto find out\nmore.\n30\nSingapore Institute of Technology\nNg Jean Yin\nGraduate (2021)Mechanical Design and\nManufacturing EngineeringOne fictional character I wish to be Olaf from “Frozen”. He is very supportive and guides his friends through different challenges. It’s a good trait everyone should learn from!\nPursuing Mechanical Design and\nManufacturing EngineeringI enjoy doing component designs, and I am excited to be part of a sector that is evolving into a smart industry.\nMy IWSP experience\nMy IWSP was with SBS Transit Ltd. It was an insightful experience in maintenance workflow.\nOne myth about Mechanical Design and\nManufacturing Engineering Most people may assume that the course is mostly about robotics and mechanical components. But it covers so much more including building real-time systems using cloud computing and machine learning, etc.MEET JEAN\nGo-to beverage Teh O Peng, the best!\nMemorable moment\nBeing the class representative for my cohort. It is rewarding when I get to be part of giving students a better learning experience.\nClick here to watch my video.\nWe adopt an aptitude-based approach in assessing applicants\nfor admission. This means we look beyond your grades and\nsee you as an individual with diverse qualities, talents, and life experiences. We are interested in who you are, and how you can contribute to the community and industry.\n31\nEngineering\nWe look out for…\nAcademic Proficiency and Prior Learning\nRelevant Work Experience\nRelated Exposure and Achievements\nPassion and Aptitude\nPerformance During Interviews START YOUR\nNEXT STEP HERE\nSubmit and check your application status via Admission.SingaporeTech.edu.sg.\nFor application dates and deadlines, visit SingaporeTech.edu.sg.\nAppl ication Opens\nSIT Scholarship Appl ication OpensMID-JAN – MID-MAR\nShort listed applicants will be assessed\nfor Admissions and a Scholarship\nconcurrently. For speci\nﬁ\nc degree\nprogrammes, you may have to submit portfolios or essays, and/or be assessed through written or technical tests.FEB – MAY\nCheck your Admissions Appl ication Outcome.\nStudents awarded Scholarships will receive their offers concurrently.APR – MAY\nIf you ar e successful, accept our offer!BY JOINT ACCEPTANCE\nDEADLINE\nFINANCIAL ASSISTANCE\nAPPLICATION OPENS\nWhen you have accepted our of fer, you\nwill receive a pre-matriculation package.\nJUNE\n32\nSingapore Institute of Technology\nADMISSIONS\nTIMELINE\nAdmissions\nSIT Scholarship\n33\nEngineeringGCE ‘A’ Level/IB Diploma/NUS High School DiplomaAdmission Requirements\n•GCE ‘A’ Level appl icants should have obtained passes in at least two H2 Level subjects and offered General\nPaper (GP) or Knowledge & Inquiry (KI) in the same sitting.\n•International Baccalaur\neate (IB) applicants should have obtained a minimum grade ﬁve for at least two HL\nand one SL subjects, and the IB Diploma.\n•NUS High applicants should have obtained t\nhe NUS High School Diploma.\nApplicants with the above quali ﬁcat\nions are also required to ful ﬁl t\nhe Mother Tongue Language (MTL)\nrequirements stipulated by the Ministry of Education.\nNote:\n# GCE ‘A’ Level/IB applicants are required to ful ﬁl additional requirements as stipulated by the German Higher Education System.\nRefer to details on the website. For furt\nher enquiries, please contact TUM Asia Admissions Of ﬁce at admission@tum-asia.edu.sg.\nFor up-to-date information, please refer to SingaporeTech.edu.sg.DEGREE PROGRAMME GCE ‘A’ LEVEL IB DIPLOMA\nAerospace Engineering\nA pass in H1/H2 Mathematics\nA pass in H1/H2 PhysicsA pass in SL/HL MathematicsA pass in SL/HL PhysicsMechanical Design and\nManufacturing Engineering\nMechanical Engineering\nDigital Supply ChainA pass in two of the following\nH1/H2 subjects (Mathematics, Physics, Chemistry, or Computing)A pass in two of the following SL/HL subjects (Mathematics, Physics, Chemistry, or Computer Science)\nElectronics and Data Engineering\n#A pass in H2 Mathematics\nA pass in one H2 Science\nsubject (Biology, Chemistry, or Physics)A pass in HL Mathematics\nA pass in one HL Science\nsubject (Biology, Chemistry, or Physics)\nMechatronics SystemsA pass in one of the following H2 subjects (Mathematics, Physics, or Computing); or a pass in H1 MathematicsA pass in one of the following HL subjects (Mathematics, Physics, or Computing); or a pass in SL Mathematics\nRobotics SystemsA pass in two of the following H1/H2 subjects (Mathematics, Physics, Chemistry, or Computing)A pass in two of the following SL/HL subjects (Mathematics, Physics, Chemistry, or Computer Science)\n34\nSingapore Institute of TechnologyGCE ‘A’ Level/IB Diploma/NUS High School DiplomaAdmission Requirements\nNote:\n1 Graduates of the BEng Civil Engineering may choose to continue taking the MSc Civil Engineering.\n2 Graduates of the BEng Electrical Power Engineering may choose to continue taking the MSc Electrical and Electronic Engineering.\n3 Graduates of the BEng Sustainable Infrastructure Engineering (Building Services) may choose to continue taking the\nMEngTech Sustainable Infrastructure Engineering (Building Services).\n4 Graduates of the BEng Sustainable Infrastructure Engineering (Land) may choose to continue taking the MEngTech Sustainable Infrastructure Engineering (Land).\nFor up-to-date information, please refer to SingaporeTech.edu.sg.•GCE ‘A’ Level applicants should have obtained passes in at least two H2 Level subjects and offered General\nPaper (GP) or Knowledge & Inquiry (KI) in t\nhe same sitting.\n•International Baccalaur\neate (IB) applicants should have obtained a minimum grade ﬁve for at least two HL\nand one SL subjects, and the IB Diploma.\n•NUS High applicants should have obtained t\nhe NUS High School Diploma.\nApplicants with the above quali ﬁcat\nions are also required to ful ﬁl t\nhe Mother Tongue Language (MTL)\nrequirements stipulated by the Ministry of Education.DEGREE PROGRAMME GCE ‘A’ LEVEL IB DIPLOMA\nAircraft Systems Engineering\nMeet minimum admission requirements as stated below.Civil Engineering1\nComputer Engineering\nElectrical Power Engineering2\nNaval Architecture and Marine\nEngineering\nSustainable\nInfrastructure Engineering\n(Building Services)3\nSustainable Infrastructure Engineering (Land)\n4\n35\nEngineeringDiploma from any local PolytechnicAdmission Requirements\nNote:\n^Please refer to SingaporeTech.edu.sg for the detailed list of relevant diplomas.\n1 Graduates of the BEng Sustainable Infrastructure Engineering (Building Services) may choose to continue taking the\nMEngTech Sustainable Infrastructure Engineering (Building Services).\n2 Graduates of the BEng Sustainable Infrastructure Engineering (Land) may choose to continue taking the MEngTech Sustainable Infrastructure Engineering (Land).\nFor up-to-date information, please refer to SingaporeTech.edu.sg.DEGREE PROGRAMME DIPLOMA FROM ANY LOCAL POLYTECHNIC\nAircraft Systems Engineering Completed a relevant^ local polytechnic diploma.\nComputer Engineering Open to all polytechnic diploma holders. Applicants with a\nrelevant engineering background (i.e. Diploma in Electrical and Electronics Engineering, Computer Engineering and Information Technology), may apply for exemption from modules of up to a maximum of two trimesters.\nFor applicants with non-relevant diplomas, exemption from\nmodules will be considered on a case-by-case basis.\nDigital Supply ChainOpen to all polytechnic diploma holders. Applicants with a strong pro\nﬁciency and inter\nest in Computing, Supply Chain, and\nLogistics are encouraged to apply. Subject to approval, diploma applicants may be granted module exemptions, based on the modules taken during their diploma.\nElectronics and Data EngineeringOpen to all polytechnic diploma holders. Applicants with a strong interest and pro\nﬁciency in Mat\nhematics and Physics are\nencouraged to apply.\nSustainable\nInfrastructure Engineering (Building Services)\n1Open to all polytechnic diploma holders. Applicants with a relevant engineering background (i.e. Diploma in Aerospace, Mechanical, Mechatronics, Civil, Environmental and Electrical Engineering), may apply for exemption from modules of up to a maximum of two trimesters.\nFor applicants with a non-relevant engineering background (i.e.\nDiploma from other engineering disciplines), exemption from modules will be considered on a case-by-case basis.\nSustainable Infrastructure Engineering (Land)\n2Open to all polytechnic diploma holders. Applicants with a relevant engineering background (i.e. Diploma in Aerospace, Mechanical, Mechatronics or Electrical Engineering), may apply for exemption from modules of up to a maximum of two trimesters.\nFor applicants with a non-relevant engineering background (i.e.\nDiploma from other engineering disciplines), exemption from modules will be considered on a case-by-case basis.\n36\nSingapore Institute of TechnologyDiploma from any local PolytechnicAdmission Requirements\nNote:\n1Graduates of the BEng Civil Engineering may choose to continue taking the MSc Civil Engineering.\n2 Graduates of the BEng Electrical Power Engineering may choose to continue taking the MSc Electrical and Electronic Engineering.\nFor up-to-date information, please refer to SingaporeTech.edu.sg.DEGREE PROGRAMME DIPLOMA FROM ANY LOCAL POLYTECHNIC\nAerospace Engineering\nOpen to all polytechnic diploma holders. Subject to approval,\ndiploma applicants may be granted module exemptions, based on the modules taken during their diploma.Civil Engineering\n1\nElectrical Power Engineering2\nMechanical Design and Manufacturing Engineering\nMechanical Engineering Mechatronics Systems Naval Architecture and\nMarine Engineering\nRobotics Systems\n37\nEngineeringAdmission Requirements\nNote:\n1Graduates of the BEng Civil Engineering may choose to continue taking the MSc Civil Engineering.\n2 This diploma will not be accepted as a relevant diploma for the Computer Engineering programme with effect from AY2023\nadmissions.\n3 Graduates of the BEng Sustainable Infrastructure Engineering (Building Services) may choose to continue taking the MEngTech Sustainable Infrastructure Engineering (Building Services).\n4 Graduates of the BEng Sustainable Infrastructure Engineering (Land) may choose to continue taking the MEngTech Sustainable Infrastructure Engineering (Land).\nApplicants with other quali ﬁcations should complete at least 12 years of formal education deemed as\nacceptable, equivalent quali ﬁcat\nions to be considered for admission.\nFor up-to-date information, please refer to SingaporeTech.edu.sg.Diploma from other institutions\nDEGREE PROGRAMME DIPLOMA FROM OTHER INSTITUTIONS\nCivil Engineering1BCA diploma holders in Construction Engineering may apply.\nComputer Engineering BCA diploma holders in the following ﬁelds of study may apply:\n•Construction Engineering2\n•Construction Informat ion Technology\n•Electrical Engineering and Clean Energy\n•Mechanical Engineering (Green Build\ning Technology)2\nSustainable\nInfrastructure Engineering\n(Building Services)3BCA diploma holders in the following ﬁelds of study may apply:\n•Architectur\ne (Technology)\n•Construction Engineering\n•Construction Informat\nion Technology\n•Electrical Engineering and Clean Energy\n•Facilit\nies Management\n•Mechanical Engineering (Green Build\ning Technology)\nSustainable Infrastructure Engineering (Land)\n4BCA diploma holders in the following ﬁelds of study may apply:\n•Electrical Engineering and Clean Energy\n•Mechanical Engineering (Green Build\ning Technology)\n38\nSingapore Institute of TechnologyAdmission Requirements\nNote:\n1 Graduates of the BEng Electrical Power Engineering may choose to continue taking the MSc Electrical and Electronic Engineering.\nApplicants with other quali ﬁcations should complete at least 12 years of formal education deemed as\nacceptable, equivalent quali ﬁcat\nions to be considered for admission.\nFor up-to-date information, please refer to SingaporeTech.edu.sg.Diploma from other institutions\nDEGREE PROGRAMME DIPLOMA FROM OTHER INSTITUTIONS\nAircraft Systems Engineering\nEach application will be considered on a case-by-case basis.Aerospace Engineering\nDigital Supply ChainElectrical Power Engineering\n1\nElectronics and Data\nEngineering\nMechanical Design and\nManufacturing Engineering\nMechanical EngineeringMechatronics SystemsNaval Architecture and\nMarine Engineering\nRobotics Systems\n39 EngineeringGet a chance to study at SIT’s\nnew campus situated in the\nheart of Punggol Digital District.\nYOU CAN SEE\nYOUR FUTURE\nFROM HERE\nClick here to find out more.•Campus-in-a-Park\n• Smart and Sustainable University\n• Companies can tap SIT’s appl\nied\nlearning and research capabilities\n• Closer Industry Partnership with\nCollaborat\nion Loop linking SIT and\nJTC buildings\n• Opportunities to work on r\neal-world\nbusiness problems\nWhen you become a SITizen, you join a\ngrowing pool of successful alumni.\nIf you are ready to begin the application\nprocess and want to learn more, visit SingaporeTech.edu.sg/Admissions .\n40\nSingapore Institute of Technology\nTAKE YOUR\nNEXT STEP HERE\nSO, WHO’S READY\nFOR AN ADVENTURE?\nCONTACT US\n© December 2021.\nAll information is accurate at time of print.SIT reserves the right to amend the information without prior notice. For the most up-to-date information, please visit SingaporeTech.edu.sg.SIT@DOVER\n10 Dover Drive, Singapore 138683\nSIT@NP BUILDING\nNgee Ann Polytechnic\n537 Clementi Road, Singapore 599493\nSIT@NYP BUILDING\nNanyang Polytechnic172A Ang Mo Kio Avenue 8, Singapore 567739 (beside Blk Q of NYP campus)\nSIT@RP BUILDING\nRepublic Polytechnic43 Woodlands Avenue 9, Singapore 737729\nSIT@SP BUILDING\nSingapore Polytechnic510 Dover Road, Singapore 139660\nSIT@TP BUILDING\nTemasek PolytechnicBlk 29B Tampines Avenue 1, Singapore 528694LOCATE US SINGAPORE INSTITUTE  OF TECHNOLOGY\nSIT@Dover, 10 Dover Drive,\nSingapore 138683\n+65 6592 1189 (Main Line)\nSTUDENT ADMISSIONS\n+65 6592 1136\nAdm@SingaporeTech.edu.sg\n(Under\ngraduate Programmes)\nAdm.Postgrad@SingaporeTech.edu.sg\n(Postgraduate Pr\nogrammes)\nFINANCIAL ASSISTANCE\nAND SCHOLARSHIP MATTERS\n+65 6592 1136\nFAS@SingaporeTech.edu.sg\nCENTRE FOR CAREER READINESS\n+65 6592 8150\nCareerReadiness@SingaporeTech.edu.sg\nDEGREE PROGRAMMES\n+65 6592 2021\nAcdPrg@SingaporeTech.edu.sg\nFINANCE, BILLINGS, AND GIRO\n+65 6592 8149\nStudentFinance@SingaporeTech.edu.sg\nREGISTRAR’S OFFICE\n+65 6592 2091\nRegistrar@SingaporeTech.edu.sg\nSTUDENT EVENTS, ACTIVITIES, AND CLUBS\n+65 6592 1191\nSLD@SingaporeTech.edu.sg\nAPPLIED RESEARCH,  INNOVATION & ENTERPRISE\n+65 6592 2723\nInnovate@SingaporeTech.edu.sg\nGIVING TO SIT\n+65 6592 1138\n+65 6592 1094\nAdvancement@SingaporeTech.edu.sg\nSINGAPORETECH.EDU.SGSingapore Institute of Technology\nSIT@Dover, 10 Dover Drive,\nSingapore 138683SingaporeTech\n@SingaporeTech@SingaporeTech"
}