{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/84%20Seeds%20for%20Change.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  09/12\nThe KKH Scholarship and Wilmar Scholarship, two of the\nearliest non-bonded scholarships to be made available at\nSIT, have positively impacted a long line of SIT students\nfrom as far back as 2011.\nIn appreciation of the many doors the scholarships\nhave opened for 84 scholarship recipients, SIT held an\nappreciation tea for the donors, Wilmar International and\nMr Kuok Khoon Hong, on 8 August 2018 at the SIT@Dover\nCampus. The tea was hosted by Prof Tan Thiam Soon,\nPresident, SIT, and the afternoon’s programme included\na tour of the campus for the guests. Also present were\n21 of the 84 KKH and Wilmar Scholars who received the\nscholarships from 2011 to 2017.\nDuring the session, recipients met Mr Kuok, who is\nChairman and CEO of Wilmar International, and thanked\nhim for the support that had enabled them to pursue their\naspirations. Several of the recipients are now working in\noccupations ranging from mechanical engineering and\nrobotics to research in fields such as artificial intelligence,\nhealth sciences and food technology.KKH and Wilmar scholars welcoming Mr Kuok Khoon Hong.From left: Mr Tay Thiam Peng, Head, Special Projects, Wilmar International; Prof\nTan Thiam Soon, President, SIT and Mr Kuok enjoying a lively chat together with the\nscholarship recipients.\n84 Seeds for Change\n21 of SIT’s 84 Wilmar and KKH Scholars get to meet the donor who made possible the\nscholarships that have changed their lives\nKKH Scholarship and Wilmar Scholarship recipients, together with Prof Tan, Mr Kuok, Mr\nTay, and SIT faculty and staff.\nMr Kuok in turn shared with them a wealth\nof insights gleaned from his years as an\nagribusiness leader. Chiefly, he advised them\nto use their free time in their youth to study\ntopics in depth, as they would not have such\nample time as they grew older. Using his in-\ndepth understanding of grains, soybeans, and\nagriculture as illustrations, Mr Kuok explained\nhow gaining deep knowledge and knowing\nrealities of work done in factories and fields\nwould give a person the “five per cent higher\nlevel of quality” that would give them an edge\nover competitors. He also encouraged the\nrecipients to think about how their products or\nservices could provide the widest commercial\nvalue to consumers.Among the scholars at the appreciation was Class of 2017\nalumnus, Mr Chew Kia Yong (Food & Human Nutrition\nprogramme, Newcastle University). A recipient of the KKH\nScholarship, he went on to join Wilmar International as a\nTechnical Service Executive after graduation. He said, “Mr\nKuok conveyed to us the importance of seizing the right\nopportunity when we are presented with it. He recounted\nhow, during a time when he was heavily involved in the\nwheat trade, he took the opportunity to do extensive\nhands-on work and grasp the industry know-how he\npossesses today.”\nMs Michelle Tan, a Wilmar Scholar who is also from\nthe Class of 2017, is now a Programme Coordinator at\nSingapore General Hospital who works on a research\nprogramme involving pre-diabetes patients. She said\nwhat stuck with her most was Mr Kuok’s lifelong journey\nof continual innovation and of constantly finding ways\nto meet the needs of his consumers. “I felt privileged\nand honoured to be at the session and to hear him tell\nhis story,” she added."
}