{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Doing%20More%20Together.pdf",
  "type": "pdf",
  "content": "Besides teaching and serving, many SIT faculty and staff\ngive generously to lend a helping hand to their students\nthrough the Faculty & Staff Giving (FSG) initiative. Through\nthis, they not only offer financial aid, but also let students\nknow that they will be there to support their growth in more\nways than one. Last year, faculty and staff raised more than\n$82,000 in support of the SIT Bursary, making possible 27\nBursaries for financially disadvantaged students at SIT.\nIn appreciation for their support, the fifth Faculty & Staff\nGiving Roadshow was organised on 25 April 2018 at SIT@\nDover campus. Participants were treated to doughnuts,\ncoffee and freshly fried vadai with green chillies. Doing More, Together\nSIT employees give students their heartfelt\nsupport at the fifth Faculty & Staff Giving\nRoadshow\nAt this year’s Faculty & Staff Giving Roadshow, donors received a small token for\ntheir big-hearted support of SIT students: a tiny pouch shaped like a mini-backpack.\nSIT faculty and staff came down to University Tower to show their support and enjoy a quick tea break before\nheading back to work.\nSITizens giving back – SIT Bursary recipients had the chance to thank Prof Tan Thiam Soon, President, SIT (second\nphoto, left) and other SIT faculty and staff members for their support.\nAttendees happily queuing up for their snacks and coffee. Snacks for tea time: freshly cooked vadai served\nwith green chillies, as well as doughnuts and coffee. SiTIZEN  |  06/12\nPast recipients of the SIT Bursary\nwere present as well, serving\nsnacks to faculty and staff and\nchatting with them to share how\nthe Bursary had helped them\nin their studies. Said Bursary\nrecipient and final-year student Mr\nHarikrishnan Panayamthatta from\nthe Bachelor of Engineering with\nMechatronics degree programme,\n“I would like to thank all the\ndonors and SIT lecturers and staff\nwho made a difference in students’\nlives, including mine. These acts of\ngenerosity inspired me to help others and give back to the\ncommunity, and the bursary also helped fund my school\nfees which was essential for me to complete my studies.\nThank you again for your generosity and support.”\nSenior Librarian Ms Joan Wee, one of the donors to\nthe SIT Bursary, believes that though a single person’s\ncontribution may not be enough to help everyone, the\ncollective efforts of many can positively impact students’\nlives. She said, “I live by the ‘starfish’ motto. My donation\nmight only make a 10 per cent difference to a student’s\nlife but at least I know I’ve done something instead of\nnot doing anything. With another nine SIT staff or faculty\njoining together, we can make up a 100 per cent difference\nto that student’s life.”"
}