{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2020-10/Annual_Report_2018.pdf",
  "type": "pdf",
  "content": "Singapore Institute of Technology - Annual Report 2018\nBumper\nL:28.9cm\nSingapore Institute of Technology - Annual Report 2018Singapore Institute of Technology - Annual Report 2018/04/ President’s Message/03/ Chairman’s Message/02/ SIT at a Glance/01/ About SIT\n/07/ Board of Trustees\n/10/ Highlights of Key Events\n/20/ Academic Year in Review\n/34/ Community/30/ Industry/23/ Applied Learning\n/40/ Donor Acknowledgement/38/ Support for Students\n/42/ Corporate Governance\nRobotics in Mechatronics deals with the application of\nmodern robotic systems and control methods for complex\nsituations found in many industries.\nAs part of a final year module, students from the\nMechatronics programme construct robots that showcase\nthe confluence of electrical, electronic, mechanical and\nsoftware systems. Using the concept of robotic wars,\nwith emphasis on various sensor & actuator technology,\nload inertia theory and spatial movement control,\nstudents gain critical hands-on experience on how the\nhybrid approach can impact the cutting-edge, high-tech\nindustrial systems in the manufacturing, shipping and\naerospace sectors.Robot Defenders\n/06/ Senior Management\n/44/ Board Committees & Internal Audit\n/45/ Financial Statements\nSingapore Institute of Technology - Annual Report 2018Singapore Institute of Technology - Annual Report 2018ABOUT SIT\nSingapore Institute of Technology (SIT) is Singapore’s\nuniversity of applied learning. SIT’s vision is to be a leader\nin innovative learning by integrating learning, industry\nand community. Its mission is to nurture and develop\nindividuals who build on their interests and talents to\nimpact society in meaningful ways.\nSIT offers applied degree programmes targeted at growth\nsectors of the economy with a unique pedagogy that\nintegrates work and study. SIT’s degree programmes feature\nan 8 to 12-month Integrated Work Study Programme\n(IWSP) which exemplifies the best of university-industry\ncollaboration.\nSince its establishment in 2009, SIT has grown from its\ninaugural batch of 500 students in 10 degree programmes\nto over 6,000 students in 43 degree programmes from\nacross SIT and nine overseas university partners. These\ndegree programmes are grouped into five clusters –\nEngineering (ENG), Chemical Engineering and Food\nTechnology (CEFT), Infocomm Technology (ICT), Health and\nSocial Sciences (HSS), as well as Design and Specialised\nBusinesses (DSB).\nSIT also aims to cultivate in its students four distinctive\ntraits, or the SIT-DNA, which will prepare them to be\n‘thinking tinkerers’, who are ‘able to learn, unlearn and\nrelearn’, be ‘catalysts for transformation’ and finally,\nbecome ‘grounded in the community’.We Are SIT\nSIT-DNA\nCATALYSTS FOR\nTRANSFORMATIONTHINKING\nTINKERERSABLE TO LEARN,\nUNLEARN & RELEARNGROUNDED IN\nTHE COMMUNITYOur aim is to produce work-ready graduates armed with more than just paper qualifications, but with skills that can\nstrengthen and energise industry and the wider community.\nThe SIT-DNA serves as necessary guiding principles that steer our curriculum design, pedagogical approach, student\ninteraction and SIT culture. These, in turn, nurture students to embody the SIT-DNA.\n001 002 003 004\n//\nSingapore Institute of Technology - Annual Report 2018SIT AT A\nGLANCE\n6 Campuses\nSIT@Dover\nSIT@NP Building\nSIT@NYP BuildingSIT@RP Building\nSIT@SP Building\nSIT@TP Building\n43 Degree Programmes\n12 SIT Programmes\n12 SIT-OU Joint Degree Programmes\n19 Overseas University ProgrammesOverall Employment82.9%\nFull-Time Permanent\nEmploymentGraduate Employment\nSurvey 2017\n92.3%5 Programme Clusters\nDesign and\nSpecialised\nBusinessesHealth and\nSocial\nSciencesChemical\nEngineering\nand Food\nTechnologyInfocomm\nTechnologyEngineering\n9 Overseas University Partners\nDigiPen\nInstitute of\nTechnology\nTechnical University\nof Munich\nNewcastle\nUniversity\nTrinity College\nDublin\nUniversity of\nGlasgow\nThe Culinary\nInstitute of\nAmerica\nThe Glasgow\nSchool of Art\nUniversity of\nLiverpool  Massey\nUniversity\n//\nSingapore Institute of Technology - Annual Report 2018\nLooking ahead, I am\nconfident that as\nmore and more of our\ngraduates begin to\nmake their mark in the\nworkplace, SIT’s applied\nlearning pedagogy\nwill not only continue\nto enrich Singapore’s\neducational landscape,\nbut shape a new\nworkforce that is well-\nequipped to take on the\nchallenges of a volatile,\nuncertain, complex and\nambiguous future.“Mr Ng Yat Chung\nCHAIRMAN’S\nMESSAGE\nIn another significant year for SIT, FY2017 proved to be\nchallenging yet rewarding on various fronts.\nOur applied degree offerings continued to attract high\napplication numbers, in spite of the shrinking cohort size of\npolytechnic graduates. An oversubscription rate of nearly\n5 times points to the growing popularity of our applied\ndegree programmes. This bodes well for the future as\nwe continue to produce industry-relevant graduates who\nare sought after by industry. We believe that by imbuing\nour students with the SIT-DNA, employers will be able to\ndifferentiate our graduates and empower them to take on\nsignificant roles within their organisations.\nWith increasing enrolment, student development is\nbecoming more significant. To that end, the revamp of our\nIT systems was completed, enabling seamless integration\nand an improved user experience for students and staff.\nFurthermore, we looked beyond our shores to enhance\nour Integrated Work Study Programme (IWSP), an integral\npart of our joint and SIT-conferred degree programmes.\nIn doing so, not only have we begun to deepen existing\nrelationships with industry partners, we continue to open\ndoors in special areas such as food technology, allied health\nand infocomm technology.\nWe continue to make headway in industry with more agreements\nbeing inked with various government agencies, MNCs, SMEs\nand trade associations, adding depth and breadth to our\napplied learning ecosystem. On the SkillsFuture front, we\nhave launched a few more customised programmes in tandem\nwith the needs of our various partners. As technological\ninnovations such as robotics and AI continue to transform\nour lives and the economic landscape, SIT must keep pace\nwith the rapid changes. Only then will we be able to attract\nlike-minded talents in terms of faculty and professional officers\nto make SIT an innovative, enterprising people organisation.\nOn the infrastructure front, our plans for the Punggol campus\nto be an innovative, stimulating learning environment are\ntaking shape. It is heartening to note that the Punggol\ncommunity has begun to embrace our students and faculty\nthrough the many community initiatives that have been\nundertaken involving residents in Pasir Ris-Punggol GRC.\nMoving forward, we will continue to deepen our engagements\nwith the community, together with the other government\nagencies involved in the Punggol Digital District (PDD).\nWe look forward to making our presence felt in the years\nahead as we firm up the detailed plans for our future home.\nThe progress of SIT over the past year augurs well for the\nfuture. Looking ahead, I am confident that as more and more\nof our graduates begin to make their mark in the workplace,\nSIT’s applied learning pedagogy will not only continue to\nenrich Singapore’s educational landscape, but shape a new\nworkforce that is well-equipped to take on the challenges\nof a volatile, uncertain, complex and ambiguous future.\n//\nSingapore Institute of Technology - Annual Report 2018I am heartened that\nover the years, we\nhave made great\nstrides in positioning\nourselves as an\ninstitution that\nenables our SITizens\nto be able to learn,\nunlearn and relearn. “Professor Tan Thiam SoonPRESIDENT’S\nMESSAGE\nIn mid-2017, the Future Economy Council (FEC) set\nout three key areas of focus to support the growth\nand transformation of Singapore’s economy and for\nSingaporeans to stay ahead in an increasingly challenging\nglobal environment.\nOne is to grow an economy that is vibrant, open and\nconnected to the world. The second, to strengthen local\nenterprises through industry-specific transformations to\nhelp them scale up. The third strategy involves enabling\nSingaporeans to acquire and utilise deep skills so as to\nseize opportunities, stay relevant and thrive in the future\neconomy. Against this backdrop, and as Singapore’s\nuniversity of applied learning, SIT is strategically positioned\nas a key enabler to drive a culture of lifelong learning\namongst Singaporeans.\nI am heartened that over the years, we have made great\nstrides in positioning ourselves as an institution that\nenables our SITizens to be able to learn, unlearn and\nrelearn. This is very much in line with the FEC’s strategic\nfocus and is symbiotic with our education system that\nis progressively shifting from a teaching-focused model\nto one that is skills driven.\nAY2017 was a significant year for SIT. In October last\nyear, SIT’s first validation under the Ministry of Education\n(MOE)’s Quality Assurance Framework for Universities\n(QAFU) was conducted. In their report to the Ministry,\nQAFU’s External Review Panel (ERP) categorically affirmed\nthat SIT is on the right trajectory.\nThe Panel commended us for implementing several key\ninitiatives that differentiates us as a university of applied\nlearning with deep links to the industry. Our Integrated\nWork Study Programme (IWSP), SkillsFuture Work-Study\nDegree Programme and the Professional Officer (PO)\nScheme in particular received very positive feedback.\nThe ERP also highlighted that most SMEs it met, were\nvery happy with SIT’s approach in partnering them. They\nmentioned that the companies described SIT’s faculty\nand students as being hungry for industry projects, and\npro-active in partnering them, offering solutions without\nexpecting returns. This review has motivated us to do\nbetter for our students.\nIt is no secret that demand for our undergraduate\nprogrammes continues to grow amongst polytechnic\ngraduates. While, as a university, we are strategically placed\nto tackle the future economy, we must recognise diverse\nstudent talents and never forget the core reason for our\nset up. It is simply to enable more young Singaporeans\nto fulfil their goals and aspirations.\nBecause of a rapidly-evolving economy, new jobs will\nbe created and old jobs will be lost. It is thus important\nSingapore Institute of Technology - Annual Report 2018 //\nSingapore Institute of Technology - Annual Report 2018to prepare for jobs and skills of the future in a timely\nmanner. To do this, education is the first touch point. In\nAY2017, we introduced new programmes. An example\nis the Bachelor of Engineering with Honours in Aircraft\nSystems Engineering, which is the first such degree to\nbe offered by an autonomous university in Singapore.\nBuilt on an interdisciplinary curriculum that intersects\nengineering and science, the programme will develop\ngraduates for careers as licensed aircraft, project and\ntechnical development engineers. We now also have\nthree Master of Engineering programmes providing the\nopportunity for graduates to become Chartered Engineers.\nThe relevance of our programmes, combined with the\nhard work of our students, is evident in the workforce.\nIn the 2017 Graduate Employment Survey (GES), we\nstrengthened across all categories with our students\ncoming out top in terms of economic activeness. The\nsurvey also found that 92% of our graduates secure\njobs within six months of graduation. This is up three\npercent from the previous year. This shows that our\nstudents’ skill sets are valued and are now being sought\nafter by employers.\nTo drive the adoption of lifelong learning beyond\nundergraduate and graduate education, we are ramping up\nour efforts on the Continuing Education and Training (CET)\nfront. In 2017, the SIT LEARN  Professional Development\nunit trained almost 3,000 working adults in more than\n850 organisations through 55 training programmes\nacross key sectors such as healthcare, cybersecurity and\nengineering amongst many others.\nSynergies were aplenty in AY2017. On top of more\ncollaborations with employers from various industries\nfor our IWSP programme, we also established some\nvery important agreements. An MOU between MINDEF’s\nDefence Cyber Organisation (DCO) was the first work-\nlearn tie-up between the ministry and a university where\nselected full-time national servicemen will be trained to\nbecome elite cyber specialists. Another key collaboration was with Singapore Power (SP) Group to jointly build a\nmulti-energy urban micro grid at our upcoming Punggol\ncampus with a target to reach zero emissions. We also\nsigned partnerships with Siemens and NTUC Health\nto train future engineers in advanced manufacturing\nand develop a talent pool of allied health and nursing\nprofessionals respectively. This robust engagement with\nindustry is a deliberate one that will benefit our students.\nIt continually improves their learning pathways, allows for\nhands-on work experiences and develops skills needed\nfor the current and future workforce.\nAnd the future certainly looks bright. Planning for the new\ncentralised SIT campus in the Punggol Digital District has\nbeen progressing well. The campus’s co-location with\nJTC’s business park will facilitate the cross-fertilisation\nof knowledge and collaboration opportunities among\nstudents, faculty and industry professionals. Similarly, JTC\ncould host industry research, and even create startup\nspaces within our campus. This space swap creates greater\nsynergies between academia and businesses to create,\ntest-bed and prototype new ideas and innovations. What’s\nheartening to note is the fact that the various events\nand activities we have been organising for the Punggol\ncommunity has generated much goodwill among the\nresidents. So we are already making an impact before\neven breaking ground.\nThis gives me a lot of hope for the journey forward, as\nchallenging as it may be. I would like to express my\nappreciation to our Board, staff, students and industry\npartners for their steadfast commitment in steering\na young university like us to where we are today. I\ncertainly look forward to welcoming more inspired\nlearners, celebrating more achievements with our staff\nand students and forging more relationships with our\nindustry partners. Let us step forward together with even\ngreater boldness and imagination, build further on our\nstrengths, and work with even greater energy to fulfil\nthe aspirations of our students.Let us step forward together\nwith even greater boldness\nand imagination, build\nfurther on our strengths,\nand work with even\ngreater energy to fulfil the\naspirations of our students.“\nSingapore Institute of Technology - Annual Report 2018 //\nSingapore Institute of Technology - Annual Report 2018SENIOR\nMANAGEMENT\n42\n13\n5\n1\nProfessor Tan Thiam Soon\nPresident\n2\nProfessor Loh Han Tong\nDeputy President (Academic) & Provost\n3\nMr Chan Wing Leong\nDeputy President (Administration) & Chief Financial Officer4\nAssociate Professor Ivan Lee Boon Heng\nVice President (Industry & Community)\n5\nMr Tsoi Mun Heng\nVice President (Planning)\nSingapore Institute of Technology - Annual Report 2018 //\nSingapore Institute of Technology - Annual Report 2018\nBOARD OF\nTRUSTEES\nMr Ng Yat Chung\nChairman\nAppointed on 23 Sep 2009\nChief Executive Officer\nSingapore Press Holdings LtdMs Rachel Eng\nTrustee\nAppointed on 21 Mar 2011\nDeputy Chairman\nWongPartnership LLP\nDr Richard Charles Helfer\nTrustee\nAppointed on 23 Sep 2009\nChairman\nRCH International Pte LtdProf Heng Chye Kiang\nTrustee\nAppointed on 16 Sep 2015\nLum Chang Chair Professor\nSchool of Design and Environment\nNational University of SingaporeMr Kwee Liong Keng\nTrustee\nAppointed on 01 Nov 2017\nManaging Director\nPontiac Land Pte Ltd\nDr Lim Khiang Wee\nTrustee\nAppointed on 23 Sep 2009\nExecutive Director, CREATE\nNational Research FoundationMrs Margaret Lui\nTrustee\nAppointed on 16 Sep 2015\nChief Executive Officer\nAzalea Asset Management Pte Ltd\nAs of 31 March 2018\nSingapore Institute of Technology - Annual Report 2018 //\nSingapore Institute of Technology - Annual Report 2018\nMr Abu Bakar Bin Mohd Nor\nTrustee\nAppointed on 16 Sep 2015\nManaging Director\nKeppel SingMarine Pte LtdMr Nagaraj Sivaram\nTrustee\nAppointed on 16 Sep 2015\nPartner\nErnst & Young LLP\nProf Tan Thiam Soon\nTrustee\nAppointed on 01 Feb 2013\nPresident\nSingapore Institute of TechnologyMr Wen Khai Meng\nTrustee\nAppointed on 16 Sep 2015\nSenior Advisor, Group Strategy\nCapitaLand Limited\nMr T K Udairam\nTrustee\nAppointed on 16 Sep 2012\nChief Operating Officer\nSheares Healthcare Management\nPte LtdMr Ng Cher Pong\nTrustee\nAppointed on 01 Nov 2017\nDeputy Secretary (SkillsFuture)\nMinistry of Education\nChief Executive Officer\nSkillsFuture SingaporeMs Teoh Zsin Woon\nTrustee\nAppointed on 01 Apr 2013\nDeputy Secretary (Development)\nMinistry of HealthBOARD OF\nTRUSTEES\nAs of 31 March 2018\n//\nSingapore Institute of Technology - Annual Report 2018\nElectric-powered scooters are not new. What’s new\nthough is the Slide and Ride kick scooter developed by\na team of mechanical engineering students. Unlike other\nscooters, the Slide and Ride doesn’t have electrical parts,\nnor does it require constant leg pushes off the ground for\nmovement. All the human-powered scooter needs is an\ninitial leg push and shuffling of the paddles to generate\nmechanical power to move. This method not only promotes\nbetter exercise but also allows for better control of speed,\nmaking it safer for both riders and pedestrians. With no\nneed for batteries or electric power, the Slide and Ride,\nwhich uses clean human-powered energy, is considered a\nsafer and greener option to conventional electric scooters.\nSingapore Institute of Technology - Annual Report 2018HIGHLIGHTS OF\nKEY EVENTS\n2017\nIn May 2017, the worldwide spread of the\nWannaCry ransomware affected tens of\nthousands of computers. SIT LEARN  Professional\nDevelopment and the ICT Cluster came together\nto organise the Ransomware Awareness Seminar\nto disseminate timely, relevant and practicable\ninformation to educate the public about the\noutbreak and ways to mitigate the threat.\nLeveraging on strong relationships built with\nindustry leaders, SIT LEARN  partnered with\nAssociation of Information Security Professionals\n(AiSP) to bring this seminar to fruition.\nThe initiative featured speakers from Cyber\nSecurity Agency of Singapore (CSA), RSA\nSecurity, MWR InfoSecurity and SIT. A total\nof 160 industry professionals came to hear Industry-wide\nRansomware\nAwareness\nSeminarJun 8\nfrom the experts about their analysis on the\nevaluation and behavioural patterns of the\nransomware as well as ways to reduce risk\nagainst future threats.\nSITizens who have graduated were keen to\nspend time together at a range of activities,\nincluding those organised by the three SIT\nAlumni Networks (Career, Leisure and Sports)\nthroughout the year. One such workshop, the\nSoap Crafting Lab, was conducted in June\nby a SITizen – Nursing graduate Ms Chew\nJia Tian – who founded a natural beauty and\nskincare company.Jun 17\nSoap Crafting\nLab\nThe two camps welcomed more than 1,200\nfreshmen and gave students the opportunity\nto bond with one another and their seniors\nfrom various degree programmes. Students Jul 22 & 23,\nAug 24 - 26\nSIT Student\nOrientationwere also introduced to the SIT-DNA – Thinking\nTinkerers; Able to Learn, Unlearn and Relearn;\nCatalysts for Transformation; Grounded in\nthe Community.\nSingapore Institute of Technology - Annual Report 2018 //\nSingapore Institute of Technology - Annual Report 2018\nJul 24\nIWSP Industry\nDayThe inaugural IWSP Industry Day was held in\nJuly to share with potential partners the six\nnew degree programmes jointly offered with\nNewcastle University. Attended by about 130\nindustry attendees comprising of engineers,\ntalent acquisition representatives and division\nheads from over 60 companies, they gained\ninsights into the programmes’ curriculum and\nfound out ways they could collaborate with SIT\nto develop their future talent pipeline.\nIn response to the new Safety Case Regime\nimplementation by the Ministry of Manpower\n(MOM), SIT LEARN  Professional Development\nand Chemical Engineering and Food Technology\n(CEFT) Cluster jointly organised a ‘Major Hazards\nSymposium’ in partnership with Employment\nand Employability Institute (e2i) and Society\nof Loss Prevention (SLP).\nMore than 110 industry professionals attended\nthis one-day symposium. Speakers from Major\nHazards Department (MOM), Petrochemical\nCorporation of Singapore, Singapore Refining\nCompany, Singapore Polytechnic, SLP and\nSIT shared their insights and expertise on the\nimplementation of the Safety Case framework.\nThey also offered different perspectives of\nprocess safety in various areas such as business\ncontinuity, leadership and education.Major Hazards\nSymposiumJul 28\nIn conjunction with the symposium, an MOU\nwas signed between SLP , e2i and SIT. The aim\nof the MOU is to promote joint training and\ndevelopmental activities to create up-skilling\nopportunities for process industry professionals\nand risk management practitioners.\nThe inaugural Beers with Peers was held to\ncelebrate the pioneer Accountancy cohort,\nthe very first SITizens to graduate with an SIT-\nconferred degree. Presented as a beanfeast, the\nevent, held at Marina Mandarin ballroom, drew\nover 130 attendees. Graduates came after work\nto interact with Accountancy professionals, as\nwell as to catch up with their former classmates\nand professors. The evening’s highlight was\na panel discussion themed ‘Ensuring Your\nFuture Readiness’ that featured members from\nSIT Board of Trustees and philanthropic and\nindustry partners. They stressed the importance\nof keeping abreast of emerging technologies,\nas well as acquiring soft skills in communication\nand networking.Beers with\nPeers – SIT\nPioneer\nAccountancy\nBeanfeast Jul 28\nSingapore Institute of Technology - Annual Report 2018 //\nSingapore Institute of Technology - Annual Report 2018HIGHLIGHTS OF\nKEY EVENTS\nA total of 257 student athletes participated in\n12 sports at the annual Singapore University\nGames last year. SIT bagged a total of two\nmedals – Floorball Men’s (Bronze) and Tchoukball\nMen’s (Bronze) – as well as an individual Bronze\nmedal in Swimming. This represents our biggest\nmedal haul to date.Singapore\nUniversity\nGamesSep 2 -\nOct 15\nSeptember saw Student Life’s Community\nService Club connect SIT student volunteers\nwith the elderly at Kreta Ayer Seniors Activity\nCentre. The students collected donated items\nfrom different campuses and distributed them\nas hampers to the beneficiaries. They also\nconversed with the residents to learn more\nabout their life stories.Sep 18 - 22\nCollection period\nOct 14\nDistribution Period\nIn August, all students, especially the freshmen,\nwere treated to a mammoth showcase of all\n85 Student Clubs and Student Management\nCommittees in the University. Organised by\nStudent Life and meticulously planned and\nexecuted by the Student Leaders, the annual\nfair not only featured the achievements of each\nclub and committee but also gave a glimpse of\nthe unique activities and experiences students\ncan expect to be part of in their time at SIT.Student\nClub FairAug 26An MOU with Young NTUC was signed in\nAugust to collaborate on an Industry Mentorship\nProgramme through their Youth Career Network\n(YCN). The YCN’s Career Discovery & Mentorship\ninitiative will prepare students with real-time\nindustry information and guidance needed\nto succeed in the workplace. The inaugural\ninstallation of the programme was offered\nto students from the six new SIT-Newcastle\nUniversity engineering courses.\nMOU with\nYoung NTUCAug 22\nSingapore Institute of Technology - Annual Report 2018 //\nSingapore Institute of Technology - Annual Report 2018Community\nCare Industry\nNetworking\nDayOct 22The inaugural Community Care Industry\nNetworking Day in October was organised in\ncollaboration with the Agency for Integrated\nCare (AIC) and National Council of Social Service\n(NCSS) to provide undergraduates from the\nnursing and allied health sciences an overview\nof the different jobs in the healthcare industry.\nThis enabled more than 250 students to network\nwith seasoned healthcare professionals from\nover 17 institutions.\nMOU with\nSingapore\nPower\n(SP Group)Oct 23An MOU with Singapore Power (SP Group)\nwas inked in October to formalise a long-term\napplied research partnership on establishing\nan experimental micro-grid at the future SIT@\nPunggol campus. The proposed micro-grid\nwill be the first of its kind in Singapore and\nthe region. It will also serve as a teaching\nand applied research platform for SIT to\ncollaborate with other stakeholders in the\nenergy ecosystem.\nInternational\nFrisbee\nChampionshipOct 14 - 15Over two days in October, 18 SIT Ultimate\nFrisbee alumni took part in ‘2017 Run to\nTaiwan’, an international frisbee championship\nwhich featured 22 teams from Asia. The team,\nwhich included SIT students, achieved fourth\nplace in their pool after edging out a fellow\nSingaporean team. The alumni have continued\nto keep in touch and help train their juniors\nfrom the current team. The trip to Taiwan was\nan initiative organised by the alumni with help\nand well-wishes from SIT.\nSIT Graduation\nCeremonyOct 20Two of our pioneer cohorts, reading SIT-conferred\ndegrees in Accountancy and Hospitality\nBusiness, graduated on this significant day.\nThe milestone event was graced by Dr Janil\nPuthucheary, then Senior Minister of State,\nMinistry of Education.\nSingapore Institute of Technology - Annual Report 2018 //\nSingapore Institute of Technology - Annual Report 2018HIGHLIGHTS OF\nKEY EVENTS\nRecognition of\nExcellenceOct 26The annual ‘Recognition of Excellence’\npresentation celebrates students’ achievements\nas well as the generous philanthropic support\nthat nurtures student excellence at SIT. Now in\nits third year, the ceremony, held at the SIT@\nDover campus, was attended by over 300\nguests. A total of 33 donated Book Prizes,\nnine Outstanding Student Awards and Yearly\nPerformance Awards, seven Gold Medals and\n40 non-bonded scholarships were handed\nout by Mr Ng Yat Chung, Chairman, Board of\nTrustees, SIT.\nSafety\nOutreach\nMonthOct 30 -\nNov 29The Safety Outreach Month was launched in\nNovember 2017 to raise awareness on emergency\npreparedness and incident reporting platforms\navailable in SIT. The month-long event saw more\nthan 300 attendees; both students and staff,\nparticipating in a variety of safety and health\nrelated activities. Medical practitioners from\nvarious hospitals and SIT lecturers were invited\nMOU with\nNTUC HealthNov 2SIT inked a partnership with NTUC Health during\nthe official opening of their second nursing\nhome facility at Chai Chee. Collaborations\nin applied research and innovation projects,\nSkillsFuture-related training and clinical practice\neducation for allied health and nursing students\nare key focus areas in this partnership.\nto share health tips during lunchtime talks, while\ntrainers from Fitness First held mass exercises\nto promote active lifestyle. Representatives\nfrom the Singapore Heart Foundation and\nSingapore Civil Defence Force trained staff in\nbasic emergency response skills. A special SIT\ncommemorative umbrella was given to all staff\nas part of the Outreach initiatives.\nSingapore Institute of Technology - Annual Report 2018 //\nSingapore Institute of Technology - Annual Report 201829 students were awarded the SIT Scholarship\nat the SIT Scholarship Awards and Appreciation\nCeremony held on 8 November at SIT@Dover.\nThe ceremony was graced by Mr Ng Yat Chung,\nChairman, Board of Trustees, SIT, who gave\nout the awards to students who attained all-\nround excellence. At the same time, the event\nrecognised the achievements of 19 graduating\nSIT Scholars. 3 out of 4 of the graduating\nscholars graduated with First Class Honours\nor equivalent. SIT Scholarship\nAwards and\nAppreciation\nCeremony 2017Nov 8\n2018\nSIT Scholars\nCamp Jan 6 & 7The inaugural SIT Scholars Camp was held on\n6 and 7 January at the West Coast Campus\nof National Community Leadership Institute\n(NACLI). The camp served as a platform for\nSIT to engage the scholars, run workshops\nand build camaraderie amongst students who\nreceived the SIT Scholarship in AY2017/2018.\nSITizens celebrated their transition from student\nto alumni as they danced the night away at the\nsixth New Alumni Welcome Party. Held at Hard\nRock Cafe Singapore, the ever-popular event\nwas attended by over 250 new alumni, together\nwith SIT Senior Management, faculty and staff,\nas well as representatives from SIT’s Overseas\nUniversity partners. The crowd rocked out to\nperformances by Muzeka, SIT’s student band\nand Jive Talking, Hard Rock Cafe’s in-house\nband. Some party-goers also walked away with\namazing lucky draw prizes.New Alumni\nWelcome PartyNov 3\nSingapore Institute of Technology - Annual Report 2018 //\nSingapore Institute of Technology - Annual Report 2018HIGHLIGHTS OF\nKEY EVENTS\nSIT held its annual Open House on 13 and 14\nJanuary at Suntec Convention and Exhibition\nCentre. Complementing the start of the\n2018 admission exercise, the two-day event\nshowcased three elements of SIT – our range\nof degrees, our applied learning pedagogy,\nand the ‘Stories of SITizens’ (narratives of our\nstudents and alumni).\nInformation talks provided insights to prospective\napplicants on our industry-relevant degrees,\nwhich included two new programmes – SIT’s\nAircraft Systems Engineering and overseas\nuniversity partner, The Culinary Institute of\nAmerica’s Food Business Management (Baking\nand Pastry Arts). The myriad performances and\nSIT Open HouseJan 13 & 14\nactivities helmed by SIT students also added\na carnival atmosphere to the event, attracting\nclose to 5,500 visitors.\nPunggol Digital\nDistrict (PDD)\nLaunchJan 21The future SIT Campus will be integrated\nwith the adjacent, mixed-use commercial and\nbusiness park developed by JTC Corporation\nas part of the Punggol Digital District (PDD).\nThe District will be geared towards the\ndigital and cyber-security industries cluster,\nand will be used to drive Singapore’s Smart\nNation push through the incorporation of\ninnovative technologies and ideas. The PDD\nwas officially launched by Deputy Prime\nMinister Teo Chee Hean.\nApplied\nLearning\nConferenceJan 25 & 26In January, SIT organised the inaugural Applied\nLearning conference themed, ‘Applied Learning:\nPerspectives, Pedagogy and Practice’ which\nattracted over 300 attendees. The conference\nbrought together more than 50 international\nand local education experts to contribute to\nthe evolving discourse on Applied Learning. It\nprovided insights into the strategic directions\nuniversities can take in partnering with industry\nto develop and conduct curricula that train\ngraduates for future employment. In addition,\nthe event also discussed how universities,\nacademics and the industry can be empowered\nto face the future economy.\n//\nSingapore Institute of Technology - Annual Report 2018\nInter-Cluster\nGames Jan 27The second edition of the Inter-Cluster Games\nsaw 246 students and faculty members compete\nin five sports. The Games also featured several\nalumni teams facing off in a series of Futsal\nmatches. After a tense and exciting round of\ncompetition, the Health and Social Sciences\nCluster emerged victorious once more, retaining\nthe Provost Cup.\nStudent Leader\nAppreciation\nDinnerFeb 9A special appreciation dinner was held in\nrecognition of the commitment and leadership\ncapabilities of our Student Leaders towards\ntheir respective clubs, committees and special\nprojects. Close to 300 students attended this\nmeaningful event.\nAlumni Movie\nNightMay 9 2017 &\nFeb 22 2018In May 2017, and again in February 2018,\nmore than 250 alumni made a beeline for\nSIT’s Alumni Movie Nights to catch the latest\nblockbusters. The screenings were preceded\nby a buffet dinner, which gave attendees a\nchance to reconnect with fellow SITizens, SIT\nfaculty and staff.\n//\nSingapore Institute of Technology - Annual Report 2018HIGHLIGHTS OF\nKEY EVENTS\nWomen in Civil\nEngineering\nSeminar Mar 8In celebration of International Women’s Day on\n8 March, four prominent female civil engineers\nshared their experiences, challenges and\ntakeaways at the ‘Women in Civil Engineering\nTechnical Seminar – Planning and Delivery of\nMajor Infrastructure Projects in Singapore’\nheld at SIT@Dover. Organised by SIT LEARN\nProfessional Development and staff from the\nEngineering Cluster, the seminar was attended\nby over 450 civil engineering professionals.\nThe speakers provided diverse and insightful\nperspectives from the rail, road, housing and\nindustrial estate sectors.\nThe SIT Discovery Day, held on 10 March,\nwelcomed close to 950 prospective students\nto the SIT@Dover campus. The event provided\nan excellent opportunity for them to discover\nindustry-relevant degree programmes through\na series of talks, counselling sessions on\nadmission processes and student activities.\nThe event also saw alumni and friends return\nto attend an intimate information session as\nwell as network with professors and faculty staff\nof the newly-launched Master of Engineering\nTechnology in Electrical Power Engineering.\nSIT Discovery\nDayMar 10\nExpresSITMar 10SIT’s Performing Arts clubs – Dancesport, Muzeka,\nJust Singers, Soundbox, Soul Extreme and\nVocalist Insight – came together for the third\nedition of ExpresSIT. They wowed the audience\nwith their song and dance numbers inspired by\nthe glitz and glamour of the Oscars.\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018Communications\nand Information\nTechnology\n(CIT) DayMar 21The Communications and Information\nTechnology Division organised a CIT day to\ncreate awareness of the various IT platforms on\noffer to serve SIT students and staff. Industry\npartners were also invited to share the latest\nIT technologies and devices, with special\nevent promotional rates available for both\nstaff and students. The event was a massive\nsuccess with more than 200 staff, students\nand parents gracing the event.\nAsia-Pacific\nAssociation for\nInternational\nEducation\n(APAIE)\nConference and\nExhibition Mar 25 - 29Our Global Experience Division represented SIT\nat the 13th Asia-Pacific Association for International\nEducation (APAIE) Conference & Exhibition held\nat Marina Bay Sands. SIT had its exhibition booth\nunder the ‘Higher Education Singapore Pavillion’\nand interacted with over 2,300 delegates who\nwere mainly international educators from all\nover the world. SIT also signed an MOU with\nUniversidad San Ignacio De Loyola S.A. (Peru)\nand connected with Chiangmai University, King\nMongkut’s University of Technology Thonburi,\nSUP’Biotech and Jonkoping University, which\nresulted in collaborations on Overseas Exposure,\nInternational Internship and Student Exchange\nProgrammes.\n//Singapore Institute of Technology - Annual Report 2018Student\nLearning\nOutcomes\nWorkshopJun 5 & 6The Centre for Learning Environment and\nAssessment Development (CoLEAD) ran\na series of workshops by Professor Petri\nNokelainen from Tampere University of\nTechnology (Finland), which focused on\n3 main areas: student learning outcomes\nthrough use of education research methods;\ngetting started in data security; and research\nethics in research and work-based learning\nand engineering pedagogy. The workshops\nwere the first of its kind in helping faculty\nthink more deeply in designing an educational\nresearch-based study.\nSingapore Institute of Technology - Annual Report 2018\nDistinctive Admission Process\nSIT is distinctive in the way it admits students by practising a holistic admissions process that looks beyond academic\ngrades. No effort is spared in identifying and admitting the right SITizens who are able to thrive in the University’s\napplied learning environment.\nIn 2017, 6,200 out of 13,947 applicants were shortlisted for a face-to-face assessment through interview sessions that\ninvolved 190 faculty members and 110 industry partners as assessors. SIT’s holistic admissions criteria include key\nattributes and characteristics of applicants, such as passion and aptitude, and gives due recognition to work experience\nand other achievements related to the proposed programme of study.\nApplication vs Intake  over the last 3 years: AY2015/16, 2016/17 & 2017/18\nApplications\nIntake2017/18\n13,9472016/17\n12,9192015/16\n9,697\n2017/18\n2,5892016/17\n2,5592015/16\n2,076\nAcademic Qualification/\nBackground ScreeningAdmission Interview/\nTest EvaluationsTalent and\nPassion\nPersonal statements\nInterest in programme\nAttitude\nThe “X” factorAbility to express clearly\nClarity on career prospects\nSpecialised skillsAcademic merit\nRelevant work\nexperience/qualificationACADEMIC YEAR\nIN REVIEW\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018\nInfocomm\nTechnology\n476\nStudents\nHealth and\nSocial Sciences\n610\nStudents  Design and Specialised\nBusinesses\n446\nStudents  Chemical Engineering and\nFood Technology\n275\nStudents  Engineering\n782\nStudents  SIT Clusters Intake (as of 1 Oct 2017)Consequently, 2,589  new SITizens were minted in AY2017/18.\n93%Over\nof them are Singaporeans\nClose to\n93%\nare Polytechnic\ngraduates91%\nof the students admitted are\nenrolled into their first-choice\nprogrammeEngineering and Health and\nSocial Sciences are the two\nlargest clusters, admitting\n30%\nand\n24%\nof the total intake respectively\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018\nWe come in contact with elevator buttons almost every\nday. Given their constant use, the probability of cross\ncontamination through indirect contact is very high.\nSome research has indicated that bacteria found on these\nbuttons are often many times higher than on public toilet\nseats. To reduce the risk of cross contamination, especially\nin critical places such as healthcare facilities, a team of\nstudents developed the idea of the Contactless Elevator\nButton. This means when users place their fingers just a\nfew centimetres away from the buttons, the in-built motion\nsensor technology immediately reads the action of users\nand brings them to their intended floor.\nSingapore Institute of Technology - Annual Report 2018APPLIED\nLEARNING\nAt SIT, our students embark on an enriching learning journey that prepares them to meet society’s\nneeds today as well as the challenges of tomorrow. An SIT education offers our students a deeply\nrewarding experience, both inside the classroom and within industry, while nurturing their talents\nto become effective practitioners as well as leaders in rapidly expanding sectors.\nNew Programmes in Growing Industries\nThe Bachelor of Engineering with Honours in\nAircraft Systems Engineering degree programme, in\ncollaboration with SIA Engineering Company (SIAEC),\nis the first of its kind to be offered by an autonomous\nuniversity in Singapore. Built on an interdisciplinary\ncurriculum that intersects engineering and science,\nthe programme will develop graduates for careers\nas licensed aircraft engineers, project engineers and\ntechnical development engineers.\nA new specialisation that is another first in Singapore, the\nBachelor of Business Administration in Food Business\nManagement (Baking and Pastry Arts) will provide\nstudents with an in-depth understanding of the baking\n//\nSingapore Institute of Technology - Annual Report 2018and pastry world, as well as valuable hands-on bake shop\nexperience. Offered by the Culinary Institute of America,\nthe new specialisation will build students’ understanding\nand command of bread, cake and pastry production,\nbusiness skills, and the catering industry. Both the Aircraft\nSystems Engineering and Food Business Management\nprogrammes have commenced in AY2018.\nWe also introduced three Master of Engineering\nTechnology programmes to provide graduates the\nopportunity to become Chartered Engineers. The\nprogrammes, specialising in sustainable infrastructure\nengineering in land, building services and electrical\npower, will go some way in catering for the increasing\ndemand for post-graduate engineers.APPLIED\nLEARNING\nGaining Global Perspectives\nIn order to prepare students for a globally-connected\neconomy and work environment, SIT enriches their\nlearning with international experiences from two\ndifferent mobility programmes. The Overseas\nImmersion Programme (OIP) is an integral credit-\nbearing component of the Overseas University (OU)\nand Joint Degree Programmes where students visit\nthe OU campuses to attend lectures and workshops,\nconduct hands-on project work, and visit overseas\nindustry players for between 3 to 21 weeks. A shorter\nand optional one-week programme, the Overseas\nExposure Programme (OEP) aims to expose students\nto industry best practices, gain cross-cultural awareness,\nand broaden their horizons in workplaces of regional\ncountries. Participation in OEP is reflected in a student’s\nRecord of Achievement. In FY2017, more than 1,500\nstudents attended the OIP and OEP in 14 countries.\nMoving forward, SIT is ramping up on overseas student exchanges, international internships and promoting a\nnew Overseas Integrated Work-Study Programme\n(OIWSP) which offers students the option of completing\ntheir compulsory work attachments overseas.\nA cornerstone of SIT’s teaching and learning philosophy\nis to leverage on collaborative partnerships with world\nclass Overseas Universities (OU) and reputable industry\npartners. We currently have nine OU partners offering\njoint degrees or OU degree programmes at SIT, but\nbeyond these relationships, we also collaborate with\nnumerous universities and industry partners on student/\nstaff exchanges, internships/work attachments and applied\nresearch areas.\nIn FY17 alone, SIT signed multiple Memoranda of\nUnderstanding (MOUs) with International University of\nHealth and Welfare (IUHW), Seirei Christopher University\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018\n(SCU), Srinakharinwirot University (SWU), Zurich University\nof Applied Science (ZHAW), San Jose State University,\nSUP’Biotech, Nanjing Tech University (NTU), Reutlingen\nUniversity, Regensburg University of Applied Science (OTH),\nUniversity of Waikato, National Institute of Technology\n(Akashi College) and Kaga City.\nLifelong Learning\nConstantly learning and developing one’s skills is more\nimportant than having the right paper qualifications and\nbeing good at what one does; it is a mindset of continually\nstriving towards excellence through knowledge and\napplication. The SIT LEARN  Professional Development\nunit develops industry-relevant, authentic learning\nexperiences that help working professionals connect\nthe dots between theory and real-world application.\nIn FY2017, SITLEARN  reached out to almost 3,000\nworking adults in 863 organisations through 55 unique\ndevelopment offerings.\nAn MOU between MINDEF Defence Cyber Organization\n(DCO) and SIT on 12 Feb 2018 was the first work-\nlearn tie-up between a ministry and a university where\nselected full-time national servicemen will be trained to\nbecome elite cyber defenders. To be offered in 2019 by\nSITLEARN , the Cyber NSF Scheme will train soldiers\nto be placed in roles such as penetration testing, cyber\nforensics and malware analysis.\nTo boost capabilities for the healthcare industry,\nSITLEARN conducted two more strategic initiatives in\nFY2017. The first was to offer a series of symposiums\nand workshops together with the Health and Social\nSciences Cluster to improve skillsets of caregivers in\nthe Integrated and Long-Term Care (ILTC) sector. The\nsuite of offerings cut across important areas such as\ndementia, rehabilitation and stroke to name a few.\nThe other was a one-day intensive workshop named ‘A\ncollective Dialogue about the Transformation of Spaces\n– Eldercare in the New Age’, which saw architects,\ndesigners and healthcare professionals come together\nto share how transformation of spaces can improve the\nquality of life for our elderly.\nSITLEARN  Professional Development worked with\nTemasek Polytechnic SkillsFuture Academy to offer\n2 undergraduate modules as part of the SkillsFuture\nEarn & Learn Programme (ELP) for the Building Services\nSector. Through this new pathway, ELP participants\ngot to experience university modules, co-mingle with\nstudents and earned Certificates of Attainment issued\nby SIT LEARN  Professional Development.Some of these MOUs have already been fruitful in facilitating\nstaff and student exchanges. For example, more than\n100 students have travelled overseas under the Overseas\nExposure Programme (OEP) for MOUs signed with IUHW,\nSCU and NTU, and 35 NTU students and staff have also\nvisited SIT on a learning journey.\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018APPLIED\nLEARNING\nEnhancing Learning Experiences\nTo imbue good learning and teaching frameworks for\nall degree programmes right from the onset, with clear\ndirections to develop the SIT-DNA, the Centre for Learning\nEnvironment and Assessment Development (CoLEAD)\nwas set up. In FY2017, CoLEAD began training faculty\non how to enhance e-learning through the possible\nuse of virtual reality, creation of videos and interactive\npresentations.\nThe centre also supported the Health and Social\nSciences cluster on their e-learning week during the\nsecond trimester. This initiative, a first of its kind, saw\nstudents learning from home for a week during term\ntime. CoLEAD’s learning designers worked with faculty\nto plan and deliver online lessons, allowing faculty to\nexplore a wide range of educational technology tools.\nStudents gave good feedback on this initiative as the\ninteractive online learning materials not only allowed them to learn at their convenience but also gave them\ninstant feedback on their queries. The learning points\nand best practices of this exercise were harnessed for\nfuture e-learning implementation.\nSIT’s first two students who received the SCCCF\nScholarship  in Academic Year 2017/18 were also the\nfirst to be given the special opportunity to engage with\nlocal business leaders – the scholarship also comes with a\ncomplimentary year-long membership with the Singapore\nChinese Chamber of Commerce & Industry (SCCCI). This\nis a unique feature of the SCCCF Scholarship, which\nwas made possible thanks to an endowed gift from the\nSingapore Chinese Chamber of Commerce Foundation\n(SCCCF). The scholarship, awarded to recipients with\noutstanding academic results and leadership potential,\nis designed to encourage SITizens to start building ties\nin the community from the time they are students.\nMentorship for Students\nThe Professional Officers Division (POD) was established\nas part of the Academic Group to centrally manage SIT\nlaboratory capabilities and resources, mentor students\nduring laboratory work, projects and Integrated Work\nStudy Programmes (IWSP), as well as work with faculty\non industry initiatives.\nIn AY2017, POD initiated activities to strengthen the\ncompetencies of officers to enhance their support to\nstudents. One such initiative was the introduction of\nmonthly technical presentations which focused on\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018\ntopics ranging from student mentoring experiences to\nthe industry projects they are involved in. This sharing\nof experiences helped foster deeper cross disciplinary\ninteractions and collaborations amongst the POs, eventually\nbenefitting students.\nEnhancing Learning and Operational Capabilities\nPOD continued to set up and operationalise new\nlaboratories in AY2017. In particular, six new laboratories\nwere established in SIT@NYP Building, in addition to the\nexisting two, to support the Newcastle University joint\nprogrammes in electrical power engineering, as well as\nmechanical design and manufacturing engineering.\nOther laboratories that were set up include the Virtual\nEnvironment for Radiotherapy Training (VERT) and the\nRadiological Information System and Picture Archiving\nand Communication System (RIS/PACS) to support SIT’s\nHealth and Social Sciences Cluster. The VERT provides\na virtual and safe environment for radiation therapy\ntraining, while the RIS/PACS allows for patient scheduling,\nresource management, examination performance tracking,\nexamination interpretation and convenient access to\nmedical images in electronic format. POD also successfully\nled a taskforce to arrive at a preliminary design for future\nlaboratories at the Punggol campus.\nAnother initiative to enhance student experience was the\nsuccessful replacement of Student Information Systems\n(SIS) with IN4SIT, an enhanced integrated platform that\nnow centrally hosts all student e-platforms in one system.\nThis saves time and allows them to navigate important\nuniversity matters and details across the entire student life\ncycle. From application and admission to matriculation, examination marks and convocations, everything is now\naccessible on IN4SIT. The Teaching & Learning platform\nwas also enhanced with the new Online Lecture System\n(OLS), a cloud-enabled system for students’ ease of\nrecording and retrieving programme lectures.\nAs a new university that is seeing its student population\nincrease year on year, planning of space resources is crucial.\nIn FY17, plans to build a new temporary building on the\nplaying field in SIT@Dover Campus were put in place.\nThe new development will add 4,000m2 of new facilities\nsuch as tutorial and seminar rooms; computer and clinical\nlabs for the Health and Social Sciences Cluster, discussion\nrooms for students, group learning spaces and staff offices.\nRemarkable Philanthropic Support for SIT’s Undergraduates\nSIT’s philanthropic partners gave students their generous\nand most impactful support to date, with gifts to nurture\na record number of undergraduates as they pursue their\ndegrees at SIT.\nA transformational gift from the Lee Foundation to the\nLee Foundation Fund at SIT (established in September\n2017) has enabled our university to help more than 200\nfinancially disadvantaged students each year, and in\nperpetuity. The single largest gift that SIT has received,\nthe Lee Foundation Fund has made possible the Lee\nFoundation Bursary, as well as the Lee Foundation\nEmergency Grant for our students.\nThe Ngee Ann Kongsi’s generous philanthropic commitment\nhas made possible The Ngee Ann Kongsi Scholarship\nand The Ngee Ann Kongsi Gold Medal (For The\nMost Outstanding Graduating Student), nurturing\nand encouraging student excellence at SIT. As many as 40 new Scholarships are to be awarded annually to\npromising students from Academic Year 2017/18 onwards.\nThe Gold Medal award will be presented annually to the\nmost outstanding graduating student from each cohort.\nSome of the scholars with members of the 44th Committee of\nManagement of The Ngee Ann Kongsi and SIT Senior Management.\nThe division, together with HR and CoLEAD, also initiated\na new training programme to strengthen mentoring\ncompetencies of the officers, so students can continue\nto have effective guidance on their applied learning\napplications throughout their time at SIT.\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018APPLIED\nLEARNING\nGenerous support from the Tan Chin Tuan Foundation\nmade possible the Tan Sri (Dr) Tan Chin Tuan Foundation\nScholarships at SIT. The scholarships nurture academically-\npromising and well-rounded students from SIT-conferred\nor joint degree programmes. Five scholarships will be\nawarded annually from Academic Year 2017/18 onwards.\nTerm and endowed gifts from The Estate of the late Mr Lim\nDoa Hin allowed SIT to establish the endowed Lim Doa\nHin Study Grant and the Lim Doa Hin Encouragement\nAward, with the Grant supporting nine recipients each\nacademic year.\nAnother strong commitment to support students, especially\nthose in engineering programmes at SIT, came from Tiong\nSeng Holdings, one of Singapore’s largest construction\nand property development groups. The Tiong Seng\nBursary was made possible by an endowed gift, and\nwill see five bursaries awarded annually from Academic\nYear 2018/19 onwards.Guests from Tiong Seng Holdings with SIT Senior Management,\nfaculty and stuff at the model of SIT’s future campus in Punggol.\nHospitality Business students Mr Jonathan Lim and Ms Eunice Goh\nare among the first Tan Sri (Dr) Tan Chin Tuan Scholars at SIT.\nRecipients of the Lim Doa Hin Study Grant and the Lim Doa Hin\nEncouragement Award, together with the members of the Lim\nfamily, the executors of the late Mr Lim Estate, Prof Tan Thiam Soon,\nPresident, SIT and SIT faculty.\n//\nSingapore Institute of Technology - Annual Report 2018\nPhysiotherapists often recommend heel raise exercises\nas a part of balance training and to strengthen muscles\naround the ankles. Traditionally, the extent of a heel\nraise is determined by the physiotherapists making a\nvisual estimate. This can lead to inaccurate readings\nand subjective interpretations of the exercise. Working\nwith Kwong Wai Shiu Hospital, a team of SIT students\ndeveloped the heel raise device to provide more\naccurate measurements from the exercises. With built-in\nsensors and an accompanying mobile app, therapists\nusing this device will be able to determine whether the\nheel raise exercises are done correctly. This will also\nenable therapists to track, record and analyse data\nremotely, allowing them to better understand patient’s\ncapabilities and provide appropriate interventions.\nPatient’s app Physiotherapist’s Dashboard\nSingapore Institute of Technology - Annual Report 2018INDUSTRY\nSIT is committed to building a symbiotic relationship with industry. The tight nexus begins with\nthe development of SIT programmes through extensive consultations and collaborative efforts\nwith industry. SIT also caters to industry’s needs in manpower development and innovation\nthrough re-skilling and up-skilling programmes, as well as industry projects. In addition,\nindustry provides our students with real work experience through the Integrated Work Study\nProgramme (IWSP) and collaborative projects. This mutually beneficial relationship is a key\nfeature of SIT’s Applied Learning pedagogy that enables SIT to produce graduates who are\nhighly adaptable and employable.\nExperience before Graduation\nSIT’s Integrated Work Study Programme (IWSP), a\nsalient feature of the University’s educational experience,\nprovides students with opportunities to integrate the\nknowledge they have gained in the classroom with real-\nworld practice. The programme is a win-win for both\nindustry partners and students. IWSP is an excellent\nplatform for students to gain work experience, while\nindustry partners gain access to a pool of work-ready\nemployees.In AY2017, the Career Services division secured more\nthan 1,900 IWSP positions with over 400 companies for\n786 students. Since the roll out of this industry-focused\ninitiative in 2014, students have received advance offers\nfrom their IWSP companies even before they graduate. At\nleast 80% of our Accountancy students have consistently\nreceived advance offers over the last 3 years, while 40% of\nthe first batch of graduates from the SIE (Land) program\nwere also offered positions by their IWSP companies.\nSingapore Institute of Technology - Annual Report 2018 //\nSingapore Institute of Technology - Annual Report 2018Getting Students Career Ready\nTo strengthen our ties with industry, the inaugural IWSP\nIndustry Day was held on July 2017 to share with potential\npartners the six new degree programmes jointly offered\nwith Newcastle University. The event was attended\nby about 130 industry attendees comprising engineers,\ntalent acquisition representatives and division heads\nfrom over 60 companies. They gained insights into the\nprogrammes and found out ways they could collaborate with\nSIT to develop the future talent pipeline for engineering\nin their organisations.\nThe inaugural Community Care Industry Networking\nDay in October 2017 was organised in collaboration with\nthe Agency for Integrated Care (AIC) and National Council\nof Social Service (NCSS) to provide undergraduates from\nthe nursing and allied health programmes an overview of\nthe different healthcare jobs in the healthcare care sector.\nThe event not only enabled more than 250 students to\nnetwork with seasoned healthcare professionals from over\n17 institutions, but also gave them an opportunity to deeply\nappreciate the professionals caring for our community.An MOU with Young NTUC was signed in August 2017\nto collaborate on an Industry Mentorship Programme\nthrough their Youth Career Network (YCN). The YCN’s\nCareer Discovery & Mentorship initiative will prepare\nstudents with the real-time industry information and\nguidance needed to succeed in the workplace. The first\nrun of the programme was offered to students from the\nsix new SIT-Newcastle University engineering courses.\nStrategic Industry Partnerships\nRobust engagement with industry through collaborative\ntie-ups and projects are pivotal in paving the way for\nexchange of knowledge, sharing of manpower and resources\nin applied research, training and education, benefitting\nindustry, faculty and students. Two such collaborations\ninitiated by the Technology Innovation and Enterprise\n(TIE) Division were:\nSIT signed an MOU with Singapore Power in October\n2017 to formalise a long-term applied research partnership\non establishing an experimental full-featured micro-grid at\nthe future SIT@Punggol campus. The proposed micro-grid\nis the first of its kind in Singapore and the region. It will\nalso serve as a teaching and applied research platform for\nSIT to collaborate with other stakeholders in the energy\necosystem, such as regulators, energy companies, power\ngenerators, educational institutions and research centres.\nIn November 2017, SIT inked a partnership with NTUC\nHealth during the official opening of their second nursing home facility at Chai Chee. This tie-up is SIT’s\nthird in the healthcare space, coming after MOUs with\nTan Tock Seng Hospital and Kwong Wai Shiu hospital.\nSynergies in applied research and innovation projects,\nSkillsFuture-related training and clinical practice\neducation for allied health and nursing students are\nkey focus areas in this partnership.\nSupporting Innovation and Enterprise\nSIT’s grant framework supports innovation and enterprise\nat various levels – from seeding to proof of concept and\nvalue. It facilitates the close collaboration with industry\nand community, develops expertise and provides authentic\nlearning for the students. SIT’s grants allow faculty to\ntinker with their ideas and work with industry to establish a feasible solution before exploring bigger external grants\nto take the solution further.\nIn FY2017, SIT received strong interest from its faculty\nmembers to leverage on the Ignition Grant scheme\nprovided by the TIE division. A total of 15 projects,\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018INDUSTRY\ncomprising 40 faculty members and Professional Officers\nand 103 students, were awarded the Ignition Grant. These\nprojects continue to build expertise not only for the\nfaculty, but students as well, and keep them abreast with\nthe latest challenges from the industry and community.\nSIT also tapped on external grant opportunities for applied\nresearch projects. 20 proposals (including 10 submissions\nto MOE’s Translational R&D and Innovation Fund grant\ncall) were submitted to external funding agencies. Seven\nof these projects were started in FY2017. The grant amount received for these seven projects totalled $1.8\nmillion. Increasingly, our applied research projects are\ngoing beyond the first collaboration to produce more\nmeaningful and innovative solutions.\nA Seed Funding  framework was also established in AY2017\nto further support faculty-led projects with industry. It\nwill support the faculty in prototyping and testing ideas,\njumpstarting projects, and showcasing capabilities which\nwill lead to increased industry interest and confidence to\ncollaborate with SIT.\nNurturing the Entrepreneurial Spirit\nStaying true to the SIT-DNA values (Catalyst for\nTransformation and Thinking Tinkerers), the Entrepreneurship\nDevelopment Programme (EDP) has become a strategic\nprogramme that imparts skills to SIT students to be\nagents of innovation.\nIn 2017, EDP taught students business skills and\nentrepreneurship values needed in starting a business\nventure. 23 students from 15 different programmes\nsigned up to learn from a pool of industry mentors and\nentrepreneurs. Each student was given an opportunity\nto be part of a potential multi-disciplinary start up team,\ndevelop a business plan and pitch it to a panel of mentors.\nSIT’s focus on nurturing the entrepreneurial spirit is\nmaking good progress. For example, Mr Lim Xing Yi, a\npast participant of EDP and a recent graduate from SIT’s\nInformation and Communications Technology programme,\nsuccessfully pitched his idea to the Singapore Valley\nAwards (SVA) panel and won a 3-month attachment stint\nwith a reputed internet company, 2345.net, in Shanghai.\n//\nSingapore Institute of Technology - Annual Report 2018\nStroke often causes immobility and weakness in the arms or\nshoulders. To help the elderly regain mobility of their arms\nafter a stroke, SIT students, in collaboration with METTA’s\nDay Rehabilitation Centre for the Elderly, designed the\nArm Skate to aid patients with rehabilitation exercises.\nThe innovative solution incorporates simple games to\nmotivate post-stroke patients to undertake gravity-assisted\nreaching tasks in order to gain faster mobility. The Arm\nSkate combines conventional approaches with virtual\nreality to increase participation and interest in therapy,\nhelping patients improve their quality of lives.\nSingapore Institute of Technology - Annual Report 2018COMMUNITY\nAt SIT, we strongly believe that our graduates can serve the community through knowledge and\nskills that they acquire from their studies and work experience. Working with faculty, Professional\nOfficers and their peers, our students are involved in projects that help improve the social,\neconomic or environmental aspects of the community. While SIT provides the opportunities,\nresources and mentorship for this process, the community, in turn, becomes a learning platform\nfor students to exercise their skills and knowledge. In the end, SIT graduates will be grounded\nin the community, looking for opportunities where they can contribute. They will become part\nof the support network that strengthens social and economic bonds of the community.\nSupporting Companies through LEAN\nSIT’s Lean Transformation Innovation Centre (LTIC) was\nestablished in August 2016. Since then, LTIC has worked\nwith 20 companies through its Lean Skills Development\nProgramme, to support local companies in their journey\ntowards achieving manpower competencies and lean\nimprovements. Amongst the companies, many of them\nare local healthcare organisations which have successfully\nachieved productivity gains and inculcated the spirit of\ncontinuous improvement within their organisations.\nIn FY2017, LTIC also offered public workshops and masterclasses to about 150 participants from 67 companies\nto equip employees with lean tools that can be applied in\ntheir workplace. In addition, it co-organised lean outreach\nworkshops in collaboration with strategic partners such\nas Agency for Integrated Care (AIC), Association of Small\n& Medium Enterprises (ASME), Civil Service College\nSingapore (CSC), Environmental Management Association\nof Singapore (EMAS), Institute for Adult Learning (IAL)\nand Singapore Food Manufacturers’ Association (SFMA)\nto reach out to specific industries to further promote lean\nculture, thinking and practices.\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018Innovative Inroads into Punggol\nSIT and Punggol 21 Community Club (P21CC) signed a\nMOU in January 2018 to collaborate on building Skillscraft,\na Community Innovation Makerspace facility, at P21CC.\nSkillscraft is SIT’s platform to promote innovation and\nencourage the community, especially the youth and Punggol\nresidents, to translate their ideas into meaningful prototypes.\nThese initiatives, curated by the TIE Division, enable\nparticipants to develop relevant technical skills such as\nsuch as 3D printing, lean skills and design thinking to\naddress community issues around Punggol. Skillscraft was\nfeatured at the Punggol Digital District Launch exhibition\nduring the week of 21 January 2018.\nIgniting Passion for STEM\nSIT aims to inspire in the younger generation a passion\nfor STEM (Science, Technology, Engineering and\nMathematics). One of the initiatives used to kindle this\npassion is through the collaboration with People’s Association\non holiday science camps. Working with Punggol-based\ngrassroots organisations, the university hosted over 150\nprimary school children residing in Punggol at SIT@Dover.\nFor two days, on 31 May and 6 December 2017, the\nparticipating children were immersed in craft workshops\nand interactive STEM activities such as robotics, drones\nand flying paper gliders. Through these science camps,\nwe enabled our young to learn through play and fun.\nImpacting Lives beyond the Classroom\nTwo SIT teams were honoured for their projects at the\n6th Eldercare Innovation Awards held in conjunction\nwith the 9th International Ageing Asia Innovation Forum\n2018 in May. Touted as the ‘Oscars of the Eldercare\nIndustry’, the award is the only one of its kind in the\nAsia Pacific region that recognises the best in innovative\neldercare product and service delivery. These projects\nwere progressively completed in FY2017.\nThe Smart Walker for Gait Rehabilitation with Local\nPositioning System, clinched the award in the ‘Best Smart\nCare Technology – Product’ category. This innovative\nsmart walker independently aids a patient undergoing\nrehabilitation. This means a patient does not need the\nphysical support of physiotherapists all the time. Therapists\nwould not only be able to monitor the walking activities\nof patients and but also identify their locations. This is\nparticularly useful as it provides an innovative solution\nto the manpower crunch faced by healthcare industries.\nThis innovative project, designed in collaboration with\nKwong Wai Shiu Hospital (KWSH), was a final year project\nfrom our student who is currently reading her Bachelor\nof Engineering with Honours in Mechatronics (SIT-UofG).The other project that made it to the top five list in\nthe same category was an ‘arm-skate’ device named\nNew Arm. The faculty/student-driven project was the\ninnovative solution to METTA Day Rehabilitation Centre\nfor the Elderly’s  challenge to design a device for post-\nstroke patients to regain upper limb mobility. The device\nincorporates a virtual reality game to motivate patients\nto move their arms. This initiative was the result of one\nand a half year’s work of four students from the design,\nengineering and occupational therapy disciplines. Both\nprojects not only put patients at the center of the design\nprocess but more importantly, contributed to improving\ntheir quality of life amidst challenges.\nIn 2017, more than 300 SIT students were involved in\nvarious community service projects in collaboration\nwith 17 organisations. SIT Student Life’s Community\nService Club and Rotaract Club have collaborated\non initiatives that benefitted more than 500 elderly,\nyouth and children. These included spending a day\nat the zoo with underprivileged children, litter picking\nin support of the ‘Keep Singapore Clean’ campaign\nand a household cleaning effort, just to name a few.\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018COMMUNITY\nAnother project that brought cheer to the community\nwas the collaboration with Kreta Ayer Seniors Activity\nCentre, which saw students collecting donated items\nfrom different SIT campuses and distributing them as\nhampers to the beneficiaries. The student volunteers\nalso conversed with the residents to learn more about\ntheir life stories.  Our students also crossed borders to improve the lives of\nother children going to schools in rural areas. Last year’s\noverseas learning projects in Myanmar, Vietnam and\nCambodia saw our students refurbishing an education\ncentre, building an eco-garden, conducting leadership\ncamps for young educators, conducting English lessons,\ndispensing hygiene tips and even constructing fences to\nincrease safety and security.\nOur Future Campus\nSince the announcement by our Prime Minister in the\n2015 National Day Rally, planning for the new SIT campus\nin Punggol has been progressing at breakneck speed.\nThe SIT Campus will be integrated with the adjacent,\nmixed-use commercial and business park developed\nby JTC Corporation. The Punggol Digital District\n(PDD) will be geared towards the digital and cyber-\nsecurity industries cluster, and will be used to drive\nSingapore’s Smart Nation push through the incorporation\nof innovative technologies and ideas. The PDD was\nofficially launched by Deputy Prime Minister Teo Chee\nHean in January 2018.\nView from the Campus Boulevard flanked between SIT and JTC\nAerial View of Campus HeartSIT@Punggol – From Design to Implementation\nThe greenfield site chosen for SIT@Punggol in PDD\nspreads over 18ha, of which the first 11ha will be\ndeveloped into a fit-for-campus facility for 12,500\nfull-time undergraduate students. The 11ha of tropical\nrainforest will be divided by a new dual-three lane road into two almost equal-sized plots, providing\nan opportunity to engage two teams of architects\nand engineers to conceptualise highly diverse, but\ncomplementary designs that match and relate well to\ncontext of the respective sites.\nAerial View of Campus Court\n//\nSingapore Institute of Technology - Annual Report 2018\nThe risk of workplace incidents is always present,\nregardless of the industry and no matter how insignificant\nthe possibilities are. Preventive systems minimise risks\nfor companies and provide safe working environments\nfor employees.\nThe transportation industry, specifically bus services, are at\nincreased risks of accidents given the size of its vehicles,\nmaneuvering complexities and the higher propensity\nfor blind spots. To help Bus Captains minimise risks on\nthe road, SIT students worked with the Land Transport\nAuthority to develop the Safe Sight System. The system\nuses sensor, light and display technologies to give precise\nvisual cues to warn drivers of hazards from all blind spots.\nThis reduces unwanted stress amongst drivers and increases\nsafety on our roads.\nSingapore Institute of Technology - Annual Report 2018SUPPORT FOR\nSTUDENTS\nFinancial assistance is given to deserving students enrolled in SIT. The financial aid covers\nexpenses that include tuition fees and costs for overseas programmes. SIT is firmly committed\nto a policy that strives to give our most needy students the assurance that quality university\neducation is well within their reach.\nSponsorships and Bonded Scholarships\nThrough generous contributions from our industry partners, government agencies and organisations, our students have\nbeen able to receive various forms of bonded scholarships or sponsorships to pursue their degree programmes.\nThe Following Industry Partners Have Provided\nSponsorships/Bonded Scholarships To SIT Students\nAgency for\nIntegrated CareAgri-Food &\nVeterinary\nAuthority of\nSingaporeAlexandra\nHealthAng Mo Kio\nThye Hua Kwan\nHospital\nAssociation of\nSingapore Marine\nIndustriesBuilding and\nConstruction\nAuthorityCentre for\nStrategic\nInfocomm\nTechnologiesEarly Childhood\nDevelopment\nAgency\nEastern Health\nAllianceFar East\nOrganizationInfocomm\nDevelopment\nAuthority of\nSingaporeJumbo Group\nof Restaurants\nJurong Health\nServicesKeppel Offshore\n& MarineLand Transport\nAuthorityMaritimeONE\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018Media\nDevelopment\nAuthority of\nSingaporeMENDAKIMinistry of\nCommunications\nand InformationMinistry of\nDefence\nMinistry of\nHome AffairsMOH Holdings\nPte LtdNational Council\nof Social\nServiceNational\nEnvironment\nAgency\nNational\nHealthcare\nGroupNational\nUniversity\nHealth SystemNTUC First\nCampusOverseas Union\nEnterprise\nLimited\nSembcorp\nIndustries LtdSembcorp\nMarine LtdSingapore\nHealth Services\nPte Ltd\nSingapore Power\nLimitedSingTelSociety for the\nPhysically\nDisabledSt Luke’s\nHospital\nThe Salvation\nArmySingapore-Industry\nScholarship (SgIS)Public Utilities\nBoardRaffles\nMedical GroupRen Ci Hospital SBS Transit\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018DONOR\nACKNOWLEDGEMENT\nWith deepest thanks and appreciation to our generous philanthropic partners whose gifts\nnurture and inspire students at SIT through bursaries, study grants, non-bonded scholarships,\nexcellence awards and programmes.\nDonor Listing (for the financial year ending 31 March 2018)\nAbwin Pte Ltd\nAmazon Web Services Singapore Private Limited\nApplied Materials South East Asia Pte Ltd\nArdent Group of Companies\nAscendas Funds Management (S) Limited\nBaker Tilly TFW LLP\nBuddhist Compassion Relief Tzu Chi Foundation\n(Singapore)\nCA Trust PAC\nCEI Limited\nCentre for Strategic Infocomm Technologies\nMs Chen Linrong\nMr Choo Chiau Beng\nMr Choo Chong Ngen\nCore Concepts Pte Ltd\nCPA Australia Ltd\nCyclect Electrical Engineering Pte Ltd\nDBS Bank Ltd\nDeloitte & Touche LLP\nDou Yee Enterprises (S) Pte Ltd\nECM Libra Foundation\nEnGro Corporation Limited\nEPS Computer Systems Pte Ltd\nFEINMETALL Singapore Pte Ltd\nFeng Ming Construction Pte Ltd 025\nFirefense Pte Ltd\nFoo Kon Tan LLP\nMr Foong Hock Meng\nGIC Private Limited\nGoh Bee Gah Foundation through SymAsia\nFoundation Limited\nMr Jeff Goh\nGoh Foundation Limited\nHiap Chuan Hardware (Pte) Ltd\nHock Seng Hoe Metal Company Pte Ltd\nHome-Fix DIY Pte Ltd\nHong Leong Foundation\nHSC Foundation through SymAsia Foundation Limited\nInstitute of Materials (East Asia)\nJCS-Echigo Pte Ltd\nMr Surya Jhunjhnuwala and Mr Gaurang Jhunjhnuwala\nJing King Tech Holdings Pte Ltd\nJumbo Group Limited\nKaspersky Lab Singapore Pte Ltd\nKCTex International Ltd\nKenyon Pte Ltd\nKeppel Care Foundation Limited\nKeppel Corporation Limited\nMr Jeffrey Khoo\nKhoo Chwee Neo Foundation Ltd\nMr Ko Oen Tjiang\nMr Kuok Khoon Hong\nKwan Im Thong Hood Cho Temple\nLee Foundation\nMr Kevin Liang Choon Yee\nMr Lim Joo Boon\nMr Lim Siah Mong\nLions Community Service Foundation (Singapore)\nLo Hock Ling & Co\nMr Low Ming Wah\nM.Tech Products Pte Ltd\nMr Mak Keat Meng\nMalayan Daching Co Pte Ltd\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018\nMapletree Investments Pte Ltd\nMcLink Asia Pte Ltd\nMicrocast Pte Ltd\nMun Siong Engineering Limited\nNehemiah Foundation through SymAsia\nFoundation Limited\nNexia TS Pte Ltd\nOcean Tankers Pte Ltd\nOceanMaster Engineering Pte Ltd\nPark Hotel Management Pte Ltd\nPerfect Team Engineering Pte Ltd\nPKF-CAP LLP\nPwC Singapore\nQ’son Kitchen Equipment Pte Ltd\nRadiology & Co. Pte Ltd\nRaffles Hotel Singapore\nRC Hotels (Pte.) Ltd\nReal Estates Investment Holding (Pte) Ltd\nRLG Asia Pacific Pte Ltd\nRohde & Schwarz Asia Pte Ltd\nRotary Club of Bugis Junction, Singapore\nRotary Club of Jurong Town, Singapore\nRSM Chio Lim LLP\nSafety Systems Engineering Pte Ltd\nSamwoh Corporation Pte Ltd\nSATS Ltd\nSCAL Resources Pte Ltd and members of The Singapore\nContractors Association Ltd\nSeagift Food Pte Ltd\nSelect Group Pte Ltd\nSembcorp Industries Ltd\nSembcorp Marine Ltd\nSiemens Pte Ltd\nSingapore Chemical Industry Council Limited\nSingapore Chinese Chamber Of Commerce Foundation\nSingapore Computer Society\nSingapore Food Manufacturers’ Association\nSingapore Leong Khay Huay Kuan Singapore Technologies Engineering Ltd\nSP Group\nTAK Products & Services Pte Ltd\nMs Tan Siew Ooa\nTaylor & Francis Asia Pacific\nTe Lay Hoon Foundation through SymAsia\nFoundation Limited\nTech Metal Machines Pte Ltd\nTeknor Apex Asia Pacific\nMr Allan Teo Kok Jin\nTexas Instruments Singapore (Pte) Limited\nThe Copyright Licensing and Administration Society\nof Singapore Ltd\nThe Estate of Lim Doa Hin\nThe Goh Family\nThe Ireland Funds (Singapore)\nThe Ngee Ann Kongsi\nThe Ritz-Carlton, Millenia Singapore\nThe Silent Foundation Ltd\nThe Tan Chin Tuan Foundation\nThomson Shin Min Foundation\nTiong Seng Contractors (Private) Ltd\nTME Systems Pte Ltd\nMr Toe Teow Heng\nWilmar International Limited\nWing Tai Retail Management Pte Ltd\nWoh Hup Pte Ltd\nMr Albert Wong\nDr Steven Wong Kai Juan\nMs Wong Kai Yun\nMrs Wong Kwok Leong\nMs Angela Wu Peihui\nwww.hardwareonline.com.sg\nYangzheng Foundation\nMr Yap Geok Lin\nYeakin Plastic Industry Pte Ltd\nZicom Holdings Private Limited\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018CORPORATE\nGOVERNANCE\n31 March 2018\nIntroduction\nSIT was incorporated in September 2009 as a Company limited by guarantee under the Companies Act (Cap. 50). It is an\nInstitution of Public Character (“IPC”) under the Charities Act (Cap 37).\nSIT is governed by the Singapore Institute of Technology Act (Cap 299B). Its key constituent document is the Memorandum\nand Articles of Association which states that the purpose of the University is to promote and undertake the advancement\nof education by providing educational facilities and courses of study in all fields of knowledge, promote and engage in\nresearch and scholarships and establish, operate, promote and maintain the University as a going concern.\nGood corporate governance is the cornerstone of a well-managed University which is, in turn, critical to SIT’s performance\nand operations. The focus of its governance framework, on which the University’s vision, mission and core values are\nformulated, promotes accountability and transparency and is manifested in the composition of the Board of Trustees\n(“Board”) and its Committees, division of powers and duties between the Board and Management, adoption of checks\nand balances and sound measures for internal and corporate controls.\nGovernance Evaluation Checklist\nThe University adheres to the Code of Governance for Charities and Institutions of Public Character (“Code”). The University\nhas complied in material aspects with the principles and guidelines set out in the Code. Where there are departures from the\nCode, these are explained under the relevant sections of the Annual Report or the Governance Evaluation Checklist (“GEC”).\nAccording to disclosure requirements imposed by the Charity Council, Ministry of Culture, Community and Youth, all IPCs\nare required to publicly disclose their compliance with the Code. The University’s GEC is made available on the website\nof the Charity Portal at www.charities.gov.sg.\nBoard of Trustees\nThe Board is the highest governing authority of the University and comprises 14 Trustees, chaired by Mr. Ng Yat Chung. The\nBoard oversees the business of the University, ensures that it acts in accordance with its objects, that its funds and assets\nare properly accounted for and safeguarded and provides guidance and stewardship to Senior Management, conferring\nregularly with them. The Board is accountable to the Minister for Education, Singapore for its acts and decisions.\nThe Trustees are eminent persons of good repute, sound judgment who possess collective competencies in areas such as\nthe public and private sectors, academia, accounting and finance, law, information technology, strategic planning, logistics,\nhealthcare and hospitality management and industry knowledge. New Trustees will continue to be selected and invited\nto serve on the Board on the basis of the diversity of their experience, skills, knowledge, abilities and insight from time\nto time to ensure constant refreshing of the Board. The Trustees’ profiles appear on pages 7 and 8 of the Annual Report.\nThere is an objective decision-making process, which allows each Trustee to exercise his or her own independent judgment.\nThe University has established financial authorisation and approval limits for operating and capital expenditure, the\nprocurement of goods and services, the acquisition and disposal of assets and making investments. The Board approves the\nannual budget, the use of operating reserves and annual audited financial statements of SIT, amongst other responsibilities.\nThe Board is supported by seven Board Committees formed in accordance with Article 53 of the Articles of Association\n(“AAs”), namely the Academic Advisory, Audit, Campus Development, Finance, Investment, Partnership Approval and\nRemuneration Committees. Each Board Committee has clear Terms of Reference setting out their role, authority, powers\nand matters requiring their approval. The list of Board Committees is on page 44 of the Annual Report.\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018Briefly, the responsibilities of the Board Committees are described as follows:-\n(a) The Academic Advisory Committee advises the Board on all academic strategies, policies and issues.\n(b) The Audit Committee oversees and reviews the University’s internal controls, integrity of its financial reporting,\nlegal and regulatory risks, enterprise risk management, internal and external audit functions.\n(c) The Campus Development Committee assists the Board in maintaining oversight of the campus development\npolicies and any other matters related to the acquisition, commissioning and management of significant physical\nassets or facilities.\n(d) The Finance Committee provides oversight of the University’s financial policy management.\n(e) The Investment Committee oversees the investment of the University’s endowment and surplus funds.\n(f) The Partnership Approval Committee assists the Board in the review of the financial and legal viability of SIT’s\nacademic partnerships between the University and its overseas university partners.\n(g) The Remuneration Committee provides independent advice, oversight and policy guidance in employee\ncompensation matters.\nEach Board Committee comprises Trustees with appropriate qualifications and skills and there is a fair distribution of\nresponsibilities amongst the Trustees. Where required, non-Trustees who have experience in their respective areas of\nexpertise are invited to provide advice to the Board Committees to enhance the process of decision making. The Board\nis kept informed of the key matters discussed at each Board Committee meeting.\nManagement of the University\nThe President of the University, Professor Tan Thiam Soon, is appointed by the Board and is the Chief Executive Officer\nand the University’s academic and administrative lead. He is responsible to the Board for the conduct, co-ordination and\nquality of the programmes of the University and its future development. He is empowered with the authority to perform\nall acts which are necessary to implement the policies, procedures and actions of the Board. As a liaison between the\nBoard and the University, the President is tasked with the responsibility of informing each party of the views and concerns\nof the other, relating to the programmes and administration of the University. He also arranges for the annual budget of\nthe University to be presented to the Board annually for approval as part of his duties.\nThe profiles of other members of the Senior Management of the University can be found on its corporate web page and\non page 6 of the Annual Report.\nConflicts of Interest\nThe Trustees and staff are required to act in the best interest of the University at all times. Policies have been developed to\nprevent or manage situations where conflicts of interest could arise, by promoting integrity and ethical business conduct.\nThe AAs contain provisions for the management and avoidance of conflicts of interest by members of its Board of Trustees.\nSuch provisions include:\n(a) Permitting a Trustee to be interested in any transaction with the University provided that the Trustee has declared\nthe nature of the interest to the other Trustees of the Board as required under the Companies Act of Singapore\nand complied with the provisions of AAs to abstain from voting on any matter related to the transaction,\n(b) Permitting a Trustee, or a firm associated with the Trustee, to act in any professional capacity for the University\nand to be remunerated for the provision of professional services, and\n(c) Permitting a Trustee to be reimbursed for out-of-pocket expenses, travelling and other expenses properly incurred\nby the Trustee in attending and returning from meetings of the Board of Trustees, any of its committees, or any\ngeneral meeting of the University or otherwise in connection with the affairs of the University.\nThe AAs also state that Trustees shall not receive any remuneration for services rendered by them as Trustees.\nThe University has implemented a Conflicts of Interest Policy which all staff must comply with. In accordance with that\nPolicy, staff must ensure that their private activities and interests do not conflict with their professional obligations to the\nUniversity. Where there is a potential conflict of interest, the staff is required to submit full disclosure and request for an\nappropriate exemption. The University will grant such exemptions at its discretion. In addition, staff are required to declare\ntheir compliance with the University’s prevailing policy on conflicts of interest annually.\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018 BOARD\nCOMMITTEES\n& INTERNAL\nAUDIT\nBoard Committee Member\nAcademic Advisory Committee Chairman : Dr Lim Khiang Wee\nProf Heng Chye Kiang, Prof Tan Thiam Soon\nAudit Committee Chairman : Mr Nagaraj Sivaram\nMr Abu Bakar Bin Mohd Nor, Ms Teoh Zsin Woon\nCampus Development Committee Chairman : Dr Richard Charles Helfer\nProf Heng Chye Kiang, Ms Teoh Zsin Woon, Mr Wen Khai Meng\nFinance Committee Chairman : Mr T K Udairam\nMrs Margaret Lui, Mr Wen Khai Meng\nInvestment Committee Chairman : Mrs Margaret Lui\nDr Chia Tai Tee (Co-opted), Mr Ng Yat Chung\nPartnership Approval Committee Chairman : Ms Rachel Eng\nMr Abu Bakar Bin Mohd Nor, Mr Ng Cher Pong\nRemuneration Committee Chairman : Mr Ng Yat Chung\nDr Lim Khiang Wee, Mr Ng Cher Pong, Mr T K UdairamAs of 31 March 2018\nBoard Committee\nInternal Audit\nInternal Audit provides independent, objective assurance and consulting services designed to add value and improve\nthe University’s operations. Internal audit activity is guided by a value-driven philosophy of partnering with other\ndepartments to enable SIT to meet its business objectives. Our key role is to assist Management in evaluating their risk\nmanagement, control and governance processes so that business objectives can be met.\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018FINANCIAL\nSTATEMENTS\nGeneral fundsEndowment and term\nfunds Total\n2018\n$2017\n$2018\n$2017\n$2018\n$2017\n$\nRevenue\nOther Income66,388,569\n1,350,772 -\n3,283,82166,388,569\n4,634,593 55,180,058\n936,093 -\n1,200,89255,180,058\n2,136,985\nOperating expenditure\nStaff and related expenses\nDepreciation and\namortisation expenses\nProgramme and\nstudent-related expenses\nRental and other facilities\nexpenses\nOther operating expenses\n(85,477,377)\n(35,970,801)\n(62,051,788)\n(21,096,539)\n(20,460,517)\n(66,033,714)\n(37,264,513)\n(61,851,195)\n(20,209,264)\n(16,738,881)\n-\n-\n(1,588,631)\n-\n(470,905)\n-\n-\n(1,505,450)\n-\n(594,257)\n(85,477,377)\n(35,970,801)\n(63,640,419)\n(21,096,539)\n(20,931,422)(66,033,714)\n(37,264,513)\n(63,356,645)\n(20,209,264)\n(17,333,138)\nTotal operating\nexpenditure\n(225,057,022)\n(202,097,567)\n(2,059,536)\n(2,099,707)\n(227,116,558)\n(204,197,274)\n(Deficit)/surplus before\ninvestment income and\ngovernment grants\nNet investment income\n(157,317,681)\n891,337\n(145,981,416)\n1,066,527\n1,224,285\n19,590,267\n(898,815)\n44,834,456\n(156,093,396)\n20,481,604\n(146,880,231)\n45,900,983\n(Deficit)/surplus before\ngovernment grants\nGovernment grants\nNet surplus and total\ncomprehensive income 33,785,603 31,519,554\n20,814,552\n-\n43,935,641\n-\n(135,611,792)\n190,211,947\n(100,979,248)\n176,434,443\n(156,426,344)\n190,211,947\n(144,914,889)\n176,434,443\n20,814,552 43,935,641 54,600,155 75,455,195\nThe Financial Statements are extracted from Singapore Institute of Technology's Audited Financial Statements for the\nyear ended 31 March 2018. It may not contain sufficient information to allow for a full understanding of the results and\nthe state of affairs of the Company. For further information, please refer to the complete audited financial statements\npublished on the SIT official website at SingaporeTech.edu.sg.Important Note:\nStatement of Comprehensive Income\nFor the financial year ended 31 March 2018\n//\nSingapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018FINANCIAL\nSTATEMENTS\nAs at 31 March 20182018\n$2017\n$\nASSETS\nCurrent assets\nCash and cash equivalents\nFinancial assets, at fair value through profit or loss\nDeposits for investments\nFees and other receivables\nStudent loans\nOther current assets120,782,115\n226,853,772\n199,448,729\n102,169,728\n158,708\n7,735,630147,993,484\n389,923,422\n-\n48,350,239\n142,551\n6,305,529\n657,148,682 592,715,225\nNon-current assets\nProperty, plant and equipment\nIntangible assets\nStudent loans\nOther non-current assets197,346,935\n6,540,487\n679,564\n77,098,777211,208,679\n6,478,647\n563,166\n80,618,645\n281,665,763 298,869,137\n938,814,445 891,584,362 Total assetsBalance Sheet\nLIABILITIES\nCurrent liabilities\nTrade and other payables\nDeferred tuition fee income\nGrants received in advance37,190,678\n9,038,746\n44,441,56631,712,152\n9,021,139\n47,698,383\n90,670,990 88,431,674\n217,628,279\n83,482,328Non-current liabilities\nDeferred capital grants\nOther deferred grants203,628,710\n80,155,249\n283,783,959 301,110,607\n374,454,949 389,542,281 Total liabilities\n564,359,496 502,042,081 NET ASSETS\nFUNDS AND RESERVES\nGeneral funds\nAccumulated surplus 116,577,818\n394,010,892\n53,770,786386,293,632\n32,956,234Endowment and term funds\nCapital\nAccumulated surplus82,792,215\n447,781,678 419,249,866\n564,359,496 502,042,081\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 2018\nEndowment\nand term\nfunds\n$Accumulated\nsurplus – General\nfunds\n$\nTotal\n$\n2018\nBeginning of financial year\nTotal comprehensive income\nGovernment grants and donations82,792,215\n33,785,603\n-419,249,866\n20,814,552\n7,717,260502,042,081\n54,600,155\n7,717,260\nEnd of financial year 116,577,818 447,781,678 564,359,496\n2017\nBeginning of financial year\nTotal comprehensive income\nGovernment grants and donations51,272,661\n31,519,554\n-363,552,445\n43,935,641\n11,761,780414,825,106\n75,455,195\n11,761,780\nEnd of financial year 82,792,215 419,249,866 502,042,081FINANCIAL\nSTATEMENTS\nStatement of Changes in Funds and Reserves\nFor the financial year ended 31 March 2018\n//Singapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology - Annual Report 20182018\n$2017\n$\nCash flows from operating activities\nDeficit before government grants\nAdjustments for:\nDepreciation and amortisation\nDonations\nNet loss on disposal of property, plant and equipment\nInterest income\nCurrency exchange loss\nFinancial assets designated as fair value through profit or loss\nFair value gain\nNet gain on sale of financial assets(135,611,792)\n35,970,801\n(3,283,821)\n31,143\n(1,843,488)\n570,793\n(5,167,604)\n(14,041,305)(100,979,248)\n37,264,513\n(1,200,892)\n620\n(1,604,234)\n726,396\n(42,584,689)\n(2,438,456)\n(123,375,273) (110,815,990)\n(2,331,320)\n906,229\n11,305,914\nNet cash used in operating activities(17,519,327)\n1,957,210\n2,494,793Change in operating assets and liabilities\nFees and other receivables\nStudent loans and other assets\nTrade and other payables\nCash flows from investing activities\nPurchase of property, plant and equipment and intangible assets\nProceeds from disposal of property, plant and equipment\nPurchase of financial assets, at fair value through profit or loss\nProceeds from sale of financial assets, at fair value through profit or loss\nInterest received\nDeposits for investments\nNet cash used in investing activities(19,504,385)\n1,144\n(27,905,922)\n209,916,232\n1,895,682\n(199,448,729)(23,305,274)\n16,701\n(19,877,597)\n20,475,709\n1,223,842\n-\n(21,466,619) (35,045,978)\n(100,935,167) (136,442,597)FINANCIAL\nSTATEMENTS\nFor the financial year ended 31 March 2018Statement of Cash Flows\nCash flows from financing activities\nOperating grants received\nDevelopment grants received\nOther government grants received\nEndowment funds received\nDonations received119,679,898\n7,894,698\n5,701,529\n7,717,260\n3,283,821110,660,227\n11,117,430\n5,373,049\n11,761,780\n1,200,892\nCash provided by financing activities 140,113,378 144,277,206\nNet (decrease)/increase in cash and cash equivalents\nCash and cash equivalents at beginning of financial year17,711,592\n130,281,892(27,211,369)\n147,993,484\nCash and cash equivalents at end of financial year 147,993,484 120,782,115\n//\nSingapore Institute of Technology - Annual Report 2018\nSingapore Institute of Technology\nSIT@Dover, 10 Dover Drive, Singapore 138683\nTel: 6592 1189\nFax: 6592 1190\nAdmissions\nTel: 6592 1189\nEmail: Adm@SingaporeTech.edu.sg\nRegistrar’s Office\nTel: 6592 1189\nEmail: Registrar@SingaporeTech.edu.sg\nStudent Life\nTel: 6592 1189\nEmail: SLD@SingaporeTech.edu.sg\nAlumni Office\nTel: 6592 1189\nEmail: Alumni@SingaporeTech.edu.sg\nGiving to SIT\nTel: 6592 1189\nEmail: Advancement@SingaporeTech.edu.sg\nCentre for Career Readiness\nTel: 6592 1189\nEmail: CareerReadiness@SingaporeTech.edu.sg\nTechnology, Innovation and Enterprise\nTel: 6592 1189\nEmail: Innovate@SingaporeTech.edu.sg\nSingapore Institute of Technology - Annual Report 2018Singapore Institute of Technology\n10 Dover Drive,\nSingapore 138683\nRegistration No: 200917667D\nSingaporeTech.edu.sg"
}