{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2022-09/SIT_Cluster_HSS.pdf",
  "type": "pdf",
  "content": "2022\nAND SOCIAL\nSCIENCESHEALTH\nSIT AT\nA GLANCE\n^Source: 2020 Graduate Employment Survey 95%of Students Secured a\nJob Within Six Months ofCompleting Their Final Exam\n^\n$3,675Average Starting Salariesof Our Graduates\n^5Programme Clusters6Campuses\n6Overseas University Partners 38UndergraduateDegree Options\n>135Student Clubs,Committees, and Chapters\n>200Student Events and Activities\n01\nHealth and Social SciencesSITizen-DNA\nThinking Tinkerers\n• Fundamentally Sound\n• Practice-oriented\nAble to Learn,\nUnlearn and Relearn\n•Embracing Change\n• Learning Beyond University\nCatalysts for Transformation\n•Improving Efficiency\n• Creating Value Through Innovation\n•\nChallenging Status Quo\nGrounded in  the Community\n• Serving the Community Through\nKnowledge and Skills\n02Singapore Institute of Technology\n1Gan, KY . Ageing in Singapore in the Next 50 Years. Speech presented at: SG50 Scientific Conference on Ageing.\n(2015, Mar 19). Available from: https://www.moh.gov.sg/news-highlights/details/speech-by-mr-gan-kim-yong-\nminister-for-health-at-the-sg50-scientific-conference-on-ageing-on-19-march-2015 AN AGEING SOCIETY\nBy 2030, the number of people aged 65 and\nabove is projected to increase from 430,000 today to more than 900,000, and make up 20% of the population\n1. An ageing society\nwould mean a greater need for healthcare services and providers.WHY PURSUE\nHealth and\nSocial Sciences?\n03 Health and Social Sciences\nPROGRAMMES TO MEET THE\nNEEDS OF SOCIETY\nSIT offers entry-level honours degree\nprogrammes in Diagnostic Radiography, Dietetics and Nutrition, Physiotherapy, Radiation Therapy, Occupational Therapy, Speech and Language Therapy, as well as a post-registration honours degree in Nursing. Co-created with clinical partners and stakeholders, the curriculum fosters interprofessional learning and adopts a systems thinking approach where clinical practice education forms an integral part of the programme.MEANINGFUL AND\nREWARDING INDUSTRY\nYou can look forward to a fulfilling career,\nimpacting the lives of individuals and communities in hospitals, polyclinics, specialist centres, intermediate and long-term care facilities, schools, or social care industries.\n04Singapore Institute of Technology\nApplied Research\nOur students are given the opportunity to work on applied research projects with our faculty,\nhealthcare, and government organisations, to benefit the wider community. Such projects can also involve students and faculty members from multiple disciplines and address either clinical, professional, or community problems that require holistic solutions.\nVirtual Reality Mobility Training\n(VRMT)\nA team of Physiotherapy students are\ncollaborating with our Engineering and Infocomm Technology students and faculty members, as well as Ng Teng Fong General Hospital to design a Virtual Reality Mobility Training (VRMT) system. This will allow users such as patients with dementia, who cannot ambulate outside safely, to walk in an environment that is familiar to them while staying in a nursing home.Design Solutions for Special\nNeeds Classrooms and Furniture in Singapore\nAn SIT team from the Health and Social\nSciences, Engineering, and Business, Communication and Design clusters, worked with a social service agency to design appropriate seating that provides stability and manoeuvrability in the classroom for children with developmental disabilities. This will improve the engagement and learning of children with special needs in Singapore.\n05 Health and Social Sciences\nEnhancing Vocational Ability of\nPatients Through Augmented Reality Games\nOur Occupational Therapy and Infocomm\nTechnology faculty members have teamed up with Bizlink Centre Singapore Ltd to develop a gamified vocational rehabilitation platform using augmented reality (AR) for persons with cognitive problems. This will enable them to improve their vocational skills and undergo training in a fun and safe environment.\nEncouraging Seniors’ Use of\nDigital Tools\nIn collaboration with Tsao Foundation’s\nCommunity for Successful Ageing, our Nursing students and faculty members have produced video clips to guide seniors in using Zoom. This will encourage them to keep in touch with family and friends and participate in social activities.\nTeaming Up to Study the\nEffectiveness of Running Sandals\nA team of final-year Physiotherapy students\nwere part of a multidisciplinary collaboration with some engineering students and faculty members to study lower limb muscle activities using running sandals. The data collected could help allied health practitioners, especially physiotherapists, understand the risks and potential muscle strain runners could face when running using this minimalist footwear.\n06Singapore Institute of Technology\nChen Zhenqiang Kevin\nYear 2Diagnostic Radiography About myself\nI am an aspiring radiographer who enjoys playing the saxophone. My wife, daughter, and family members are my world. I would like to thank them for their support when I decided to embark on this career switch.\nBefore studying at SIT\nI was an education officer with the Ministry of Education at the primary level for a decade. Having an interest in the medical field since young, I seized the opportunity to pursue Diagnostic Radiography through the Career Conversion Programme (CCP).\nOne song to describe my SIT experience\n‘Try Everything’ by Shakira.\nBeing an adult learner\nBeginning at entry-level as a Year 1 undergraduate takes humility. Starting from scratch where your past experiences might not count for much is challenging. But I treat it as a second chance to do better and view this as a gateway to more employment opportunities.MEET KEVIN\nTip on having a school-life balance Plan your time well and don’t be too hard on yourself.\nSupport from SIT for Adult Learners\nFaculty members double up as  our academic advisors, and are part of our learning journey throughout.\nOne tip for prospective adult learners\nSeize every opportunity to be able to learn, unlearn, and relearn.\nClick here to watch my video.\nAt Changi General Hospital (CGH),\nwe’re committed to grooming the next generation of health professionals, which is why we have decided to take in SIT students through its clinical placement programme. Having students at CGH gives our staff a chance to support their development and personally mentor these up-and-coming health professionals. It has been rewarding to see the students develop, both professionally and personally, in their clinical placements.\nMR GABRIEL LEONG\nHead, Radiography\nChangi General Hospital\n07 Health and Social Sciences\nThe maturity, enthusiasm, and\nindeed, promising for our healthcare\nsector ahead.professionalism of SIT students isDiagnostic Radiography\nCampus Location\nSIT@Dover\nCareer Opportunities\nYou can be employed as a diagnostic\nradiographer in a variety of settings, such as:\n• Public and Private Hospitals\n•Private Clinics\n•Medical Centres\nThe Diagnostic Radiography programme is a\nfour-year, direct honours degree programme that prepares you for the role of a professional radiographer. It is the only diagnostic radiography programme offered by an autonomous university in Singapore.\nThe curriculum is developed in close\nconsultation with the radiography industry to ensure relevance and graduates’ employability. The programme is accredited by the Allied Health Professions Council (AHPC), thus enabling graduates to practise as professional radiographers in Singapore.\nCurriculum Highlights\n• Anatomy and Physiology\n•Patient Care and Safety\n• General Radiographic Practice•CT and MRI\n• Radiobiology and Radiation Protection• Image Interpretation•32-week Clinical Practice EducationClick here\nto find out more\n08Singapore Institute of TechnologyIn my work at the Dietetic & Food\nServices department in Changi General Hospital (CGH), we are responsible for providing dietary consultations to patients to support them on their journey to good health. Students can gain hands-on experience within the hospital setting to better understand and address the social determinants of health that impact our patients’ health outcomes. Through my observations, I see that\nMRS MAGDALIN CHEONG\nHead and Deputy Director\nDietetic and Food Services\nChangi General HospitalDietetics\nand Nutrition\nCampus Location\nSIT@Dover\nCareer Opportunities\nYou can be employed as a dietitian in a variety\nof settings, such as:\n• Public and Private Hospitals\n•Community Hospitals\n•Intermediate and Long-Term Care\nOrganisations, including Nursing Homesand Rehabilitation Centres\n• Private Practice\n• Polyclinics\nThe Dietetics and Nutrition programme is a\nfour-year, direct honours degree programme that addresses the growing demand for dietetic manpower in hospitals and intermediate long-term care (ILTC) settings in Singapore.\nAs the first dietetics degree programme to\nbe offered by an autonomous university in Singapore, this programme will provide you with evidence-based theoretical knowledge, research skills, and practical experience across all domains of dietetic practice (individual clinical case management, community and public health nutrition, and food service management).\nThe programme is designed to meet the\nacademic requirements and clinical competencies for graduate entry-level professional dietitians, based on international educational standards for professional dietetic practice. The curriculum is developed in close consultation with chief dietitians from major healthcare clusters in Singapore, to provide you with up-to-date and relevant knowledge, as well as specialised skills in all domains of dietetic practice.eager to learn, and we hope that they will\ncontribute to our local healthcare sector. SIT students are dedicated, passionate, and\nCurriculum Highlights\n•Nutrition Throughout the Lifespan\n• Nutritional Assessment\n• Nutrition, Health, and Disease•Community and Public Health Nutrition\n• Medical Nutrition Therapy•Communication Skills and\nNutritional Counselling\n• Honours Thesis\n•32-week Clinical Practice EducationClick here\nto find out more\n09 Health and Social SciencesThe SIT-UofG Nursing degree\nprogramme is designed to build on existing foundation knowledge learnt at a diploma level and refine students’ critical and leadership skills. SIT-UofG nursing students that I have interacted with have been highly engaged and motivated, and\nMS PAULIN KOH\nChief Nursing Officer\nMinistry of Health I am confident that they will raise the\ntheir skill sets and positive attitude. standard of nursing in Singapore with Nursing\nCampus Location\nSIT@Dover\nCareer Opportunities\nYou can pursue further career advancements in\nclinical practice, education, and management, in positions such as:\n•Nurse Clinician\n• Nurse Educator\n• Nurse Manager• Nurse Researcher\nThe SIT and University of Glasgow joint degree\nin Nursing is a two-year post-registration honours programme, jointly developed by both universities and accredited by the Singapore Nursing Board. Co-created and designed in partnership with stakeholders from healthcare institutions, nursing education partners, and the Ministry of Health (MOH), you will build on the foundation you have established through your nursing diploma at Nanyang Polytechnic or Ngee Ann Polytechnic.\nIn line with MOH’s Healthcare Industry\nTransformation Map, you will be equipped with critical, analytical and innovative skills, as well as leadership, research, teaching, and clinical competencies – much needed qualities for the new roles that you will be performing to meet the healthcare challenges Singapore faces.\nCurriculum Highlights\n•Health Assessment and Clinical Reasoning\n• Design Innovation\n•Principles and Practice of Population Health\n•Managing Long Term Conditions\nin Communities\n•Evidence-Based Practice\n•Electives (Palliative Care and Global Health)• Honours Thesis\n•Six-week Clinical Placements\n• Overseas Immersion Programme (OIP)Click here\nto find out more\n10Singapore Institute of TechnologyOccupational\nTherapy\nCampus Location\nSIT@Dover\nCareer Opportunities\nYou can be employed as an occupational\ntherapist in a variety of settings, such as:\n•Public, Private, and Community Hospitals\n•Intermediate and Long-Term Care\nOrganisations, including Nursing Homes,and Rehabilitation Centres\n•Private Practice Clinics and Consultancy\n• Government Agencies\n• Special Schools, Early Intervention, and\nChild Development Centres\nThe Occupational Therapy programme is a\nfour-year, direct honours degree programme that is designed to provide an excellent educational experience in the theory and practice of occupational therapy. Upon successful completion of academic modules and clinical practice education, you will have the knowledge, skills, and understanding to support contemporary development and delivery of occupational therapy, to meet the evolving needs of Singapore’s population.\nThe programme is accredited by the Allied\nHealth Professions Council (AHPC) and World Federation of Occupational Therapists (WFOT). This will enable graduates to practise as professional occupational therapists in Singapore and internationally, subject to local laws.\nCurriculum Highlights\n•Occupational Therapy Clinical Reasoning\n•Occupational Therapy Practice Skills\n•Occupational Therapy and Chronic Disease\nManagement with Older Adults\n• Play, School and Transition\n•Application of Psychopathology in\nOccupational Therapy\n• Occupational Therapy Entrustable\nProfessional Activities\n•30-week Clinical Practice EducationIt has been a pleasure for us to work closely with SIT faculty and students. Through their clinical placements at our organisation, we fi nd the students to be\nwell-informed and prepared for a career in the healthcare and social care sectors.\nand work experiences, coupled with an\nintrinsic motivation to see their students succeed. The relationship we have with the university is invaluable and critical to our effort to hire the best, who can assimilate in their future workplace.\nMR ABHIMANYAU PAL\nChief Executive Officer\nSPDThe dedication and commitment we see\ncommendable as they come with a\nunique blend of academic credentialsin the faculty members are also highly Click here\nto find out more\n11 Health and Social Sciences\nSIT’s clinical practice education is an\nimportant and valuable opportunity for both students and the healthcare industry. It allows the students to put what they have learnt into real practice. At the same time, it also gives healthcare institutions a chance to share real-life experiences with the students. Our journey with the SIT Physiotherapy students has been very encouraging and positive.\nThis has led to many of them joining Tan Tock Seng Hospital as their first career, and we are happy to be part of their professional journey even before they graduate.\nMR CHRISTOPHER NG THONG LIAN\nHead of Department\nSenior Principal Physiotherapist\nTan Tock Seng HospitalPhysiotherapy\nCampus Location\nSIT@Dover\nCareer Opportunities\nYou can be employed as a physiotherapist in a\nvariety of settings, such as:\n• Public and Private Hospitals\n•Intermediate and Long-Term Care\nOrganisations, including CommunityHospitals, Nursing Homes, andRehabilitation Centres\n• Polyclinics\n• Private Practice• Government Agencies• Sports and Military Settings• Special Schools\nThe Physiotherapy programme is a four-\nyear, direct honours degree programme. The programme aims to train you to become a professional physiotherapist who is theoretically-grounded and clinically-oriented to practise autonomously in different specialities of physiotherapy.\nYou will have the opportunity to gain clinical\nexperience through clinical attachments with various major hospitals and healthcare facilities in Singapore. Mid-career individuals with prior degree qualification in a science-related field may apply for the Physiotherapy programme under the Career Conversion Programme (CCP). The programme is accredited by the Allied Health Professions Council (AHPC), thus enabling graduates to obtain direct registration to practise as physiotherapists in Singapore.\nCurriculum Highlights\n• Neurological Physiotherapy\n•Musculoskeletal Physiotherapy\n•Cardiopulmonary Physiotherapy\n•Chronic Disease Rehabilitation\n•Exercise Physiology and Clinical\nExercise Prescription\n•Physiotherapy Across Lifespan\n• Health Promotion and Population Health\n•30-week Clinical Practice EducationThe students demonstrated a high level of\nand a strong passion in acquiring new skills.professionalism, a positive learning attitude,Click here\nto find out more\nRadiation Therapy\nCampus Location\nSIT@Dover\nCareer Opportunities\nYou can be employed as a radiation therapist\nin the public or private sector to serve in a radiation therapy centre.\nThe Radiation Therapy programme is a four-\nyear, direct honours degree programme that prepares you for the role of a professional radiation therapist. As the only radiation therapy degree programme offered in Singapore, the curriculum is developed in close consultation with the radiation therapy industry to ensure relevance and graduates’ employability.\nThe programme is accredited by the\nAllied Health Professions Council (AHPC), thus enabling graduates to obtain direct registration to practise as radiation therapists in Singapore.\nCurriculum Highlights\n•Patient Care and Safety\n•Cancer Pathology\n• Radiation Oncology\n•Principles of Radiation Therapy\n• Advances in Radiation Therapy•32-week Clinical Practice Education\n12Singapore Institute of Technology\nGraduates are prepared for their clinical\npractice from year one and ready to enter the exciting and rewarding Radiation Therapy profession upon graduation. Beyond producing good, competent radiation therapists, the programme has also nurtured empathetic and strong communicators with a heart for the patients they serve. The curriculum is future-oriented, interdisciplinary, and interprofessional, preparing them to become visionary leaders and compassionate radiation therapists of tomorrow.\nDR MICHAEL WANG\nChairman\nDivision of Radiation Oncology\nSenior Consultant\nNational Cancer Centre SingaporeThe SIT Radiation Therapy programme is\nclosely aligned to industry practices.\nStudents admitted to the Radiation Therapy programme\nmay be required to have secured a sponsorship from their employer at the point of enrolment. Refer to SingaporeTech.edu.sg for updates.Click hereto find out more\n13 Health and Social Sciences\nSpeech and\nLanguage Therapy\nCampus Location\nSIT@Dover\nCareer Opportunities\nYou can be employed as a speech and language\ntherapist in a variety of settings, such as:\n•Child Development Centres\n• Special Schools\n• Social Service Agencies• Acute Hospitals•Community Hospitals\n•Intermediate and Long-Term Care\nOrganisations, including Nursing Homesand Rehabilitation Centres\n• Private Practice\nThe first Speech and Language Therapy\nundergraduate degree programme in Singapore has been carefully developed with input from senior speech and language therapy practitioners across the local public healthcare, community care, social services, and private sectors.\nThe four-year, direct honours degree\nprogramme serves to meet the national needs by training a new generation of highly-competent and market-ready speech and language therapists, who will help individuals with communication, feeding, and swallowing difficulties across lifespans. The programme will seek accreditation from the Allied Health Professions Council (AHPC), thus enabling graduates to practise as professional speech and language therapists in Singapore.\nCurriculum Highlights\n•Communication Development\n•Communication Disorders in Children\n• Dysphagia Management in Adults\n•Fluency and Related Disorders\n• Voice Sciences and Disorders•Paediatric Feeding and Swallowing\nDisorders\n•30-week Clinical Practice EducationAs the only local, autonomous university that offers a bachelor’s degree in Speech and Language Therapy, this programme will provide students with a robust and relevant curriculum that caters to the rapidly changing landscape of Singapore’s healthcare sector. The faculty, who are also clinical practitioners themselves, are well renowned in their respective fields of speech-language therapy, and students will be able to learn from their expertise.\nAs part of their clinical placements,\nstudents will be exposed to interprofessional work and direct patient care experiences, which are invaluable.\nMS MELISSA CHUA\nHead and Senior Principal Speech Therapist\nSengkang General HospitalStudents will be able to contextualise their\nwhich no class or textbook can replicate. learning through the clinical placements, Click here\nto find out more\n14Singapore Institute of Technology\nNafisah Binte Zulkifli\nYear 2Speech and Language TherapyAbout myself\nI truly love writing. I’m currently working on my second compilation of poetry and prose! I keep these compilations for myself, but I do share my work with others occasionally.\nOne common myth about SIT\nThat it is for those who didn’t do well in their GCE ‘A’ Levels or Polytechnic diploma.\nPursuing Speech and Language Therapy\nI hope to help others enjoy and experience life more by helping them with their reading, writing, and speaking skills.\nOne thing I wished I knew when choosing\nSpeech and Language TherapyThat I would need to learn about children and adults simultaneously and learn to switch code when speaking to different groups of people.MEET NAFISAH\nOne tip for prospective students Socialise and make friends, especially with your coursemates. It will make your university experience more fun.\nAdvice to my younger self\nDon’t take your losses too hard. In a couple years, you might realise they were “wins” all along!\nshare my work with others occasionally.\nOne common myth about SIT\nThat it is for those who didn’t do well in their\nGCE ‘A’ Levels or Polytechnic diploma.\nlife more by helping them with their reading,\nwriting, and speaking skills.\nOne thing I wished I knew when choosing\nSpeech and Language Therapy\nThat I would need to learn about children and\nadults simultaneously and learn to switch code\nwhen speaking to different groups of people.\nClick here to watch my video.\n15 Health and Social SciencesWe adopt an aptitude-based approach in assessing applicants\nfor admission. This means we look beyond your grades and\nsee you as an individual with diverse qualities, talents, and life experiences. We are interested in who you are, and how you can contribute to the community and industry.\nWe look out for…\nAcademic Proficiency and Prior Learning\nRelevant Work Experience\nRelated Exposure and Achievements\nPassion and Aptitude\nPerformance During Interviews START YOUR\nNEXT STEP HERE\nSubmit and check your application status via Admission.SingaporeTech.edu.sg.\nFor application dates and deadlines, visit SingaporeTech.edu.sg.\n16Singapore Institute of TechnologyADMISSIONS\nTIMELINE\nAdmissions\nSIT ScholarshipApplication Opens\nSIT Scholarship Application OpensMID-JAN – MID-MAR\nIf you are successful, accept our offer!BY JOINT ACCEPTANCE\nDEADLINEShortlisted applicants will be assessed\nfor Admissions and a Scholarship concurrently. For specific degree programmes, you may have to submit portfolios or essays, and/or be assessed through written or technical tests.FEB – MAY\nFINANCIAL ASSISTANCE APPLICATION OPENS\nWhen you have accepted our offer, you will receive a pre-matriculation package.JUNECheck your Admissions Application Outcome. Students awarded Scholarships will receive their offers concurrently. APR – MAY\n17\nHealth and Social SciencesGCE ‘A’ Level/IB Diploma/NUS High School DiplomaAdmission Requirements\nGood pass in two H2/HL subjects (Biology,\nChemistry, Physics, and Mathematics)DEGREE PROGRAMME GCE ‘A’ LEVEL NUS HIGH SCHOOL\nDIPLOMAIB DIPLOMA\nDiagnostic Radiography\nRadiation Therapy*\nPhysiotherapy\nSpeech and Language TherapyGood pass in two H2/HL subjects (Biology, Chemistry, Physics,\nSports, Exercise and Health Science, and Mathematics), one\nof which must be Chemistry\nGood pass in two H2/HL subjects, one of which\nmust be Biology, Chemistry, Physics, Sports,\nExercise and Health Science, or Mathematics\nGood pass in two H2/HL subjects (Biology,\nChemistry, Physics, Sports, Exercise and Health\nScience, and Mathematics)\nGood pass in two H2/HL subjects, with a good\npass in H1/SL or H2/HL Biology, Chemistry,\nPhysics, Mathematics, or EconomicsDietetics and Nutrition\nOccupational Therapy\n•GCE ‘A’ Level applicants should have obtained passes in at least two H2 Level subjects and offer ed General\nPaper (GP) or Knowledge & Inquiry (KI) in the same sitting.\n•International Baccalaureate (IB) appl\nicants should have obtained a minimum grade five for at least two HL\nand one SL subjects, and the IB Diploma.\n•NUS High applicants should have obtained the NUS High School Diploma.\nAppl\nicants with the above qualifications are also required to fulfil the Mother Tongue Language (MTL)\nrequirements stipulated by the Ministry of Education.\nApplicants will also need to fulfil language requirements. Please refer to subsequent pages.\n* Students admitted to the Radiation Therapy programme may be required to have secured a sponsorship from their employer\nat the point of enrolment.\nFor up-to-date information, please refer to SingaporeTech.edu.sg.\n18\nSingapore Institute of TechnologyDiploma from any local PolytechnicAdmission Requirements\nApplicants with other qualifications should complete at least 12 years of formal education deemed as\nacceptable, equivalent qualifications to be considered for admission.\nApplicants will also need to fulfil language requirements. Please refer to subsequent pages.\n* Please refer to SingaporeTech.edu.sg for the detailed list of relevant diplomas.\n# Students admitted to the Radiation Therapy programme may be required to have secured a sponsorship from their employer\nat the point of enrolment. Refer to SingaporeTech.edu.sg for updates.\nFor up-to-date information, please refer to SingaporeTech.edu.sg.DEGREE PROGRAMME DIPLOMA FROM ANY LOCAL POLYTECHNIC\nDiagnostic Radiography\nCompleted a relevant Diploma*Dietetics and Nutrition\nOccupational TherapyPhysiotherapyRadiation Therapy\n#\nSpeech and\nLanguage Therapy\nNursing• Be qualified as a Register\ned Nurse\n• Hold current r\negistration with the Singapore Nursing Board\n(SNB)\n• Completed an SNB-accred\nited Diploma in Nursing programme\nin Singapore. Only these two diplomas are accredited:\n– Nanyang Polytechnic: Diploma in Nursing\n–\nNgee Ann Polytechnic: Diploma in Healt\nh Sciences\n(Nursing)/Diploma in Nursing\n19\nHealth and Social SciencesOther degrees will be considered on a case-by-case basis.\nApplicants will also need to fulfil language requirements. Please refer to subsequent pages. For up-to-date information, please refer to SingaporeTech.edu.sg.Other DegreesAdmission Requirements\nSuccessful applicants who have a Science-related honours degree from a recognised\nuniversity may be offered a place in the two year, eight-month accelerated Physiotherapy Career Conversion Programme (CCP).\nEXAMPLES OF SCIENCE-RELATED HONOURS DEGREE\n•Exercise and Sports Sciences\n•Anatomy and Physiology\n•Nursing and Medicine\n•Life Sciences/Biomedical Sciences\n•Other Healt\nh Sciences\n20\nSingapore Institute of TechnologyDietetics and Nutrition, Occupational Therapy, and PhysiotherapyLanguage Requirements\nQUALIFICATION SUBJECT Minimum English Requirement\nApplicants to these Health Sciences programmes are also required to fulfil one of the following English requirements by the application closing date. The Allied Health Professions Council (AHPC) mandates the minimum English language proficiency (ELP) requirements for the Allied Health programmes to enable our graduates to practise in the respective Allied Health professions.\nGCE ‘O’ Level English as First Language C5\nGCE ‘A’ LevelGeneral Paper/\nKnowledge & InquiryD\nInternational Baccalaureate (IB)SL/HL English A: Language & Literature or\nSL/HL English A:\nLiterature or\nSL: Literature &\nPerformance4\nPolytechnic Foundation Programme (PFP)English modules C+\nNUS High School DiplomaEL4101 or higher (EL5101, 6103) modulesC+\nIELTS (Academic) IELTS 7.0 (for all components)\nTOEFL TOEFL250 marks for computer-based test,\nor 600 marks for paper-based test,\nor 100 marks for internet-based test\nOET OET B\nApplicants to all Health Sciences Programmes (Diagnostic Radiography, Dietetics and Nutrition, Nursing,\nOccupational Therapy, Physiotherapy, Radiation Therapy, and Speech and Language Therapy), are required to undergo a pre-enrolment medical examination prior to the commencement of their studies at SIT and should be certified physically and mentally fit for the programme by the examining medical doctor. Please refer to the Mandatory Medical Clearance here – SingaporeTech.edu.sg/admissions/undergraduate/requirements .\nApplicants who hold a first degree from Singapore, Australia, Canada (except Quebec), New Zealand, Republic of Ireland, South Africa, United Kingdom, or the United States of America will be deemed to have fulfilled the stipulated English Language requirement for the programme.\n21\nHealth and Social SciencesDiagnostic Radiography and Radiation TherapyLanguage Requirements\nQUALIFICATION SUBJECT Minimum English Requirement\nApplicants to these Health Sciences programmes are also required to fulfil one of the following English requirements by the application closing date. The Allied Health Professions Council (AHPC) mandates the minimum English language proficiency (ELP) requirements for the Allied Health programmes to enable our graduates to practise in the respective Allied Health professions.\nGCE ‘O’ Level English as First Language C6\nGCE ‘A’ LevelGeneral Paper/\nKnowledge & InquiryD\nInternational Baccalaureate (IB)SL/HL English A: Language & Literature or\nSL/HL English A:\nLiterature or\nSL: Literature &\nPerformance4\nPolytechnic Foundation Programme (PFP)English modules C+\nNUS High School DiplomaEL4101 or higher (EL5101, 6103) modulesC+\nIELTS (Academic) IELTS 6.0 (for all components)\nTOEFL TOEFL 60 marks for internet-based test\nOET OET B\nApplicants to all Health Sciences Programmes (Diagnostic Radiography, Dietetics and Nutrition, Nursing,\nOccupational Therapy, Physiotherapy, Radiation Therapy and Speech and Language Therapy), are required to undergo a pre-enrolment medical examination prior to the commencement of their studies at SIT and should be certified physically and mentally fit for the programme by the examining medical doctor. Please refer to the Mandatory Medical Clearance here – SingaporeTech.edu.sg/admissions/undergraduate/requirements .\nApplicants who hold a first degree from Singapore, Australia, Canada (except Quebec), New Zealand, Republic of Ireland, South Africa, United Kingdom, or the United States of America will be deemed to have fulfilled the stipulated English Language requirement for the programme.\n22\nSingapore Institute of TechnologySpeech and Language TherapyLanguage Requirements\nQUALIFICATION SUBJECT Minimum English Requirement\nApplicants to these Health Sciences programmes are also required to fulfil one of the following English requirements by the application closing date. The Allied Health Professions Council (AHPC) mandates the minimum English language proficiency (ELP) requirements for the Allied Health programmes to enable our graduates to practise in the respective Allied Health professions.Minimum Mother Tongue Language (MTL) Grade Required\n*\nGCE ‘O’ LevelEnglish as First\nLanguageA2Higher Mother Tongue\n(HMTL) – C6/\nMother Tongue\nLanguage (MTL) – C5\nGCE ‘A’ LevelGeneral Paper/ Knowledge & InquiryBH1 Mother\nTongue Language\n(MTL) – E\nInternational Baccalaureate (IB)SL/HL English A: Language & Literature or\nSL/HL English A:\nLiterature or\nSL: Literature &\nPerformance5HL/SL Mother Tongue\nLanguage (MTL) A:\nLiterature or Language\nand Literature – 4\nPolytechnic Foundation Programme (PFP)English modules A –\nNUS High School DiplomaEL4101 or higher (EL5101, 6103) modulesB –\nIELTS (Academic) IELTS8.0, and no less than 7.5,\nfor all components–\nTOEFL TOEFL 110 marks for internet-based test –\nOET OET 3 Grade As and 1 Grade B –\nApplicants to all Health Sciences Programmes (Diagnostic Radiography, Dietetics and Nutrition, Nursing,\nOccupational Therapy, Physiotherapy, Radiation Therapy, and Speech and Language Therapy), are required to undergo a pre-enrolment medical examination prior to the commencement of their studies at SIT and should be certified physically and mentally fit for the programme by the examining medical doctor. Please refer to the Mandatory Medical Clearance here – SingaporeTech.edu.sg/admissions/undergraduate/requirements.\nApplicants who hold a first degree from Singapore, Australia, Canada (except Quebec), New Zealand, Republic\nof Ireland, South Africa, United Kingdom, or the United States of America will be deemed to have fulfilled the stipulated English Language requirement for the programme.\n* Applicants to the Speech and Language Therapy programme are required to fulfil both the English and Mother Tongue Language (MTL) requirements as stated in the table above.\n23 Health and Social Sciences\nGet a chance to study at SIT’s\nnew campus situated in the\nheart of Punggol Digital District.\nClick here to find out more.\nHealth and Social Sciences 23\nYOU CAN SEE\nYOUR FUTURE\nFROM HERE\n•Campus-in-a-Park\n•Smart and Sustainable University\n•Companies can tap SIT’s applied\nlearning and research capabilities\n•Closer Industry Partnership withCollaboration Loop linking SIT andJTC buildings\n•Opportunities to work on real-worldbusiness problems\n24Singapore Institute of TechnologySO, WHO’S READY\nFOR AN ADVENTURE?When you become a SITizen, you join a\ngrowing pool of successful alumni.\nIf you are ready to begin the application\nprocess and want to learn more, visitSingaporeTech.edu.sg/Admissions .TAKE YOUR\nNEXT STEP HERE\nCONTACT US\n© December 2021.\nAll information is accurate at time of print.SIT reserves the right to amend the information without prior notice. For the most up-to-date information, please visit SingaporeTech.edu.sg.SIT@DOVER\n10 Dover Drive, Singapore 138683\nSIT@NP BUILDING\nNgee Ann Polytechnic\n537 Clementi Road, Singapore 599493\nSIT@NYP BUILDING\nNanyang Polytechnic172A Ang Mo Kio Avenue 8, Singapore 567739 (beside Blk Q of NYP campus)\nSIT@RP BUILDING\nRepublic Polytechnic43 Woodlands Avenue 9, Singapore 737729\nSIT@SP BUILDING\nSingapore Polytechnic510 Dover Road, Singapore 139660\nSIT@TP BUILDING\nTemasek PolytechnicBlk 29B Tampines Avenue 1, Singapore 528694LOCATE US SINGAPORE INSTITUTE OF TECHNOLOGY\nSIT@Dover, 10 Dover Drive,\nSingapore 138683\n+65 6592 1189 (Main Line)\nSTUDENT ADMISSIONS\n+65 6592 1136\nAdm@SingaporeTech.edu.sg (Undergraduate Programmes)\nAdm.Postgrad@SingaporeTech.edu.sg (Postgraduate Programmes)\nFINANCIAL ASSISTANCE\nAND SCHOLARSHIP MATTERS\n+65 6592 1136\nFAS@SingaporeTech.edu.sg\nCENTRE FOR CAREER READINESS\n+65 6592 8150\nCareerReadiness@SingaporeTech.edu.sg\nDEGREE PROGRAMMES\n+65 6592 2021\nAcdPrg@SingaporeTech.edu.sg\nFINANCE, BILLINGS, AND GIRO\n+65 6592 8149\nStudentFinance@SingaporeTech.edu.sg\nREGISTRAR’S OFFICE\n+65 6592 2091\nRegistrar@SingaporeTech.edu.sg\nSTUDENT EVENTS, ACTIVITIES, AND CLUBS\n+65 6592 1191\nSLD@SingaporeTech.edu.sg\nAPPLIED RESEARCH,  INNOVATION & ENTERPRISE\n+65 6592 2723\nInnovate@SingaporeTech.edu.sg\nGIVING TO SIT\n+65 6592 1138\n+65 6592 1094\nAdvancement@SingaporeTech.edu.sg\nSINGAPORETECH.EDU.SGSingapore Institute of Technology\nSIT@Dover, 10 Dover Drive,\nSingapore 138683SingaporeTech\n@SingaporeTech@SingaporeTech"
}