{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2023-09/AR2023-Industry.pdf",
  "type": "pdf",
  "content": "Industry\nSIT has developed thriving and symbiotic partnerships with industry in formulating and delivering\nits education and research programmes. Industry involvement is evident and sustained in SIT’s\neducational, applied research and innovation activities. The University also works closely with\nindustry partners to support industry’s growth, transform work processes, move up the innovation\nvalue chain, and develop manpower capabilities.\nSIT’s industry-focused learning and research efforts position us well to meet industry demands\nand the lifelong learning needs of the future workforce.\nCHAMPIONING LIFELONG LEARNING\nSINGAPORE’S FIRST COMPETENCY-BASED\nSTACKABLE MICRO-CREDENTIALS PATHWAY\nSIT has partnered with NCS, Singtel, Singapore Computer Society, and 3 polytechnics (Nanyang Polytechnic,\nSingapore Polytechnic and Temasek Polytechnic) to offer Singapore’s first Competency-based Stackable\nMicro-credentials (CSM) degree pathway for in-employment learners.\nThe CSM degree pathway is piloted through the Bachelor of Science with Honours in Applied Computing\nprogramme and comprises micro-credentials, a workforce essentials component and a capstone project.\nThe pathway allows in-employment learners to earn micro-credentials, or qualifications in specialisations\nsuch as cybersecurity, software engineering and network systems, to complete their degree. Separately,\nlearners could also just subscribe to each micro-credential as a standalone, which would equip them with\nthe necessary competencies to start pivoting to new job opportunities.\nThe micro-credentials will be delivered via a combination of asynchronous and synchronous modes, augmented\nby face-to-face sessions for practical and laboratory experiments, allowing learners the flexibility to personalise\ntheir learning journey while managing multiple commitments.\nThe competency-based education approach in the CSM degree pathway ensures learners acquire both\nknowledge and skills, as well as the competency to apply them at work, empowering them to stay\nrelevant in their industries. The first intake in September 2023 comprises mainly in-employment learners\nfrom Singtel and NCS.\nAn MOU signing ceremony was held on 28 November 2022 between SIT and partners — NCS, Singtel, Singapore\nComputer Society, Nanyang Polytechnic, Singapore Polytechnic, and Temasek Polytechnic — to launch the CSM\ndegree pathway.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202332\nALIGNED WITH INDUSTRY NEEDS\nSIT strives to develop relevant and timely courses and\nprogrammes to meet industry needs through its lifelong\nlearning unit, SITLEARN Professional Development. In\n2022, more than 4,000 CET training places were offered\nto upskill/reskill learners.\nPIONEER BATCH: POSTGRADUATE\nDIPLOMA IN SONOGRAPHY\nSIT is the first autonomous university to offer a Postgraduate\nDiploma in Sonography to meet the demand for skilled\nsonographers in allied health. Modules can be taken\nindividually or be stacked towards a Postgraduate Certificate\nor Diploma. Since 2019, over 40 allied health professionals\nhave embarked on this specialised programme. In November\n2022, the pioneer batch of 5 learners graduated with a\nPostgraduate Diploma in Sonography.\nINAUGURAL BATCH: POSTGRADUATE\nCERTIFICATE IN URBAN RAILWAY\nTECHNOLOGY\nIn collaboration with Singapore Rail Academy, SBS Transit,\nand SMRT Corporation, SIT launched the Postgraduate\nCertificate in Urban Railway Technology (PGCert URT)\nin 2021. Designed for engineering professionals in the\nlocal rail industry, the programme equips learners with\nspecialised skills in the planning and management of railway\nassets. The inaugural batch of 11 learners completed the\nprogramme in December 2022, while the second batch of\n15 learners commenced the programme in January 2023.\nSKILLSFUTURE CAREER TRANSITION\nPROGRAMME (SCTP) IN DESIGN\nINNOVATION\nIn 2022, SIT launched the SkillsFuture Career Transition\nProgramme (SCTP) in Design Innovation. The SCTP supports mid-career individuals in gaining industry skills\nand expanding employment prospects through project\nopportunities and career support. The first cohort of 7\nlearners worked on real-life application projects with\nindustry partner Purely Fragrances. They gained skills and\nknowledge on the key drivers of innovation and developed\ninnovative solutions for new product launches.\nELECTRICAL SAFETY SYMPOSIUM 2023\nSIT’s maiden Electrical Safety Symposium held at SIT@\nDover on 4 January 2023 drew over 260 attendees.\nThe event featured industry experts who shared best\npractices in preventing electrical-induced injuries and\nfire hazards. The full-day symposium featured speakers\nfrom the Energy Market Authority, National Fire and\nEmergency Preparedness Council, Ministry of Manpower,\nON Engineers, The Institution of Engineering and\nTechnology, Singapore Civil Defence Force, Singapore\nBattery Consortium, DEHN Asia Pacific, SJ Thames,\nSunlight Electrical and SIT.\nPARTNERSHIP WITH APPLIED\nMATERIALS TO SUPPORT FUTURE-\nREADY WORKFORCE\nApplied Materials South East Asia Pte. Ltd. and SIT\nsigned an MOU to provide CET programmes to Applied\nMaterials employees. The aim is to contribute to the\nmanpower capability building of the local semiconductor\nindustry and its ecosystem. The learning programmes\nare customised and offered through short courses and\nstackable postgraduate modules related to Industry 4.0\nconcepts, such as artificial intelligence, data engineering,\nthe Internet of Things, machine learning and smart\nfactory. To date, over 200 Applied Materials employees\nhave participated in courses offered by SIT.\nMOU signing between Applied Materials and SIT in July 2022. (Photo: Applied Materials South East Asia)33\nINDUSTRY\nGROOMING WORK-READY TALENTS\nA WINDOW OF OPPORTUNITIES\nTHROUGH INTEGRATED WORK STUDY\nPROGRAMME (IWSP)\nThe Integrated Work Study Programme (IWSP) is a\nhallmark feature of SIT’s degree programmes, where\nT-UP EAGLES AWARDS: RECOGNISING\nIWSP EXCELLENCE\nSIT has been partnering with the Agency for Science,\nTechnology and Research (A*STAR) to engage local\nenterprises to provide industry R&D IWSP opportunities\nfor its students. The A*STAR-SIT Technology for Enterprise\nCapability Upgrading (T-Up)/IWSP collaboration enables\nlocal enterprises to build their in-house R&D capabilities\nwith the researchers seconded from A*STAR, while the\nSIT’s Centre for Career Readiness (CCR) grooms students to be work-ready employees who contribute to their\norganisations from day one. It boosts students’ employability through initiatives such as work attachments, career\nevents and career mentorship programmes.\nstudents undertake up to 12 months of work attachment\nrelevant to their course of study. The longer duration\nallows students to apply what they have learned in real\nwork situations. In AY2022, about 1,900 SIT students\nwent for their IWSP with opportunities offered by more\nthan 750 industry partners.\nA*STAR researchers will mentor and work with the IWSP\nstudents attached to the company.\nIn 2022, the newly-introduced T-Up Eagles Awards\ncommended 4 SIT student innovators who have excelled\nin their work attachments at local enterprises under the\nT-Up/IWSP partnership. As of AY2022, the partnership has\nseen 16 completed T-Up/IWSP cases with the participation\nof 21 students from various degree programmes.\nCAREER NEXUS 2023: NETWORKING\nWITH PROSPECTIVE EMPLOYERS\nHeld on 1 February 2023 at the Sands Expo and\nConvention Centre, Career Nexus organised by CCR\ngathered about 2,000 students and representatives from 205 companies, far exceeding the participation\nrate at the last physical event in 2020. The annual career\nfair is a platform for students to network with company\nrepresentatives, explore IWSP options, and seek full-time\nemployment opportunities.  Thriving conversations between job seekers and participating companies at Career Nexus 2023.\nT-Up EAGLES award winners with Ms Chan Lai Fung, Permanent Secretary (National Research and Development) and Chairman,\nA*STAR; Professor Chua Kee Chaing, SIT President; and company representatives. (Photo: A*STAR)\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202334\nNURTURING FINTECH TALENTS\nIn November 2022, SIT inked 7 MOUs with 6 financial\ninstitutions and an IT service provider at the Singapore\nFintech Festival to jointly nurture fintech talents. The\npartners are AIA Singapore, DBS Bank, Oversea-Chinese\nBanking Corporation (OCBC), Prudential Singapore,\nStandard Chartered Bank, United Overseas Bank (UOB)\nand Infosys.\nThis partnership signifies the commitment to jointly\nnurture talents in the Applied Computing (Fintech FORGING STRATEGIC\nCOLLABORATIONS WITH INDUSTRY\nRobust engagement with industry through collaborations is pivotal in exchanging knowledge, deepening applied\nlearning and catalysing innovations. In AY2022, SIT forged several key MOUs and partnerships with the industry in\nvarious areas.INDUSTRY MENTORSHIP\nPROGRAMME (IMP)\nSIT continues to organise the Industry Mentorship\nProgramme (IMP) with Young NTUC to prepare students\nfor their future careers. Through the programme, students are paired with industry mentors for 5 months to receive\nindustry-specific guidance, develop career paths, and\nbroaden their perspectives on career opportunities. Since\nits inception in 2018, the IMP successfully completed\nits 6th run in June 2023, and the programme benefitted\nclose to 500 students from 20 degree programmes.\nspecialisation) degree programme. Through the\nMOU, the industry partners will participate in the co-\ndevelopment of the degree programme and provide\nrelevant work attachments and learning opportunities in\nthe SkillsFuture Work-Study Degree (WSDeg) pathway\nunder the Term-In Term-Out (TITO) model. SIT students\nand faculty can also participate in Fintech projects\nwith industry partners to deliver integrated solutions\nthat address real-world business challenges. A total of\n14 students were awarded placements in the WSDeg\npathway in AY2022.Mentors and mentees from the 6th run of the Industry Mentorship Programme at the IMP Appreciation Night.\nKey representatives at the MOU signing ceremony to collaborate on the WSDeg pathway.35\nINDUSTRY\nDRIVING HEALTHCARE INNOVATION\nIn September 2022, SingHealth and SIT extended their\npartnership to co-develop education programmes and\ncollaborate on healthcare research till 2026. Both parties\nwill focus on solutions to improve healthcare operations\nand processes for early diagnosis and intervention, and\nto bring healthcare services from the hospitals closer to\nhome. The partnership will also look at developing a Living\nSTRENGTHENING R&D EFFORTS IN\nLAND TRANSPORT\nThe SMRT-SIT Transport Living Lab (TLL) was\nestablished in November 2022 to co-create land\ntransport solutions to address SMRT’s operational\nproblems. SIT will be an extension of SMRT’s\nLab in the Punggol and Sengkang estates, leveraging\nSingHealth’s healthcare facilities to provide an authentic\nand hands-on experience for SIT students. Another area\nis the experimentation and co-development of new\nhealthcare innovations. There will be opportunities for\nSIT students and academic staff to work with SingHealth\ninnovators on tackling real-world healthcare challenges\nthrough applied research and innovation.\nengineering arm, while SMRT offers its infrastructure\nand facilities to SIT academic staff and students for\napplied learning and research. The collaboration\nwill also explore applied research opportunities and\nstaff exchange initiatives, thereby strengthening the\ntalent pipeline for SMRT and the land transportation\nindustry, and upskilling the SMRT workforce. The SingHealth-SIT MOU signifies a multi-faceted collaboration to co-develop education and research programmes.\n(Photo: SingHealth)\nThe partnership with SMRT saw the set-up of the Transport Living Lab, which will provide mutual benefits for both organisations.\n(Photo: SMRT Corporation)\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202336\nDEVELOPING EXCELLENCE IN\nDISTRICT COOLING\nGlobal energy and services group ENGIE and SIT inked\nan MOU in July 2022 to jointly develop a district cooling\ncentre of excellence in Singapore. The ENGIE-SIT District\nCooling Centre of Excellence will catalyse innovation in\ncooling solutions across the Asia-Pacific. The partnership\nA BOOST TO SINGAPORE’S MARITIME\nECOSYSTEM\nLeading classification society DNV and SIT signed a 3-year\nMOU in September 2022 to progress net-zero ambitions\nin Singapore’s maritime sector. Both parties will focus on\nadvancing zero-emission and autonomous ships; shore\nremote control and simulation centres; shore charging\nand future fuel bunkering infrastructure.\nincludes joint development and funding of applied\nresearch, as well as knowledge exchange between\nENGIE Southeast Asia, ENGIE Lab Singapore and SIT.\nIt also covers work attachment and commercial district\ncooling system (DCS) development opportunities for\nSIT students. ENGIE is currently building a DCS plant\nat SIT’s Punggol Campus.\nThe collaboration combines SIT’s applied learning\npedagogy and DNV’s Simulation Trust Centre to\nconduct lessons on optimising ship system design for\nhydrodynamics, energy, emissions and safety management.\nStudents will have opportunities to work on final-year\nprojects in maritime technology applications, undertake\nIWSP at DNV, and co-organise student competitions.An MOU signing ceremony was held in Singapore, attended by key representatives from ENGIE and SIT. (Photo: ENGIE)\nThe collaboration between DNV and SIT aims to promote maritime decarbonisation and digitalisation. (Photo: DNV)37\nINDUSTRY"
}