{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/RCBJ%20Give%20SITizens%20Support.pdf",
  "type": "pdf",
  "content": "In 2015, the Rotary Club of Bugis Junction (RCBJ) made its\nfirst gift to the Singapore Institute of Technology (SIT) to establish the Rotary Club of Bugis Junction Outstanding Student Award. This year, to commemorate the club’s 20th anniversary, RCBJ members came together to raise slightly more than $300,000 to establish the Rotary Club of Bugis Junction Endowment Fund at SIT.\nTogether with the government matching grant that their\ngift attracts, this gift will result in an endowed fund that will enable SIT to award one Rotary Club of Bugis Junction Scholarship (valued at $10,000) and two Rotary Club of Bugis Junction Bursaries (valued at $5,000 each) annually, beginning in AY 2017/18, and in perpetuity. In addition, the gift will also support the Outstanding Student Award (which recognises the recipient for outstanding leadership as well as contributions beyond academic studies to SIT or the community) in perpetuity.\nThanking RCBJ at their 20th Anniversary Celebration\nDinner for their gift, Prof Tan Thiam Soon, President, SIT, highlighted that apart from the Club’s generous philanthropic support, it was also nurturing SITizens through its sponsorship of the Student Rotaract Club at SIT, and through its collaboration with SIT’s Enterprise and Innovation Hub to mentor students who are keen to start their own businesses.\nSaid Prof Tan, “The spirit of philanthropy and service\nas exemplified by the Club’s members will inspire our students to become active and contributing members of the community in future.”SiTIZEN  |  08/12\nPrestigious scholarship made possible by the\nSingapore Chinese Chamber of Commerce Foundation will give recipients the special opportunity to forge ties within the industry\nA generous endowed gift from the Rotary Club of\nBugis Junction to commemorate its 20th anniversary will nurture undergraduates at SIT with a scholarship, two bursaries and an outstanding student award each academic yearSCCCF Scholarship\nEstablished at SIT\nRotary Club of Bugis Junction\nMembers Give SITizens Their All-Round Support(From left to right) Prof Tan Thiam Soon, President, SIT, Assoc Prof Muhammad\nFaishal Ibrahim, Parliamentary Secretary, Ministry of Education and Ministry\nof Social and Family Development, Mr Chew Ghim Bok, Past District Governor,\nRotary International District 3310 and Mr Ralph Ang, President, Rotary Club of Bugis Junction during the cheque presentation at the Club’s 20th Anniversary Celebration Dinner.The Mid-Autumn Festival brought with it good tidings for\nthe Singapore Institute of Technology (SIT) as it continues to receive growing support from the community. Supporting SIT for the first time is the Singapore Chinese Chamber of Commerce Foundation (SCCCF), which has made an endowed gift of $1.2 million to make possible the SCCCF Scholarship at SIT.\nThe Scholarship was announced at the Singapore Chinese\nChamber of Commerce & Industry (SCCCI)’s Mid-Autumn Festival Celebrations and University Scholarship Endowment Fund Inauguration Ceremony. Prof Tan Thiam Soon, President, SIT, and Mr Wu Hsioh Kwang, Vice-Chairman, SCCCF, signed the agreement at the ceremony.\nApplicable to undergraduates from SIT-conferred degree\nprogrammes (including joint-degree programmes), this Scholarship is awarded to candidates who have excelled academically as well as in their contributions to SIT or the community. The SCCCF Scholarship is valued at $15,000 annually and is tenable for three years, provided that the academic performance of the recipient is sustained. Thanks to SCCCF’s endowed gift, two selected SIT students will benefit from this Scholarship annually, and in perpetuity.\nScholarship recipients will also receive membership to the\nSCCCI that allows them to take part in events organised by the Chamber, giving them the special opportunity to network with and learn from some of Singapore’s best entrepreneurs – an opportunity that will prove invaluable, as these young SITizens learn to become future leaders in the industry.\nEstablished in 1906, SCCCI is a renowned business\norganisation and has a membership network comprising 4,000 corporate members and over 150 trade association members, representing more than 40,000 companies.\nProf Tan Thiam Soon, President, SIT (left), and Mr Wu Hsioh Kwang, Vice-Chaiman,\nSingapore Chinese Chamber of Commerce Foundation."
}