{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/SIT%20Undergraduates%20Get%20Support%20from%20Construction%20Industry_0.pdf",
  "type": "pdf",
  "content": "SIT Undergraduates\nGet Support from\nConstruction IndustryUndergraduates from SIT’s building and\nconstruction-related programmes are getting even more support thanks to an endowed gift\nfrom SCAL Resources Pte Ltd and members\nof The Singapore Contractors Association Ltd. The gift will enable SIT to award three Singapore Contractors Association Study Grants annually, and in perpetuity.\nThe Study Grant, which aims to nurture talent\nfor the building and construction industry in Singapore, is valued at $5,000 each. It\nis applicable to undergraduates pursuing\nthe Sustainable Infrastructure Engineering (Building Services), Civil Engineering and Electrical Power Engineering programmes who show an interest in pursuing a career in\nthe building and construction industry.\nThe Singapore Contractors Association\nLimited (SCAL) was formed in 1937, and is the official representative body of the\nconstruction industry in Singapore with over\n2,800 members.\nPlum & Rice, a hawker stall run by three\nSIT alumni at Bedok North Street 1,\nrecently won the Young Hawker Award\nas part of the City Hawker Food Hunt,\na yearly contest organised by City Gas and Shin Min Daily News. The stall\ndishes out rice and porridge cooked\nwith umeboshi (a Japanese plum) served with fish or braised meats and\nside dishes.\nThe alumni, Mr Raphael Sim, Mr\nGladwin Yap and Mr Eric Lee, are all 26, and graduated from the Bachelor\nof Professional Studies in Culinary Arts\nManagement (The Culinary Institute of America) degree programme at SIT. Mr Sim and Mr Yap graduated in 2015\nwhereas Mr Lee graduated in 2016.\nTheir desire to be part of the hawker\nscene in Singapore took root even\nwhen they were still studying. They had\nnoticed that hawkers were dying out and not a lot of the younger generation were willing to be hawkers. “We wanted to do\nsomething about that as we all grew up\neating in hawker centres,” said Mr Sim.\nMr Sim explained that Singaporeans\nalready had their favourite stalls when\nit came to traditional hawker fare like\nfishball noodles or lor mee, so they came up with a different concept to\nattract customers and break into the\ntough hawker scene.\nWhen they first opened, their main\nchallenge was trying to convince people that despite being young hawkers, they were indeed capable of cooking. Mr Sim said that he had customers coming to ask them if their parents were the ones cooking\nand they were just manning the stall. Their neighbours at the hawker centre were\nthrilled to have the trio open the stall. “They said that the place felt young again,” said Mr Sim. Business has since picked up and the stall now has regular customers\nincluding the office crowd and quite a few senior citizens as well.\nAdded Mr Sim, “We are humbled by this award, and didn’t expect this during the\nfirst year. This award lets us know that we are doing things on the right track and we have to go further and improve ourselves.”SITizens Bag Young Hawker Award\nPlum & Rice, run by three SIT-CIA alumni, won the Young Hawker Award in NovemberProf Tan Thiam Soon, President, SIT (right), receiving the cheque from Mr Kenneth Loo, President,\nSingapore Contractors Association Limited (left), witnessed by Guest of Honour, Mr Lawrence Wong,\nMinister for National Development, Second Minister for Finance, at the Singapore Contractors Association\nLimited 80th Anniversary Gala Dinner on 28 September 2017.\n(From left) Mr Gladwin Yap, Mr Raphael Sim and Mr Eric Lee in front of their stall which serves fish and meat cooked in a local homely style, served with plum-infused rice.SiTIZEN  |  11/16"
}