{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Loan%20Repayment%20PSEA%20Application%20Form.pdf",
  "type": "pdf",
  "content": "MINISTRY OF EDUCATION\nADHOC APPLICATION FOR USE OF POST -SECONDARY EDUCATION ACCOUNT\nTO REPAY APPROVED GOVER NMENT LOAN S AND FINANCING SCHEMES\nPlease note: You may need 5 minutes to fill in this form.  MOE will not be able to process your application if you provide incorrect or\nincomplete information  (especially NRIC No) .\nDo also note that PSEA Holder can onl y use the funds in his/ her account to pay for his/her own loan(s). For those who wish to use\nPSEA to repay more than one loan , the repayment of Government loan(s) indicated under (A) will take precedence over the repayment\nof CPF Education Scheme loan(s) indicated under (B).  Please read Information and Instructions the next page  before filling in the form .\nPart 1:  To be completed by Post -Secondary Education Account  (PSEA)  Holder (please write within the boxes)\nName  :\nContact   : (Mobile  No) ________ ___________________________         NRIC  No:        -                                 -\n(Email)  ______________________________________\n(A) For  repayment of  Government  Loan (s) only (please list loan in order of repayment priority if you wish to\nrepay more than one loan)\nS/No  Loan Administering Agency *\n(DBS / OCBC / SMU ) Loan Type *\n(TFL/  SL/ OSPL)  Loan Account No *.\n1\n2\n3\n* Refer to Instructions on the next page\n(B) For repayment of loan(s) taken under the CPF Edu cation Scheme  only (please li st in order of repayment\npriority if you wish to repay more than one CPF Education Scheme  loan)\nS/No  Institution Name  (To spell in full)\n1\n2\n3\nPart 2: To be compl eted by Account Holder  or Parent / Legal Guardian  for Account Holder below 21 years old\nMinimum withdrawal amount from PSEA for repayment of Government Loan is $100  in accordance with the minimum repayment\namount stated in the terms and conditions of your / your child’s/ ward’s  TFL/ SL/ OSPL. This condition will only be waived if you r/\nyour c hild’s/ ward’s  outstanding loan amount or PSEA balance is less than $100.\nPlease tick only one of the following options:\nUse all of my/ my child’s/ ward’s  PSEA to repay my / my child’s/ ward’s  outstanding loan (s).  Only the PSEA\namount equivalent to the  outstanding loan amount will be deducted from the PSEA balance.  If the PSEA\nbalance is not enough  for full loan repayment , the balance will be used for the partial loan repayment.\nUse $_________ ____ _ in my / my child’s/ ward’s  PSEA to repay my/ my child’s/ ward’s  outstanding\nloan(s).  If the PSEA balance is less than this specified amount, the full balance will be used for the\nrepayment.\nNote: Tick this option only if you DO NOT  wish to use up all your / your child’s/ ward’s  PSEA balance to repay the\noutstanding loan amount .\nUnder Section 16(D) of the Education Endowment and Savings Schemes Act, I hereby authorise the PSE Scheme Administrator to ma ke\ndeductions from my / my child’s/ ward’s  PSEA to repay f or the loans as stated in Part 1 of this form above .\nI declare that, to the best of my knowledge, all the information in this form is true and accurate.  In connection with this application, I undertake to\nfurnish to the PSE Scheme Administrator any documents which the PSE Scheme Administrator may require  for verification purposes, and also\nauthorise the PSE Scheme Administrator to obtain from the relevant authorities / persons any information or documents which m ay be required\nfor such purposes.\nSignature of Account Holder  (aged 21 and above) or\nSignature of P arent / Legal Guardian (i f account holder  is below 21 years old)\nDate\nName of Parent / Legal  Guardian\n(If Account Holder is below 21 years old)   Parent's / Legal Guardian's NRIC\n(If Account Holder is below 21 years old)\nPart 3: To be completed by MOE\nProcess ed on  Process ed by Date\n1. NOTES:  INFORMATION  ON USE OF POST -SECONDARY EDUCATION ACCOUNT TO REPAY APPROVED\nGOVERNMENT LOAN S AND FINANCING SCHEMES\na) This form is to be used if you / your child/ ward  has left the institution ( Autonomous Universities / Polytechnics / I nstitute of\nTechnical Education  / Art Institutions) and wish to use your PSEA balance to repay the loan (s) taken under the approved\nGovernment Loan s and Financing Schemes when you were studying in the institution . PSEA cannot be used for loan (s)\nrepayment if you/ your child/ ward is still studying in the institution.\nb) PSEA acco unt holder can only use his/her PSEA balance to repay the loan (s) taken under the approved Government Loan s\nand Financing Schemes  for his/her tertiary study.\nc) The approved Government Loan s and Financing Schemes include  Tuition Fee Loans  (TFL) , Study Loan s (SL), Overseas\nStudent Programme Loans  (OSPL) , and /or CPF Education Scheme  loans , that the PSEA account holder has taken for his/her\ntertiary study at an approved publicly -funded tertiary institution .\nd) The repayment using your / your child’s/ ward’s  PSEA is a one -time capital loan repayment. You cannot request for your / your\nchild’s/ ward’s  PSEA funds to be returned once your application has been approved by MOE and repayment has been made\nfor your / your child’s/ ward’s  loan(s).\ne) For application  forms rece ived by MOE before or on 20th of the month, loan repayment will be effected by the following month ,\nif the application form is verified to be in order . If there are multiple loans to be repaid and among  them , there is repayment to\nthe CPF Education Scheme Loan (s), MOE will make the repay ment  for the government loan (s) in the order specified in the\napplication form first and CPF Education  Scheme  Loan (s) will be repaid in the subsequent month (if there is still balance in\nyour/ your child’s/ ward’s  PSEA after  repayment of the government  loans) .\nf) Please note that loan interest will continue to accrue  on your / your child’s/ ward’s  loan(s)  during MOE’s processing period.\nPlease continue with your / your child’s/ ward’s  existing repayment arrangements until the loa n(s) has/ have been fully paid.\ng) The amount used from your / your child’s/ ward’s  PSEA for the loan repayment will be reflected in the PSEA monthly statement\nwhich you/your child/ward  will receive  in the month after your PSEA has been deducted for loan repa yment .\nh) Please refer to the following details to check your/ your child’s/ ward’s  loan(s) balance after loan repayment has been made\nfrom your / your child’s/ ward’s  PSEA :\ni)  For DBS Loan  - via your/ your child’s/ ward’s  DBS internet banking  account  or ca ll DBS contact centre at 6333  0033 ;\nii) For OCBC Loan  - via the annual statement sent by OCBC to your mailing address at the beginning of each calendar year\nor call OCBC contact centre at 1800 363 3333 ;\niii)   For SMU Loan  - write in to Student Loans ( studentloans@smu.edu.sg ) to check the outstanding balance or wait for the\nmonthly Statement of Account ;\niv) For CPF Education Scheme Loan  - via your/ your child’s/ ward’s  online Redemption Statement obtained from my cpf Online\nServices at www.cpf.gov.sg  using your / your child’s/ ward’s  SingPass .\ni) For any queries related to your/ your child’s/ ward’s  loan(s) , please contact the respective loan administering  agencies.\n2. INSTRUC TIONS ON COMPLETION OF FORM\nPart 1\na) Name: PSEA holder’s name as indicated in NRIC\nb) For Government Loan (s) (The information can be found on your/ your child’s/ ward’s  respective loan agreements or\ncorrespondence with the loan administering agencies )\ni) Loan A dministering Agency : Please enter DBS, OCBC or SMU\nii)  Loan Type:  Please enter TFL , SL or OSPL\niii)  Loan Account No: This can be found on the annual statement sent by the bank  or SMU  to your mailing address at the\nbeginning of each calendar year .\nc) For CPF Education Scheme Loan (s) (The information can be retrieved from your / your child’s/ ward’s  CPF Education Scheme\nLoan Redemption Stateme nt)\ni)  Institution Name:  Full I nstitution Name where the loan was taken from\nDIRECT CREDIT AUTHORISATION  (DCA)  FORM\nPlease fill in the DCA  form ONLY  IF you/ your child/ ward is repaying the OCBC  loan(s). In Part II of the form, please fill in your /\nyour child’s/ ward’s  Loan Account No  under Bank Account No. to be credited.\nSUBMISSION OF FORM (S)\nPlease post the c ompleted form (s) to:\nMinistry of Education\nPSEA unit\nc/o 1 Buona Vista Drive\nSingapore 138675\nNo correction tape/fluid should be used on this form.  Any cancellations made must be endorsed by the same authorised signatories signing\nthis form AND bank\nPlease complete Part II, obtain your bank’s endorsement for Part III and mail the original form (fax copy not acceptable) to the\nMinistry/Department/Statutory Board that you are liaising with.\nPlease note:\n(i) If you are receiving payment as an individual , fill in your name as stated in your NRIC/FIN.\n(ii) If you are receiving payment as a Singapore registered company/business/society , fill in your organisation’s name as registered with ACRA/UEN. You\nmay check your registered name on www.uen.gov.sg .\n(iii) Leave Part III blank if you are an ACRA -registered organisation/Singapore Citizen/Permanent Resident AND  you hold a bank account with\nDBS/POSB/OCBC/UOB/ Far Eastern Bank (FEB)/ Citibank.\nPART I - TO BE COMPLETED BY THE REQUESTING M INISTRY/DEPARTMENT/STATUTORY BOARD\nAll fields are mandatory. Incomplete forms will not be processed.\nTo: ACCOUNTANT -GENERAL\nName(s) of Bank Account Holder(s):\nBank No.   Branch No.   Bank Account No. to be Credited\n7 3 3 9  5 0 1  5 0 1\nBank and Branch Name\n(a) I/We hereby authorise the Government and Statutory Boards to credit payments due to me/us to the above account.  Amounts so credited would constitute v alid disch arge\nof obligations due to me/us.\n(b) This authorisation shall continue to be in force until I/we have notified you in writing.\n(c) I/We hereby request and authorise the Government and Statutory Boards to obtain confirmation/verification of information rela ting t o me/us and/or to my/our account(s)\nfrom/with the bank where the Account is maintained as stated in the form.\n(d) In consideration of the Government and Statutory Boards acceding to my/our said request and in consideration  of the Bank confirming/verifying such  information pursuant to\nthe said request, I/we irrevocably consent to and authorise the Bank, including any officer thereof, to disclose any informat ion whatsoever relating to me/us and to the\nAccount as is necessary for the sole purpose of account valida tion and agree that such authorisation shall survive any termination of the Account. I/We agree that this\nconsent shall survive the termination of any of the Account with the Bank and may be relied on and enforced as fully and effe ctively by the Bank as if  it is addressed to the\nBank.\n(e) I hereby consent to the release of my updated address by the Immigration and Checkpoints Authority (ICA) to the Accountant -General’s Department for the purpose of\nsending the Remittance Advice to me.\nAuthorised Signature(s) & Stamp as in Bank’s Record                              Date\nTo:  ACCOUNTANT -GENERAL\nWe hereby certify that the signature(s) and other particulars as stated in Part II agree with that contained in our records.\nName & Signature of Authorised Bank Officer                           Date & Bank’s Official Stamp  Name of Ministry/Department/Statutory Board  Ministry of Education   Vendor ID   -\nContact Officer  -  Please tick one of the relevant boxes:\nContact Number  -         New vendor record\nFax Number  -         Update of exis ting vendor record\nUEN No.\n(for all UEN registered\nentities)  - - - - - - - - - - -\nOR\nNRIC / FIN\n(for individuals)\nOR\nOthers\n(e.g. Forei gn Passport No)  - - - - - - - - - - -\nGST Registered  Yes / No\nGST Registration No.  - Address\nTelephone Number\nFax Number\nEmail Address*\nOCBC and OCBC Centre\nPART II – TO BE COMPLETED BY ENTITY RECEIVING PAYMENT FROM THE GOVERNMENT/STATUTORY BOARD\nPART III – TO BE COMPLETED BY BANK  *It is mandatory to provide the email address. Payment notification will\nbe sent to this email address.  DIRECT CREDIT AUTHORISATION FORM\n(Only Originals are Accepted)"
}