{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2023-09/AR2023-Chairman-Message.pdf",
  "type": "pdf",
  "content": "Chairman’s Message\nI am pleased to present this year’s annual report, themed “Deepening Applied Learning”, which\nhas been the main strategic focus for SIT. I am happy to note that we have made good strides in\nstrengthening our education and research offerings in financial year (FY) 2022.\nSUPPORTING SINGAPORE’S GOALS\nSIT aligns itself with Singapore’s national goals in the\neducation sector, supporting the development of a skilled\nworkforce, driving innovation and economic growth, and\npromoting Singapore as an education hub. Through our\nprogrammes and collaborations, we remain dedicated to\nenhancing applied learning experiences, driving innovation,\nand empowering learners for success in an ever-changing\nworld. According to the 2021 Graduate Employment\nSurvey, 95.6% of SIT graduates secured a job within 6\nmonths of completing their studies, with starting salaries\nthat exceeded pre-pandemic levels.\nAs a testament to our efficacy, SIT’s student enrolment has\nbeen growing year by year. I am pleased to note that we now have an annual intake of over 3,000 and an enrolment\nof over 9,000 undergraduates, making us the third-largest\nautonomous university in Singapore by undergraduate\nstudent intake. These outcomes are a testament that we\nare on the right track. We have continued this momentum\nand continually updated our educational offerings.\nDEEPENING EDUCATIONAL HORIZONS\nSIT places a strong emphasis on experiential learning\nthrough solving real-world problems. In other words,\nour education goes beyond earning a degree — it is also\nabout developing skills that are relevant to industries and\nbacked by deep disciplinary knowledge.\nOur undergraduate and postgraduate degree programmes\nare designed with this aim in mind. In FY2022, we expanded\nour academic offerings for both the pre-employment\ntraining (PET) and continuing education and training (CET)\nsectors to bring the benefits of our pedagogy to even\nmore learners. Our signature Integrated Work Study\nProgramme (IWSP) gives students valuable learning\nopportunities and enhances their employability in an\nincreasingly competitive workforce. To date, about 1,000\ncompanies and agencies partner with SIT to provide\nplacements for our students.\nBeyond IWSP , our Term-In Term-Out (TITO) programmes\nare also gaining traction. TITO offers students the option\nof alternating between the University and the workplace\nas they complete their degree, providing valuable industry\nexposure. It also augments students’ learning experiences\nand distinguishes SIT as a university where learning comes\nto life. Thanks to companies such as AIA, DBS, Infosys,\nOCBC, Prudential, Standard Chartered Bank, ST Logistics,\nUOB and YCH, students on the TITO pathway are spending\nsubstantially more time in industry.\nEven as we continue to develop and expand our\nprogrammes, we must pay attention to the broader\neducational landscape. In keeping with the Ministry of\nEducation’s focus on strengthening lifelong learning by\nmoving to a lifetime cohort participation rate of 60%\nby 2025, we continue to enhance our CET offerings to\ncater to working adults who wish to upskill and gain new\ncapabilities in the workplace.\nOur dedicated unit for lifelong learning, SITLEARN\nProfessional Development, has been hard at work rolling\nout courses for adult learners. In 2022, more than 4,000 CET\ntraining places were made available. During the year, we\nWe believe that\ncollaboration with industry\nis at the heart of applied\nlearning. As such,\nSIT weaves\ncollaboration\nwith industry\npartners\nseamlessly and\nintentionally\ninto all aspects\nof our applied\nlearning and\nresearch\nactivities.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202304\npartnered with companies like semiconductor equipment\nmanufacturer Applied Materials to future-proof their staff’s\ncapabilities in emerging technologies. Over 200 Applied\nMaterials employees were trained in areas such as data\nanalytics, AI and the Internet of Things.\nA notable CET initiative is the provision of practice\nworkshops to prepare rehab healthcare professionals\nto carry out the objectives of the National One-Rehab\nFramework. In FY2022, SIT trained over 500 allied health\nand rehab professionals from over 30 healthcare and\ncommunity institutions, including the National Healthcare\nGroup, SingHealth, Kwong Wai Shiu Hospital, and St\nLuke’s Hospital. Through this programme, the participants\nunderstand how to apply the One-Rehab Framework in\ntheir rehabilitation practice so that their patients have\ntimely access to the right level of care.\nAt SIT, we understand that industry needs are always\nevolving. Our education and training programmes seek\nto evolve along with changing industry needs and equip\nlearners with skills that are applicable and relevant. For\nexample, we have rolled out the Competency-based\nStackable Micro-credentials (CSM) pathway to support\nworking adults to upskill. Such a competency-based\napproach accelerates their professional development.\nThe delivery, which is a blend of both face-to-face and\nasynchronous learning, balances between empowering\nthe learners to learn at their own pace and the benefits of\nin-person and group learning. We continue to engage the\nindustry in the design and delivery of the programme to\nensure that the micro-credentials are aligned with market\nneeds and reflect the latest trends and technologies.\nTo ensure that our educational offerings make a difference\nin the real world, we continue to push for progress on the\napplied research front. We work closely with educational\ninstitutions in Singapore, such as the other autonomous\nuniversities and 5 polytechnics, and industry to achieve\nresearch outcomes that matter to businesses. Some of\nour partners include global companies such as Cargill,\nConveGenius, DNV, Meinhardt and Yinson Holdings, as\nwell as universities such as Japan’s Tohoku University, the\nTechnical University of Munich and the University of Illinois\nUrbana-Champaign.\nCrucially, such partnerships also enable us to provide\nour students with authentic learning experiences in\nareas such as sustainability, digitalisation, food security,\ncommunity healthcare and more. These are critical areas\nof development for Singapore.\nDEEPENING IMPACT ON INDUSTRY\nAND COMMUNITY\nWe believe that collaboration with industry is at the heart\nof applied learning. As such, SIT weaves collaboration\nwith industry partners seamlessly and intentionally into\nall aspects of our applied learning and research activities.\nI am heartened that we have continued to grow our\nnetwork of industry partners in FY2022. We have signed\nnumerous memoranda of understanding and forged\nresearch collaborations in multiple areas. These will go\na long way towards building a strong academia-industry nexus and creating opportunities for work attachments,\nresearch and other joint initiatives for our students to\ndevelop the necessary skills to excel.\nOur commitment to our student community, as well as\nthe community at large, is also a big part of who we\nare. Students are at the core of SIT’s mission, and their\nsuccess and personal growth are key elements of the\nSIT experience. In FY2022, we remained committed to\nfostering an inclusive and conducive campus environment,\nwith comprehensive support services available for students\nshould they need it.\nThis past year, the University actively engaged with\nthe community, working with local organisations and\ncommunity partners to craft outreach programmes to\nhelp individuals and communities. For example, SIT co-\nproduced the Tech for Good 2022 competition to provide\nstudents with the opportunity to contribute to vulnerable\ncommunities. A student team from SIT designed a device\nthat enables wheelchair users to snap photographs using\na motorised arm. Another SIT team modified the bowling\nramp to make it easier and more interactive for those with\ncerebral palsy to bowl.\nOur upcoming SIT Punggol Campus will be critical to\nour engagement efforts. The campus will be co-located\nin the Punggol Digital District alongside enterprises and\nis specifically designed to enable intermingling between\nindustry and academia. This serves to strengthen the bond\nbetween academia and industry, and foster opportunities\nfor collaboration through the exchange of workspaces\nand mutual flow of ideas.\nWe will become the resident university in the North-\nEast region, occupying an important place in the local\necosystem as a knowledge hub. I believe that our state-\nof-the-art facilities and expertise in STEM education will\nprove an invaluable resource to residents in the area. As\nwe share our resources and contribute towards shoring\nup the knowledge base of the community, our staff and\nstudents will have the opportunities to put their academic\nknowledge and industry proficiency to good use in giving\nback to the community.\nFORGING AHEAD\nAs we turn to the future, SIT will continue to redefine the\nhigher education landscape and build upon our applied\nlearning pedagogy to achieve leadership in this key front.\nEven as we build on our successes, we must continue to\nadapt to a changing global environment and keep forging\nstrategic partnerships with industry.\nWith the support of our staff and partners, including the\nMinistry of Education, polytechnics, overseas universities,\nindustry partners, government agencies and community\nleaders, I am confident that SIT will continue to thrive\nand differentiate itself as Singapore’s premier university\nof applied learning.\nMR BILL CHANG\nChairman05\nCHAIRMAN’S MESSAGE"
}