{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-09/%5BFA%5D%20SIT%20AR%202024_04_Impacting%20industry_0.pdf",
  "type": "pdf",
  "content": "Partnerships\nOver 30 Memoranda of Understanding (MOU) were signed:\n•    Encompassing a wide range of collaboration areas including applied research\nand education, co-development of modules for PET and CET, IWSP and\nacademic exchanges.\n•   Notable MOU signings include:\nSingapore Army\nTo enhance the engineering skills and\nexpertise of the Singapore Army servicemen\nand women, this collaboration identifies the\nArmy’s engineering training needs and aligns\nthem with relevant SIT courses, which include\nmicro-credentials, competency-based stackable\ndegrees and postgraduate certification.\nSIT Photo: Keng Photography/Tan Eng Keng\nNVIDIA\nSIT has partnered with NVIDIA to establish the\nSIT Centre for AI. The Centre aims to bolster AI\nadoption across industries and develop a talent\npipeline to support Singapore’s goal of tripling\nthe number of AI practitioners within the next\nfive years. It is dedicated to assisting industries\nwith the customisation and refinement of\nfoundational and generative AI models, as well\nas fostering the development of cutting-edge AI\napplications tailored to specific needs. SIT Photo: Keng Photography/Tan Eng KengBioPIPS\nBioPIPS or the Biologics Pharma Innovation\nProgramme Singapore aims to strengthen local\nbiomanufacturing capabilities and transform\nSingapore’s biologics manufacturing facilities\ninto agile factories of the future. Led by A*STAR\nand supported by the Singapore Economic\nDevelopment Board, it works through a\nconsortium model consisting of leading\nbiopharma companies and Singapore’s public\nsector R&D agencies and universities.IMPACTING INDUSTRY\nWe forge partnerships with industry leaders\nwho identify critical challenges that drive our\ncurriculum and translational research agenda.\nBy continuously deepening these collaborations,\nwe scale our applied research, fuel innovation,\nand develop the skilled workforce that propels\nSingapore’s economy forward.\nPhoto: A*STAR\nIndustry partners signalling their commitment to developing future-ready tech talent, fostering\nco-innovation and test-bedding, and driving entrepreneurship.\nPhoto: JTC\n/25\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024\nApplied Research\nAt SIT, we continue to push the boundaries of education and research through forward-\nthinking initiatives. We focus on solving real-world problems and innovating to drive\neconomic growth.\nSecured close to S$33 million in external grants and industry cash contributions.\nApplied Research Projects*:\n*As of 31 March 2024\nWorked with 292 companies and organisations on applied research projects.35  Internal Projects\n67  External Projects\nINTERNAL\nGRANT:\n$6.91M\nFY21 – $1.33M\nFY22 – $1.77M\nFY23 – $3.81MEXTERNAL\nGRANT:\n$81.83M\nFY21 – $43.19M\nFY22 – $8.72M\nFY23 – $30.1MINDUSTRY\nCONTRIBUTION\n(CASH): $6.22M\nFY21 – $0.74M\nFY22 – $1.59M\nFY23 – $3.7MINDUSTRY\nCONTRIBUTION\n(IN-KIND):\n$23.02M\nFY21 – $13.54M\nFY22 – $3.78M\nFY23 – $5.96MAccumulative\nTabulation of\nGrants and Industry\nContributions\nFY21 – FY23\nAs of 1 April 2024\n5% 69% 6% 20%FOODBOWL, SEAFAST and SIFT\nUnder FoodPlant, a subsidiary of SIT, a partnership has been established with FOODBOWL,\nSEAFAST, and SIFT, leading food innovation facilities from New Zealand, Indonesia, and Australia\nrespectively. The dynamic multi-project collaboration aims to build capabilities and accelerate\ncommercial outcomes in food innovation, manufacturing and network partnering.\nLiving Labs\nWe work with our partners to solve their operational challenges, catalyse research\ncollaborations with our academic staff, and create authentic learning experiences for\nour students through Living Labs.\nTwo off-campus Living Labs were operationalised:\nTransport: SMRT\n•    For SIT students and academic staff to co-create land transport solutions to\naddress SMRT’s real-world challenges.\n•    Smart Bus Captain Rostering: A Final-Year-Project that involved the development\nof an algorithm/macro to automate bus rostering schedules with the objective\nof distributing bus captains’ driving hours for overall productivity without\ncompromising on safety. An automated user interface was created for quick\nand efficient management of the rostering process.\nHealthcare: SingHealth\n•    To build innovation capabilities and next-generation talent in the healthcare\nsector, contributing to national healthcare initiatives such as Healthier SG.\n•    Launched Master of Health Sciences with industry-focused specialisations and\nIntegrated BSN-MSN programme to train specialist nurses.\n•    Scoped applied research projects that included capabilities from Business\nCommunications and Design, Engineering and Infocomm Technology clusters\nto add value to innovative healthcare solutions.\n•    Developed CET courses relevant to healthcare operations for Sengkang General\nHospital, with opportunities to co-develop specific courses for SingHealth.Photo: A/Prof Lim Bee Kim/26\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024\nCTIL Project Highlight – Carbon Negative Steel Slag\nCurrently, most pavements are designed to prevent water infiltration, leading to\nincreased runoff and accumulation, which often results in urban flooding. A viable\nsolution to this problem is the use of Permeable Concrete, a porous material that\nreduces water runoff and helps recharge groundwater aquifers. This project aims to\ndevelop an environmentally beneficial and ecologically functional carbon-negative\nconcrete using steel slag – a by-product of iron and steel production – to create Steel\nSlag Permeable Concrete.\nEDGE Project Highlight – Vehicle-to-Grid (V2G) Test-bed\nA consortium led by STRIDES will develop and test Singapore’s largest V2G (Vehicle-to-\nGrid) technology with a grant awarded by the Energy Market Authority (EMA) and SIT\nunder the EMA-SIT Exploiting Distributed Generation (EDGE) programme. The project\nwill involve various V2G-enabled electric vehicle (EV) chargers and will allow EVs to\ninteract with the power grid, potentially feeding electricity back into the grid during\npeak demand periods. It aims to evaluate the technical and economic feasibility of\nV2G technology in Singapore’s context.FoodPlant Project Highlight – HerbY-Cheese\nFoodPlant, in collaboration with Agrocorp International (Agrocorp), has launched\nHerbY-Cheese, Singapore’s first plant-based, nut-free cheese range. As part of this\ncollaboration, Agrocorp’s food scientists developed the product in SIT’s food labs and\nreceived support in manufacturing prototypes at a pilot scale, paving the way for the\nsuccessful commercialisation of HerbY-Cheese, which includes dairy-free alternatives\nto cheddar, mozzarella, and parmesan.\nLaunch of Herb-Y-Cheese at SIT@Dover\nSIT Photo: Keng Photography/Tan Eng Keng\n/27\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024"
}