{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20220630-lianhe-zaobao-motheranddaughterkeentobakeandopenastoretogethertorealisedream.pdf",
  "type": "pdf",
  "content": "韩宝镇　报道\nhanpt@sph.com.sg\n拥有烹饪学位的女儿国外实\n习和工作后回国，却碰上母亲被裁员。不过，“塞翁失马，焉知非福”，母亲在女儿的鼓励下，不仅找回昔日对烘焙的热忱，也重拾对人生的信心。　　令这对母女欣慰的是，她们俩联手创业，从居家烘焙生意做起，手艺备受顾客欢迎和肯定，如今更开设了首家实体店。　　Puffs and Peaks创办人之一的王靖婷（25岁）接受《联合早报》访问时，形容母亲是被职场生涯耽误了的烘焙师，尽管被裁员，却因祸得福。　　“妈妈过去是营运经理，多年来，她从不下厨，工作对她来说很重要，但也剥夺了她探索热爱事物的机会。被裁员后经营烘焙生意，是发生在她身上最好的事情。”　　王靖婷毕业于新加坡理工大学（SIT），拥有美国烹饪学院食品业务管理课程的商业管理学士学位，曾在澳洲先后实习和工作各半年。　　母亲孙爱青（57岁）受访时说，她遭裁员后一时之间觉得很难接受，茫然失措，女儿于是建议她到澳洲散心，女儿也陪同她到之前的工作场所参观。\n母亲遭裁员\n女儿助她重拾梦想\n当孙爱青看到烘焙师制作的\n面包时，才突然想起她过去也对烘焙和制作糕点有浓厚兴趣，但后来却为了事业而把兴趣搁置。　　原来，孙爱青在30年前也学习过制作糕点，还梦想过要开店。这个梦想，竟然是在她被裁员后实现了。因为赋闲在家，整天闷闷不乐，女儿于是鼓励她重新去尝试自己喜欢做的事情。　　“女儿带我去上短期烹饪课程，并且给我很大的鼓励，让我重新找回以前的梦想。”　　她倾注热情制作红龟粿和香蕉蛋糕等糕点。年轻的女儿熟悉社交媒体，在Instagram展示她的“作品”，结果吸引到越来越多顾客的支持，这让孙爱青顿时重拾信心。　　王靖婷说，一年后，也就是在2019年，她们决定把业务扩大至实体店。开店的想法最初也是母亲提出的。　　她们于同年8月开始物色店面，并在2020初签下了淡滨尼中民众俱乐部的店面租约。由于冠病疫情暴发，开业日期一拖再拖，直到11月才开幕。第一次开店，母女俩都是一边摸索，一边学习。　　她们原本只是想要有一个更大的厨房空间来工作，没有想到开张后来到店里的客人竟然比预期来得多。　　门店总面积390平方英尺，一半已作为厨房用途。当客人纷纷上门，店里顿时格外拥挤，母女也手忙脚乱起来。她们赶紧聘请更多兼职人手帮忙，连父亲也出动，协助维持排队人龙的秩序。　　她们也接受客户在网上预定，以减少上门的客户。与此同时，她们搬走原本摆在店里的三张桌子，腾出更多空间作为储存用途。　　经过一番努力，她们总算把客户排队等候的时间从45分钟至一个小时，大大地减短至几分钟。她们后来也迎来了多一名生意伙伴，工作担子得以减轻。　　开了实体店后，母女的烘焙生意也改善不少，王靖婷透露，居家烘焙生意一天最多可售出200个甜甜圈，而在店里最多可售出1000个，是之前的五倍，尽管每天的销量都不一样。　　王靖婷在澳洲的工作经验在开店时也派上用场。例如，她在当地学会制作创意面包的，并且注重使用天然和高质量材料。　　创业也让王靖婷得到磨炼，如今的她，已从当初遇到事情时的阵脚大乱，变为从容淡定、处之泰然。　　做生意涉及成本，今年物价高涨，孙爱青在谈到如何应对时说，她和女儿都没有把自己当成“生意人”，因此并不追求高盈利。“我们都尽量选好的材料，注重品质，没有说要赚很多钱，只要足以应付开销就可以了。”　　由于成本尤其是牛油等材料费用大涨8%至10%，为了节约成本，她们都是亲力亲为，即使工作时间长一些也不介意。包装方面，她们也力求简单，只是使用环保盒子。\n携手创业母女关系更亲密\n谈到与女儿的合作关系，孙爱青说，过去因为工作的关系，与子女共度的时间不多。与女儿成为生意伙伴后，母女俩相处时间更多，关系也变得更加亲密和融洽。　　“被裁员后，给我很多与女儿相处的机会，也把30多年前的梦想重新找了回来。如果是我一个人的话，我可能没有勇气去开店。现在有了女儿在身旁，很多事情我们都可以一起去面对，这是一个很大的不同。”　　孙爱青说，女儿鼓励她“要相信自己能够做到”，她制作的糕点在Instagram得到热烈反响，女儿也会拿给她看，让她对自己有了信心。　　“看到自己的产品得到别人的肯定，是最大的欣慰。”　　她很庆幸拥有许多很支持她们的客户，并以正面的心态接受客户的批评和指正。　　“我们接受他们的批评并做出改进。我们从在家里到现在开店经营，都一直在改进。”　　母女俩最初合作时也会有意见上的分歧，但都会开诚布公地与彼此分享自己的看法。　　如今，她们的默契也越来越好，王靖婷说：“对方没有说完的话，我们都能够为彼此接下去说。在厨房工作时，我们不需要跟彼此说什么，就能够把事情做好。”　　“能与母亲并肩工作，我感到很幸运，也对现状感到满意。重要的是社区对我们表现的支持，让我们心存感恩。我们会继续秉持我们的信念制作食品。”\n三之二母女热衷烘焙 携手开店圆梦　　我国经济重开带动国内消费，但各国暂停出口糖和食油，\n面粉也因为俄乌战争而涨价，让烘焙业者苦恼万分。　　《面包飘香 ·商界威扬》系列二，将介绍三家本地烘焙业\n者在抓紧商机的同时，如何应对成本上涨的压力。\n面包飘香■商界威扬系列\n王靖婷（左）和母亲孙爱青联手创业，从居家烘焙生意做起，如今更开设了首家实体店。 （谢智扬摄）\nPublication: Lianhe Zaobao\nDate: 30 June 2022\nHeadline: Mother and daughter keen to bake\nand open a store together to realise dream\nSource: Lianhe Zaobao © SPH Media Limited. Reproduced with permission."
}