{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20230101-lhzb-amulti-prongedapproachtocreateanage-friendlydigitalsociety.pdf",
  "type": "pdf",
  "content": "家庭主妇钟玖娇（73岁）\n原本与不少年长者一样，不敢使用电子付款应用，担心一不小心按错屏幕按钮，钱就会“飞走”。　　一年多前，她留意到，住家附近的裕泉民众俱乐部设立了新加坡数码转型社区援助站。她于是把援助站的每一名大使当成老师，碰到下载应用或重设密码等问题，就会去请教他们，慢慢学会使用更多手机应用。　　“我比较伤脑筋的是，很多手机应用的文字都使用英文，需要有人跟我解释。开始的时候，我对应用一窍不通。但经过数码大使的教导，我现在比较不怕使用电子付款，懂得使用PayLah!和PayNow等应用。”　　从事营销行业10多年的张美香，2020年7月转行成为新加坡数码转型办事处（SDO）的数码大使。如今她是一名数码大使组长，负责领导大巴窑区的联系活动，一般派驻在大巴窑南民众俱乐部及大巴窑公共图书馆。　　对张美香来说，当数码大使是一份有意义的工作，她很乐意手把手教导年长者。　　“疫情让不少年长者意识到数码科技是重要的。他们一般希望有人来教导，但不大好意思问忙碌的家人。一般人认为很简单的滑手机、点击应用等基本动作，老人家其实不大娴熟。手机上字体太小，会对他们构成障碍，我们会帮他们调整设置并细心引导。援助站提供一个亲乐龄环境，鼓励年长者放心来学习。”　　凡是到援助站咨询的公众，数码大使分不同层次提供一对一引导。数码大使先介绍如何使用WhatsApp或Zoom通讯应用，年长者若已有一定基础，大使则会进一步教导他们使用Singpass、健康365等政府部门的数码应用，以及以电子付款。　　数码大使也会在图书馆举办学习之旅，让年长者模拟电子付款，如果时间允许，数码大使会带他们到咖啡店亲身体验电子付款方式。　　为确保我国在迈向智慧国进程中，维持社会包容，公共服务设立的ServiceSG中心也有工作人员，指导居民上政府网站进行交易，以及使用20个政府机构的线上服务。　　资媒局新加坡数码转型办事处及数码益终身秘书处处长吴日明指出，许多政府部门如公积金局仍提供实体服务中心。另一方面，政府机构也不断改善线上服务，确保易于使用。“这项具包容性的方针是要确保每个人，包括不擅长数码技能的人，也能受益于数码服务。”进入数码时代，政府部门和商业机构推出各项线上服务和数码应用，为人们的生活带来更大便利。\n然而，对没有智能手机和不谙科技的年长者来说，从使用现金到无现金支付、从刷卡到扫手机应用，这些转变令他们无所适从。不少乐龄人士只须要一些鼓励，或有人手把手引导，就能让他们更有信心学习数码技能；也有年长者认为，传统作业方式仍须保留，才能体现社会包容和多元。本期《实况报道》访问年长者、学者，以及政府和商业机构，探讨如何通过亲乐龄服务，帮助乐龄适应数码时代。\n退休人士陈保隆（77岁）\n拥有一台智能手机，手机\n的主要用途是通话和看网络新闻。近几年，他愈发觉得，数码化步伐越来越快，就连上餐馆，也得扫描QR码看菜单。不擅长数码技能的他，唯有请侍应生帮他点餐。　　对于手机应用，他能不碰就不碰，电子付款应用，更是不敢尝试。但各种应用还是会“找上他”。　　他最近发现，上超市购物须下载应用并连接数码账号，才能继续扫卡累积或兑换奖励分数。幸好，超市安排促销员一步步引导他完成各项步骤。“要下载应用，我觉得很麻烦。如果没有人教我怎么做，我自己是不会去下载的。”　　像陈保隆这样自认跟不上科技步伐的年长者不在少数。过去几个月，接连有公众投函《联合早报》和《海峡时报》反映，不谙科技的年长者对日常生活中的数码工具无所适从，他们须要帮助才能与数码化社会接轨。　　新加坡理工大学商业、传播及设计学院助理教授黄毅凯受访时说，整体而言，数码化带来了很多便利和高质量的用户体验，也提高了企业和政府机构的办事效率。　　然而，在推广高度数码化的过程中，一些群体会不经意被忽略。　　“比如年长和残障者，他们在使用数码科技时往往会遇到困难。这些群体可能学习能力较弱、记性较差。他们可能也有肢体上的障碍或困难，如视力弱或行动不便。但应用程序设计师往往忽略了这些特殊群体。”　　新跃社科大学研究生事务办公室主任陈明礼副教授也有同感，他认为无论是专门服务年长者，或用户群只有一部分是年长者，机构在设计和开发数码应用时，不妨采用以人为本的设计思维（Design Thinking）理念。　　“本地年长群体相当多元，数码科技掌握能力各异。以李显龙总理、荣誉国务资政吴作栋为例，他们是年长者，也是活跃于社交媒体的数码达人。但也有人投函报章反映应付数码科技的烦恼。也有人不识字或没有手机。采取设计思维理念，可确保在设计应用的过程中，多考虑用户需求。”　　陈明礼指出，新加坡标准理事会（Singapore Standards Council）已推出一套关于设计年长者用户界面的指导准则，一些政府部门在设计数码服务时，也参考这套准则。他希望本地更多企业和机构能提高这方面的意识。　　黄毅凯指出，有关机构在设计应用时，若无法同时满足年长者等群体的需求，它们可投入资源，帮助这些用户。　　“企业和相关政府机构可开展培训课，训练服务人员为这些群体提供相关帮助。这方面的培训不仅可以帮助这些特殊群体，也可以让社会大众了解社会数码化须要时间、耐心和包容心。本地社会在走向高度数码化的同时，不应忽略‘数码包容心’。”　　陈明礼强调，从家庭成员到社会大众，“整体社会”（whole-of-society）为不谙科技的年长者提供支援，也是至关重要的。　　另外，机构也可更灵活地让前线务人员有时间引导年长者使用数码工具，例如帮忙他们下载应用。如果前线人员得服务其他顾客，那可让其他职员支援年长者。　　“随着社会快速老龄化，我们若对年长者的需求更加敏感，并且发挥同理心，可让社会变得更亲乐龄和优雅。”\n鼓励顾客过渡到数码服务和产品的同时，部分企业仍保留非数码选项，或面对面咨询渠道，包容不同顾客的需求。　　私校教师杨伟樑（62岁）持有的华侨银行/职总Plus!卡，即将在2023年1月31日取消。他想继续在平价超市购物时累积宏惠积分（LinkPoints），也希望持有一张实体信用卡，决定申请取而代之的优信银行（Trust Bank）信用卡。　　优信银行是渣打银行和职总创优企业合作社（NTUC Enterprise）合资经营的全面数码银行，2022年9月正式启用。　　杨伟樑下载优信银行应用后，申请卡时手忙脚乱，便到怡丰城平价超市的客户体验中心，亲自询问数码大使。　　“应用提示我完成一些步骤，我手脚慢，一时紧张按错，一切又得重来。有人面对面教导，就比较清楚。”\n优信数码银行用户\n10％年龄在65岁及以上\n优信银行的用户至今增至\n40万人，银行业务发展总监黄宝琼透露，当中10％的年龄在65岁及以上。　　“开发应用时，我们的研究小组咨询不同年龄顾客，以改善应用功能。我们了解有年长顾客较习惯使用华文，决定为应用设置中英文选项。”　　职总联卡总经理陈峙勋说，公司特为不擅长数码科技的顾客，提供申请实体Link Rewards卡的选项。　　除了训练员工和增添人手应付询问，平价超市和Kopitiam店面已派驻数码大使。平价合作社数码团队也与资媒局合作，定期举办超市学习之旅，让年长者学习使用应用和扫描付款功能。　　yuu Rewards Club在2022年10月底，由淡马锡创立的科技公司minden.ai与经营冷藏公司超市、巨人超市、7-Eleven便利店和和佳宁药房的DFI零售集团，以及人民协会百盛卡和星展银行等伙伴合作推出。至今已有80万人注册为yuu会员。　　持有实体百盛卡的消费者在指定零售店购物，得下载yuu应用，将卡连接账号，以继续累积奖励分数。　　顾客若无法下载应用或将卡连接账号，仍可扫卡累积积分。但最迟要在2023年4月30日注册为yuu会员，才能继续查看和兑换奖励积分，间中不会损失积分。　　年长者无智能手机，也可在线下注册为yuu会员，继续扫卡累积积分。注册过程只需百盛卡的16数字编号，不必提供银行资料。　　minden.ai首席执行官孙仁勇说，下载应用碰到问题或要线下注册，可到任何DFI零售店或民众俱乐部求助，5000名完成培训的前线员工会提供支援。除了宣传册子，yuu奖励平台也在社交媒体上载中英文，以及福建话的宣传视频。　　资讯通信媒体发展局通过数据分析，了解乐龄聚集和往来地点，以便调派数码大使教导年长者使用数码工具，包括使用智能手机获取Singpass等政府服务。　　新加坡数码转型办事处（ SG Digital Office， 简称SDO ）自2020年成立以来， 截至2022年 底 已 为 超 过 2 1 万 名 年 长 者 ，提供了 一对一的数码技能培训。\n目前全岛有37个\n数码转型社区援助站\n资媒局新加坡数码转型办\n事处及数码益终身秘书处处长吴日明回复《联合早报》询问时说，透过数码乐龄计划（Seniors Go Digital），SDO时不时会检讨派驻数码大使的最合适地点。　　目前，全岛有37个新加坡数码转型社区援助站（SG Digital Community Hubs）派驻了数码大使。这些援助站多数设在民众俱乐部和公共图书馆。SDO每月也在不同地点设立约200个流动柜台，包括工作场所、乐龄活动中心、医疗机构、宗教场所，以及居民联系网（Residents’Network）和邻里委员会等空间。　　吴日明指出，资媒局近期也同公积金局和陆路交通管理局合作，在公积金局的淡滨尼服务中心，以及指定地铁站和巴士转换站，派驻数码大使，引导公众使用公积金局数码服务，以及数码交通应用。　　资媒局未答复目前数码大使人数的询问，它在2020年曾透露，会雇用和派驻1000名数码大使到全岛各处，包括小贩中心。　　吴日明强调，当局目前采\n用数据分析，确定服务对象所\n在地点，目的是把数码援助\n服务带给他们。\n“例如，我们通过数据分析，找出年长者聚集或时常光顾的地区，好让我们善用资源，更好地策划联系工作。这些数据也让我们了解年长者偏爱的学习时段，有助我们设计数码技能培训课，以及适当分配人力。”　　跃大老年学高级讲师陈正见博士指出，SDO至今为超过21万名年长者提供数码技能培训，数据令人备受鼓舞，但完成一次培训后，多少人记得所学知识，并且有信心学以致用，值得关注和探讨。　　陈正见认为，数码应用日新月异，鼓励年长者定期上课，温故知新，相当重要。　　“除了数码大使，我建议资媒局也考虑设立网上咨询平台，通过智能聊天机器人（chatbot）或借助社交媒体和聊天应用，耐心引导年长者解决数码疑难杂症。”　　数码技能较娴熟的年长者，也可教导其他年长者。陈正见指出，让年长者担任数码大使，也可缓解人力短缺的问题，而数码大使也可调派到更多地点设立援助站，包括组屋底层、运动场所或公园。\n实况报道\n许翔宇\t hsiangyu@sph.com.sg\n已为逾21万乐龄提供一对一数码技能培训\n企业包容不同顾客需求\n仍保留非数码选项\n之前怕按错钮钱飞走　 七旬妇学会用 PayNow退休人士陈保隆（左）最近在淡滨尼的巨人霸级市场购物时，在促销员宋洪涛的教导下，学会下载yuu\n应用，以及如何将他的百盛卡连接到应用账号，以便继续扫卡累积奖励分数。（关俊威摄）\n▼家庭主妇钟玖娇\n（左）遇到使用智能手机或下载应用等疑问，就会到住家附近的裕泉民众俱乐部，向新加坡数码转型社区援助站的数码大使请教。（蔡家增摄）私校教师杨伟樑（左）下载优信银行应用，尝试申请信用卡，因不熟悉步骤，手忙脚乱。他上周到优信银行于怡丰城平价超市设立的客户体验中心，向数码大使求助。（特约摄影张荣）\n手把手引导\n应用须考虑年长者需求多管齐下打造多管齐下打造\n亲乐龄亲乐龄\n数码社会数码社会\n▲新加坡数码转型办事\n处数码大使也会在公共图书馆，为须要数码技能援助的年长者提供一对一引导。（资讯通信媒体发展局\n提供）\nPublication: Lianhe Zaobao\nDate: 03 Jan 2023\nHeadline: A multi-pronged approach to\ncreate an age-friendly digital society\nSource: Lianhe Zaobao © SPH Media Limited. Reproduced with permission."
}