{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2023-09/AR2023-Community.pdf",
  "type": "pdf",
  "content": "Community\nSIT aims to build a university ecosystem that provides opportunities, resources and mentorship\nto enable SITizens to serve the community by utilising their knowledge and skills gained through\ntheir studies and job experience. Throughout the year, students, faculty, and staff at SIT were\nactively involved in meaningful collaborations to benefit the social, economic, or environmental\naspects of the community.\nCOMMUNITY PROJECTS AND\nCOLLABORATIONS\nTECH FOR GOOD 2022\nAt SIT, students have ample opportunities to hone their technical and\nindustry-relevant skills while building empathy towards others in society.\nCompetitions such as Tech for Good (T4G), organised by Engineering\nGood and co-produced by SIT, give students the chance to contribute\nto vulnerable communities.\nHeld at the National Library on 1 October 2022, T4G 2022 featured 30\nshortlisted teams, including 3 teams from SIT. Team MECIT from SIT\nclinched the Best Advocate award. Its prototype allows users to position\na mobile phone attached to a motorised arm on a wheelchair, snap\npictures and review them straight away. As users navigate the various\noptions on the app by winking, they can enjoy a more independent\nform of recreation and expression.\nTeam MECIT received the Best Advocate Award at T4G 2022 for their device (right) that helps users capture photos\nconveniently. (Photo: Engineering Good)\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202340\nSIT COMMUNITY CHALLENGE 2022\nThe SIT Community Challenge is an annual competition\norganised by SIT, James Dyson Foundation and\nGreendale Secondary School. Themed ‘Sustainable\nLiving’, the 2022 edition of the challenge involved 300\nsecondary 2 students from Greendale and 10 student\nmentors from SIT’s Yes!Program. The students went\nthrough prototyping workshops to work on designing\nor re-designing a product or service that can promote\nsustainability at home or in their community.\nCOMMUNITY EVENTS\nOn 6 August 2022, visitors to the NDP@Heartlands\ncelebrations in Punggol got a chance to experience\nSIT’s virtual campus through an interactive virtual\nreality experience. The event, which took place in\nPunggol Field, was attended by 30,000 residents from\nPunggol, Pasir Ris, Sengkang and Tampines. In an effort\nto bring healthy living to the community, 80 students\nfrom the Physiotherapy degree programme provided\ncomplimentary sports massages for participants of the\nStandard Chartered Run in December 2022.SIT Community Challenge 2022 brought together students and staff from SIT and Greendale Secondary School to promote\nsustainable living. (Photo: Greendale Secondary School)\nSITizens gave visitors a glimpse of SIT’s Punggol Campus via virtual reality.Students from SIT’s Physiotherapy programme giving sports massages to participants of the run.41\nCOMMUNITY\nFIRST YEAR EXPERIENCE 2022\nWELCOMES NEW SITIZENS\nAfter 2 years of being held online, SIT welcomed over\n3,000 freshmen in person at SIT@Dover for the First\nYear Experience. From 20 to 26 August 2022, freshmen\nlearned more about SIT through a series of induction\nprogrammes — University Life Club Fair, Day Zero and\nHelix. The University Life Club Fair gave freshmen a taste\nof SIT’s vibrant university life through over 100 exhibition\nbooths and 40 student performances and workshops.STUDENT ENGAGEMENT AND DEVELOPMENT\nComplementing SIT’s community efforts is the shaping of future leaders of Singapore through various student activities\nand scholarships.ENGAGING THE MIGRANT WORKER\nCOMMUNITY\nIn January 2023, 3 SIT student groups — Muzeka, Soul\nExtreme and SITintegrates — collaborated with JTC to\norganise a carnival for the migrant worker community.\nActivity booths and performances were held to engage\nand thank the workers who contributed to the construction\nof the SIT Punggol Campus.\nIn addition, SITintegrates partnered with the Ministry\nof Manpower (MOM) and Westlite Papan Dormitory on\noutreach programmes for the migrant worker community.\nIn FY2022, more than 700 migrant workers participated\nin various sports, arts and cultural activities organised\nby SITizens. SIT was recognised as a valued partner of\nthe Assurance, Care and Engagement (ACE) Group at\nan MOM Appreciation Lunch for its efforts in integrating\nmigrant workers into the community.\nSIT students and migrant friends at Punggol Digital District\n(PDD) dormitory having a game of jumbo Jenga.\nDay Zero took place over 7 sessions covering all academic\nclusters and provided a platform for purposeful interaction\nbetween first-year students, seniors, academic staff and\nindustry speakers.\nThe week-long orientation culminated in Helix, where\nfreshmen displayed their talents through performances,\nfostered community resilience and forged new friendships\nthrough various group activities, expanding their social\nsupport for their academic journey.SIT students sharing their cultural game of 5 stones with the\nmigrant brothers.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202342\nFirst Year Experience (FYE) is back as a fully physical event after 2 years of being held in an online/hybrid mode.\nNEW PERFORMING ARTS GROUP\nThe SIT Chinese Orchestra was formed in July 2022\nto celebrate traditional Chinese music and culture and\nfoster a sense of belonging for SIT student musicians on\ncampus. With only 12 initial members, the Orchestra has\n(Left) SIT Chinese Orchestra members with Guest-of-Honour Senior Minister Teo Chee Hean at the Community Chest Fú Dài event.\n(Right) The SIT Chinese Orchestra performing at the Graduation Dinner 2022.\ngrown exponentially to 70 members within 10 months.\nIn their first year, the SIT Chinese Orchestra performed\nat multiple events such as SIT Open House, Student\nLeaders Appreciation Night, Graduation Dinner and the\nCommunity Chest Fú Dài event. 43\nCOMMUNITY\nSINGAPORE UNIVERSITY GAMES (SUNIG)\nSUniG was the highlight of the University sporting calendar\nthat saw SIT pitting its athletes against teams from other\nautonomous universities. The annual sporting affair aims to\nunite students through sports and foster inter-university\nfriendship. SIT was represented by 389 student athletes\nacross 16 sporting categories. The SITizens brought home\n10 medals, including the first gold medal in Men’s Football.\nGROOMING FUTURE LEADERS\nTHROUGH SCHOLARSHIPS\nWe support and nurture our students through a wide\nrange of scholarships made available by the University\nand our partners.\nHeld on 11 November 2022, the annual SIT Scholarship\nAwards and Appreciation Ceremony welcomed 34 new\nSIT Scholars, as well as recognised the contributions\nand achievements of 26 graduating scholars. The SIT\nScholarship aims to cultivate well-rounded individuals\nwho will shape student culture at SIT, contribute to the\ncommunity, assume roles as future leaders for Singapore’s\ngrowing industries, and become responsible global citizens.\nAt the Recognition of Excellence 2022 held on 17\nNovember 2022, a total of 77 Book Prizes, Outstanding\nStudent Awards, Yearly Performance Awards and 198\nScholarships were presented. The awards are made\npossible by the generosity of SIT’s philanthropic partners.\n2 key events were held in November 2022 for scholarship and award recipients.(Top) The SIT Women’s Basketball team received the bronze medal. (Bottom) The SIT Men’s Football Team won the gold medal.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202344\nAt SIT, we believe that a strong culture is essential to align\neveryone toward our mission. While our strategic goals\nestablish where we want to be, culture determines how we\nget there. A shared work culture and values help to keep\nemployees united in purpose, allowing different perspectives\nto help shape and improve outcomes at the workplace.\nBUILDING A STRONG SIT CULTURE\nThe SIT Culture Handbook was launched on SIT Day on\n28 March 2023. The handbook comprises a collection of\nstories contributed by staff that aims to promote a shared\nwork culture in the University.\nThe Culture Induction Programme (CIP) was introduced to\nacquaint employees with SIT’s core values. Commenced in\nNovember 2022, CIP has completed 6 runs of workshops\ninvolving more than 200 participants. The CIP is part of\nSIT’s culture-building effort that introduces new employees\nto the University’s culture, values and mission. EMPLOYEE WELLNESS AND\nWORKPLACE CULTURE\nPROMOTING STAFF WELL-BEING\nWith staff well-being being one of the key pillars of SIT’s\nEmployee Value Proposition, the SIT Staff Well-being\nFramework was launched during the inaugural Staff\nWell-being Day in May 2022. The framework focuses\non 3 areas — mental, physical and social well-being —\nthat will serve as the roadmap for upcoming initiatives\nand programmes.\nLaunched in August 2022, SIT Revitalize is a holistic\nemployee health and well-being programme that\nengages staff through an interactive digital platform\nby a leading corporate health provider, Virgin Pulse.\nWith content spanning physical, emotional, financial and\nmental health, SIT staff have access to evidence-based\ntools and resources that support their health and well-\nbeing needs. To date, 46% of staff have enrolled on SIT\nRevitalize, with half actively engaged on the platform.\nSITIZENS FORM 7 NEW SIT ALUMNI\nGROUPS\nGraduating does not mean having to leave one’s friends\nand interests from university days behind. In 2022,\nmore than 200 SIT alumni came together to form 7 new\nofficial Alumni Groups to stay connected with fellow SITizens who share the same interests. The groups —\nSIT Muzeka Alumni Group, SIT Tennis Alumni Group,\nSIT Running Alumni Group, SIT Handball Alumni Group,\nSIT Air Transport Management (ATM) Alumni Group, SIT\nGlasgow School of Art (GSA) Alumni Group, and SITizen\nAmbassadors Alumni Group — are supported by the SIT\nAdvancement & Alumni Division.\nSIT Culture Handbook and Culture Induction Programme are initiatives to promote a strong workplace culture.45\nCOMMUNITY"
}