{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2020-10/Annual_Report_2020.pdf",
  "type": "pdf",
  "content": "THE JOURNEY SO FAR\nAND THE WAY FORWARDANNUAL REPORT 2020\nSingapore Institute of Technology (SIT) is Singapore’s\nUniversity of Applied Learning. SIT’s vision is to be a\nleader in innovative learning by integrating learning,\nindustry and community.\nIts mission is to nurture and develop individuals who\nbuild on their interests and talents to impact society\nin meaningful ways.FY2019 was a significant year for SIT. We celebrated our ‘5+5’\nmilestone, reflecting on significant dates in our 10 years as an\ninstitute of higher learning, and the last five years as an\nautonomous university. We also took time to review our plans for\nthe next five years, establishing new strategic goals that will take us\ninto the future.\nThe theme for this annual report signifies the SIT journey – looking\nback on our past achievements, appreciating the present situation\nwe are in, while being mindful of a future that is uncertain.\nTHE JOURNEY SO FAR\nAND THE WAY FORWARDANNUAL REPORT 2020COVER ABOUT SIT\nCONTENTS\n01\n02\n04\n06\n08\n09\n12\n22\n34\n3642\n46\n52\n54\n56\n60\n62\n67About SIT\nSIT at a Glance\nChairman’s Message\nPresident’s Message\nSenior Management\nBoard of Trustees\nHighlights of the Year\nKey Moments in the\nSIT Journey\nAcademic Year in Review\nApplied LearningIndustry\nCommunity\nSupport for Students\nDonor\nAcknowledgement\nCorporate\nGovernance\nBoard Committees\n& Internal Audit\nFinancial Statements\nSIT – The Next LapOUR UNIQUE PEDAGOGY:\nAPPLIED LEARNING\nSince its incorporation in 2009, SIT has been offering\napplied degree programmes targeted at growth sectors\nof the economy with a unique pedagogy that integrates\nwork and study. SIT aims to provide diverse pathways and\nskillsets to prepare students for the disruptive future. Its\napplied learning model allows students to spend part of\ntheir curriculum in work-study or industry placements.\nBuilt upon a solid foundation of industry collaborations,\nSIT’s curriculum is designed to enhance students’ industry-\nreadiness. Its signature Integrated Work Study Programme\n(IWSP) exemplifies the best of the university-industry\ncollaboration. Students are immersed in the real working\nworld for up to 12 months, allowing them to gain practical\njob skills and be work-ready.\nAPPLIED RESEARCH\nApplied research is weaved into students’ applied learning\nexperiences, where they work on real industry problems\nand create solutions to meet industry needs. By working\nclosely with the industry, students gain insights and emerge\nas deep specialists in their chosen fields.\nSIT’s degree programmes are grouped into five clusters\n– Engineering (ENG), Chemical Engineering and Food\nTechnology (CEFT), Infocomm Technology (ICT), Health and\nSocial Sciences (HSS), as well as Design and Specialised\nBusinesses (DSB).\nWORK-LEARN CONTINUUM\nSIT strives to strengthen its applied learning focus to\nprepare students to not only be work-ready, but also\nunderstand the importance of learning throughout their\nworking lives. By blurring the boundary between formal\nand lifelong education, SIT is moving towards a work-\nlearn continuum for life and a greater emphasis on skills\nneeded by industry.\nOnce students enter SIT, they embark on their lifelong\njourney to learn, unlearn and relearn, so that they are\nequipped with skills to prepare for the future.\nWE\nARE\nSIT\nSingapore Institute of Technology / Annual Report 2020 / About SIT\n01\nSIT AT A GLANCE\nTHE SIT-DNA6\nCAMPUSES\n5\nPROGRAMME CLUSTERS*\nGRADUATE EMPLOYMENT\nSURVEY 201846 UNDERGRADUATE + 9 POSTGRADUATE\nPROGRAMMESInfocomm\nTechnologyHealth and\nSocial SciencesDesign and\nSpecialised BusinessesChemical Engineering\nand Food TechnologyEngineering9 OVERSEAS UNIVERSITY PARTNERS\n*BEng (Hons) Telematics (Intelligent Transportation Systems Engineering) undergraduate programme is included in both\nEngineering and Infocomm Technology Clusters.\n92.5%\n82.9%Overall\nEmployment\nFulltime\nPermanent\nEmployment SIT Programmes\nSIT-OU Joint Degree\nProgrammesOverseas University\nProgrammesThe Culinary\nInstitute of America\nDigiPen Institute\nof Technology\nThe Glasgow\nSchool of Art\nMassey\nUniversity\nNewcastle\nUniversity\nTechnical University\nof Munich\nTrinity College\nDublin\nUniversity of\nGlasgow\nUniversity of\nLiverpool\nSIT aims to produce work-ready graduates\narmed with more than just paper qualifications,\nbut with skills that can energise industries and\nthe wider community.\nThe SIT-DNA serves as necessary guiding\nprinciples that steer our curriculum design,\npedagogical approach, student interaction and\nSIT culture. These, in turn, nurture students to\nembody the SIT-DNA.16\n18 12Undergraduate\nUndergraduate Undergraduate9PostgraduateCATALYSTS FOR\nTRANSFORMATIONTHINKING\nTINKERERS\nABLE TO LEARN,\nUNLEARN AND RELEARN\nGROUNDED IN\nTHE COMMUNITYSIT@DOVER\nSIT@NP BUILDING\nSIT@NYP BUILDING\nSIT@RP BUILDING\nSIT@SP BUILDING\nSIT@TP BUILDING\n18Undergraduate\nProgrammes4Undergraduate\nProgrammes9Undergraduate\nProgrammes8Undergraduate\nProgrammes8Undergraduate\nProgrammesSingapore Institute of Technology / Annual Report 2020 / SIT at a Glance\n03 02\nCHAIRMAN’S MESSAGE\nFY2019 was an extraordinary and momentous year for SIT as we celebrated our ‘5+5’ milestone, which culminated in the\nGroundbreaking Ceremony for our Punggol Campus last September. That event marked a significant point in a journey\nwhich began as a concept, just over 10 years ago. Today, SIT has carved out a credible niche for itself, championing\napplied learning in Singapore. Coupled with a strong culture and ‘can do’ work ethic, the current leadership has started\nto redefine the meaning and purpose of higher education in Singapore – that obtaining a degree is not necessarily the\nend, but merely the start of a lifelong learning journey.\nWith construction having commenced on our new home in Punggol, faculty members and staff have begun to test-bed\ninitiatives and projects so that we will hit the ground running by the time we move in. Our SIT@NYP Building has been\nrepurposed into a living lab, where various projects involving Internet of Things (IoT), and Industry 4.0 keep faculty and\nstudents on the forefront of developments. It is this pioneering spirit and ethos of always wanting to learn that will\nenable us to achieve what we are beginning to set out in the next chapter of our journey.\nOur Integrated Work Study Programme (IWSP) disrupted\nthe traditional internship model when it was launched and\nremains a salient feature of the SIT experience. Through the\nIWSP , our students are able to take a deeper dive into their\nspecialised professions and are empowered to make decisions\nin a real work setting. Moving forward, we believe that the\nnext area of focus in higher education requires an innovation\nmindset – one that embraces disruption and generates\nsolutions that fuel progress. Our increasing engagements\nwith industry partners continue to provide opportunities for\nfaculty and students to innovate and transform the lives of\nthe community around us. This is evident in the strategic\ncollaborations we established during the year, in various fields\nincluding accounting, energy, food technology, healthcare\nand telecommunications.\nI am heartened to note that demand for our programmes\ncontinues to remain high, with an overall application rate\nof 4.5 times. Today, our staff and faculty work hard to help\nnearly 8,000 enrolled students achieve their dreams as they\nlook forward to joining more than 9,500 alumni who have\nreceived degrees from SIT or one of our overseas university\npartners. I am especially proud of the recent cohort of\ngraduates from the Health and Social Sciences cluster, who\nwere deployed immediately upon graduation to the various\nhealthcare institutions and community care facilities to help\nat the frontlines during the circuit breaker period.\nOne of the main tenets of the work-learn continuum is that\nlearning should be continuous and for life. As a growing\norganisation, we continue to explore new ground and forge collaborations with various government agencies and\nclose industry partners, to ensure that as we move forward,\nour students’ learning journeys are constantly enriched and\nempowering. While striving to sharpen our competitive\nedge, we will remain focused on educating our SITizens to be\nnimble, adaptable and able to thrive in their chosen careers.\nAs SIT continues to grow, we will have to adroitly navigate\nthe ever-changing and fluid economic landscape.\nThe COVID-19 pandemic has brought unprecedented\ndisruption. Adapting to the new normal is going to\nbe challenging. The disruption to our economy has\nresulted in the need for everyone to rethink what a\ncareer means in a post-COVID-19 world. For SIT, this\nmeans having to rethink how we continue to deliver\napplied learning through the use of technology,\nwithout losing that all-important human element\nthat comes from the mentoring experience between\nfaculty and students. It calls for all of us to be versatile,\nadaptable and resilient.\nSIT has responded swiftly to the COVID-19 circuit\nbreaker measures. We came together quickly and\nefficiently as one to support our students, especially\nin mounting full home-based learning and online examinations. We will continue to render support to\nstudents who are facing financial hardship, as well as\nassist graduating students in their job searches and\nupskilling. We will need the same agility to conduct\nour programmes and meet the needs of our students\nas Singapore emerges progressively from the circuit\nbreaker measures.\nWe have come through a challenging period. With\nthe support of our strategic partners – the Ministry of\nEducation, polytechnics, overseas university partners,\nindustry partners, government agencies and community\nleaders – we will continue to forge ahead to establish\nSIT as a premier University of Applied Learning in the\nyears to come.\nOUR INCREASING ENGAGEMENTS\nWITH INDUSTRY PARTNERS CONTINUE TO\nPROVIDE OPPORTUNITIES FOR FACULTY\nAND STUDENTS TO INNOVATE AND\nTRANSFORM THE LIVES OF THE\nCOMMUNITY AROUND US.”“\nMR NG YAT CHUNG\nCHAIRMAN\nEMBRACING CHALLENGES, STAYING UNITED\nAPPLIED LEARNING – SIT’S NEXT LAPSingapore Institute of Technology / Annual Report 2020 / Chairman’s Message\n05 04\nPRESIDENT’S MESSAGE\nFY2019 has been a year like no other. The first part of the year marked the climax of SIT’s ‘5+5’ celebrations, where\nwe commemorated SIT’s five years as an Institute of Higher Learning and five years as an Autonomous University.\nTHE LAST 10 YEARS – CELEBRATING OUR MILESTONES\nTHE NEXT FIVE YEARS – DEEPENING APPLIED LEARNINGSince our inception in 2009, we have achieved many things\nwe can rightly be proud of. We have graduated over 9,500\nstudents since 2012, established a successful Integrated Work\nStudy Programme (IWSP) that now has over 500 local and\nforeign companies offering full-time work attachments to our\nstudents, and our graduates are well-received by industry.\nWe will continue to grow by launching quality degree\nprogrammes that are valued by industry, after close\nconsultation with them and attracting talented applicants\nwho see the value in our applied learning pedagogy. In\n2020, we launched two new degree programmes in Speech\nand Language Therapy, and Digital Communications and\nIntegrated Media. Both programmes are the first to be\noffered by an autonomous university in Singapore, and\ndeveloped by our dedicated faculty, many of whom come\nfrom industry to impart their valuable knowledge to the\nnext generation of practitioners.\nSIT graduates continue to be highly sought-after by industry.\nOur GES results continue to validate our approach to\nlearning – thanks, in no small part, to our supportive industry\npartners. We continue to set new benchmarks each year in\nspite of a tough economy. In the 2017 and 2018 Graduate\nEmployment Survey, we achieved a 92.3% and 92.5% overall\nAs we looked back on SIT’s 10-year journey, we also had the\nfuture in mind. At the annual Strategic Planning Workshop\nheld in August 2019, SIT updated its 5-Year Strategic Plan\nafter many months of lively debates and brainstorming\nto lay out the roadmap for the next five years till FY2024.\nOver the years, SIT has established itself as a thought-\nleader in applied learning. Moving forward, we will deepen\napplied learning by pioneering the work-learn continuum\nand strengthening applied research. The concept of a work-\nlearn continuum resonated at the second Applied Learning\nConference, hosted by SIT in January 2020. The discussions\nrevolved around developing future-ready talents in an era of\ndisruptive changes. One key takeaway was the importance of\nlearning, unlearning and relearning throughout our working\nlives in order to keep up with uncertainties and changes\nin today’s world. employment rate respectively. This is a clear sign that we\nare on the right track.\nAt the turn of the decade, it seemed fitting that the ‘5+5’\nfestivities culminated in the Groundbreaking Ceremony for\nSIT’s future campus in Punggol, held on 10 September 2019.\nWe were honoured to have Prime Minister Lee Hsien Loong\nofficiating this ceremony and attendance from numerous\nministers. We have the opportunity to build a campus\nthat is approachable and aspirational, fostering a vibrant\nenvironment that is both inviting and inspiring. It is indeed\na rare opportunity to re-imagine what a university campus\nof the future will be and work towards realising it.\nOur co-location with JTC’s Punggol Digital District will\nfacilitate the cross fertilisation of knowledge and collaboration\nopportunities among students, faculty and industry\nprofessionals. It will also be a ‘living lab’ that integrates\napplied research and innovation for SIT and its partners.\nThe borderless, highly integrated learning environment will\nstrengthen SIT’s position as an industry-focused university of\napplied learning with a close nexus to the community. The\ncampus can accommodate up to 12,000 students, and will\nserve to support Singapore in becoming a regional hub for\ndigital advancements and talent development.\nGiven our close ties with industry, SIT is well-positioned to\npioneer the work-learn continuum – to become a university\nthat can provide re-skilling and knowledge enhancement\nfor those who are already in the workforce, through the\nfacilitation of authentic learning at the workplace. To do this,\na National Centre of Excellence for Workplace Learning, or\nNACE@SIT, has been set up in collaboration with SkillsFuture\nSingapore to develop workplace learning capabilities for\nleading companies. In the near future, SITizens as well as\nSingaporeans will have many opportunities to enhance their\nlifelong learning journeys. As we say here at SIT: “Once a\nSITizen, always a SITizen.”\nAt the same time, strengthening applied research will also\nbe our key focus in the next five years as this will enable SIT\nfaculty and academic staff to anticipate changes in industry,\nand the experience and best practices gained will, in turn,       GIVEN OUR CLOSE TIES WITH INDUSTRY,\nSIT IS WELL-POSITIONED TO PIONEER THE\nWORK-LEARN CONTINUUM – TO BECOME\nA UNIVERSITY THAT CAN PROVIDE\nRE-SKILLING AND KNOWLEDGE\nENHANCEMENT FOR THOSE WHO ARE\nALREADY IN THE WORKFORCE, THROUGH\nTHE FACILITATION OF AUTHENTIC\nLEARNING AT THE WORKPLACE.”“\nPROFESSOR TAN THIAM SOON\nPRESIDENTbe infused back into their teaching. Applied research\nwill also allow students a first-hand experience in\nsolving industry problems.\nTo support applied research and deepen linkages\nwith industry, SIT has set up a number of Technology\nInnovation Centres in the past year. They include the\nAccounting Technology & Innovation Centre, a joint\ninitiative between SIT and the Singapore Accountancy\nCommission; Energy Efficiency Technology Centre, a\ncollaboration with the National Environment Agency;\nand Food Technology Innovation Centre, a shared\nfood production facility for small batch production,\nin partnership with Enterprise Singapore and JTC\nCorporation. These Centres are pivotal in paving\nthe way for exchange of knowledge, sharing of\nmanpower and resources in applied research, training\nand education.\nSIT has come a long way. In our next chapter towards\nPunggol, it is timely that we are taking steps to\nstrengthen our position as Singapore’s premier\nUniversity of Applied Learning, especially given how\nincreasingly volatile the world has become.Take, for instance, the end of FY2019, which took an\nunexpected turn due to the COVID-19 outbreak. SIT\nstaff, students and partners displayed unity and resilience\nthrough this unprecedented time, often going above\nand beyond their regular work to ensure that business\nwent on as usual. After the Circuit Breaker measures\nwere implemented, staff from various divisions worked\ntirelessly to implement full home-based learning and\nconduct examinations online – the first time that online\nexaminations were conducted on such a large scale.\nIn addition, with the support from our philanthropic\npartners and donors, the Student Relief Fund at SIT\n(COVID-19) raised more than $800,000 in less than\ntwo months, in aid of students who were impacted by\nthe pandemic. In the face of these challenges, I am\nheartened to see how our people here at SIT have\nrisen up to the challenge.\nThe next five years of SIT’s journey will certainly have\nits ups and downs, but it is these values that will keep\nus grounded and take us through any challenges that\nmay come our way.  Singapore Institute of Technology / Annual Report 2020 / President’s Message\n07 06\nSENIOR MANAGEMENT BOARD OF TRUSTEES\nProfessor Tan Thiam Soon\nPresident\n(appointed on 1 February 2013)\nProfessor Chua Kee Chaing\nDeputy President (Academic) & Provost\n(appointed on 1 September 2019)\nProfessor Loh Han Tong\nDeputy President (Technical Development)\n(appointed on 1 September 2019)\nAssociate Professor Ivan B.H. Lee\nVice President (Industry & Community)\n(appointed on 1 October 2015)\nMr Tsoi Mun Heng\nVice President (Planning)\n(appointed on 1 April 2015)Mr Ronnie Tay\nDeputy President (Administration)\n& Chief Financial Officer\n(appointed on 1 July 2019)\nMr Chan Wing Leong\nDeputy President (Campus Development)\n& Chief Investment Officer\n(appointed on 1 July 2019)Mr Ng Yat Chung - Chairman\n(appointed on 23 September 2009)\nChief Executive Officer\nSingapore Press Holdings Ltd\nDr Chia Tai Tee - Trustee\n(appointed on 16 September 2018)\nChief Risk Officer\nGIC Private Limited\nDr Richard Charles Helfer - Trustee\n(appointed on 23 September 2009)\nChairman\nRCH International Pte Ltd\nMs Melissa Khoo - Trustee\n(appointed on 1 December 2019)\nDeputy Secretary (Policy)\nMinistry of Education\nDr Benjamin Koh - Trustee\n(appointed on 16 September 2018)\nDeputy Secretary (Development)\nMinistry of HealthProf Heng Chye Kiang - Trustee\n(appointed on 16 September 2015)\nLum Chang Chair Professor,\nSchool of Design and Environment\nNational University of Singapore\nFOR THE FINANCIAL YEAR ENDED 31 MARCH 2020\nThe Board of Trustees includes 3 Trustees who have served for more than 10 years. These Trustees have broad experience\nand are eminent leaders in their respective fields and their active engagement continues to contribute significantly\nto SIT’s growth and strategic direction, offering continuity through critical periods. All appointments of Trustees were\nendorsed by the Ministry of Education.FOR THE FINANCIAL YEAR ENDED 31 MARCH 2020Singapore Institute of Technology / Annual Report 2020 / Senior Management\nSingapore Institute of Technology / Annual Report 2020 / Board of Trustees\n09 08\nMr Kwee Liong Keng - Trustee\n(appointed on 1 November 2017)\nManaging Director\nPontiac Land Pte Ltd\nMr Nagaraj Sivaram - Trustee\n(appointed on 16 September 2015)\nMr Soon Sze Meng - Trustee\n(appointed on 16 September 2018)\nPresident, International\nJD.com\nProfessor Tan Thiam Soon - Trustee\n(appointed on 1 February 2013)\nPresident\nSingapore Institute of Technology\nMs Tammie Tham - Trustee\n(appointed on 16 September 2018)\nChief Executive Officer\nEnsign Infosecurity Pte Ltd\nMr T K Udairam - Trustee\n(appointed on 16 September 2012)\nChief Operating Officer\nSheares Healthcare Management Pte Ltd\nMr Wen Khai Meng - Trustee\n(appointed on 16 September 2015)\nSenior Advisor, Group Strategy\nCapitaLand LimitedDr Lim Khiang Wee - Trustee\n(appointed on 23 September 2009)\nExecutive Director, CREATE\nNational Research Foundation\nMrs Margaret Lui - Trustee\n(appointed on 16 September 2015)\nChief Executive Officer\nAzalea Asset Management Pte Ltd\nMs Gail Ong - Trustee\n(appointed on 16 September 2018)\nPartner, Equity Capital Markets\nWongPartnership LLP\nMr Quek Gim Pew - Trustee\n(appointed on 16 September 2018)\nChief Defence Scientist\nMinistry of Defence\nMr Ravinder Singh - Trustee\n(appointed on 16 September 2018)\nPresident\nST Engineering Electronics LtdMr Abu Bakar Bin Mohd Nor - Trustee\n(appointed on 16 September 2015)\nGroup Chairman\nInfoFabrica Holdings Pte Ltd\n11 10\nHIGHLIGHTS OF THE YEAR\nSIT has had a fruitful year filled with significant achievements and milestones. It celebrated\nits ‘5+5’ anniversary, commemorating its 10th year of incorporation as an institute of higher\nlearning and fifth year as an autonomous university.\n10-17 APRIL 2019\nSTUDY TRIP TO CHINA\n24 APRIL 2019\nCXO LEAN SUMMIT 201927 APRIL 2019\nTHE ART OF MINGLING AND\nNETWORKING WORKSHOP\n3 JUNE 2019\nINAUGURAL PHARMACEUTICAL\nENGINEERING OVERSEAS\nINDUSTRY ENGAGEMENT DAY2 MAY 2019\nMAPLETREE CHALLENGE\nGRAND FINAL\n30 MAY 2019\nCHEERS IT’S THURSDAY!\n3 MAY 2019\nSIT SCHOLARS’ TEA SESSION1 JUNE 2019\nCAPTAIN’S BALL\nRepresentatives from various divisions\nparticipated in a study trip to China,\nled by Mr Chan Wing Leong, Deputy\nPresident (Campus Development) &\nChief Investment Officer, SIT, to visit\ntechnology companies and universities\nin Shenzhen and Hangzhou. The trip\npresented opportunities to observe the\nuse of smart and emerging technologies\nthat could be deployed in SIT’s future\ncampus in Punggol, in the areas of\nIT infrastructure, library operations,\nfinancial services, as well as innovative\nsoftware applications.\n‘Transform Fire-Fighting into Lean Leadership’ was the\ntheme for the fourth CXO Lean Summit. It saw over 400\nparticipants who heard from keynote speaker Mr John\nShook, Executive Chairman, Lean Global Network (LGN),\nUSA. Companies such as Four Seasons Group, Shalom\nMovers Pte Ltd, and Particle Measuring Systems, Inc., who\nhave embarked on Lean Transformation Innovation Centre\n(LTIC)’s Lean Skills Development Programme (LSDP), also\nshared their lean transformation experiences and how\nthey apply the five core principles of Lean and strive for\nstability within their organisations.How does one present oneself better\nat the workplace through deportment\nand etiquette? At this SIT Alumni Career\nNetwork workshop held at Pan Pacific\nSingapore and conducted by Etiquette\n& Image International, SITizens got some\ngreat tips on the importance of making\na good first impression, as well as the\nbasic approach to the art of mingling.\nThe outreach session was organised to\nprovide Pharmaceutical Engineering\nundergraduates with opportunities to work\nin China for their Overseas Integrated Work\nStudy Programme (OIWSP). Participating\ncompanies GenScript showcased jobs\navailable and Tessa Therapeutics shared\ninsights on living in China from a\nSingaporean perspective.The Mapletree Challenge aims to equip SIT students with job\ninterview and presentation skills while providing them with a\ntest-bed to pitch their entrepreneurial ideas. Supported by\nMapletree Investments Pte Ltd, the inaugural Challenge, which\nbegan in October 2018, culminated in The Grand Final, as six\nteams of students with entrepreneurial ideas for sustainable\ninnovations presented their business ideas before a panel of\ndistinguished judges. Team Trolley presented a flexible trolley\ndesign to improve the workflow in a healthcare setting, and\nclinched the Mapletree Gold award and a cash prize of $5,000.\nThe very first CheerS IT’s Thursday, a social event\nwhere SITizens could unwind together after work\nwithout the pressures of formal networking, drew\nover 50 alumni. At the Japanese gastrobar Kuro\nIzakaya, they reconnected with old friends and\nmade new ones from different academic clusters,\nwhile enjoying a buffet dinner and drinks in the\ncosy environment.\nThe SIT Scholars’ Tea Session is an annual\nevent aimed at strengthening the bond\nbetween SIT scholars and the university.\nGuest speaker Thaddeus Lawrence shared\non ‘Resilience and Grit: Life as a Multi-Day\nMarathon’ – his journey taking on multi-day\nmarathons in the Sahara and Antarctica.\nSIT scholars walked away from the event\nunderstanding their key role in building\nthe name of SIT and how through sheer\nresilience, they can help to cultivate a\nstrong student culture.This friendly game of Captain’s Ball, held at the SIT@Dover\nSports Hall, was the first in a series organised by the SIT\nAlumni Sports Network. Alumni who came together for a\ngood game scored in something else too – the discovery\nof new friends who shared the love of the game.\nMAY\nAPRIL JUNESingapore Institute of Technology / Annual Report 2020 / Highlights of the Year\n13 12\nAUGUSTJULY SEPTEMBER20 JUNE 2019\nFSG ROADSHOW\nMore than $73,000 was raised in support\nof the SIT Bursary through the Faculty\n& Staff Giving (FSG) initiative in 2018,\nmaking possible 24 bursaries for\nfinancially disadvantaged students at\nSIT. In appreciation of this warm-hearted\nsupport, the sixth FSG roadshow was\nheld at SIT@Dover. SIT faculty and\nstaff got the chance to hear from past\nrecipients on how the SIT Bursary made\na difference to them. This roadshow also\nmarked the first time that FSG donors\nhad the choice of directing their gifts to\nAdventureLearn – a new holistic student\ndevelopment platform to help students\nbetter understand and improve their\npersonal learning traits and approaches\nto learning.\n1 JULY 2019\nHO BEE AUDITORIUM NAMING CEREMONY\nAND APPRECIATION LUNCH\n12 JULY 2019\nLAUNCH OF INTEGRATED\nWORK-STUDY DEGREE20 AUGUST 2019\nSTUDENT LEADERS\nTOWN HALL 201922 AUGUST 2019\nLAUNCH OF ACCTECH CENTRE\n23-25 AUGUST 2019\nSTUDENT ORIENTATION 201910 SEPTEMBER 2019\nSIT GROUNDBREAKING CEREMONY\nHeld in appreciation of the $3.25 million endowed gifts from\nHo Bee Land, this naming ceremony and appreciation lunch\nmarked the very first time that a gift was made in support of\nSIT’s future campus in Punggol. In appreciation of Ho Bee\nLand’s philanthropic leadership, the future auditorium at\nPunggol (and the auditorium at SIT@Dover) was named the\nHo Bee Auditorium.\nHo Bee Land’s generous support also made possible the Ho\nBee Scholarship for academically promising undergraduates\nfrom nine degree programmes. Mr Ong Ye Kung, Minister\nfor Education, was the Guest-of-Honour, with Dr Chua Thian\nPoh, Chairman and Chief Executive Officer of Ho Bee Land,\namong the distinguished attendees.\nThe new work-study pathway was launched\nin July 2019 by Mr Ong Ye Kung, Minister for\nEducation. The Integrated Work-Study Degree\nis a “through-train” programme for polytechnic\nstudents aspiring to obtain a degree. Students\non this pathway may obtain both a diploma and\na degree within five to seven years. The pioneer\ndegree programme under this pathway is\nMechanical Design and Manufacturing Engineering.\nThe first batch of seven students from Temasek\nPolytechnic have commenced their Integrated\nWork-Study Degree in April 2020.The biannual Student Leaders Town Hall is\nan important platform to engage SIT student\nleaders through communication of key initiatives\nand a dialogue to exchange ideas.\nParticipating student leaders were from various\nStudent Management Committees, Special\nInterest, Arts & Culture, Sports Clubs and\nService-Learning groups.\nThe freshmen’s journey at SIT began with a three-day, two-night camp, connecting them\nacross different degree programmes and forging a sense of identity as a community of\nSITizens. Over 1,000 students attended the orientation, which aimed to cultivate a sense\nof belonging through experiential learning activities. Specially curated games and activities\nintroduced freshmen to the SIT-DNA and the university’s approach to applied learning.\nHighlights of the camp included the Escape Room, which tested the freshmen’s teamwork\nand trust in one another, as well as the inaugural Amazing Race, where freshmen had to\ncomplete tasks across three SIT@Poly Buildings to win.SIT and Singapore Accountancy Commission jointly\nset up the Accounting Technology & Innovation (AccTech)\nCentre to help the accountancy industry adopt technology.\nIt is a resource centre that catalyses collaboration\namong accounting firms, technology partners and SIT\nto experiment and prototype innovative ideas. The Centre\nwill also provide networking opportunities with thought\nleaders and technology partners. In addition, accounting\nprofessionals can benefit from workshops and symposiums\non advanced accounting technologies, as well as attend\ntraining and attain certifications to upgrade their skillset.\nOfficiated by Guest-of-Honour, PM Lee Hsien Loong, the\nGroundbreaking Ceremony for SIT’s future campus in Punggol\nmarked the beginning of construction. The future campus will\nbe part of the Punggol Digital District that will feature a fit-for-\npurpose campus, where the reimagining of higher education\ncan take place within a community setting.\nDistinguished guests at the event included Mr Teo Chee\nHean, Senior Minister and Coordinating Minister for National\nSecurity; Dr Ng Eng Hen, Minister for Defence; Mr Ong Ye\nKung, Minister for Education; Mr Ng Chee Meng, Minister,\nPrime Minister’s Office; Dr Janil Puthucheary, Senior Minister\nof State, Ministry of Transport and Ministry of Communications\n& Information; Ms Sun Xueling, Senior Parliamentary Secretary,\nMinistry of Home Affairs and Ministry of National\nDevelopment; and Mr Zainal Sapari, Member of Parliament. 19-22 AUGUST 2019\nSIT ENTREPRENEURSHIP DEVELOPMENT\nPROGRAMME (EDP)\n50 SIT students and alumni attended the third\nrun of the EDP together with 20 students from\nthe Shanghai Institute of Technology. During\nthe five-day programme, the participants\nshared and learnt about the development of\ne-commerce in China and its ‘One Belt, One\nRoad’ initiative. The EDP also featured sharing\nby entrepreneurs from Boogle, Nimbus UAV\nand Tueetor.\n28 JUNE 2019\nPRESIDENT HALIMAH YACOB’S VISIT TO SIT\nSIT had the honour of hosting\nPresident Halimah Yacob at\nSIT@Dover, where she spent the\nmorning interacting with SITizens\nand checking out their projects.\nThese included the ‘Light Track\nInspection Vehicle’, a low-cost\ninnovation that improves inspection\nof train tracks, as well as ‘Troll-E’,\na personal mobility device that\ndoubles up as a shopping trolley\nin three quick steps.\n15 14\n17 SEPTEMBER 2019\nINAUGURAL STAFF APPRECIATION DAY3 OCTOBER 2019\nLAUNCH OF EETC28 SEPTEMBER 2019\nLEATHER CRAFT WORKSHOP\n12 OCTOBER 2019\nEXPRESSIT 201918-20 OCTOBER 2019\nSIT SCHOLARS’ LEADERSHIP CAMP\nThe inaugural Staff Appreciation Day\nwas held for the SIT family as part\nof the ‘5+5’ celebrations. A total of\n88 staff received five- and 10-year\nlong-service awards – the first time\nthat 10-year awards were given out.\nA ‘Moments Exhibition’ was also\nput together to showcase significant\nmilestones during SIT’s journey.The Energy Efficiency Technology Centre (EETC)\nwas established by SIT in collaboration with the\nNational Environment Agency (NEA) to drive energy\nefficiency initiatives for Singapore’s manufacturing\nindustries. Companies can work with EETC to\nconduct energy assessments of their facilities to\nestablish their energy consumption standards, as\nwell as to upskill their engineers through courses.\nEETC will also build a pipeline of engineering\nundergraduates with experience in energy\nassessments for the industry. Our alumni seized the opportunity to join the\nLeather Craft Workshop at Bynd Artisan’s\natelier in Holland Village. Presented by the SIT\nAlumni Leisure Network, this turned out to be\none of the most popular alumni workshops\nyet. The response was so overwhelming that\na second session had to be organised on\nthe same day – at the end of which, SITizens\nproudly took home a leather cardholder that\nthey had learnt to make from scratch, under\nthe guidance of experienced craftsmen.Organised by and featuring student artistes from the\nArts and Culture clubs, the annual production promoted\nskills and knowledge sharing among all performers.\nThemed ‘Seasons’, ExpresSIT 2019 encouraged\nstudents to collaborate innovatively with one another\nto create a narrative around the four seasons – Spring,\nSummer, Autumn and Winter. The SIT Scholars’ Leadership Camp was held at the\nWest Coast Campus of the National Community\nLeadership Institute. The three-day, two-night camp saw\n32 newly-minted SIT Full Term and Mid Term Scholars\nparticipate in workshops and team-building activities\ndesigned by the senior batches of SIT Scholars. Aside\nfrom building a sense of continuity amongst different\nbatches of SIT Scholars, the camp also offered a platform\nfor SIT to share its vision for its student leaders and how\nthey can help in the building of SIT’s reputation.3 OCTOBER 2019\nDIALOGUE WITH SITIZENS 2019\nOrganised by SIT students, the second Dialogue with SITizens\nwas a platform for the SIT community to engage with notable\npolitical figures on contemporary issues facing the nation.\nSpeaking on ‘Catalyst for Economic Growth: Competitive\nSkillset’, Mr Chan Chun Sing, Minister for Trade and\nIndustry, shared how the youth of today could best equip\nthemselves with the necessary skillsets to navigate their way\nin today’s disruptive environment.\n16-18 OCTOBER 2019\nSIT GRADUATION CEREMONY\nHeld over six sessions at The Theatre at MediaCorp, the 2019\nGraduation Ceremony marked several records. An all-time high\nof 1,868 graduates received their degree scrolls – 1,401 from\nSIT-conferred and SIT-joint programmes, as well as 467 from\nprogrammes conferred by overseas university partners. A record\nnumber of 13 degree programmes produced 372 pioneer graduates,\nincluding those from Sustainable Infrastructure Engineering\n(Building Services), Telematics (Intelligent Transportation\nSystems Engineering), and Pharmaceutical Engineering.\nOCTOBER\n17 16\nDECEMBERNOVEMBER29 OCTOBER-1 NOVEMBER 2019\nWELLNESS WEEK 201930 OCTOBER 2019\nRECOGNITION OF EXCELLENCE\n1 NOVEMBER 2019\nNEW ALUMNI WELCOME PARTY2-4 DECEMBER 2019\nINAUGURAL LOCAL\nEXPERIENCE PROGRAMME\nTo raise awareness on the effects of stress on mental\nhealth and to build a sense of community and peer\nsupport, a series of activities was held across all six SIT\ncampuses. Students shared messages of support and\ncontributed songs that helped them through hard times\nto a shared Spotify playlist – poSITive Vibes. They were\nalso given tips on coping with stress as well as various\nsupport resources.Now in its fifth year, the Recognition of Excellence\n(ROE) celebrates the achievements of SIT students\nand honours the generous donors whose support had\nnurtured student excellence. Held at the SIT@Dover\nSports Hall, the year’s turnout was the largest yet. Close\nto 800 attendees, including SIT’s donors and friends,\nSIT senior management, faculty and staff, as well as the\naward and scholarship recipients and their loved ones,\ncame together for this key university event. A total of\n98 Book Prizes, Awards and Gold Medals, and 168 non-\nbonded scholarships were given out by Prof Tan Thiam\nSoon, President and Prof Chua Kee Chaing, Deputy\nPresident (Academic) and Provost.SIT’s eighth New Alumni Welcome Party was back at\nthe Hard Rock Café Singapore at Orchard, where more\nthan 280 new alumni, SIT senior management, faculty\nand staff, as well as representatives from SIT’s overseas\nuniversity partners had a rolling good time. Over a\nsumptuous buffet dinner, the merrymakers enjoyed\nenergetic performances and took part in party games.\nLucky party-goers also won attractive prizes such as an\nApple Watch Nike+, Dyson Supersonic Dryer and DJI\nOsmo Pocket Camera from the lucky draw.The Local Experience Programme (LEP) is part of the Aircraft\nSystems Engineering (ASE) degree programme developed\nby SIT, in collaboration with SIA Engineering Company.\nThe LEP provides ASE students with an opportunity to learn\nabout the broad spectrum of industrial work and gain a better\nunderstanding of the aerospace community in Singapore.\nDuring their LEP , the students visited seven MRO companies\n– ST Engineering Aerospace, Eagle Services Asia, GE Aviation,\nHoneywell, Singapore Component Solutions, Thales and SAESL\n– to understand the technologies, processes, and career paths\nwithin the aerospace industry.\n24 OCTOBER 2019\nCOMMUNITY CARE INDUSTRY\nNETWORKING DAY 2019\nTo raise awareness of careers in the community care setting,\nthe Community Care Industry Networking Day was organised\nby SIT with support from the Agency for Integrated Care and\nNational Council of Social Service. The event saw participation\nfrom 24 organisations, and was attended by the first cohort\nof Dietetics and Nutrition students, as well as Year 1 students\nfrom the Allied Health and Nursing programmes.29 OCTOBER 2019\nSINGAPORE ENERGY AWARD (SEA) 20195 DECEMBER 2019\nLINKEDIN 101 WORKSHOP SIT was presented with the Singapore Energy Award (SEA)\n2019 for Capabilities Development for its pioneering\nrole in leading manpower development in power\nengineering. Held in conjunction with the Singapore\nInternational Water Week 2019, the biennial SEA recognises\noutstanding contributions to Singapore’s energy sector\nin the areas of capabilities development and innovation.\nSIT was acknowledged as the first local institute of higher\nlearning to offer a dedicated Electrical Power Engineering\nundergraduate degree, which has helped groom talent\nfor the sector.  More than 50 alumni and graduating\nstudents visited the LinkedIn offices\nat Marina Bay Financial Centre for an\ninformational workshop on the popular\nsocial platform for professional networking\nand career development. Participants\nlearned how to optimise their LinkedIn\nprofile to benefit their careers.\n13 NOVEMBER 2019\nSIT SCHOLARSHIP AWARDS AND APPRECIATION CEREMONY\nClose to 300 guests, including Mr Ng Yat Chung,\nChairman, SIT Board of Trustees, SIT senior\nmanagement, SIT Scholars, as well as their\ninvited guests, attended this flagship event.\nThe ceremony welcomed 32 newly-appointed\nSIT Scholars, and celebrated the achievements\nof its 19 graduating scholars as well. At the same\ntime, as part of SIT’s ’5+5’ celebrations, the\nevent saw more than 20 graduated SIT Scholars\nattending the event and sharing their industry\nexperiences with their juniors.\n19 18\nMARCHJANUARY10 DECEMBER 2019\nNIGHT@THE PROJECTOR\n17 JANUARY 2020\nLEADERSHIP APPRECIATIONAt The Projector, one of Singapore’s\nhidden cineplex gems, SITizens were\ntreated to a special cinema experience.\nThere, they enjoyed a delicious\nbuffet spread and networking session\nbefore settling in to find out all about\n‘Parasite’, the acclaimed South Korean\nfilm that would go on to win the Oscar\nand several major awards.15 JANUARY 2020\nCAREER NEXUS 2020\nFor the first time, Career Nexus 2020 was\norganised as a single event offering both\nIWSP and full-time employment opportunities\nfor students. The largest SIT career event to\ndate saw participation from 177 companies\nand over 1,700 students from 24 degree\nprogrammes. Highlights of Career Nexus\nincluded industry sharing and networking\nsessions, as well as a series of recruitment\ntalks and career-essential activities for\ngraduating students.\nHeld for the first time at SIT@Dover, this\ninaugural ceremony celebrated the\nphilanthropic leadership of SIT’s donors\nwho nurture students through various forms\nof financial aid. In the decade preceding,\nthese donors had made possible 2,572\nbursaries, grants and other forms of\nfinancial aid for our less privileged but\ndeserving students, many of whom were\nthe first in their families to attend university.\nClose to 200 attendees participated in the\nafternoon’s festivities.6-31 JANUARY 2020\nINSTITUTE-VARSITY-POLYTECHNIC\nGAMES (IVP GAMES)\nIVP Games 2020 was a celebratory year in the university’s sporting calendar.\nSIT athletes competed against 12 other institutions and clinched its biggest\nachievement to date, with a total of eight podium finishes. It was history\nin the making for the Track and Field team as they bagged SIT’s first Gold\nmedal at the IVP . The Bowling team also achieved an individual Gold and a\nteam Bronze in the Women’s category with an impressive display of strength\nand precision. The SIT Women’s Floorball and Netball teams also made\ntheir debut in the competition after qualifying through the Singapore University\nGames (SUniG) for the first time.\n11-12 JANUARY 2020\nSIT OPEN HOUSE 2020\nThe SIT Open House, held at Suntec Convention\nand Exhibition Centre, marked the start of the 2020\nAdmissions Exercise. The flagship event highlighted\nthree elements of SIT – range of undergraduate and\npostgraduate degree programmes, outstanding\nstudent projects, and state-of-the-art lab equipment.\nSIT also continued to feature ‘Stories of SITizens’ as\nwell as ‘Singularly Talented SITizens’, which presented\nnarratives of its current students, scholars and alumni,\nas well as endorsements from parents of SITizens. The\nevent saw close to 5,000 visitors over the weekend and\na record 7,600 attendees at the talk sessions.3 JANUARY 2020\nSITIZEN AMBASSADOR INVESTITURE 2020\nSITizen Ambassadors are students who embody the core\nvalues of the SIT-DNA, who help co-create the present\nand future of SIT as a premier University of Applied\nLearning. In September 2019, the first group of SITizen\nAmbassadors was selected through a rigorous interview\nprocess. This multi-divisional programme calls for the\nSITizen Ambassadors to serve and represent the university\nthrough hosting networking events, as well as outreach\nand facilitation programmes. The event marks the start\nof their journey.\n9-14 MARCH 2020\nSIT DISCOVERY SERIES\nThe inaugural SIT Discovery Series was\nconceptualised in view of SIT’s precautionary\nmeasures to safeguard the community against\nCOVID-19. It replaced the annual SIT Discovery\nDay event and provided an opportunity for\nprospective students, and their parents, to\nfind out more about SIT’s degree programme\nofferings and the admission processes through\na series of webinar sessions. The virtual series\nsaw over 11,000 unique prospective students\nand parents tuning into the webinars via Zoom\nand Facebook. The week-long event was held in\ntandem with other online efforts such as the ‘Let’s\nGet Real’ talk show series on Facebook, which\naveraged 10,000 views per programme.\n12 MARCH 2020\nMAPLETREE INNOVATION AND\nENTREPRENEURSHIP FORUM\nThe second edition of the Forum – part of The Mapletree Challenge\norganised by SIT and supported by Mapletree Investments Pte Ltd –\nfeatured a hybrid structure due to the COVID-19 outbreak. A panel of\ntop industry leaders came together for an evening of idea-sharing on\nentrepreneurship and innovation held before a group of about 50\nparticipants at SIT@Dover. ‘Watch parties’ were also held among the\nSIT community, as the forum was streamed live to the public via the\nSIT Facebook page, with viewers sending in their questions during\nthe audience participation segment.\n30-31 JANUARY 2020\nAPPLIED LEARNING CONFERENCE 2020\nOrganised by SIT and held at Sands Expo and Convention\nCentre, the second Applied Learning Conference was graced\nby Guest-of-Honour Mr Ong Ye Kung, Minister for Education, and\nwas attended by more than 400 local and overseas academia and\nindustry partners. Compelling discourses revolving around the\ntheme of ‘Developing Future-Ready Talents in An Era of Disruptive\nChange’ were facilitated. Featuring renowned thought leaders, the\nconference provided a platform for various education trends and\nperspectives, concepts of applied learning\nand international best practices to be shared.\n21 20\n2019  was a milestone year for SIT as we\ncelebrated our 10th year of incorporation as an\ninstitute of higher learning and our 5th year as\nan autonomous university.\nWe have accomplished much because of the\npassion, enthusiasm and hard work of all those\nwho have been, and continue to be, a part of\nthe SIT story.\nHere are 10 key moments in our ‘5+5’ history.\n23 22\nKEY MOMENTS IN THE SIT JOURNEY\nSIT’S JOURNEY BEGAN\nIN 2009 TO PROVIDE\nMORE OPPORTUNITIES\nFOR POLYTECHNIC\nGRADUATES\nPARTNERING\nREPUTABLE\nOVERSEAS\nUNIVERSITIES\n02\n01Singapore Institute of Applied Technology (SIAT) was incorporated\nin September 2009 to provide more opportunities for polytechnic\ngraduates to obtain recognised degrees. Just six months later,\nSIT was launched to offer polytechnic graduates more choice\nof obtaining a specialised degree, in collaboration with renowned\noverseas universities.\nSIT’s first five Overseas University (OU) partners were reputable\nnames in the fields of engineering, game design and hospitality.\nThis approach set the foundations for offering specialised,\nindustry-relevant degrees.\nBYYEOSHANG LONG\nMACBETH, when taught at Com-\npassvale Secondary School, incul-\ncates not only an appreciation for\nliterature, but also character and\nconfidence.\nUnder the North Star Educa-\ntion Programme – a school\nscheme that aims to develop stu-\ndents holistically – students also\nlearn about the pitfalls of greed\nand jealousy when studying theShakespeare play.\nThe Secondary 1 students then\nform groups, each of which is allo-\ncated a scene from the play. They\nbrainstorm ideas on acting out\nthe scene and getting props and\ncostumes. In the process, the stu-\ndents learn how to work together\nas a team.\nTheir efforts culminate in a\nplay staged in class, giving them a\nchance to hone their public speak-\ning skills.Madam Asvinder Kaur, who\nteaches English and literature to-\ngether in a subject known as Lan-\nguage Arts, noted that “lessons\nnow have a lot of hands-on activi-\nties” and are focused on the proc-\ness of learning rather than just\nthe outcomes alone.\nStudent Umairah Saidon, 13,\nsaid: “Macbeth taught us how to\nrespect others and not to only\nthink about yourself.”\nYeo Jin Hua, 12, who played\nMacbeth, said his group was ini-\ntially caught up in “complaining\nabout who was doing the most\nwork, and who was doing no\nwork”. “But eventually we\nstopped complaining and learnt\nto work together,” he said.BYSANDRA DAVIE\nSENIOR WRITER\nTHE Singapore Institute of Technology (SIT)\nwill start running foreign university degree\nprogrammes for polytechnic graduates in Au-\ngust, earlier than originally planned.\nSIT initially planned to start offering the\ncourses next year.\nBut Education Minister Ng Eng Hen said\nyesterday “good progress” had been made\nand as a result, SIT can start its degree pro-\ngrammes ahead of time.\nThe admission process for eight degree\nprogrammes from five top institutions rang-\ning from culinary arts to video game design\nwill now start today.\nThe Government will provide a roughly 75\nper cent fee subsidy for the two-year degree\ncourses – the same as the subsidies it pro-\nvides for undergraduates at the three localuniversities. Fees will be about $18,000 over\nthe two years.\nThe SIT’s five partner institutions are\ntop-notch in their fields of specialisation.\nThey include the Technical University of Mu-\nnich, the German science and engineering in-\nstitution which has produced 15 Nobel prize\nwinners; the Culinary Institute of America\n(CIA), consistently ranked as the best culi-\nnary school in the United States; and the\nDigiPen Institute of Technology, dubbed the\nHarvard for video game developers.\nThe other two are the University of Ne-\nvada, Las Vegas, ranked in the top two for\nhospitality programmes in the US; and the\nUniversity of Newcastle, part of the prestig-\nious Russell Group of universities in Britain.\nThe SIT, now headquartered in North\nBridge Road, says the admission process will\ntake a student’s grades, extra-curricular ac-\ntivities and personal qualities into account.\nWork experience will be key and all candi-\ndates will be subject to interviews.\nDr Ng made the announcement when he\nspoke about expanding university places fur-\nther this year.\nThe SIT will add more degree pro-\ngrammes over the next few years and eventu-\nally offer 2,000 places to polytechnic gradu-ates every year.\nDr Ng said that with the opening of the\nSingapore University of Technology and De-\nsign next year and the expansion of SIT pro-\ngrammes, the Government will be on track\nto meet the 2015 target of having 30 per cent\nof a cohort attend university.\nNoting that SIT’s partners were picked\nfor their high academic standing and strong\nindustry links, he said all institutes of higher\nlearning must strive to be the best in their\nclass globally. “This is the best way to serve\nSingaporean students, because they are then\nassured that their graduation certificates are\nworth something and will not diminish over\ntime,” he added.\nThe Education Ministry said faculty mem-\nbers from partner universities will be in-\nvolved in teaching students.\nStudents will also enjoy industrial attach-\nments, internships and exchange pro-\ngrammes at partner universities.\nDr Ng also revealed that his ministry will\ninvest up to $1 billion to increase capacity at\nthe five polytechnics.\nThis means that by 2015, 45 per cent of a\nPrimary 1 cohort can access polytechnic edu-\ncation, up from the 42 per cent now.\nThe five polytechnics took in about\n25,000 students last year.\nPolytechnic graduate Terence Chuah,\nwho studied culinary management at Te-\nmasek Polytechnic, was impressed that SIT\nwas able to bring in the renowned CIA.\nThe 22-year-old, who is now in national\nservice, said: “I used to dream of going to\nCIA. It would have cost at least $200,000 in\nfees and living expenses over four years. My\nparents don’t have that kind of money.\n“But with CIA here and the subsidy, it is\nwithin my reach. I can’t wait.”\nsandra@sph.com.sg\nTHE first few batches of students\nentering the Singapore University\nof Technology and Design (SUTD)\nwill pay subsidised yearly fees of\nabout $11,000 – but future under-\ngraduates will pay significantly\nmore.\nThis, Education Minister Ng\nEng Hen said yesterday, is so that\nstudents bear a fair share of costs\nfor the recruitment of top faculty\nand for state-of-the-art facilities\nat Singapore’s fourth university,\nscheduled to open next year.\nThe Government currently sub-\nsidises 75 per cent of course fees\nat the three autonomous universi-\nties with students paying the rest.The $11,000 in fees that the\nfirst SUTD cohorts will pay ac-\ncounts for 17 per cent of the total\nfees, Dr Ng said. But once facili-\nties are set up, students will pay\nmore than 25 per cent of the fees.\nAnnual fees for degree pro-\ngrammes at the Nanyang Techno-\nlogical University, National Uni-\nversity of Singapore and Singa-\npore Management University\nrange from $6,000 to $10,000,\nbut medicine and dentistry stu-\ndents pay close to $19,000.\nUsing the Massachusetts Insti-\ntute of Technology – which charg-\nes about $53,000 yearly – as an\nexample, Dr Ng said the SUTDwill, like leading American univer-\nsities, have a more equitable fund-\ning model based on endowment,\nscholarships and grants.\nStudents in such institutions\nare asked to pay much higher fees\nas they would be the “prime bene-\nficiaries” after graduating from\nthese prestigious universities.\nBut he gave the assurance that\nadequate financial schemes will\nbe in place. “We will still main-\ntain our standing policy for SUTD\nthat no student who can benefit\nfrom its education will be denied\nthat opportunity due to lack of\nmeans.”\nLEOW SI WANBYCLARISSA OON\nCHINESE language teaching will remain\ntailored to students’ abilities, with oral\nskills emphasised for the majority, and\nample opportunity for the best to go as\nfar as they can.\nEducation Minister Ng Eng Hen gave\nthis reassurance yesterday to four Mem-\nbers of Parliament, who cautioned\nagainst lowering Chinese language stand-\nards across the board.\nThe exchange came amid an ongoing\nreview of how the three mother tongues\nare taught in schools, given that the moth-\ner tongue is now used less often in Chi-nese, Malay and Indian homes.\nThe review, led by the Director-Gener-\nal of Education Ho Peng, will be complet-\ned at the year’s end, said Dr Ng.\nIt will redesign the mother tongue cur-\nriculum to recognise “the wider range of\nstarting points and prior backgrounds of\nour pupils, and devise customised ap-\nproaches”, Dr Ng said.\nFar from losing its bilingual edge, Sin-\ngapore wants to strengthen it by not alien-\nating the majority of students with moth-\ner tongue lessons pitched at too difficult\na level for them, he clarified.\n“With the rise of China, being bilin-\ngual is a valuable cachet. Similarly too forthose who speak Malay or Tamil languag-\nes as markets in Indonesia, Malaysia and\nIndia expand,” he added.\nA perennial hot-button issue, Chinese\nlanguage standards have resurfaced as a\ntopic of debate in recent months. The\nMinistry of Education (MOE) had said it\nwas reviewing the curriculum now that\nsix in 10 ethnic Chinese students entering\nPrimary 1 come from predominantly Eng-\nlish-speaking homes.\nThe last Chinese language review six\nyears ago introduced a modular curricu-\nlum pegged to students’ abilities.\nNew changes in the pipeline, revealed\nby Dr Ng last December, include modify-ing how Chinese language proficiency is\ntested, taking a leaf from overseas exami-\nnation models tailored for students with\nlittle or no exposure to Chinese at home.\nBut Mrs Josephine Teo (Bishan-Toa\nPayoh GRC) warned yesterday against\nbasing the review “on the assumption\nthat (the mother tongues) have become\nmore like foreign languages in Singa-\npore”.\nThe MP, who chairs the Government\nParliamentary Committee for Education,\nnoted the popularity of Chinese-language\nmedia here, as well as how Mandarin and\nChinese dialects can be heard every day\nin public places.“So, I hope the MOE does not adopt a\ndefeatist attitude when reviewing the\nteaching of mother tongues and end up\neroding our language environment to our\nown detriment,” she said.\nThe call to have more creative meth-\nods of teaching Chinese, rather than low-\nering standards, was also made by Work-\ners’ Party leader Low Thia Khiang (Hou-\ngang), Nominated MP Teo Siong Seng\nand Mr Baey Yam Keng (Tanjong Pagar\nGRC).\nReplying, Dr Ng said Singapore would\nnot swing to the extreme of teaching the\nmother tongues as foreign languages. He\nurged teachers to take advantage of the\nmass media and pop culture to encourage\nstudents to use these languages daily.\nMore details on how language teaching\nand curriculum will be tweaked will be an-\nnounced in Parliament today./L50237Technical University of Munich\n(Technische Universitat\nMunchen) has produced 15 Nobel\nPrize winners and 10 recipients of\nthe Gottfried Wilhelm Leibniz\nPrize, the highest German\nresearch prize.\nIt is among nine elite schools\nthat receive national funding for\nresearch under the German\nUniversities Excellence Initiative.\nTUM will offer three\nspecialisations: microelectronics,\nintegrated circuit design and\nautomation.\n/L50237Newcastle University is a\nmember of the Russell Group, an\nassociation of leading\nresearch-intensive universities in\nBritain.\nThe Bachelor of Engineering in\nMarine Technology programme it\nwill offer has three\nspecialisations: naval\narchitecture, marine engineering\nand offshore engineering.\n/L50237DigiPen Institute of\nTechnology’s graduates are\nhighly sought after by top game\ndevelopers and publishers such as\nNintendo, Electronic Arts,\nLucas-Arts, Sony, Microsoft and\nDreamworks.The two degrees it will offer\nare: Bachelor of Science,\nspecialising in real-time\ninteractive simulation/game\ndesign and Bachelor of Arts,\nspecialising in production\nanimation/game design.\n/L50237The Culinary Institute of\nAmerica is among the best and its\nstudents have become leading\nchefs and restaurant owners as\nwell as media personalities.\nIts alumni include Anthony\nBourdain (author, chef and TV\nhost) and Roy Yamaguchi\n(author, restaurant owner and\nformer TV Iron Chef).\nDetails of the degree course\nwill be confirmed soon.\n/L50237The University of Nevada, Las\nVegas William F. Harrah College\nof Hotel Administration is\nconsistently ranked in the top\ntwo for hospitality undergraduate\nprogrammes in the United States.\nIts alumni include Mr Scott\nSibella, president of Mirage Hotel\nand Casino, and Mr George\nMaloof, owner and chief\nexecutive of The Palms Casino\nResort.\nIt will offer a Bachelor of\nScience in hotel administration.\nCompassvale Secondary 1 students Yeo Jin Hua (left) and Edmund Gang, both 12, acting out a scene from Shakespeare’s\nMacbeth under the North Star Education Programme, which aims to develop students holistically .ST PHOTO: CHEW SENG KIMAdmission process begins\ntoday for 8 courses from\n5 top foreign institutions\nLearning about confidence,\ncharacter – from MacbethLanguage teaching will not ‘swing to extreme’Degrees for poly\ngrads launched\n4th varsity’s fees to go up progressivelyMINISTRY OF EDUCATION\nCourses offered by 5 top instituteshome /L50237budget debate\nTHE STRAITS TIMES WEDNESDAY, MARCH 10 2010 PAGE B10\nA 14-MEMBER high-level board has been appoint-\ned by the Education Ministry to chart new direc-\ntions for polytechnic graduates seeking a university\neducation, with a strong industry focus.\nHeading the board of the new Singapore Insti-\ntute of Technology (SIT) is Mr Ng Yat Chung, a sen-\nior managing director at investment house Temasek\nHoldings.\nThe institute will manage and implement degree\nprogrammes offered by foreign universities in part-\nnership with the five polytechnics.\nThe SIT board, made up of key individuals from\nmedicine, telecommunications, law and Govern-\nment, has also appointed Professor Tan Chin Tiong\nas its president.\nProf Tan was the founding member of the Singa-\npore Management University and has been its prov-\nost and deputy president since 1999.\n“Over the years, more and better students are\nopting for polytechnic education. SIT will offer new\ndegree opportunities in Singapore to this large pool\nof students,” Prof Tan said.\n“I look forward to the many challenges ahead for\nSIT and believe that it will contribute significantly\nto the new landscape of higher education in Singa-\npore.”\nSIT will work with the foreign universities to of-\nfer degree courses but the classes will be mostly\nconducted at the five polytechnic campuses.\nThe institute intends to offer places for 2,000\nfull-time and 1,500 part-time students yearly by\n2015. The full-time courses are expected to last two\nyears while the part-time courses can take up to\nfour years.\nSince 2007, six foreign universities have part-\nnered three local polytechnics to offer niche de-\ngrees in areas such as optometry and early child-\nhood education.\nCurrently, just 300 students are enrolled in the\ntwo-year degree programmes run by the six over-\nseas universities.BYJEREMY AUYONG\nAFTER a year of being on the defen-\nsive, the labour movement now wants\nto go on the offensive.\nYesterday, labour chief Lim Swee\nSay gave a bullish outlook for the job\nmarket in the coming year, saying the\nNational Trades Union Congress\n(NTUC) wants to get Singapore back\nto full employment next year as well\nas ramp up efforts for groups like the\nPMETs (professionals, managers, exec-\nutives and technicians), who have\nbeen severely hit in this downturn.\n“This year was the year of the de-\nfensive play – save jobs and keep re-\ntrenchment down,” he said.\n“The year 2010 is going to be the\nyear of the offensive play. We are go-\ning all out to score goals, to pursue\nhigher economic growth, to pursue\nstronger job creation, to lower the un-employment rate and at the same\ntime, increase the employment rate.”\nMr Lim’s target is for an overall un-\nemployment rate of under 3 per cent,\na full employment level Singapore has\nenjoyed for most of the past 10 years.\nIn fact, the unemployment rate in\n2007 was 2.1 per cent.\nAs for boosting employment, he\nsought not just to draw groups like\nwomen and older workers back to\nwork, but also make better use of\nPMETs.\n“We hope the re-employment rate\ncan be further increased, the structur-\nal unemployment can be further re-\nduced and more importantly, un-\nder-employment among the mid-\ndle-aged PMETs can be further avoid-\ned through retraining, reskilling,” he\nsaid.\nMr Lim, NTUC’s secretary-\ngeneral, was speaking at a press confer-\nence, alongside his colleagues, to re-\nview the labour movement’s work this\nyear and to give a peek into its plans\nfor the year ahead.\nDetails of its plans will be unveiled\nin February when it holds its Work-\nplan Seminar. It decided to wait until\nthe Economic Strategies Committee re-leases its recommendations, which are\ndue next month.\nHowever, the remarks made yester-\nday indicate that next year’s plans will\nbe a departure from this year’s more\nconservative approach.\nMr Lim described NTUC’s efforts\nthis year as “less pain, more gain”.\nThis is how he explained what it\nhad set out to do at the start of the\nyear: “Less pain for the worker, less\npain for the companies, less pain for\nthe Singapore economy in a downturn\nand hopefully, more gain for the work-\ners, businesses, economy in an up-\nturn.”\nOn both counts, he said, the NTUC\nhad been largely successful.\nHe noted that Singapore was\namong only a handful of countries\nthat can boast a low unemployment\nrate (less pain) and a quick recovery\nfrom the downturn (more gain).\nThe Singapore economy grew by\n14.2 per cent in the third quarter over\nthe second quarter. Latest official fig-\nures put the unemployment rate at 3.4\nper cent. In contrast, the United\nStates economy grew by only 2.8 per\ncent during the same period, while its\nunemployment rate hit 10 per cent.In fact, the efforts of the unions,\nthe Government and employers this\nyear meant that by most measures,\nthe pain for workers during this crisis\nwas less than in previous slumps, he\nsaid.\nFor instance, the NTUC estimates\nthat Singapore will end the year with a\ntotal of 20,000 workers retrenched.\nThe total is about one-third lower\nthan the 29,000 recorded in 1998 dur-\ning the Asian financial crisis.\nMuch of the credit can be traced to\npain-relief measures rolled out this\nyear, such as the Jobs Credit wage sub-\nsidy scheme and the Spur subsidised\ntraining scheme which coaxed compa-\nnies to retain, not retrench, workers\nas well as to send them for training.\nThe NTUC, on its part, urged com-\npanies to cut costs to save jobs, and\nhelped retrenched workers get back on\ntheir feet quickly.\nSaid Mr Lim: “Even though we had\nnot been able to keep retrenchment ze-\nro, we made every effort possible to\nmake sure not every retrenched work-\ner has to end up being unemployed. So\nif you are retrenched, very quickly we\nretrain them and get them back to\nwork again.”\nNTUC’s Employment and Employa-\nbility Institute (e2i) found jobs for\n16,000 of the 27,000 that went to it\nfor help.\nFor 59-year-old Sim Bai Hai, “less\npain” was the story of his year. He lost\nhis job in the textile industry in Au-\ngust, but was back in the workforce as\na security guard by October after at-\ntending courses in e2i.\n“I just stayed positive and tried to\nlearn new things,” he said.\njeremyau@sph.com.sg\nBoard to chart\npath for poly grads\nseeking degrees\nLabour chief says aim\nis to get S’pore back\nto full employment\nREAD ALL\nABOUT\nIT IN DL\nTOMORROW\nHIDDEN iPHONE SHORTCUTS\nImpress even veteran usersNTUC bullish about\njob market in 2010\nhome /L50237\nTHE STRAITS TIMES TUESDAY, DECEMBER 29 2009 PAGE B3\nBYSIALINGXIN\nANATIONAL institute,\nset up to help diploma\nholders upgrade their\nqualifications to a degree from\nforeign universities, will start\nclasses from August – a year\nahead of schedule.\nThe Singapore Institute of\nTechnology (SIT), which was es-\ntablished last year, will be offer-\ning eight degree programmes –\nin fields such as culinary arts\nand video-game design – from\nfive top overseas institutions.\nFor a start, about 500 vacan-\ncies in all will be available\nacross the eight courses, but the\nexact number for each course\nwill depend on the demand and\nideal cohort size.\nThe institute aims to in-\ncrease this number to 2,000 in\nfive years’ time.\nClasses are starting ahead of\ntime because the SIT has made\ngood progress on this major ef-\nfort, said Dr Ng Eng Hen, Minis-\nter for Education, yesterday.\nIn a debate on the Budget es-timates for the Education Minis-\ntry (MOE) yesterday, he said\nthat the SIT and other higher in-\nstitutes of learning will act as en-\ngines to power Singapore’s next\nphase of growth as a knowl-\nedge- and innovation-driven\neconomy.\nThe renowned universities\nthat the SIT is partnering will\n“add value and recognition to\nour polytechnic diplomas as\nthey provide advanced stand-\ning”, he said.\nPolytechnic graduates will al-\nso be able to obtain degrees af-\nter only two years instead of\nthree or four years, he added.\nSingaporean students will\nhave their course fees subsidised\nby the MOE.\nOther than fresh polytechnic\ngraduates, those with work expe-\nrience are encouraged to apply.\nThis is because “their maturi-\nty and real-world knowledge\nwill bring valuable perspectives\ninto the classroom and add val-\nue to the strong industry rele-\nvance of SIT’s degree offerings”,\nan SIT spokesman said.\nPolytechnic student VanessaChua, 18, welcomes the SIT, as\nshe does not want to go abroad.\nShe plans to apply for its ho-\ntel-administration course after\ngraduating next year.\nShe said: “There are many\npeople who cannot afford to gooverseas because of the high\ncosts involved. It’s a great idea\nto bring some of those pro-\ngrammes here, and I like how\nthey are tailored to match poly-\ntechnic education so that it\ntakes only two years.”\nlingxin@sph.com.sgPARLIAMENT\nNew institute: Diplomas to degrees\nJAKARTA\nONE of the region’s most want-\ned terror suspects, Dulmatin ali-\nas Joko Pitono, was yesterday\nkilled in a raid conducted by theIndonesian police’s counterter-\nrorism squad on an Internet kiosk\nin Pamulang, Banten province.\nDulmatin was one of the\nmost-wanted leaders of the\nJemaah Islamiah (JI) militant\ngroup. He was an Al-Qaeda-\ntrained bomb-making special-\nist with a US$10-million\n(S$14.6-million) bounty on his\nhead under the United States’\nRewards for Justice pro-\ngramme.\nBelieved to be in his late 30s,\nhe is accused of helping JI planand carry out the 2002 Bali\nbombings, which killed 202 peo-\nple on the Indonesian resort is-\nland, most of them foreign tour-\nists.\n“He was shot dead just five\nminutes after he logged on to\nthe Internet,” a counterterror-\nism-squad member told The Ja-\nkarta Post newspaper.\nTV footage showed police car-\nrying an orange body bag to an\nCONTINUED ON WORLD A8SHOT DEAD: Dulmatin died in\na police raid on an Internet kiosk.Possible use of\nMedisave for\nhealth screenings\nunder study\nA2\nRomanian embassy\ndriver got series\nof phone calls\nfrom Silviu Ionescu\nA3NAVIGATOR\nIndonesia\nkills top\nJI fugitive\nIN CHINESE SECTION\nWhich stocks\nwill take off\nwith the IRs?\nB7HOME  A2-A6\nWORLD  A8-A11\nTECHNOLOGY  A12\nMOTORING  A13\nENTERTAINMENT  A14-A15\nLIFESTYLE  A16\nVIEWPOINTS  A17\nSPORTS  A18-A19\nBUSINESS  A20-A23Indonesia’s David\nGurnani is Asia’s\nBiggest Loser\nA15Overseas University Programme OfferedOVERSEAS UNIVERSITY PARTNERS\nTechnical University of\nMunich (TUM), Germany     Bachelor of Science in Electrical Engineering\nand Information Technology\nUniversity of Newcastle\nupon Tyne (NU), UK\nDigiPen Institute of\nTechnology (DigiPen), USA\nCulinary Institute of\nAmerica (CIA), USA\nUniversity of Nevada,\nLas Vegas (UNLV), USA     Bachelor of Professional Studies in Culinary\nArts Management     Bachelor of Science with specialisation in\nReal-Time Interactive Simulation/Game Design\nBachelor of Arts with specialisation in\nProduction Animation/ Game Design     Bachelor of Engineering in Marine Technology\nwith Honours in Naval Architecture\nBachelor of Engineering in Marine Technology\nwith Honours in Marine Engineering\nBachelor of Engineering in Marine Technology\nwith Honours in Off-shore Engineering\nSOURCE: MINISTRY OF EDUCATION     Bachelor of Science in Hotel Administration\nWEDNESDAY MARCH 10, 2010 ● MICA(P) 107/12/2009 WEBSITE: mypaper.sg\n25 24\nKEY MOMENTS IN THE SIT JOURNEY\n03\n04\nBRINGING\nTHE WORLD\nTO YOU AT SIT’S\nINAUGURAL\nOPEN HOUSE\nBUILDING SKILLS\nRATHER THAN\nDEGREESAfter just five months of planning, SIT opened its doors to the\npublic at its first Open House on 20 March 2010. Branded ‘Bringing\nthe World to You’, the event was held at the Ministry of Education\nheadquarters and showcased 10 degree programmes offered by\nfive OU partners.\nBy integrating learning, industry and community, SIT has established\nitself as a leader in applied education. This is all down to the\nuniversity’s progressive mindset. Spearheaded by our president\nProfessor Tan Thiam Soon in 2013, it is one that focuses on building\nskills over chasing paper qualifications.\n12,000+ Applications5,000+ AttendeesToday, the SIT Open House attracts over DID YOU KNOW?\n27 26\nKEY MOMENTS IN THE SIT JOURNEY\nSINGAPORE’S FIFTH\nAUTONOMOUS\nUNIVERSITY\nDEFINING\nTHE SITIZEN\n0605 SIT was gazetted as Singapore’s fifth Autonomous University (AU)\non 28 March 2014 through an act passed in Parliament. This was a\ntestament to SIT’s success and the new university launched three\nSIT-conferred degrees.\nAfter becoming an AU, the SIT-DNA was formulated around\nfour traits that would help undergraduates quickly cement\ntheir identity in SIT.\nThe university aims to prepare students to be ‘thinking\ntinkerers’, who are ‘able to learn, unlearn and relearn’, be\n‘catalysts for transformation’ and finally, become ‘grounded in\nthe community’.\nThe SIT-DNA continues to be a guiding principle that steers\ncurriculum design, pedagogical approach, student interaction\nand SIT culture. SIT-conferred Degrees from 2014 to presentDID YOU KNOW?\n201405101520\n2015 2016 2017 20182019 2020\nSIT-conferred Degrees Joint Degrees\n29 28\nKEY MOMENTS IN THE SIT JOURNEY\n0807\nGES 2018IWSP – NOT YOUR\nAVERAGE INTERNSHIP\nSIT’s distinctive Integrated Work Study Programme (IWSP) has disrupted the\ntraditional internship model. The longer time frame, ranging from six to 12\nmonths, allows SIT students more time to immerse themselves in the working\nenvironment and better appreciate the demands of their chosen career\npaths. Similarly, employers get to know the students and see more tangible\noutcomes during the course of their work. As a result, many students\nreceive full-time job offers even before they graduate – a win-win scenario.\nDID YOU KNOW?\nof the graduating cohort\nwas employed within\n6 months.92.5%\nINAUGURAL\nGRADUATING COHORT\nThe pioneering cohort of SITizens graduated from two SIT-conferred\ndegree programmes – Bachelor of Accountancy and Bachelor of Hospitality\nBusiness – in 2017 and another three SIT-conferred degree programmes\n– Bachelor of Engineering with Honours in Sustainable Infrastructur e\nEngineering (Land), Bachelor of Engineering with Honours in Information\nand Communications Technology (Software Engineering) and Bachelor of\nEngineering with Honours in Information and Communications Technology\n(Information Security) – in 2018.\n31 30\nKEY MOMENTS IN THE SIT JOURNEY\n1009\nSIT’S ROLE IN\nTHE FUTURE\nECONOMY\nOUR FUTURE HOME\nIN PUNGGOLSIT’s applied learning approach will be pivotal to Singapore’s success,\ncreating opportunities for students to develop skills that are highly relevant\nand needed by industry. Prime Minister Lee Hsien Loong spoke on SIT’s role\nin the future economy at the inaugural ‘Dialogue with SITizens’ on 24 October\n2016. The theme for the evening was ‘Preparing for the Future Economy’.\nOn 10 September 2019, SIT held its Groundbreaking Ceremony for its future\ncentralised campus in Punggol. Co-located with JTC’s Punggol Digital District, it is\nenvisioned to become a vibrant and inclusive district underpinned by technology,\nwhich will enable students, faculty and industry partners to collaborate on projects\nthat are beneficial to the community.\nDID YOU KNOW?\nThe total land area of the campus will be about\n91,000 sqm = 17 football fields\n10,000 sqm of photovoltaic (PV) solar panels installed\non the buildings’ rooftopsWired with a smart sensor network of over\n10,000 sensors that collects data on temperature,\nambient light and human presenceAccommodate up to 12,000 students\n33 32\nACADEMIC YEAR\nIN REVIEW\nDISTINCTIVE ADMISSION PROCESS\nAPPLICATION VS INTAKE\nover the last three Academic Years (AY) 2017/18, 2018/19, 2019/20PROFILE OF SITIZENS\n2,718 new SITizens joined the SIT family in AY2019/20\nTOTAL MATRICULATED\nBY ACADEMIC CLUSTER\n2,718 (as of 1 October 2019)SIT prides itself as an institution that adopts an\naptitude-based admissions assessment approach\nthat looks beyond academic achievements. Its\nrigorous selection process ensures that all applicants\nare evaluated objectively, as potential SITizens who\nwill be able to excel in the university’s distinctive\napplied learning environment.\nIn 2019, 6,661 out of 12,185 applicants were selected\nfor assessments through interviews and tests that\ninvolved faculty members from SIT and its overseas\nuniversity partners as well as industry guests.\nThe selection process included a robust assessment\nof each candidate, by focusing on their passion and\ngiving due recognition to relevant work experience\nand exceptional achievements related to their\npreferred programme of study.  SINGAPORE\nCITIZENSPOLYTECHNIC\nGRADUATESOF THE STUDENTS ADMITTED\nWERE ENROLLED INTO THEIR\nFIRST-CHOICE PROGRAMMESAcademic Qualification/Background Screening\n- Academic merit\n- Relevant work experience/qualification\nAdmission Interview/Test Evaluations\n- Ability to express clearly  - Specialised skills\n- Clarity on career prospects\nTalent and Passion\n- Personal statements  - Attitude\n- Interest in programme - The”X” factorSingapore Institute of Technology / Annual Report 2020 / Academic Year in Review\n35 34\nAPPLIED\nLEARNING\nAt SIT, our students embark on an enriching learning journey\nthat prepares them to meet the ever-changing demands of\ntoday, as well as to confront the challenges of the future. An\nSIT education offers students a deeply rewarding experience,\nboth inside the classroom and within industry. We harness\ntheir passion and nurture their talents to become effective\npractitioners and professionals in rapidly expanding sectors.\nOur unique pedagogy of integrating work and study is built\nupon a solid foundation of industry collaborations and an\nexpanding line-up of programmes catering to emerging\neconomic sectors. Complementing SIT’s applied learning\napproach is our applied research that focuses on creating\nsolutions for contemporary issues, and implementing them\nin industry settings. Through an applied curriculum, students\nembark on learning journeys to deepen their skillsets and\nemerge as work-ready graduates.NEW\nPROGRAMMES\nIN GROWING\nINDUSTRIESPOSTGRADUATE\nPROGRAMMES BY\nCOURSEWORK\nAND RESEARCHIn line with the university’s mission to offer applied degree\nprogrammes targeted at growth sectors of the economy,\nSIT launched two new degree programmes in Academic\nYear (AY) 2020:\nThe Bachelor of Science with Honours in Speech and\nLanguage Therapy was introduced to meet the national\nneed for competent speech therapists to promote health\nand well-being for people of all ages. It is the first such\nundergraduate programme in Singapore, developed in\nclose consultation with speech therapists from Singapore’s\nthree major health clusters, Ministry of Social and Family\nDevelopment-funded Therapy Hubs and Social Service\nAgencies, as well as practitioners from private practice. The\nfour-year programme includes a 30-week clinical practice\neducation with various public and private healthcare\ninstitutions during their studies.\nThe Bachelor of Science with Honours in Digital\nCommunications and Integrated Media was launched\nto meet industry demand for digital communications\nprofessionals amid an increasingly digitised world and\nthe convergence of tech and media. The three-year\nprogramme aims to train students in three key spheres –\nDigital Web Analytics, Integrated Media Management and\nDigital Media Production – in response to the changing\nmedia landscape.\nAdditionally, new agreements between SIT and two\nOverseas University (OU) partners saw four existing OU\ndegrees evolving into joint-degree programmes. SIT and\nDigiPen Institute of Technology Singapore now jointly\noffer the Bachelor of Science in Computer Science\nin Real-Time Interactive Simulation and Bachelor of\nScience in Computer Science in Interactive Media and\nGame Development, while the Bachelor of Engineering\nwith Honours in Electronics and Data Engineering and\nBachelor of Engineering with Honours in Chemical\nEngineering programmes have been converted to joint\ndegrees by SIT and Technical University of Munich.SIT has started to offer Postgraduate Programmes by\nCoursework (PGC) in the form of Master of Engineering\nTechnology (MEngTech) since January 2018. There are\nfive MEngTech programmes currently being offered,\nwhich provide the opportunity for graduates to become\nChartered or Professional Engineers in their field of study\nshould they aspire to do so. These MEngTech programmes\ninclude: Sustainable Infrastructure Engineering (Land),\nSustainable Infrastructure Engineering (Building Services),\nElectrical and Electronic Engineering, Civil Engineering\nand Chemical Engineering.\nSIT will also introduce new Postgraduate Programmes\nby Research (PGR) in AY2020. These include an Industrial\nDoctorate Programme and an Industrial Master Programme,\nwhich will strengthen the industry-academia interaction\nand build Singapore’s pipeline for industry-relevant\nprofessionals with deep technical knowledge and specialised\nskills. Individuals in these programmes will spend time\nworking on industry projects in their companies while\ncompleting postgraduate modules and complementary\napplied research work in SIT. Four such programmes are\nbeing offered: Master of Engineering, Master of Clinical\nResearch in Health Sciences, Doctor of Engineering, and\nDoctor of Clinical Research in Health Sciences. The focus\nof these programmes taps on the university’s strengths in\napplied research and industry collaboration.\nSkillsFuture Work-Study Degree (WSDeg) places students\non an apprenticeship programme with industry partners\nto gain deeper and meaningful workplace knowledge\nand opportunities. FY2019 saw a total of 155 students\nsuccessfully placed with 26 companies under the WSDeg\npathway. Four of the 15 degree programmes eligible for\nWSDeg were added in FY2019: Systems Engineering\n(ElectroMechanical Engineering), Chemical Engineering,\nComputing Science, and Pharmaceutical Engineering.Singapore Institute of Technology / Annual Report 2020 / Applied Learning\n36 37\nENHANCING LEARNING EXPERIENCES\nAND DISCOURSES EXPANDING SUITE OF\nLIFELONG LEARNING OFFERINGS\nDEEPENING APPLIED LEARNING\nTHROUGH APPLIED RESEARCHThe second Applied Learning Conference, held in\nJanuary 2020, featured an inaugural photo and oral essay\ncompetition themed ‘Applied Learning in Action’, which\nattracted 25 entries from both local and international\neducational institutes. Through photos and captions,\nparticipants illustrated how novel educational strategies\nwere being developed and explored so that complex\nconcepts may be understood and applied to real-world\nchallenges.\nThe Centre for Learning Environment and Assessment\nDevelopment (CoLEAD) strengthened online learning\ntools and faculty training in preparation for the university’s\ntransition to Home-Based Learning (HBL) during\nCOVID-19. With the support of various divisions within\nSIT, CoLEAD intensified and enhanced the following\nareas to ensure that students’ learning outcomes were\nnot compromised, and teaching-learning integration\ncould be fulfilled despite remote teaching.\nTraining Sessions: Training sessions were conducted\nto equip faculty with effective remote online teaching\ncompetencies. These include the effective use of Zoom\n(live streaming), Teams (collaboration), and PowerPoint\n(video creation) platforms for lesson delivery. CoLEAD\nalso collaborated with the Learning Management System\n(LMS) team from the Communications and Information\nTechnology (CIT) division to conduct workshops for online\nassessment tools such as the Respondus LockDown Browser.\nWalk-in Clinics and Consultations: Prior to Singapore’s\nimplementation of enhanced safe distancing measures,\nCoLEAD organised consultations for faculty members\nwho required support for remote teaching and learning.\nAn online clinic was also conducted to encourage faculty\nto post questions at any time and day.One of the traits imbued in all SITizens is the ability\nto learn, unlearn and relearn, to encourage them to\ncontinually reskill and upskill. As SIT’s lifelong learning\ndivision, SITLEARN Professional Development (SITLEARN\nPD) develops authentic, industry-relevant learning\nexperiences targeted at working professionals. FY2019\nsaw SITLEARN PD launching new modular certification\ncourses and strengthening SIT’s collaboration with one\nof its OU partners, Massey University.\nFirst Modular Certification Courses in Sonography,\nElder Health and Rehabilitation:  The inaugural stackable\nmodular certification courses in Sonography, as well\nas Elder Health and Rehabilitation, were launched in\nMay 2019. Offered as standalone modules or stackable\ntowards postgraduate qualifications, the two portfolios of\npostgraduate modules help to deepen and broaden the\nskills of healthcare professionals, in response to Singapore’s\nefforts to build a future-ready healthcare workforce for\nan ageing population.\nTo strengthen SIT’s reputation as Singapore’s University of Applied Learning, the university established the Applied\nResearch Office (ARO) in March 2020 to provide strategic direction for applied research, oversee research compliance and\ngovernance, and grant administration and management. SIT’s applied research efforts will be ramped up to enhance skillsets\nand competencies in the various key sectors – to enable the university to deliver impactful outcomes that transform industry.\nModular Certification Courses in Chemical Engineering for\nContinuing Education and Training (CET):  In conjunction\nwith the launch of MEngTech in Chemical Engineering,\nindividual modules from the programme were made\navailable in September 2019 for public enrolment. This\nenabled working professionals to upskill in specialist or\nmanagement tracks, or for mid-career switches.\nFirst collaboration with Massey University (MU) in\nJoint CET: SIT partnered with MU to deliver CET courses\njointly conducted by faculty members of both universities\nin design and health sciences, infocomm technology and\nfood technology. In 2019, two courses were delivered\nto 30 participants: Design Innovation for Products and\nServices, and Community-based Health Care Needs and\nService Delivery for Healthy Populations.\nTo support the university’s burgeoning applied research efforts, the Applied Research Industry Laboratory (ARIL) was\nset up in SIT@Dover in the last quarter of 2019. Located on Level 4 of the University Resource Centre, the space boasts 33\nproject spaces for test-bedding of processes and operational best practices. The lab will serve as a guide for the design\nand development of the ARILs at SIT’s future campus in Punggol.\nResources: Learning materials and guides were provided\nto all faculty to access through the LMS, xSiTe. More\nresources such as microphones and writing tablets were\nalso made available for faculty to produce their own\nteaching materials.\nFacilities: More than 30 rooms across SIT’s campuses\nwere converted to provide a conducive space for faculty\nto conduct live-streaming or recording of their lessons.\nStudent Engagement: Dedicated outreach efforts took\nplace to familiarise students with the online space as an\neffective learning environment. A survey was conducted\nto understand students’ HBL needs and concerns so that\nfaculty can better engage the students online.\n38 39\nENHANCING LEARNING FRAMEWORK,\nTOOLS AND OPERATIONAL CAPABILITIES\nCoLEAD’s Technology-Enhanced Learning (TEL) framework\nintroduced four Competencies for Online and Remote\nTeaching (CORT) to encourage faculty members’ purposeful\nand effective use of technology tools for online teaching\nand improvement of students’ learning experiences. The\ncompetencies are (i) creation of online video lessons, (ii)\nconducting synchronous live online lessons, (iii) conducting\nasynchronous online discussions and (iv) provision of\nonline assessments and feedback.\nSpearheaded by the Estates and Library divisions, the\nGener8 Media Studio in SIT Library was set up in\nSeptember 2019 to develop students’ digital and media\nliteracy skills and competencies. For example, students\nfrom the Food Technology programme learned to create\nmultimedia projects using the media production facilities.\nMore than 110 bookings were made within the first five\nmonths of operation, clocking a total of 500 hours of usage.\nTo pilot the use of biometric data authentication technology,\nthe university launched the Facial Recognition Authenticated\nLibrary Loan Service in November 2019. Users can loan\nbooks quickly and seamlessly without the need to tap access\ncards. SenseTime Face Recognition Technology (FRT) is\nbeing tested for the authentication of staff and students,\nwhile Radio-Frequency Identification (RFID) technology\nhas been installed for loaning of books. Implementation\nof this project was driven by the Library and CIT divisions.\nTo minimise disruption to students’ learning amid COVID-19,\nthe SIT Library established partnerships with publishers\nto widen its suite of online library databases. Students\nbenefit from complimentary access to new e-titles and\ne-databases, and the increased number of concurrent\nusers of e-textbooks, making the transition to online\nlearning easier.\nThe COVID-19 situation created an immediate need for\nthe Admissions division to switch its planned physical\ninterviews to an online platform. The experience from the\nsuccessful run of using an online asynchronous video\nassessment tool in 2019 spurred the Admissions team to\nswiftly adopt it on a larger scale across the majority of SIT’s\nprogrammes. Around 7,000 applicants were assessed via\nonline interviews in the AY2020 admissions exercise. The\ndecisive switch to video interviews was pivotal in ensuring\nthat the voluminous admissions assessments could proceed\nsmoothly in spite of the physical restrictions. Consequently,\noffers were made promptly with a sufficient runway for\nsuccessful applicants to secure their places for admission.\nFaculty members and Professional Officers from the\nEngineering cluster incorporated the use of holograms\nto facilitate inductive learning in design engineering\nfor the first time in September 2019. 151 students from\nthe Mechanical Engineering and Aerospace Engineering\nprogrammes benefitted from the use of the Microsoft\nHoloLens, a mixed reality software that translates their 2D\nCAD designs into holographic parts for assembly testing.\nThe highly interactive and transformative technology\nempowers students to efficiently explore design options\nand iterations, without the need for multiple prototyping\nthat typically leads to high production costs.\nTo enhance authentic learning in the areas of flight simulation\nand building of unmanned aerial vehicles, the Estates and\nProfessional Officers divisions set up and operationalised\nspaces at SIT@NYP Building. Classrooms were converted\ninto the Virtual Reality (VR) Flight Simulation Lab ,\nUnmanned Aerial Vehicle (UAV) Design Lab and UAV\nTest Flight Lab.\nVR Flight Simulation Lab: Consisting of a VR flight\nsimulator station that allows students to fly the aircraft,\nrecord flight data and evaluate flight characteristics, the\nlab provides ample opportunities for students to work\non VR and aircraft design-related topics as part of their\ncapstone projects.\nUAV Design Lab: Enabling students to design, build\nand integrate their UAV platforms, the lab provides a\nsafe environment that allows works such as soldering,\ncharging and other crucial aspects of UAV development\nusing state-of-the-art equipment and components.\nUAV Test Flight Lab: This 200-square metre lab allows\nlarger UAVs and low-speed fixed-wing UAVs to be safely\nflight-tested indoors. Students are safely positioned within\nthe control stations separated from the flight space and can\ncontrol the UAVs using the lab’s ceiling-mounted cameras.\nIn collaboration with industry partners ST Engineering\nand SingPilot, faculty members and Professional Officers\nfrom the Engineering and Infocomm Technology clusters\ndeveloped and deployed The SIT Electric Autonomous\nDriving Car (SEAD) and Smart Lamp Posts at SIT@Dover .\nStudents from the Telematics (Intelligent Transportation\nSystems Engineering) programme were able to explore\nvarious autonomous technologies and functionalities\nfirst-hand, such as vehicle specifications and operations,\nelectric autonomous vehicle (EAV) system architecture,\nsmart lamp post features and architecture, and smart\nlight controls. Successful runs will ascertain deployment\nof more EAVs in the future campus in Punggol.To familiarise students from the Chemical Engineering and\nFood Technology cluster with practical lab knowledge and\nskills required for their courses, the Professional Officers\nDivision (POD) created the ’Bus Stop’ initiative, a creative\nand fun way of learning through live demonstrations and\nhands-on learning. Using the analogy of a bus travelling\nfrom one stop to another, groups of students learned lab\ntechniques by rotating between different demonstration\nstations. The first run took place in September 2019.\nPOD also supported multi-disciplinary lab practical\nsessions for Year 3 Occupational Therapy students for\nthe ’Engineering and Technology for Healthcare Solutions’\nmodule, which introduces concepts and skills that harness\ntechnology for healthcare solutions. The Professional\nOfficers offered functional prototyping guidance in the\nareas of Mobile App Development, Arduino, Computer-\naided Drawing, and 3D Printing. The first run of the\nsessions took place in June/July 2019, and the second\nrun in February/March 2020.\nWith an increasing need for learning spaces, new Health\nand Social Sciences laboratories were constructed in\nThe Shed at SIT@Dover with updated features such as\nautomatic and intelligent light control, additional LED\nmonitors to enable small group learning, green air-\nconditioners and ceiling electrical outlets. The labs allow\nflexible partitions with collapsible walls and full-length\ncurtains. These configurations, coupled with the latest\nlive streaming capabilities, allow for management of\ndifferent class sizes. Hundreds of plinths and equipment\nsuch as isokinetic machines, treadmills and physiotherapy\nequipment were shifted from the University Resource\nCentre to the new labs.\nOther highlights in FY2019 included preparation for lab\naccreditation evaluation by panels from Allied Health\nProfessions Council (AHPC) and Singapore Nursing Board\nin January 2020. Various documentations were collated\non risk assessment, equipment maintenance, lab usage\nand policies to demonstrate the university’s exemplary\nuse of technology in labs to promote inter-profession\nlearning amongst students. Provisional accreditation\nexercises were also conducted for Civil, Chemical and\nMechanical Engineering programmes in October 2019\nby the Engineering Accreditation Board (EAB).\n40 41\nINDUSTRY\nSIT’s strong nexus with industry, coupled with its industry-focused\ncurriculum, enables students to experience the environment and\nculture of their chosen industry, even before they graduate. The\nuniversity’s commitment to building a symbiotic relationship with\nindustry has resulted in extensive collaborations – from curriculum\ndevelopment to joint efforts in manpower development and\ninnovative project solutions for industry. Industry partners also\nserve as the backbone of the Integrated Work Study Programme\n(IWSP), providing students with real work experience. This mutually\nbeneficial relationship with industry is key to SIT’s mission of\nproducing graduates who are highly adaptable and employable.GROOMING CAREER-READY\nGRADUATES\nESTABLISHING STRATEGIC INDUSTRY\nPARTNERSHIPSSIT’s Integrated Work Study Programme (IWSP), a salient\nfeature of the university’s educational experience, provides\nstudents with opportunities to integrate the knowledge\nthey have gained in the classroom with real-world practice.\nIt is also an excellent platform for students to gain work\nexperience, while industry partners get access to a pool\nof work-ready employees.\nIn AY2019, the Centre for Career Readiness (CCR) division\nsecured over 2,580 IWSP positions with more than 460\ncompanies for 1,051 students. Since the rollout of this\nindustry-focused initiative in 2014, students have received\nadvance offers from their IWSP companies even before\nthey graduate.\nTo help develop sector-specific training collaboration to\nsupport skills development and workplace learning for\nSMRT’s large base of value-chain partners, a memorandum\nof understanding (MOU) was signed at the Applied Learning\nConference 2020 between SIT, SkillsFuture Singapore (SSG)\nand SMRT Corporation Ltd. This strategic collaboration\naims to upskill 100 Small and Medium Enterprises (SMEs)\nover three years, to help drive innovation and productivity\nenhancements across the land transport sector.\nSIT will also work closely with SMRT to engage its value-\nchain partners to develop training curricula for the land\ntransport sector through the National Centre of Excellence\nfor Workplace Learning (NACE@SIT). Supported by SSG,\nthe centre will help organisations, especially the SMEs, to\nsupport their workplace learning efforts and build workplace\ncompetencies. NACE@SIT is the first workplace learning\ncentre set up within an autonomous university.To provide students the opportunity to reflect on their IWSP experiences, CCR designed a two-part IWSP reflection\nsession. Such reflections are beneficial in cultivating the right mindset in managing work and working relationships during\ntheir IWSP and beyond, as well as helping students to identify their career aspirations. In FY2019 alone, IWSP reflection\nsessions have been conducted for more than 16 degree programmes.\nOther than offering industry exposure through IWSP and industrial attachments, SIT also deepens students’ industry insights\nand connects them with industry professionals through the Industry Mentorship Programme. In FY2019, SIT continued\nits partnership with Young NTUC to recruit industry mentors with relevant work experience to mentor students. From\n11 Engineering disciplines, the programme was extended to two new degree programmes in FY2019 – Pharmaceutical\nEngineering and Systems Engineering (ElectroMechanical Systems). A total of 129 students and 67 industry mentors\nparticipated in the six-month long programme.\nRobust engagement with industry through collaborative tie-ups and projects is pivotal in paving the way for exchange of\nknowledge, sharing of manpower and resources in applied research, training and education.\nSingapore Institute of Technology / Annual Report 2020 / Industry\n42 43\nDRIVING\nENTERPRISE\nAND INNOVATION\nTHROUGH TICS SUPPORTING\nAPPLIED\nRESEARCH\nTHROUGH\nGRANTS\nAND FUNDSA research collaboration was inked between M1 and SIT\nthat would see both parties jointly research and develop\nadvanced artificial intelligence (AI) deep learning algorithms\nto improve the planning, operations and maintenance\nof large and complex mobile networks. Apart from the\nopportunity for SITizens to be involved in this project\nas part of their IWSP , the university will work with M1 to\nresearch, model and develop algorithms for AI machine\nlearning, with the aim to detect mobile traffic anomalies\nand predict the volume of mobile traffic.\nSIT and SATS Catering signed an MOU in February 2020\nto collaborate on an open innovation platform. Both\norganisations will jointly develop a pool of Food Technology\nspecialists within SATS Ltd through SIT’s IWSP , Industrial\nMaster, Industrial Doctorate, and other academic curriculum/\nprogrammes, as well as co-create innovative products\nand services through research projects and co-sharing\nof research and production facilities.\nTo deepen linkages with industry, SIT has set up a number\nof Technology Innovation Centres (TICs). The objectives\nare to build capabilities and a talent pipeline, upskill and\nreskill industry professionals, as well as conduct applied\nresearch with industry.\nSIT signed a multi-party MOU with SkillsFuture Singapore\n(SSG) , Infocomm Media Development Authority (IMDA) ,\nCapitaLand, CPG Corp, EM Services, Securities Industry\nand Financial Markets Association (SIFMA), Singapore\nPolytechnic and Temasek Polytechnic to set up the Smart\nEstates Talent Development Programme (SETDP) in\nNovember 2019. The parties aim to transform the Built\nEnvironment sector to support the skill and talent needs\nof smart estate developments.SIT signed an MOU with Fujifilm Asia Pacific and a Training\nFacilities Agreement with Philips Electronics Singapore\nin November 2019 and January 2020 respectively to\ncollaborate in areas related to: (i) the use of these partners’\ndiagnostic radiography equipment; (ii) access to these\npartners’ facility to support SIT’s diagnostic radiography\ndegree programme needs; (iii) applied research and\nhonours thesis project collaboration; and (iv) student\nmentorship. With the latest equipment available and\nmentorship from Fujifilm and Philips, SIT students will\nremain industry-relevant, practice-oriented and are trained\nto be work-ready.The Accounting Technology & Innovation Centre\n(AccTech Centre) is a joint initiative between SIT and the\nSingapore Accountancy Commission (SAC) . Launched\nin August 2019, it is a resource centre that facilitates\ncollaboration and catalyses technology and business\ninnovations in the accounting sector. Through the\nAccTech Centre, local accounting entities will have the\nopportunity to work with SIT faculty, technology partners\nand government agencies to innovate processes, service\ndelivery, products, and business models for adoption\nby Small Medium Practitioners.\nThe Energy Efficiency Technology Centre (EETC) was\nlaunched in collaboration with the National Environment\nAgency (NEA) in October 2019 to drive energy efficiency\ninitiatives for Singapore’s manufacturing industries. Through\nthe EETC, companies can partner SIT to conduct energy\nassessments of their facilities to establish energy consumption\nstandards. The centre will also reskill and upskill working\nprofessionals with skillsets in industrial energy efficiency,\nand train SIT undergraduates with practical experience\nin energy assessments for the industry.\nSIT has set up a Food Technology Innovation Centre to\ndeepen its linkages with the local food industry. Established\nin partnership with Enterprise Singapore (ESG) and JTC\nCorporation, the shared food production facility will be\nlocated at the JTC Food Hub @ Senoko. This facility will\nbe the first in Singapore for small batch food production\nand aims to address existing market gaps for food\nmanufacturers. The facility will enable food companies,\nespecially startups and SMEs, to validate new products\nafter R&D, without the need to invest in costly equipment\nor commit to high minimum order requirements imposed\nby outsourced manufacturers. This would also allow them\nto test their commercial viability before making the leap\nto full-scale production.Other than TICs, SIT has an internal grant framework\nthat supports the test-bedding of ideas and provides\nearly-stage funding for industry projects that involve\nfaculty and students. The two types of internal grants\nare Seed Funding and Ignition Grant. Seed Funding\nallows faculty to test ideas, jumpstart projects, and\nillustrate capability to the industry. For the Ignition Grant,\ncollaborators could work with SIT faculty to address\nindustry-specific challenges and co-fund various projects.\nWith funding from SIT’s Ignition Grant and in collaboration\nwith Par International Holdings Pte Ltd, Assistant\nProfessor Lim Kaiyang from SIT and Associate Professor\nKelvin Goh from Massey University successfully completed\nan applied research project on development and\ncharacterisation of clean label modified rice starch. Par\nInternational plans to set up a manufacturing plant in\nits local food factory to produce this rice starch.\nIn collaboration with the Elections Department\nSingapore (ELD), a group of SIT students, led by\nAssistant Professor Nicholas Teo, helped improve the\ncurrent design of polling booths and stations through\nSeed Funding. ELD plans to conduct further trials on\nthe prototypes.\nSIT has been working closely with Energy Market\nAuthority (EMA) on the Exploiting Distributed Generation\n(EDGE) programme to fund research for next-generation\nenergy technologies. The three Projects Awarded\nwith EDGE Programme Funding in December 2019\nare Micro-grid Digital Twin Development for Effective\nEnergy Management and Deployment; Optimisation\nof Energy Management in Multiple Micro-grids System\nBased on Predictive Control and Artificial Intelligence\nand Platform for Interconnected Micro-Grid Operation\n(PRIMO).\n44 45\nCOMMUNITY\nAn integral part of SIT’s mission is to equip graduates with the\nknowledge and skills to serve the community around them.\nStudents, faculty and staff are actively involved in meaningful\ncollaborations that help improve the social, economic or\nenvironmental aspects of the community. As SIT creates the\navenues to provide the necessary resources and mentorship for its\nstudents, the community has become a learning platform where\nstudents can hone their knowledge and skills acquired from the\nclassroom. As a result, SIT graduates become grounded in the\ncommunity, forming an essential network that fortifies social and\neconomic bonds within the community they are part of.SIT’S FUTURE\nCAMPUS\nThe Groundbreaking Ceremony of SIT’s centralised\ncampus in Punggol held on 10 September 2019 was a\nhistorical moment in its 10-year journey. Officiated by\nGuest-of-Honour, Prime Minister Lee Hsien Loong, the\nmomentous occasion marked the beginning of construction\nwork for SIT’s future home.\nThe university will be co-located with JTC Corporation\nin the Punggol Digital District (PDD), enabling students,\nfaculty and industry professionals to collaborate on projects\nthat benefit the wider community. Stretching across two\nplots of land, the new campus will accommodate up to\n12,000 students, as well as more than 500 faculty and\nprofessional officers when completed. Borderless and\nintegrated with the surrounding community and industry,\nthe centralised campus in Punggol is envisaged to provide\na vibrant, inclusive learning environment. Overlooking the\nwaterfront, the campus preserves an existing forest around\nthe scenic tree-lined Heritage Trail, giving it a distinctive\n‘campus-in-a-park’ identity.\nFollowing the ceremony, construction of the Punggol\ncampus commenced with piling works. Plot 1, situated on\nthe western side of the campus, will house the academic\nblocks, while Plot 2 will house the administration building,\nadditional academic blocks, auditorium and indoor sports\nfacilities blocks on the eastern side of the campus.\nThe PDD Groundbreaking Ceremony took place on 17\nJanuary 2020, together with the launch of the three-day\nPDD Exhibition held at Punggol Waterway Point that\nwelcomed 15,000 visitors. This multi-agency exhibition,\nunveiled by Senior Minister Teo Chee Hean, showcased\ninnovative projects that gave a glimpse into Singapore’s\nfirst Enterprise District. It was also one of the first events\nwhere visitors could approach SITizen Ambassadors –\nstudents who embody the SIT-DNA and are selected\nto represent the university in networking and outreach\nevents – to learn more about the university and what\nPunggol residents can look forward to when the new\ncampus is operational.\nPlot 1 construction progress as of March 2020\nPlot 2 construction progress as of March 2020\nSIT featured projects from the Infocomm Technology cluster\nunder the ‘Future of Learning’ theme of the exhibition.\nVisitors had a chance to imagine what the future of\nlearning could be with virtual reality simulations such as\n‘Cow Butchery’, ‘Air Traffic Controller’, ‘Radiation Therapy’\nand ‘Virtual Bioreactor’, as well as the service robot, Cruzr.Singapore Institute of Technology / Annual Report 2020 / Community\n46 47\nINSPIRING THE YOUNG\nREACHING THE HEART\nOF THE COMMUNITYLeading up to the Groundbreaking Ceremony in\nSeptember 2019, SIT co-organised a PDD Hoarding\nDesign Competition with JTC as part of the university’s\non-going efforts to connect with the Punggol community.\nThe competition was open to entries from three categories:\npublic, primary and secondary schools. JTC oversaw the\npublic category that had the theme, ‘The Future of Work,\nSIT established six service-learning projects across ASEAN\ncountries, focusing on developing global citizenship and\ncultural awareness within students, whilst inculcating values\nof adaptability, collaboration and empathy. Between April\nand December 2019, six groups of SIT students partnered\nwith various communities in Cambodia, Indonesia, Laos,\nMyanmar, Thailand and Vietnam. They gained meaningful\ninsights into complex social issues faced by the local\ncommunities, and were able to identify needs and work\nwith these communities to address them. This experience\nencouraged students to create a positive social impact\nbeyond Singapore.Live and Play’. SIT handled the other two categories with\nthe theme, ‘The Future of Education’, inviting design\nentries from schools in Punggol over the June holidays.\nOut of the 150 entries, 11-year-old Elisea Cheng Rui\nSee and 15-year-old Justina Low Jie Shi emerged top\nwinners for the primary and secondary school categories\nrespectively. All entries will be featured on the hoarding\npanels around SIT’s future campus construction site and\nalong the Punggol-Promenade Nature Walk.\nSparking curiosity in young Singaporeans is what SIT aims\nto do with its biannual Punggol Fun Science Camp in\npartnership with People’s Association (PA). During the\n2019 June and December school holidays, SIT hosted\na total of 110 primary and secondary school students\nresiding in Punggol – its fifth and sixth run of the camp\nrespectively. The goal is to inspire youths from lower\nincome households to ignite their passion for STEM\n(Science, Technology, Engineering and Mathematics). The\nstudents enjoyed a fun-filled day of activities and learnt\nhow technology plays a part in their daily lives.\nFour students from the Occupational Therapy programme\nembarked on their seven-week overseas clinical placement\nat Lion’s Resource and Education for Autistic Children\nCentre in Penang,  Malaysia from 15 April to 31 May 2019.\nThe students provided individual occupational therapy\nservices to children with autism and helped to assess and\nformulate treatment plans based on what was discussed\nwith the parents. They were also tasked to organise and\nrun a camp for the children. This overseas attachment\nhelped to build their professional confidence and put\ntheir classroom learnings into real practice.\nIn November 2019, Year 2 Allied Health and Year 1 Nursing\nstudents headed into the heartlands to share health practices\nand tips with residents as part of their practicum. Over\none weekend, 200 residents from Punggol Parc Terraces\nand Punggol Raydew learnt more about the war against\ndiabetes and enjoyed free health assessments. Besides\nPunggol, SITizens also conducted similar Community\nHealth Practicums in Changkat, Hougang, Chong Pang,\nKeat Hong and Telok Blangah.\nIn the same month, SIT was invited by Housing and\nDevelopment Board (HDB) to conduct a one-day design-\nthinking workshop for 40 residents from the Sengkang and\nPunggol communities as part of HDB’s annual build-a-thon,\nLively Places Challenge 2020. This full-day workshop,\nconducted by Assistant Professor Nicholas Teo, equipped\nresidents with the tools to develop ideas for community\nbonding. Participants then took to their drawing boards,\ncrafting proposals that were later presented to the panel,\ncomprising representatives from various agencies. Following\nthe review, participants headed out to implement their\nideas from December 2019 to March 2020.\nDuring National Day 2019, a group of SIT staff members\nspent a celebratory afternoon with the seniors at Bright\nHill Evergreen Home in Punggol. Organised by the SIT\nEmployee Wellness Committee, the afternoon began with\na clay-making session for 20 elderly residents, facilitated\nby staff, together with a social enterprise vendor. SIT staff\nalso distributed National Day Fun Packs to 200 seniors\nand engaged them in conversations over tea.\nSIT’s future campus in Punggol is envisioned to be a\n‘living lab’ where students and industry can test-bed and\nimplement innovations. In line with this concept, the campus\nwill house Southeast Asia’s first Multi-Energy Micro-Grid\n(MEMG), a collaborative research venture between SIT\nand SP Group. With it, SIT will have approximately 10,000\nsquare metres of photovoltaic (PV) solar panels installed\non its rooftops.\nThe MEMG will supplement power supply to the campus,\nreducing the reliance on the main utility grid and contributing\nto its larger aim of being self-sustainable in the long run.\nFurthermore, the MEMG will serve as a living experimental\nlab to support the research, development and test-bedding\nof distributed energy systems and cyber-security solutions,\nwhich will benefit the whole of Singapore.\nAs an environmentally-responsible organisation, SIT has\nset up the Sustainability Workgroup in the last quarter\nof FY2019. With the tagline ‘Sustainability – We Do Our\nPart!’, the workgroup aims to inculcate sustainable habits\nand lifestyles within the SIT community.\nSome sustainability initiatives and practices implemented\ninclude having recycling corners; separating food waste at\nthe Food Court and processing it into compost; installing\nsensor-controlled lighting in offices; setting air-conditioning\ntemperatures at 24°C; and phasing out the consumption\nof bottled water. SUSTAINABILITY\nEFFORTS\n48 49\nDEVELOPING\nSTUDENT LEADERS\nREMARKABLE\nPHILANTHROPIC\nSUPPORT FOR\nSTUDENTSThe Leadership Training Roadmap (LTR) is an\ninitiative by the Student Life division that equips\nstudent leaders with fundamental leadership skills\nand knowledge during their tenure. The LTR consists\nof four components: Club Management Training,\nLocal Leadership Development Programme, Overseas\nLeadership Development Programme, and Reflections\nWorkshop. Through this robust programme, student\nleaders gain greater self-awareness and understanding\nof their leadership styles, as well as team dynamics\nand conflict resolution. At the end of the roadmap,\nthey will reflect upon their journey as a student leader,\nboth individually and collectively, with their peers.\nSITizen Ambassadors are students who embody\nthe core values of the SIT-DNA. Together with the\ninstitution, these students co-create the present and\nfuture of SIT as a premier University of Applied Learning\nand partner of choice for industries. The first group of\nSITizen Ambassadors was selected through a rigorous\ninterview process in November 2019. Each ambassador\nreceived comprehensive training, from personal branding\nand communication skills, to digital presence and\nenergy management. They were also provided with\na deeper understanding of SIT’s vision, mission and\nstrategic goals. This multi-divisional programme calls\non each ambassador to represent SIT through various\nhosting and networking events, as well as outreach\nand facilitation programmes.SIT saw renewed and widened philanthropic support for\nits undergraduates through scholarships and bursaries.\nThese include the DBS Scholarship, the Lim Doa Hin\nScholarship, the Lim Siah Mong Scholarship, The Applied\nMaterials Bursary, the Q’son Kitchen Equipment Bursary\nand the Silent Minority Bursary at SIT.\nNew endowed scholarships that will allow academically\npromising and talented SIT undergraduates to fulfil their\nfullest potential include the iSparkle Scholarship and the\nPeter Lim Scholarship.\nNew bursaries and grants were also made available to allow\nless privileged students to pursue university education\nwith reduced financial hindrances. These include the Lim\nPu Leh Bursary, that supports both Singaporean and\nMalaysian students pursuing all degree programmes at SIT,\nand the Ti Sui Tsu Bursary for Nursing and Allied Health\nundergraduates. Both bursaries are endowed. In addition,\nstudents pursuing degrees in Nursing, Occupational Therapy\nand Physiotherapy are now supported by the TL Whang\nFoundation Bursary and the TL Whang Foundation\nOverseas Immersion Programme Grant.\nOther new endowed bursaries that were established in\nFY2019 include: the Ho Family Bursary, the Kee Gen\nHeng Bursary, the Lim Peng Hun and Vanisa Compass 6\nBursary, the Mohamed Abdul Jaleel Bursary, the Peter\nWong Tat Tak Bursary, and the Yeo Lik Kim Bursary.The SIT Vanguard Programme, introduced in 2019,\nis designed as an advanced leadership programme.\nThis programme offers stepped-up training aimed at\ndeepening the leadership skills and experiences of\nstudent leaders by having them serve as mentors to\nthe next batch of student leaders. During their service,\nvanguards were able to develop individual effectiveness\nand mentorship styles, and apply these newly acquired\nskillsets as they journey with the incoming group of\nstudent leaders.\nIn the last few years, SIT has been actively partnering the\nPeople’s Association (PA) in supporting programmes to\nengage the Punggol community. To honour the university’s\nefforts, PA awarded SIT the PA Community Partnership\nMerit Award. On 20 November 2019, Associate Professor\nIvan Lee, Vice President (Industry & Community), SIT,\nreceived the award on behalf of the university at the annual\nPA Community Spirit Awards 2019 ceremony from Mr\nChan Chun Sing, Minister for Trade and Industry and\nDeputy Chairman of the PA. Nominated by the Punggol\nCoast Citizens’ Consultative Committee, this would be\nthe second consecutive year that SIT was recognised for\nits contribution and impact to the Punggol community.\nThe Total Defence Awards (TDA) is a national pinnacle\naward that recognises organisations and individuals who\nhave demonstrated exemplary support for National Service\n(NS) and NSmen. To be considered for TDA honours,\ncompanies and organisations will need to attain the NS\nMark (Gold), a national-level accreditation scheme that\nrecognises businesses and organisations with pro-NS\npolicies and Human Resource practices. SIT was accredited\nwith NS Mark (Gold) in May 2019.\nAs an employer, SIT has implemented policies and\npractices to support NSmen employees in fulfilling their NS\nobligations. Incentives are awarded to NSmen employees\nfor the attainment of IPPT standards. SIT also demonstrated\nits support for National Education and Total Defence\nthrough participation in various events, including the NS50\ncelebrations, SAF Day Combined Rededication Ceremony\nand National Day Observance Ceremony. SIT SGSecure\nTaskforce, in collaboration with Singapore Civil Defence\nForce, set up the SIT-Civil Defence Lionhearter Club to\nraise awareness on emergency preparedness, civil defence\nskills and fire safety among their peers in the university.  AWARDS AND\nEMPLOYEE\nENGAGEMENTIn addition, SIT achieved a Merit for the Biennial Singapore\nHEALTH (Helping Employees Achieve Life-Time Health)\nAward  given by the Health Promotion Board (HPB), in\nrecognition of organisations that promote healthy and\nvibrant lives for employees through exemplary Workplace\nHealth Promotion programmes. Some efforts include:\nWorking with faculty members from SIT and The Culinary\nInstitute of America to roll out healthy recipes and cooking\nclasses; gamifying and incentivising healthy activities, e.g.\nVirgin Pulse Global Challenge 2019; free health screening\nand weight management programmes.\nWithin our own community, and as part of the SIT Employee\nRecognition Framework, Cheers4Peers was launched in\nJuly 2019 to recognise and promote positive behaviour\namongst SIT staff. The e-platform enables staff to send thank\nyou notes to each other, as well as nominate colleagues\nwho have gone the extra mile or exhibited exemplary\nbehaviour, for an award. Since its launch, Cheers4Peers has\ngarnered about 450 appreciation messages and awards.\nThe Human Resource division has also partnered with\nCODE and Finance divisions to develop the Digital\nInitiative Awards and Economy Drive Awards under\nthe framework. In April 2020, 13 projects received the\nDigital Initiative Award for their efforts in initiating positive\nchange in the business process through digital adoption.\nOut of this pool of 13 projects, six teams successfully\ndemonstrated effective cost-savings in overall operational\nexpenditures through their projects and received the\nEconomy Drive Award.\n50 51\nSUPPORT FOR STUDENTS\nFinancial assistance is given to deserving students enrolled in SIT. The financial aid\ncovers expenses that include tuition fees and costs for overseas programmes. SIT is\nfirmly committed to a policy that strives to give our most needy students the assurance\nthat quality university education is well within their reach.\nSPONSORSHIPS AND BONDED SCHOLARSHIPS\nTHE FOLLOWING INDUSTRY PARTNERS HAVE PROVIDED\nSPONSORSHIPS/BONDED SCHOLARSHIPS TO SIT STUDENTSThrough generous contributions from our industry partners, government agencies and organisations, our students have\nbeen able to receive various forms of bonded scholarships or sponsorships to pursue their degree programmes.\nAll Saints\nHome\nChangi\nGeneral HospitalAWWA\nKeppel FELSRen Ci Hospital SBS Transit Ltd Sembcorp Marine\nAng Mo Kio\nThye Hua Kwan\nHospital\nBuilding and\nConstruction\nAuthorityCentre of\nStrategic Infocomm\nTechnologies\nThye Hua Kwan\nMoral Charities\nLimitedSociety for\nthe Physically\nDisabled\nSt Andrew’s\nCommunity\nHospitalInfocomm\nDevelopment\nAuthority of\nSingaporeSingapore\nIndustry Scholarship\n–\nMinistry\nof EducationAlexandra\nHealth\nKeppel\nShipyardKwong Wai Shiu\nHospitalMarina Bay\nSands\nNational Infocomm\nScholarship\nSengkang\nGeneral HospitalSingapore\nGeneral Hospital\nSt Luke’s\nHospital\nWoodlands\nHealth CampusTan Tock Seng\nHospitalThe Salvation\nArmy Raffles\nMedical GroupMinistry\nof Defence\nNg Teng Fong\nGeneral HospitalMinistry\nof Home Affairs\nNU Systems\nPte LtdMOH\nHoldings\nOverseas\nUnion Enterprise\nLand Transport\nAuthoritySingapore Institute of Technology / Annual Report 2020 / Support For Students\n53 52\nDONOR ACKNOWLEDGEMENT\nFOR THE FINANCIAL YEAR ENDED 31 MARCH 2020\nThrough generous contributions from our industry partners, government agencies and organisations, our students have been\nable to receive various forms of bonded scholarships or sponsorships to pursue their degree programmes.\nMr John Abraham\nAbwin Pte Ltd\nAcestes Pte. Ltd.\nADERA Global Pte Ltd\nAegis Building & Engineering Pte Ltd\nAlfa Tech Vestasia Pte Ltd\nAmazon Web Services Singapore\nPrivate Limited\nApplied Materials South East Asia\nPte Ltd\nApricot Capital Foundation through\nSymAsia Foundation Limited\nAscendas Funds Management\n(S) Limited\nAsiaCloud Solutions Pte Ltd\nAviva Ltd\nBaker Tilly\nBlu5 View Pte Ltd\nBR Metals Pte Ltd\nBuddhist Compassion Relief Tzu Chi\nFoundation (Singapore)\nCanary Intelligence Pte Ltd\nCEI Limited\nCentre for Strategic Infocomm\nTechnologies (CSIT)\nLTC (RET) Chan Chik Weng and\nMdm Chong Chow Hah\nChangi Airport Group\nMr Eddie Chau\nMr Choo Chiau Beng\nMr Choo Chong Ngen\nChop Wah On\nConrac Asia Display Products Pte Ltd\nContinental Automotive Singapore\nPte Ltd\nCore Concepts Pte Ltd\nCPA Australia Ltd\nCybersprout Pte Ltd\nCyclect Electrical Engineering Pte LtdDBS Bank Ltd\nDecision Science Agency Pte Ltd\nDeloitte & Touche LLP\nDou Yee Enterprises (S) Pte Ltd\nECM Libra Foundation\nENGIE Services Singapore Pte Ltd\nEnGro Corporation Limited\nEPS Computer Systems Pte Ltd\nEY\nFar East Organization\nFARM (Farmwork Pte Ltd)\nFEINMETALL Singapore Pte Ltd\nFeng Ming Construction Pte Ltd\nFoodXervices Inc Pte Ltd\nFurama Pte Ltd\nGeo Energy Group\nGIC Private Limited\nGoh Bee Gah Foundation through\nSymAsia Foundation Limited\nGoh Foundation Limited\nMr Jeff Goh\nHiap Chuan Hardware (Pte) Ltd\nHo Bee Land\nMr Ho Yee Yang Edmond\nHock Seng Hoe Metal Company Pte Ltd\nHong Leong Foundation\nIES-IStructE Joint Committee, The\nInstitution of Engineers, Singapore\nInfo-Communications Media\nDevelopment Authority of Singapore\nIngredion Singapore Pte Ltd\nInstitute of Chemical and Engineering\nSciences (ICES)\nInstitute of Materials (East Asia)\nInstitute of Singapore Chartered\nAccountants (ISCA)\nInterlocal Exim Pte Ltd\nJCS-Echigo Pte LtdMr Surya Jhunjhnuwala and\nMr Gaurang Jhunjhnuwala\nJumbo Group Limited\nKaspersky Lab Singapore\nKewalram Chanrai Group of Companies\nMr Kee Sek Huat\nKeppel Care Foundation Limited\nKeppel Corporation Limited\nKhoo Chwee Neo Foundation Ltd\nKimly Construction Pte Ltd\nMr Ko Oen Tjiang\nKoufu Group Limited\nKreston Ardent CAtrust PAC\nMr Kuok Khoon Hong\nKwai Fong & Raymond Goh\nKwan Im Thong Hood Cho Temple\nLand Transport Authority of Singapore\nLearning Access Foundation\nLee Foundation\nLee Kim Tah Holdings Limited\nMr Kevin Liang\nLien Shih Sheng Foundation\nLih Ming Construction Pte Ltd\nMr Lim Joo Boon\nMr Lim Kun Rong Stewart\nMr Lim Peng Hun and Ms Vanisa Lee\nChildren of Mdm Lim Pu Leh\nMr Peter Lim\nMr Lim Siah Mong\nLions Community Service Foundation\n(Singapore)\nLo Hock Ling & Co\nFamily of Loo Shaw Chang &\nTan Hooi Hong\nMr Low Ming Wah\nLoyang Tua Pek Kong\nL-QuBE Pte LtdM.Tech Products Pte Ltd\nMapletree Investments Pte Ltd\nMarina Bay Sands Pte Ltd\nMarina Mandarin Singapore\nMHC Medical Network Pte Ltd\nMicrocast Pte Ltd\nMount Alvernia Hospital\nNaterra Resources International Pte Ltd\nNational Council of Social Service\nNebulas Tree Pte Ltd\nNehemiah Foundation through SymAsia\nFoundation Limited\nNet-Source Group Pte Ltd\nNexia TS Pte Ltd\nFamily of Mr Ng Sheng Poh and Mdm\nQuek Siew Keow\nOcean Tankers Pte Ltd\nOceanMaster Engineering Pte Ltd\nOctava Foundation Limited\nON Semiconductor\nOne Farrer Pte Ltd\nPacific World Meetings & Events\nSingapore Pte Ltd\nPan Pacific Hotels and Resorts Pte Ltd\nPan Pacific Hotels Group Ltd operating\nas PARKROYAL on Beach Road\nPark Hotel Management Pte Ltd\nPARKROYAL Kitchener Hotel Pte Ltd\nParsing Pte Ltd, the holding company\nof Amoy St Dental Clinic\nPei Hwa Foundation Limited\nPKF-CAP LLP\nPrudential Assurance Company\nSingapore (Pte) Limited\nPwC Singapore\nQ’son Kitchen Equipment Pte Ltd\nQuantum Inventions Pte Ltd\nDr Stanley Quek through The Ireland\nFunds (Singapore)\nRadiology & Co. Pte Ltd\nRaffles Hotel Singapore\nRC Hotels (Pte.) Ltd\nRohde & Schwarz Asia Pte Ltd\nRotary Club of Bugis Junction, Singapore\nRotary Club of Jurong Town, SingaporeRotary Club of Tanglin, Singapore\nRSA\nRSM Chio Lim LLP\nS M Jaleel Foundation\nS.S. Jhunjhnuwala Charity Fund\nSamwoh Corporation Pte Ltd\nSATS Ltd\nSBF Foundation\nSBS Transit Ltd\nSCAL Resources Pte Ltd and members\nof The Singapore Contractors\nAssociation Ltd\nSeagift Food Pte Ltd\nSelect Group Pte Ltd\nSheng Siong Group\nShopee\nSiemens Pte Ltd\nMs Elsie Sim M G\nSingapore Accountancy Commission\nSingapore Chemical Industry\nCouncil Limited\nSingapore Chinese Chamber Of\nCommerce Foundation\nSingapore Computer Society\nSingapore Food Manufacturers’\nAssociation (SFMA)\nSingapore Heart Foundation\nSingapore Leong Khay Huay Kuan\nSMRT Corporation Ltd\nSP Group\nSprinkler Fire Systems Pte Ltd\nSuper Bean International Pte Ltd\nSYNthesize Pte Ltd\nT T J Design and Engineering Pte Ltd\nT.E Engineering & Trading\nTAK Products & Services Pte Ltd\nMs Angela Tan Guat Hoon\nTan and Neo Family\nMs Tan Siew Ooa\nTaylor & Francis Asia Pacific\nTeknor Apex Asia Pacific Pte Ltd\nTexas Instruments Singapore (Pte) Limited\nMs Tammie Tham\nThe Copyright Licensing and\nAdministration Society of Singapore LtdThe Estate of Chong Yook Yin\nThe Estate of Lim Doa Hin\nThe Goh Family\nThe Ireland Funds (Singapore)\nThe Ngee Ann Kongsi\nThe Pan Pacific Hotel Singapore\nThe Silent Foundation Ltd\nThe Tan Chin Tuan Foundation\nMdm Thng Poh Choo\nThomson Medical Pte Ltd\nThomson Shin Min Foundation\nMs Ti Sui Tsu Memorial Fund\nTiong Seng Contractors (Private) Ltd\nMr Edy Hardijana Tjugito\nTL Whang Foundation Limited\nTME Systems Pte Ltd\nMr Toe Teow Heng\nMr Tong Kok Chiang\nTractors Singapore Limited\nDr Paul Tseng\nTunnelling and Underground\nConstruction Society (Singapore)\nTyco Electronics Singapore Pte Ltd\nUnited Overseas Bank Limited\nVivahealth Pharmacy Pte Ltd\nMr Wee Siew Kim\nWilmar International Limited\nWoh Hup Pte Ltd\nMr Albert Wong\nMs Wong Kai Yun\nDr Paul Wong (PAUL WONG AICM\nPTE LTD)\nDr Steven Wong Kai Juan\nMrs Wong Kwok Leong\nMr Wong Yuen Kuai Lucien\nMs Angela Wu Peihui\nwww.hardwareonline.com.sg\nYangzheng Foundation\nYeakin Plastic Industry Pte Ltd\nDr Alvin Yeo (AY ANAESTHESIA AND\nPAIN PTE LTD)\nMr Yusof Bin Amir WahidSingapore Institute of Technology / Annual Report 2020 / Donor Acknowledgement\n55 54\nFOR THE FINANCIAL YEAR ENDED 31 MARCH 2020\nMANAGEMENT OF THE UNIVERSITY\nThe President of the University, Professor Tan Thiam Soon, is appointed by the Board and is the Chief Executive Officer and the\nUniversity’s academic and administrative lead. He is responsible to the Board for the conduct, co-ordination and quality of the\nprogrammes of the University and its future development. He is empowered with the authority to perform all acts which are\nnecessary to implement the policies, procedures and actions of the Board. As a liaison between the Board and the University,\nthe President is tasked with the responsibility of informing each party of the views and concerns of the other, relating to the\nprogrammes and administration of the University. He also arranges for the annual budget of the University to be presented to\nthe Board annually for approval as part of his duties.\nThe profiles of other members of the Senior Management of the University can be found on its corporate web page and at\npage 8 of the Annual Report.The Board is supported by eight Board Committees formed in accordance with Article 53 of the Articles of Association (“AAs”),\nnamely the Academic Advisory, Audit, Campus Development, External Partnerships, Finance, Industry Relations, Investment\nand Remuneration Committees. Each Board Committee has clear Terms of Reference setting out their role, authority, powers\nand matters requiring their approval. The list of Board Committees is on page 60 of the Annual Report.\nBriefly, the responsibilities of the Board Committees are described as follows:-\nThe Academic Advisory Committee advises the University on all academic strategies, policies and issues.\nThe Audit Committee oversees and reviews the University’s internal controls, integrity of its financial reporting, legal and\nregulatory risks, enterprise risk management, internal and external audit functions.\nThe Campus Development Committee maintains oversight of the University’s campus development policies and any\nother matters related to the acquisition, commissioning and management of significant physical assets or facilities.\nThe External Partnerships Committee reviews the financial and legal viability of the University’s partnerships with overseas\nuniversity partners, local universities, institutions of higher learning, corporates, government agencies and other similar\ninstitutions.\nThe Finance Committee provides oversight of the University’s financial policy management.\nThe Industry Relations Committee advises the University on industry engagement and collaboration strategies.\nThe Investment Committee oversees the investment of the University’s endowment and surplus funds.\nThe Remuneration Committee provides independent advice, oversight and policy guidance to the University in employee\ncompensation matters.(a)\n(b)\n(c)\n(d)\n(e)\n(f)\n(g)\n(h)\nEach Board Committee comprises Trustees with appropriate qualifications and skills and there is a fair distribution of responsibilities\namongst the Trustees. Where required, non-Trustees who have experience in their respective areas of expertise are invited to\nprovide advice to the Board Committees to enhance the process of decision making. The Board is kept informed of the key\nmatters discussed at each Board Committee meeting.\nNone of the Trustees have general control and management of the administration of the University’s subsidiaries.CORPORATE GOVERNANCE\nINTRODUCTION\nGOVERNANCE EVALUATION CHECKLIST\nBOARD OF TRUSTEESSIT was incorporated in September 2009 as a Company limited by guarantee under the Companies Act (Cap. 50). It is an\nInstitution of Public Character (“IPC”) under the Charities Act (Cap 37).\nSIT is governed by the Singapore Institute of Technology Act (Cap 299B). Its key constituent document is the Memorandum\nand Articles of Association which states that the purpose of the University is to promote and undertake the advancement of\neducation by providing educational facilities and courses of study in all fields of knowledge, promote and engage in research\nand scholarships and establish, operate, promote and maintain the University as a going concern. SIT has three subsidiaries –\nVerbosecurity Pte. Ltd. (Company Registration No. 201902376G), which was incorporated on 18 January 2019, SIT Microgrid\nPte. Ltd. (Company Registration No. 201926986H), which was incorporated on 19 August 2019, and Foodplant Pte. Ltd.\n(Company Registration No. 202007139N), which was incorporated on 2 March 2020. The three subsidiaries were incorporated\nto support SIT’s strategic initiatives.\nGood corporate governance is the cornerstone of a well-managed University which is, in turn, critical to SIT’s performance and\noperations. The focus of its governance framework, on which the University’s vision, mission and core values are formulated,\npromotes accountability and transparency and is manifested in the composition of the Board of Trustees (“Board”) and its\nCommittees, division of powers and duties between the Board and Management, adoption of checks and balances and sound\nmeasures for internal and corporate controls.\nThe University adheres to the Code of Governance for Charities and Institutions of Public Character (“Code”). The University\nhas complied in material aspects with the principles and guidelines set out in the Code. Where there are departures from the\nCode, these are explained under the relevant sections of the Annual Report or the Governance Evaluation Checklist (“GEC”).\nAccording to disclosure requirements imposed by the Charity Council, Ministry of Culture, Community and Youth, all IPCs are\nrequired to publicly disclose their compliance with the Code. The University’s GEC is made available on the website of the\nCharity Portal at www.charities.gov.sg.\nThe Board is the highest governing authority of the University and comprises 19 Trustees, chaired by Mr Ng Yat Chung. The\nBoard oversees the business of the University, ensures that it acts in accordance with its objects, that its funds and assets are\nproperly accounted for and safeguarded and provides guidance and stewardship to Senior Management, conferring regularly\nwith them. The Board is accountable to the Minister for Education, Singapore for its acts and decisions.\nThe Trustees are eminent persons of good repute and sound judgment who possess collective competencies in areas such as\nthe public and private sectors, academia, accounting and finance, law, information technology, strategic planning, engineering,\nhealthcare and hospitality management and industry knowledge. New Trustees will continue to be selected and invited to\nserve on the Board on the basis of the diversity of their experience, skills, knowledge, abilities and insight from time to time to\nensure constant refreshing of the Board. The Trustees’ profiles appear on pages 9-11 of the Annual Report.\nThere is an objective decision-making process, which allows each Trustee to exercise his or her own independent judgment. The\nUniversity has established financial authorisation and approval limits for operating and capital expenditure, the procurement\nof goods and services, the acquisition and disposal of assets and making investments. The Board approves the annual budget\nand annual audited financial statements of SIT, amongst other responsibilities. With regard to the reserves policy, the use of\nthe reserves is subject to the approval of the Board.Singapore Institute of Technology / Annual Report 2020 / Corporate Governance\n56 57\nCONFLICTS OF INTEREST\nThe Trustees and staff are required to act in the best interest of the University at all times. Policies have been developed to\nprevent or manage situations where conflicts of interest could arise, by promoting integrity and ethical business conduct.\nThe AAs contain provisions for the management and avoidance of conflicts of interest by members of its Board of Trustees.\nSuch provisions include:\npermitting a Trustee to be interested in any transaction with the University provided that the Trustee has declared the\nnature of the interest to the other Trustees of the Board as required under the Companies Act of Singapore and complied\nwith the provisions of AAs to abstain from voting on any matter related to the transaction,\npermitting a Trustee, or a firm associated with the Trustee, to act in any professional capacity for the University and to be\nremunerated for the provision of professional services, and\npermitting a Trustee to be reimbursed for out-of-pocket expenses, travelling and other expenses properly incurred by\nthe Trustee in attending and returning from meetings of the Board of Trustees, any of its committees, or any general\nmeeting of the University or otherwise in connection with the af fairs of the University.(a)\n(b)\n(c)\nThe AAs also state that Trustees shall not receive any remuneration for services rendered by them as Trustees. In addition, the\nUniversity does not have any staff receiving more than S$50,000 in annual remuneration that is a close relative of any Trustee.\nThe University has implemented a Conflicts of Interest Policy which all staff must comply with. In accordance with that Policy,\nstaff must ensure that their private activities and interests do not conflict with their professional obligations to the University.\nWhere there is a potential conflict of interest, the staff is required to submit full disclosure and request for an appropriate\nexemption. The University will grant such exemptions at its discretion. In addition, staff are required to declare their compliance\nwith the University’s prevailing policy on conflicts of interest annually.\nBOARD ATTENDANCE\nA total of four Board meetings were held during the financial year from 1 April 2019 to 31 March 2020. The attendance of the\nTrustees at the Board meetings during the financial year is tabulated below:\nMr Ng Yat ChungName\nDr Chia Tai Tee\nDr Richard Charles Helfer\nProf Heng Chye Kiang\nMs Melissa Khoo1\nDr Benjamin Koh\nMr Kwee Liong Keng\nDr Lim Khiang Wee\nMrs Margaret Lui\nMr Abu Bakar Bin Mohd Nor\nMr Ng Cher Pong2\nMs Gail Ong\nMr Quek Gim Pew\nMr Ravinder Singh\nMr Nagaraj Sivaram\nMr Soon Sze Meng\nProf Tan Thiam Soon\nMs Tammie Tham\nMr T K Udairam\nMr Wen Khai Meng100Percentage (%) of Attendance\n100\n75\n25\n100\n75\n50\n100\n50\n50\n100\n100\n100\n50\n100\n100\n100\n75\n75\n75\n1Ms Melissa Khoo was appointed as Trustee of the Board on 1 December 2019.\n2Mr Ng Cher Pong ceased to be a Trustee of the Board on 1 December 2019.\n58 59\nBOARD COMMITTEES\n& INTERNAL AUDIT\nBOARD COMMITTEES\nINTERNAL AUDITBoard Committee Board Committee Composition Composition\nChairman - Dr Lim Khiang Wee\nMember - Dr Chia Tai Tee\nMember - Prof Heng Chye Kiang\nMember - Dr Benjamin Koh\nChairman - Dr Richard Charles Helfer\nMember - Prof Heng Chye Kiang\nMember - Ms Tammie Tham\nMember - Mr Wen Khai MengChairman - Mr Ng Yat Chung\nMember - Ms Melissa Khoo\nMember - Dr Lim Khiang Wee\nMember - Mr T K Udairam\nChairman - Mr T K Udairam\nMember - Mrs Margaret Lui\nMember - Mr Ravinder Singh\nMember - Mr Wen Khai Meng\nChairman - Mr Abu Bakar Bin Mohd Nor\nMember - Mr Quek Gim Pew\nMember - Mr Ravinder Singh\nMember - Mr Soon Sze Meng\nMember - Ms Tammie ThamChairman - Mr Nagaraj Sivaram\nMember - Dr Benjamin Koh\nMember - Ms Gail OngChairman - Mrs Margaret Lui\nMember - Dr Chia Tai Tee\nCo-opted Member - Mr Oo Wooi Cheng\nChairman - Ms Gail Ong\nMember - Ms Melissa Khoo\nMember - Mr Soon Sze MengAcademic Advisory CommitteeInvestment Committee\nAudit CommitteeRemuneration Committee\nCampus Development Committee\nExternal Partnerships Committee\nFinance Committee\nIndustry Relations CommitteeFOR THE FINANCIAL YEAR ENDED 31 MARCH 2020\nInternal Audit provides independent, objective assurance and consulting services designed to add value and improve the\nUniversity’s operations. Internal audit activity is guided by a value-driven philosophy of partnering with other departments to\nenable SIT to meet its business objectives. Our key role is to assist Management in evaluating their risk management, control\nand governance processes so that business objectives can be met.Singapore Institute of Technology / Annual Report 2020 / Board Committees & Internal Audit\n61 60\nFINANCIAL STATEMENTS\nCONSOLIDATED STATEMENT OF COMPREHENSIVE INCOME\nFOR THE FINANCIAL YEAR ENDED 31 MARCH 2020\nImportant Note:\nThe Consolidated Financial Statements, as set out on pages 62 to 66, are extracted from Singapore Institute of Technology and\nits subsidiaries’ (“the Group”) Audited Financial Statements for the year ended 31 March 2020. It may not contain sufficient\ninformation to allow for a full understanding of the results and the state of affairs of the Group. For further information, please\nrefer to the full set of the audited financial statements published on SIT official website at SingaporeTech.edu.sg. GENERAL FUNDS\n2020\n$’000\nRevenue\nOther Income\nOperating Expenditure\nStaff and Related Expenses\nProgramme and\nStudent-Related Expenses\nDepreciation and\nAmortisation Expenses\nRental and other Facilities\nExpenses\nFinance Expenses\nOther Operating Expenses\nDeficit before\nInvestment Income\nand Government Grants\nNet Investment Income/(Loss)\n(Deficit)/Surplus before\nGovernment Grants\nGovernment Grants\nNet Surplus/(Loss) and Total\nComprehensive Income/(Loss)Total Operating Expenditure(389)\n–\n–(111,507)\n(3,459) (71,417)\n(42,886)\n(15,953)\n(10,800) (192,339)(1,588) (184,557)\n(10,800) 3,869– 196,208(9,212) (7,782)(4,514) (268,963)– (1,610)(97,779) (377)\n–\n–(64,111) (3,221)\n(29,771)\n(22,372)\n–\n(238,409)\n(164,263)\n(163,025) 24,109(1,726)\n1,238\n183,294\n20,269 24,109–25,835(3,902)––\n2,92680,044\n4,36273,409\n737–\n2,1762020\n$’0002020\n$’000(Restated)\n2019\n$’0002019\n$’000TOTALENDOWMENT AND\nTERM FUNDS\n(Restated)\n2019\n$’000\n80,044\n1,436\n(111,118)\n(67,958)\n(42,886)\n(15,953)\n(1,610)\n(264,449)\n(182,969)\n(181,539)1,430\n196,208\n14,669(24,924) (666) (25,590) (24,376) (304)(98,156)\n(67,332)\n(29,771)\n(22,372)\n(138,916)(165,989)\n44,378183,29427,073(242,311)–73,409\n2,913\n(24,680)BALANCE SHEET\nAS AT 31 MARCH 2020\nASSETS\nCurrent Assets\nCash and Cash Equivalents\nFinancial Assets, at Fair Value through Profit or Loss\nDeposits for Investments\nFees and Other Receivables\nStudent Loans\nOther Current Assets\nDerivative Financial InstrumentsGROUP\nAs at\n31 March 2020\n$’000(Restated) As at\n31 March 2019\n$’000(Restated) As at\n1 April 2018\n$’000\nNon-Current Assets\nProperty, Plant and Equipment\nIntangible Assets\nStudent Loans\nOther Non-Current Assets\nTotal Assets\nLIABILITIES\nCurrent Liabilities\nTrade and Other Payables\nDeferred Tuition Fee Income\nGrants Received In Advance\nLease Liabilities\nNon-Current Liabilities\nDeferred Capital Grants\nOther Deferred Grants\nLease Liabilities\nTotal Liabilities\nNET ASSETS\nFUNDS AND RESERVES\nGeneral Funds\nAccumulated Surplus\nEndowment and Term Funds\nCapital\nAccumulated Surplus179,796\n439,823\n33,698\n77,172\n165\n10,277\n-\n740,931\n204,444\n7,394\n756\n73,690\n286,284\n1,027,215\n39,788\n8,878\n26,207\n-\n74,873\n211,493\n76,828\n-\n288,321\n363,194\n664,021\n154,381\n431,761\n77,879\n509,640\n664,021120,782\n226,854\n199,449\n102,170\n158\n7,736\n-\n657,149\n197,347\n6,540\n680\n77,099\n281,666\n938,815\n37,191\n9,039\n26,908\n-\n73,138\n203,629\n80,155\n-\n283,784\n356,922\n581,893\n134,112\n394,011\n53,770\n447,781\n581,893165,355\n489,158\n-\n158,513\n58\n8,480\n88\n821,652\n589,404\n6,665\n729\n70,386\n667,184\n1,488,836\n88,783\n11,604\n27,997\n5,376\n133,760\n458,023\n73,501\n42,087\n573,611\n707,371\n781,465\n169,050\n545,336\n67,079\n612,415\n781,465Singapore Institute of Technology / Annual Report 2020 / Financial Statements\n62 63\nCONSOLIDATED STATEMENT OF CHANGES IN FUNDS AND RESERVES\nFOR THE FINANCIAL YEAR ENDED 31 MARCH 2020\n2020\nBalance at 1 April 2019 as restated\nTotal Comprehensive Income/(Loss)\nGovernment Grants and Donations\nBalance at 31 March 2020Accumulated\nSurplus - General\nFunds\n$’000Endowment and\nTerm Funds\n$’000Total\n$’000BALANCE SHEET\nAS AT 31 MARCH 2020\nASSETS\nCurrent Assets\nCash and Cash Equivalents\nFinancial Assets, at Fair Value through Profit or Loss\nDeposits for Investments\nFees and Other Receivables\nStudent Loans\nOther Current Assets\nDerivative Financial InstrumentsSIT\nNon-Current Assets\nInvestment in Subsidiaries\nProperty, Plant and Equipment\nIntangible Assets\nStudent Loans\nOther Non-Current Assets\nTotal Assets\nLIABILITIES\nCurrent Liabilities\nTrade and Other Payables\nDeferred Tuition Fee Income\nGrants Received In Advance\nLease Liabilities\nNon-Current Liabilities\nDeferred Capital Grants\nOther Deferred Grants\nLease Liabilities\nTotal Liabilities\nNET ASSETS\nFUNDS AND RESERVES\nGeneral Funds\nAccumulated Surplus\nEndowment and Term Funds\nCapital\nAccumulated Surplus(Restated) As at\n31 March 2019\n$’000\n179,796\n439,823\n33,698\n77,219\n165\n10,277\n-\n740,978\n-(a)\n204,444\n7,394\n756\n73,690\n286,284\n1,027,262\n39,768\n8,878\n26,207\n-\n74,853\n211,493\n76,828\n-\n288,321\n363,174\n664,088\n154,448\n431,761\n77,879\n509,640\n664,088(Restated) As at\n1 April 2018\n$’000\n120,782\n226,854\n199,449\n102,170\n158\n7,736\n-\n657,149\n-\n197,347\n6,540\n680\n77,099\n281,666\n938,815\n37,191\n9,039\n26,908\n-\n73,138\n203,629\n80,155\n-\n283,784\n356,922\n581,893\n134,112\n394,011\n53,770\n447,781\n581,893As at\n31 March 2020\n$’000\n165,270\n489,158\n-\n158,563\n58\n8,477\n88\n821,614\n-(a)\n589,404\n6,603\n729\n70,386\n667,122\n1,488,736\n88,683\n11,604\n27,997\n5,376\n133,660\n458,023\n73,501\n42,087\n573,611\n707,271\n781,465\n169,050\n545,336\n67,079\n612,415\n781,465\n(a) Less than $1,0002019\nBalance at 1 April 2018 as previously reported\nEffects of Adjustments\nBalance at 1 April 2018 as restated\nTotal Comprehensive Income (restated)\nGovernment Grants and Donations\nBalance at 31 March 2019154,381\n14,669\n–\n169,050\n116,578\n17,534\n134,112\n20,269\n–\n154,381509,640\n(10,800)\n113,575\n612,415\n447,781\n–\n447,781\n24,109\n37,750\n509,640664,021\n3,869\n113,575\n781,465\n564,359\n17,534\n581,893\n44,378\n37,750\n664,021\n64 65\nCONSOLIDATED STATEMENT OF CASH FLOWS\nFOR THE FINANCIAL YEAR ENDED 31 MARCH 2020\nCash Flows from Operating Activities\nDeficit before Government Grants\nAdjustments for:\n- Depreciation and Amortisation\n- Donations\n- Net (Gain)/Loss on Disposal of Property, Plant and Equipment\n- Interest Income\n- Currency Exchange Gain\n- Financial Assets, at Fair Value through Profit or Loss\n• Fair Value Loss/(Gain)\n• Net Gain on Sale of Financial Assets\n- Derivative Financial Instruments\n- Interest Expense2020\n$’0002019\n$’000\nChange in Operating Assets and Liabilities\n- Fees and Other Receivables\n- Student Loans and Other Assets\n- Trade and Other Payables\nNet Cash Used in Operating Activities12,980\n783\n1,328\n(123,287)\nCash Flows from Investing Activities\nPurchase of Property, Plant and Equipment and Intangible Assets\nProceeds from Disposal of Property, Plant and Equipment\nPurchase of Financial Assets, at Fair Value through Profit or Loss\nProceeds from Sale of Financial Assets, at Fair Value through Profit or Loss\nSettlement of Currency Forwards\nInterest Received\nDeposits for Investments\nPrepayment of Leases\nNet Cash Used in Investing Activities\nCash Flows from Financing Activities\nOperating Grants Received\nDevelopment Grants Received\nOther Government Grants Received\nEndowment Funds Received\nDonations Received\nPrincipal Payment of Lease Liabilities\nInterest paid on Lease Liabilities\nNet Cash Provided by Financing Activities\nNet (Decrease)/Increase in Cash and Cash Equivalents\nCash and Cash Equivalents at Beginning of Financial Year\nCash and Cash Equivalents at End of Financial Year(192,339)\n42,886\n(2,926)\n(7)\n(2,682)\n(416)\n12,933\n(2,223)\n170\n1,610\n(142,994)\n(5,806)\n5,190\n32,188\n(111,422)\n(102,933)\n56\n(67,426)\n40,288\n(258)\n2,604\n-\n(250,795)\n(378,464)\n167,156\n280,541\n13,883\n17,738\n2,926\n(5,189)\n(1,610)\n475,445\n(14,441)\n179,796\n165,355(138,916)\n29,771\n(2,176)\n16\n(2,540)\n(55)\n(21,962)\n(2,516)\n–\n–\n(138,378)\n(35,663)\n94\n(50,679)\n59,002\n-\n2,442\n(33,698)\n-\n(58,502)\n158,053\n33,487\n9,337\n37,750\n2,176\n-\n-\n240,803\n59,014\n120,782\n179,796SIT – THE NEXT LAP\nMoving forward, SIT will focus on deepening its applied learning pedagogy to establish\nitself as Singapore’s premier University of Applied Learning.\nFirstly, SIT will pioneer the ‘work-learn continuum’ and put a greater emphasis on\nskills needed by industry, and skills that will require continuous upskilling. Next,\nthe university will strengthen applied research and deliver impactful outcomes that\ntransform industry, to raise SIT’s reputation and credibility as Singapore’s premier\nUniversity of Applied Learning. Last, but not least, it will leverage on its new campus\nto be a ‘living lab’ that will drive and support integrative digital frameworks and\nplatforms, and industry test-bedding.\nIn the years ahead, SIT will strive to test-bed new technologies, pilot new pr ojects\nin Industry 4.0 and Internet of Things (IoT), and play a key role in Singapore’s higher\neducation landscape in a new age of disruptive changes.\n66\nSingapore Institute of Technology / Annual Report 2020 / SIT - The Next Lap\n67\n68CONTACTS\nSingapore Institute of Technology\nSIT@Dover, 10 Dover Drive, Singapore 138683\nTel: 6592 1189\nFax: 6592 1190\nAdmissions\nTel: 6592 1136\nEmail: Adm@SingaporeTech.edu.sg\nAlumni Office\nTel: 6592 2114 / 6592 2129\nEmail: Alumni@SingaporeTech.edu.sg\nApplied Research, Innovation & Enterprise\nTel: 6592 6917\nEmail: Innovate@SingaporeTech.edu.sg\nCentre for Career Readiness\nTel: 6592 8150\nEmail: CareerReadiness@SingaporeTech.edu.sg\nGiving to SIT\nTel: 6592 1138 / 6592 1094\nEmail: Advancement@SingaporeTech.edu.sg\nRegistrar’s Office\nTel: 6592 2091\nEmail: Registrar@SingaporeTech.edu.sg\nSITLEARN\nEmail: SITLEARN@SingaporeTech.edu.sg\nStudent Events, Activities and Clubs\nTel: 6592 1191\nEmail: SLD@SingaporeTech.edu.sg\nSingapore Institute of Technology\n10 Dover Drive,\nSingapore 138683\nRegistration No: 200917667D\nSingaporeTech.edu.sg"
}