{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2023-05/20230527_Shin%20Min_Fronting%20Ocean%20Conservation%20%E2%80%93%20Narrowing%20the%20gap%20between%20Humans%20and%20the%20Oceans_Prof%20Cesar.pdf",
  "type": "pdf",
  "content": "12副刊副刊\n日\n月\n明　　你可知道人类赖以存活的氧气，有高达75％来自海洋中的植物？\n海洋堪称地球食物链的基石，对生态存亡至关重要。然而，一般人对\n大海的了解却出乎意料地低，甚至觉得海洋环保事不关己。且看这位“海\n洋构想师”如何化身为海洋与人类之间的桥梁，通过创意与技术的巧妙结\n合，让更多人对海洋有进一步的认识，从而更乐意为环保出一份力。\n目前在新加坡理工大学授课的\n希瑟， 也是滨海湾金沙艺术科学博物馆的 “ArtScience Residency” 计划 下 、首 位 驻 馆 的 艺 术 科 学 家 。接 下来两年， 他会为博物馆策划一系列免费与付费活动， 包括来临6月学校假期举行的 “June Hackathon Camp”工 作 坊 系 列 。到 时 ，希 瑟 将 以 浅 白 有趣的互动实验方式， 与公众分享他的环保研发心得， 鼓励更多人加入打造可持续未来的行列。开发海洋氢气\n希瑟当下的研发重点， 包括开\n发海\n洋潜在的可再生能源， 以及有\n利于环境可持续的海事交通。 来临工作坊的主题之一为 “Ocean Solar Hydrogen” （6月2日至4日 ） ， 探索利用太阳能分解海水， 从中 “提炼” 氢气， 作为煮食、 照明与开车等生活能源。　　计划运用可持续的洁净能源， 也可协助沿海社群自给自足。 希瑟透露 ，中 国 与 欧 美 都 在 大 力 开 发 氢 气 资源 技 术 ，是 极 具 环 保 与 经 济 效 益 的 重要 项 目 ，前 景 值 得 期 待 。　　其他三场工作坊的主题， 分别为结合土著造船文化与前卫航海科技的 “Indigenous Future Outrigger”（ 5 月 2 7 日 至 2 9 日）、以 大 自 然 为 灵感提升航行效率的 “Shape Shifting Sailing” （ 6月16日至18日 ） ， 以及通过列车原理善用海运能源的 “Ocean Train” （6月23日至25日 ） 。 每场\n文／陈珮雯图／滨海湾金沙提供\n希瑟曾经在世界各地进行研 发 宣 导 ，也 享 受 与 大 众 交 流 互动， 从中获得启发。 在香港教学期间， 他与不同年龄层的学生探讨海洋珊瑚保育课题， 对年轻一代的环保创意尤其刮目相看。　　“珊瑚礁为海洋生物提供觅食、 繁殖与栖息之所， 无节制捕鱼、 环境污染以及气候变化， 却将珊瑚推向绝迹的深渊。 过去，保 育 员 得 潜 入 海 底 ，用 尺 人 工 测量 珊 瑚 变 化 。当 时 有 中 学 生 向 我反映， 这种方式耗时费力又不稳定、 建议改用尺寸固定的框架形\n希瑟研发的“变形航行器”模拟鱼身希瑟研发的“变形航行器”模拟鱼身\n不停摆动的原理提升航海效率，从而不停摆动的原理提升航海效率，从而\n减少能源消耗。（图/陈珮雯摄）减少能源消耗。（图/陈珮雯摄）　　对于一般人来说， 海洋或许 是 阴 冷 深 邃 、神 秘 莫 测 ，甚 至危机四伏的存在； 但是对于法日混 血 的 “ 海 洋 构 想 师 ”（ O c e a n  Imagineer ） 希瑟 （ Cesar Jung-H a r a d a ，4 0 岁 ）来 说 ，海 洋 却 拥有一股让他奋不顾身的莫名魅力。　　“我出生于法国沿海地区，三岁时第一次跟父母到海边玩，就 一 股 脑 儿 地 冲 入 海 中 ，结 果 受伤 昏 迷 ，还 差 点 溺 水 ，得 缝 针 动手术。 六岁那年， 我和其他小朋友出海学习扬帆， 不料碰上比船身 还 高 的 巨 浪 。其 他 孩 子 都 在 害怕惊叫， 只有我在兴奋地欢呼。哈 哈 ！”\n两次与死神擦身而过的海上 经 历 ，不 但 没 让 希 瑟 留 下 阴影 ，反 而 使 他 对 海 洋 更 着 迷 ，以捍卫海洋为己任。 “看到海洋被漏油污染， 我的反应是有如见到兄弟受伤、 叫人不禁咬牙握拳的愤 怒 。在 我 心 目 中 ，海 洋 的 地 位等同于家人。 让海洋生态环境健 康 长 存 ，也 成 为 我 的 事 业 兼 使命 。”　　为了让更多人了解与保护海洋， 希瑟一度投入动画制作，以传达海洋环保的讯息。 “后来我发现， 这种形式太单方被动，于是我想到从生活应用的角度下 手 ，开 发 出 让 人 们 提 升 生 活 效率， 又能促进可持续发展的技术 ，从 而 加 强 公 众 对 环 保 的 共鸣 。”\n交流互动激荡创意\n测 量 工 具 。后 来 ，当 地 的 大 学 生也 提 出 各 种 改 良 方 案 ，从 使 用 激光 测 量 ，到 遥 控 人 工 智 能 代 劳 ，甚至将技术延伸到海底塑料侦测。 而这一切的起点， 都源于一班 中 学 生 的 想 法 ！”\n首位驻馆艺术科学家\n工 作 坊 为 期 三 天 ，开 放 给 8 岁 以 上者 参 加 ，每 人 费 用 为 4 0 0 元 。欲 知详情， 可浏览网站： https://www.marinabaysands.com/museum/events/hackathon-holiday-cesar-harada.html\n——拉近海洋与人类的距离\n海洋构想师\n希瑟将4月希瑟将4月\n底预先举行两场底预先举行两场\n工作坊“热身”，工作坊“热身”，\n吸引了大批公众吸引了大批公众\n参与。参与。“海洋构想师”希瑟。“海洋构想师”希瑟。\n希瑟尤其喜欢与想象不设希瑟尤其喜欢与想象不设限的孩童互动。限的孩童互动。\n希瑟当场改装变形航行器希瑟当场改装变形航行器\n的原型，以改善其航行效的原型，以改善其航行效\n率。（图/陈珮雯摄）率。（图/陈珮雯摄）“海洋列车”采用陆地火车的形式，“海洋列车”采用陆地火车的形式，\n借由打头阵的船只驱动后方列船，节借由打头阵的船只驱动后方列船，节\n省航运能源。省航运能源。\nPublication: Shin Min\nDate: 27 May 2023\nHeadline: Fronting Ocean Conservation –\nNarrowing the gap between Humans and the Oceans\nSource: Shin Min © SPH Media Limited. Reproduced with permission."
}