{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20230206-lhzb-technologicaladvancementsareforcingemployeestostepoutoftheircomfortzonetoimproveskillsbutmanyfinditdifficult.pdf",
  "type": "pdf",
  "content": "科技发展迫使员工走出舒适圈\n更多人懂 须培训提升技能却不易办到\n卢慧菁　报道\nfcloo@sph.com.sg\n科技发展带来破坏性创新，\n让更多人被迫走出舒适圈，大家也日益了解到有培训、再培训以提升技能的必要。然而知易行难，一些雇员特别是较年长者，不太愿意为工作上的转变受训，以致踏入职场后，能力随着年龄增长没有提升反而下降。　　受访专家和学者们认为，阻碍本地雇员在职业生涯中持续学习和提升技能的“大山”，是整体社会风气。许多人以为离开学校后就不必再进修，而排资论辈的工资制度，也导致一些人缺乏自我提升的动力。　　政府每年通过财政预算案，宣布大笔拨款用作各类培训和转型计划，为技能提升提供充足的资源和财务支援。　　因此，专家和学者建议，预算案的宣布也应放眼长远的规划，成人培训更重要的挑战，其实是如何让大家改变思维，认识到今天的学习，是为了迎接更美好的未来。　　成人学习学院创新中心总监沈素卿说，成人学习的其中一个核心精神是“自主”。她不认为年长雇员或所谓的“老将”，就没有学习精神，但要资深人员接受培训，就要让他们知道意义何在。　　她说，打造一个支持员工培训的环境是很重要的，除了雇员要知道学习是为了未来，雇主也不可以太短视，要给员工时间培训，他们才能把所学习到的技能运用到工作上。　　新加坡政策研究所近期的一项调查结果显示，较年长雇员比年轻一代，更不认为要为了适应工作上的变化，接受技能再培训，也相对不愿意转换跑道。　　主持这项《新加坡人想要的未来工作》调查的政策研究所高级研究员张晖晖博士说，年长雇员可能觉得投入培训的成本大于回报，没必要也不值得花精力和时间学习新技能。\n35岁后新加坡人能力\n低于OECD平均水平\n另一个原因可能是惯性。她\n说，当一个人从事同一份工作多年后，突然要换一份工作或学习全新技能，他可能会觉得须从头开始，心理上难免会难以适应，甚至感到焦虑。　　“其实无论年长或年少，很多人都会下意识抗拒离开舒适区。这是大家都必须克服的。”　　另一项由经济合作与发展组织（OECD）展开的国际成人能力评估（Programme for International Assessment of Adult Competencies，简称PIAAC）也显示，新加坡人在识字和数学能力方面，整体水平比经合组织国家的平均低。　　值得关注的是，新加坡受访者的各项得分随着年龄增加而递减。其中，16岁至35岁的语言和计算能力，都超越经合组织国家平均水平，但35岁至65岁群体低于平均水平。换言之，新加坡人进入职场后，能力没有提升反而下降。　　经合组织有近40个成员国，主要是欧美发达经济体，新加坡非成员国。　　超过30个经济体参与的第二阶段评估正在进行中，结果预计在2024年公布。 　　新加坡理工大学商业、传播及设计学院助理教授黄毅凯认为，大部分中年雇员面对经济压力和家庭负担，要他们接受技能再培训，他们须牺牲一定的经济收入和陪伴家庭的时间，这群人可能会更为抗拒。　　“学历较高者更可能接受技能再培训。本地高等学府早在多年前，就强调了课程的广泛性和综合性。学历相对较低者，可能缺乏这方面的学习经历，若学习与原有领域相差甚远的新技能，接受程度可能相对较低。”\n受访专家和学者们认为，阻碍本地雇员在职业生涯中持\n续学习和提升技能的“大山”，是整体社会风气。许多人以为离开学校后就不必再进修，而排资论辈的工资制度，也导致一些人缺乏自我提升的动力。\n新加坡理工大\n学 商 业 、传 播及设计学院助理教授黄毅凯认 为 ，大 部 分中年雇员面对经济压力和家庭 负 担 ，要 接受再培训并做出 牺 牲 ，他 们可能会抗拒。\n（新工 大 提 供）\n新加坡政策研究所高级研究员张晖晖 博 士 说 ，很多人都会下意识抗拒离开舒 适 区 ，这 是大家得克服的心理。\n（新加 坡 政 策研\n究所提供 ）\nPublication: Lianhe Zaobao  Date: 06 Feb\n2023\nHeadline: Technological advancements\nare forcing employees to step out of\ntheir comfort zone to improve skills but\nmany find it difficult\nSource: Lianhe Zaobao  © SPH Media Limited. Reproduced with permission."
}