{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2025-03/FAQ_Matriculation%20Exercise_Students_PG.pdf",
  "type": "pdf",
  "content": "SINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 1 of 12\nSIT Restricted\nSIT Student Matriculation Exercise\nFrequently Asked\nQuestions\nAY2024 /25 Trimes ter 3\nPostgraduate Programmes\nBy Registrar’s Office\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 2 of 12\nSIT Restricted\nDear Student,\nA warm welcome to SIT !\nTo help you kick start your matriculation process , Registrar’s Office has collated some\nFrequently Asked Questions (FAQ) which you may find useful . For queries not in the FAQ s,\nplease write to matriculation@singaporetech.edu.sg .\nThank you.\nThe FAQ is broadly divided into the following sections  (Click on the link s below to access) :\na. Important Dates &  Deadlines        3\nb. Matriculation Exercise        4\nc. Online Declaration & Document Submission    4\nd. Online Photo Submission       5\ne. SIT Medical Examination        6-7\nf. MOE Subsidy  Related Matters       8\ng. IT Related M atters         9\nh. Payment &  Fee Related Matters       10\ni. SIT Student Card         10\nj. Transfer of Credits &  Module Registration     11-12\nWelcome Message     OVERVIEW\nPage  Sections\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 3 of 12\nSIT Restricted\nQuestion 1: What are the important dates for SIT’s Academic Year (AY) 2024\nMatriculation E xercise?\nDeadline for Online Declaration, Photo Submission, Matriculation Medical Check -up and\nDocument S ubmission is  on 11 April 2025  for all Postgraduate programmes.\nFor Financial Assistance application/ deadlines by other sections, please refer to the “Matriculation\nGuide” .\nQuestion 2: I will not be in Singapore during the matriculation period . How can I\ncomplete the matriculation process?\nOther than the Medical Examination, the rest of the matriculation process can be done online as\nyou do not have to be physically present in Singapore. If you are not able to complete the Medical\nExamination within the stipulated deadline, please write to matriculation@singaporetech.edu.sg to\nrequest for an extension of deadline; an approval from your Programme Leader is required.\nQuestion 3: I have overlooked the deadlines. Can I get an extension?\nPlease write to matriculation@singaporetech.edu.sg to request for an extension of deadline.\nQuestion 4: I am waiting for my appeal to be processed. Do I still proceed with the\nsubmitting the documents and doing the M edical Check -Up within the stipulated\ndeadline?\nPlease write to matriculation@singaporetech.edu.sg.\nA. IMPORTANT DATES & DEADLINES\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 4 of 12\nSIT Restricted\nQuestion 1: Now that I have received the e -Matriculation Package, what do I do next ?\nOnce you received this e- Matriculation Package you can proceed to complete the administrative\nprocedures to matriculate as an SIT student. For further information on the matriculation exercise\nplease refer to the M atriculation G uide .\nQuestion 2: I would like to withdraw from the University  before the start of the\nprogramme. What should I do?\nFor all withdrawal requests, please write to matriculation@singaporetech.edu.sg.\nQuestion 1: I have made an error in my declaration,  can I change my online\ndeclaration after I have submitted ?\nThe matriculation officer will have to assist you with this . Please write to\nmatriculation@singaporetech.edu.sg .\nQuestion 2: I am below 18 years old, do I need to complete the Lea rner Undertaking\nDeclaration ?\nIf you are below 18 years old, you will need to download and complete the Form, attach a copy of\nyour birth certificate and a copy of your parent/ guardian’s NRIC (front and back) during submission\nvia IN4SIT.)\nIf you are above 18 years old and above, you are only required to complete the online Learner\nUndertaking Declaration  during matriculation.\nQuestion 3: The personal particulars shown on the online declaration page is wrong,\nhow do I change it?\nPlease write to registrar@singaporetech.edu.sg  with the change(s) required along with the\nsupporting documents, if available.  B. MATRICULATION EXERCISE\nC. ONLINE DECLARATION & DOCUMENT SUBMISSION\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 5 of 12\nSIT Restricted\nQuestion 1: What are the photo requirements?\nThe photo requirements  for the online photo submission  are listed on the photo submission page.\nQuestion 2: Will I be notified of the status of my photo submission?\nPlease check the status by logging into IN4SIT one week after  your  photo  submission. You will be\nrequired to re -submit the photo if it does not meet the requirements for printing of your SIT Student\nCard.\nQuestion 3: Can I change my photo after it has been approved?\nOnce the photo has been approved, it cannot be changed.  Do take note to  submit a recent photo\ntaken within the last three months adhering to the photo requirements.\nD. ONLINE PHOTO SUBMISSION\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 6 of 12\nSIT Restricted\nQuestion 1: Which are the appointed medical provider( s) by SIT, and what are the\npackages for the SIT Medical E xamination?\nThe details on the appointed medical provider (s) and the packages can be found in the “SIT\nMedical Examination Clinic Info Kit”. This can be  downloaded from the link provided in your\nmedical form.\nQuestion 2: Is it compulsory to go to the appointed medical provider(s)  for my SIT\nMedical E xamination?\nStudents are strongly advised to go to our designated medical provider(s) for their SIT Medical\nExamination  as we have worked out special preferential  rates with the clinic (s) for SIT students. Our\ndesignated medical provider(s) will also ensure that the screening is completed according to the\nprogramme requirements and that the softcopies of the medical reports are sent to SIT  directly .\nQuestion 3: What should I bring for the Medical Examination?\nPlease  bring the following documents:\n1. SIT Medical Examination Form downloaded from IN4SIT ( To be printed on a single side).\n2. NRIC/Passport or Student Pass\n3. Immunisation records/Vaccination history (Applicable to Allied Health programmes, refer the Matriculation Guide  for details)\n4. ICA Medical Examination Form (Applicable to International Students  Only)\nE. SIT MEDICAL EXAMINATION\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 7 of 12\nSIT Restricted\nQuestion 4: Where should I submit the completed SIT Examination Form?\nIf you go to our designated medical provider(s) for the SIT Medical Examination, softcopy of your\nmedical report will be sent to us through the appointed provider, hence you will not need to make\nany submission. In addition, you can collect the hardcopies directly from the designated clinic(s).\nQuestion 5: May I have a copy of my medical examination form?\nYes, a ll hardcopy medical forms and reports can be collected from the clinic directly by you.\nQuestion 6: I have had a Hepatitis B  (Hep B) / Varicella ( Chickenpox ) vaccination. Do\nI still need to do a screening?\nHep B  (even if you had the vaccination for Hep B) and Tuberculosis (TB)  screenings are compulsory.\nIf you have been vaccinated for Measles, Mumps, Rubella  (MMR)  and Chickenpox, you are required\nto provide a proof of vaccination. If you are unable to show a valid document to prove  your\nvaccination, you are required to do the screening for immunity .\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 8 of 12\nSIT Restricted\nQuestion 1: Am I eligible for MOE Subsidy ?\nFor Singapore Citizens  and Permanent Residents :\nSingapore Citizens and Permanent Residents will automatically be eligible for MOE s ubsidy\nprovided they have not previously received the MOE subsidy at any a utonomous university or been\nawarded a government scholarship or sponsorship to pursue a qualification of equal or higher\nlevel .\nFor International Students:\nInternational Students are not eligible for MOE subsidy and will pay non -subsidised fee.\nQuestion 2: I have previously attempted a postgraduate programme in another\nautonomous university but did not graduate, will I still be eligible for MOE Subsidy\nif I transfer to another postgraduate degree programme in SIT?\nSingapore Citizen s and Permanent Residents who have received MOE subsidy  for studies in\npostgraduate  programmes at NUS, NTU, SIT, SMU, SUTD, SUSS, LASALLE , NAFA or UAS will be\neligible for MOE  subsidy up to the total credits required for graduation at SIT minus  the percentage\nof trimesters  or credits  of MOE s ubsidy received at your previous educational institution(s) .\nF. MOE SUBSIDY RELATED MATTERS\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 9 of 12\nSIT Restricted\nQuestion 1: I did not receive the Matriculation L etter and/or E mail regarding my\npassword .\nYou may wish to check your junk mail folder as the email(s) may have gone to that folder. If you did\nnot receive the email, please write to matriculation@singaporetech.edu.sg with your Full Name and\nwe will re- send the email(s). Please check your email inbox again 1 hour after receiving our email\nresponse to inform that we have re -sent the email(s).\nQuestion 2: I cannot find the matriculation e- mail received.\nPlease write in to us of your Full Name and we will re -send the email(s). Please check your email\ninbox again 1 hour after receiving our email response to inform that we have re -sent the email(s).\nQuestion 3: I am not able to login to the AUP portal, login username and/or password\nis incorrect\nYou may write to ITHelpdesk at IThelpdesk@singaporetech.edu.sg to assist you. Alternatively, you\nmay call them directly at their hotline 6592 8511 followed by Option 3 .\nQuestion 4:  How can I connect to SIT VPN?\nPlease refer to the VPN User Guide downloaded from Student Intranet > Guides & Policies > Global Protect VPN Software & Guide\nAlternatively, you may call ITHelpdesk directly at their hotline 6592 8511 followed by Option 3 , or\nwrite to IThelpdesk@singaporetech.edu.sg .\nQuestion 5: I am not able to access IN4SIT using the username and password .\nPlease ensure you have done the following steps:\n1) Logged into the AUP portal using the given username and password and changed the\npassword\n2) Downloaded the VPN, the I nstallation Guide is available in Student Intranet > Guides & Policies\n> Global Protect VPN Software & Guide\nIf you still encounter the login issue, please write to matriculation@singaporetech.edu.sg.\nG.   IT RELATED MATTERS\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 10  of 12\nSIT Restricted\nQuestion 1: I have completed my Matriculation exercise and made the payment of\nS$54.50 , I am now withdrawing from SIT due to some unforeseen circumstances\nwould the S $54.50  be refunded to me?\nNo, the matriculation fee of S $54.50 (inclusive of 9 % GST) is non -refundable.\nQuestion 2: Will I be charged the trimester fees if I withdraw during the matriculation\nperiod ?\nNo, you will not during this period . However, kindly note that you will be billed the 1st\ntrimester/semester tuition fee if you withdraw after Week 2 of the  trimester/semester.\nQuestion 1: How would I be receiving my SIT Student Card?\nAnswer:  Your SIT Student Card will be mailed to you. Please ensure that the correct  mailing address\nis reflected  on IN4SIT  once you have been matriculated into the Programme. You will receive an\nemail once your SIT Student Card has been mailed out and you are required to acknowledge upon\nreceiving the card.\nH.   PAYMENT & FEE RELATED MATTERS\nI.   SIT STUDENT CARD\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 11  of 12\nSIT Restricted\nQuestion 1: When can I start applying for the Transfer of Credits? How can I apply?\nTransfer of Credits application period for newly matriculated students will be in April 2025  and it\nis open only once  to students in their studies at SIT.\nPlease check the Important Announcements on the Student Intranet and email notification from\nthe Registrar’s Office for the exact dates of the Transfer of Credits schedule if you are eligible for\ncredit exemption.\nIf you are eligible to apply, please refer to the IN4SIT Transfer of Credits Guide on how to submit\nthe application in IN4SIT. To access IN4SIT Transfer of Credits Guide, please login to Student\nIntranet  > Policies and Guides > IT & System Guides > IN4SIT Transfer of Credits Guide .\nQuestion 2: I missed the Transfer of Credits application period. Can I still apply?\nYou will not be able to apply after the Transfer of Credits application period  is over .\nQuestion 3: When can I start registering for modules? How can I apply?\nThe Module Registration period is normally open in mid  to end  April  for newly matriculated\nstudents. However, for most of SIT programmes, SIT will pre -allocate or register the modules on\nyour behalf.  For other programmes that require students to register for modules, you will receive\na notification email to log into IN4SIT to check your scheduled module registration date and time.  For more information, please look out under the Important Announcements on  the Student\nIntranet to find if your programme requires you to enrol your modules.\nFor students who are registering your modules, please refer to the IN4SIT Module Registration User Guide for the step -by-step instructions. To access IN4SIT Module Registration User Guide,\nplease login to Student Intranet  > Policies and Guides > IT & System Guides > IN4SIT Module\nRegistration Guide .\nJ.   TRANSFER OF CREDITS & MODULE REGISTRATION\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 12  of 12\nSIT Restricted\nQuestion 4: I missed the module registration during the M odule Registration period.\nCan I still register?\nYes, the next available period for enrolment is during the Add/Drop period, which starts on the\nfirst Tuesday  (in Week 1)  till the second Sunday (Week 2)  of the new trimester. Students can make\nfinal changes to their personalised class timetable during the Add/Drop period.\nFor students whose modules are pre- registered by the University, they will need to seek advice\nfrom their Programme Leaders or Academic Programme Admin istration , if they want to A dd/Drop\nmodules during the Add/Drop period. The billing of tuition fees will be finalised based on the\nmodules registered at the end of Add/Drop period.\nPlease note that the Add/Drop period is not applicable to new students in their first trimester at SIT.\nQuestion 5: My programme doesn’t require me to do self -service module\nregistration. Do I still need to check my registered modules?\nYes, every student is responsible for his/her registered modules. Please log into IN4SIT and\nnavigate to Course Management > View My Classes to view your scheduled classes. You may refer\nto the Module Registration User Guide  for the step -by-step instructions.  The billing of tuition fees\nwill be finalised based on the modules registered at the end of Add/Drop period.\nQuestion 6: Can I withdraw from individual modules after the Add/Drop period has\nended?\nYes, you may submit a Module/ Course Withdrawal Request between Week 3 and Week 7. After\nWeek 7, applications will not be accepted. Log into IN4SIT and navigate to Course Management >\nEnrolment > Course Withdrawal Request. You may refer to the Module Registration User Guide  for\nthe step -by-step instructions.\nDo note that a pproved Course Withdrawal Request applications will receive a “Withdrawn” (W)\ngrade  and student will still be liable for the tuition fee charged  as they are withdrawn after the end\nof the Add/Drop period. In addition, you will be billed for these registered modules when you\nregister for the withdrawn modules again in the future.\nNotwithstanding this, during self- service module registration and Add/Drop period, you are free\nto add or drop classes without any financial penalty or W grade records. Please note that the\nAdd/Drop period is not applicable to new students in their first trimester at SIT."
}