{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20221218-lhzb-severalmasterrsquosdegreeprogrammesareself-financedanduniversitiescansettheirowntuitionfees.pdf",
  "type": "pdf",
  "content": "过去三年，在公立大学修读\n硕士课程的学生中，平均约四成是新加坡公民。大学可根据自资模式是否可行等因素，决定哪些课程向教育部要求资助，并自定学费。　　新加坡国立大学日前透露，除了一些特定的硕士修课课程（Master's by Coursework）继续获得政府资助，多数修课课程最迟在2024年自资。国大自2020年起把课程转向自资模式。校长陈永财教授说，这意味着，课程学费可跟其他顶尖大学的相接近，作为另一个收入来源。　　教育部星期五（12月16日）答复《联合早报》时说，教育部为新加坡人的学士文凭课程提供显著资助，学士文凭后的课程，大学可自主决定哪些须向教育部要求资助，并根据市场需求等考量决定学费。　　发言人指出，多数硕士修课课程已自资，但一些课程作为专业的入行条件，仍然会获得资助，这可包括建筑学、公共行政和公共卫生等。多数硕士研究课程（Master's by Research）也继续获资助，为我国培训研究专才。教育部资助的课程，学费依学生的公民身份而有所不同，公民的学费较低。　　教育部于2018年宣布为了“重新分配资源”，2019年调整硕士修课课程和学士后专业文凭课程的津贴。新加坡籍学生不受影响，学费津贴维持在75％，永\nᮯߐ䷍嗩\u0018\u0019 ᱔约四成学生为本地公民\n多个硕士课程已自资　大学可自定学费\n教育部星期五答复《联合早报》时说，教育部为新加坡人\n的学士文凭课程提供显著资助，学士文凭后的课程，大学可自主决定哪些须向教育部要求资助，并根据市场需求等考量决定学费。\n胡洁梅　 ohkm@sph.com.sg久居民的从65％减至50％。多数\n课程终止国际学生的50％津贴，意味他们须支付全费。　　教育部当时说，大学开办约300个硕士修课和学士后专业文凭课程，其中三分之一由教育部津贴。调整预计每年为教育部腾出约2500万元，这笔钱将投入大专学府开办的短期培训课程。　　教育部发言人在答复中重申，当局与大专学府合作，加大力度提供与领域相关的单元课程，这类课程获精深技能发展局资助，公民与永久居民可获最多达70％的学费津贴。各大学也提供奖学金、学费折扣和经济援助来帮助有需要的本地学生应付硕士课程开销。　　国大受询时说，公共行政、音乐、牙科手术、公共卫生等硕士课程，以及硕士研究课程仍会获得教育部资助。已自资的课程，学费一般介于3万6000元至5万元。　　以上不包括也属自资的工商管理硕士课程。根据国大网站，工商管理硕士课程学费约8万4000元。南大的工商管理硕士课程学费约7万零700多元。美国哈佛商学院的课程学费则是7万3000多美元（约9万9000多新元）。　　国大发言人说，校方会提前公布任何学费调整，在籍学生不受影响。从2023学年起，校方为报读自资硕士课程的公民与永久居民，以及校友提供10%或15%学费折扣。国大在2021学年有超过1万名硕士生。\n公民与永久居民可使用补助​\n修读FlexiMasters课\n南洋理工大学每年录取约\n4200名硕士生。南大副教务长（研究生教育）李佩诗教授透露，约15％课程是硕士研究课程，都获教育部津贴。少数仍获津贴的修课课程包括亚洲学、土木工程、国际政治经济等。　　她指出，公民与永久居民可使用技能创前程补助来修读FlexiMasters课，这些单元课可累计成硕士文凭。南大也为校友提供价值至少1600元的终身学习补助，让他们用来抵消部分费用。　　新加坡管理大学同样提供折扣等补助。新大指出，除了哲学硕士这类研究课程，其他硕士课程一向自资，学费一般从约5万元起跳。新跃社科大学的硕士课程也属自资，但一些课程可利用精深局的津贴。　　每年录取约150名硕士生的新加坡科技设计大学指出，硕士课程目前全由教育部津贴。　　主要为理工学院毕业生设立的新加坡理工大学同样由教育部资助硕士课程。发言人说，硕士课程主要分研究类和培训专业工程师这两种，每年录取不到100人，现阶段没有自资的计划。\nPublication:  Lianhe Zaobao\nDate: 18 Dec 2022\nHeadline:  Several master’s degree\nprogrammes are self-financed and\nuniversities can set their own tuition fees\nSource: Lianhe Zaobao © SPH Media Limited. Reproduced with permission."
}