{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2023-09/AR2023-Applied-Learning.pdf",
  "type": "pdf",
  "content": "Applied Learning\nSIT’s unique pedagogy bridges learning and work, with an emphasis on experiential learning\nbased on real-world problems. The University’s degree programmes are designed to deepen\nskill mastery, with interdisciplinary and transferable skills integrated into the curriculum.\nWe aim to develop work- and future-ready, lifelong learning professionals who are catalysts\nin industry transformation.\nTRANSFORMING LEARNERS THROUGH\nNEW ACADEMIC INITIATIVES\nNEW UNIVERSITY-LEVEL MODULES\nFOR INTERDISCIPLINARY LEARNING\nIn AY2022, SIT completed the harmonisation of degree\nprogrammes with the rollout of 5 university-level modules\nunder its Undergraduate Programme Structure that\nemphasise dispositions like curiosity, creativity, critical\nthinking, communication and collaboration. These\nmodules prepare students for life beyond the classroom\nby providing them with the skills to navigate the\nincreasingly volatile, uncertain, complex, and ambiguous\n(VUCA) world.\n• The Critical Thinking and Communication module\nteaches students essential skills to evaluate texts\nand propose innovative ideas specific to their degree\nprogrammes. Students will acquire foundational\nknowledge in writing and speaking through training\nin critical reading, literature reviews, effective report\nwriting and presentation skills.\n• In the Digital Competency Essentials module,\nstudents will complete a series of stackable micro-\nmodules that will equip them with basic digital skills and competencies aligned with the Ministry\nof Education’s digital literacy framework. These\nskills include cybersecurity, cloud computing and\ndata analytics.\n• The Introduction to Design Innovation and\nInterdisciplinary Design Innovation modules train\nstudents to innovate using a multi-disciplinary\napproach focused on user-centred problems. Through\nempathic discovery and iterative solutioning, students\nare equipped with the critical competency and\nconfidence to approach complex problems and\ndevelop creative solutions.\n• Under the Social Innovation Project (SIP) module,\nstudents will identify and address contemporary social,\nenvironmental and sustainability factors. SIP enhances\nstudents’ learning and develops them into effective,\ninclusive and socially attuned individuals. There will be\nopportunities for them to formulate social innovations\nor solutions that can address a variety of challenges,\nsuch as those related to sustainability and sustainable\ndevelopment, or the management of disruptions and\nimpact on seniors.\nINNOVATIVE EDUCATION PATHWAYSSIT has introduced innovative education pathways such as Term-In\nTerm-Out (TITO), which maximise the curriculum time the students\nspend at job attachments. Students alternate between classes and on-\nthe-job training, and at the end of their undergraduate studies, they\nwould have spent almost half of their school term in authentic industry\nsettings without extending the duration of their degree programme.\nThe TITO model enables students to gain a deeper understanding of\nindustry needs and bring these perspectives back to the classroom. Concurrently, sponsoring companies\nwill be able to green-harvest talents. In FY2022, the University secured the commitment of 15 companies\nfor 3 degree programmes in Applied Computing (with Fintech specialisation), Digital Supply Chain,\nand Robotics Systems. These companies will provide work placements for students throughout the\ncourse of study.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202316\nREFRESHED CURRICULA TO NURTURE\nSTEWARDS OF SUSTAINABILITY\nSIT recognises its role in building capability for\nsustainability efforts and has announced the following\nrefreshed curricula:\nIntroduced in AY2022, all Year 1 undergraduates from SIT\nand SIT-joint degree programmes will receive a baseline\nsustainability education through a compulsory Introduction\nto Sustainability micro-module that equips students with the fundamentals of sustainable development. The\nmicro-module also supports future sustainability-related\nmodules and projects.\nIn AY2023, a new Minor in Environmental Sustainability\nwill be available for undergraduates of selected\nprogrammes, such as the Electrical Power Engineering\ndegree programme.\n2 degree programmes will have their names changed to\nbetter reflect their curricula, with effect from AY2023:\n• Bachelor of Engineering with Honours in Sustainable\nInfrastructure Engineering (Building Services) has been\nrenamed Bachelor of Engineering with Honours in\nSustainable Built Environment;\n• Bachelor of Engineering with Honours in Sustainable\nInfrastructure Engineering (Land) has been\nrenamed Bachelor of Engineering with Honours\nin Engineering Systems.\ncontribute to industry advancements and innovation.\nLiving Labs also emphasise interdisciplinary collaboration,\nencouraging the exchange of ideas and knowledge across\ndifferent fields. Ultimately, the initiative aims to bridge\nthe gap between academia and industry to accelerate\nthe translation of research into practical applications\nthat benefit society.\nFor a start, the University has set up 5 Living Labs in\nthe areas of Energy, Transport, Healthcare, Building\nServices and Virtual Campus. SIT students and\nresearchers can tackle real-life projects such as the\nMulti-Energy Microgrid (MEMG) and the District Cooling\nSystem (DCS) implementations. In FY2022, the University\nextended its partnerships with SingHealth and SMRT\nto drive strategic initiatives through new research and\ninnovation opportunities and practice-oriented education\nfor students. Through Living Labs, SIT brings greater\nauthenticity to its educational offerings and catalyses\napplied research opportunities for SIT students and\nfaculty, all while contributing to and solving operational\nchallenges with our partners.In addition to pathways and programmes, SIT is\ntransforming learning through Living Labs, which play\na key role in enabling authentic and active learning for\nstudents, and supporting the nurturing of talents to ESTABLISHING LIVING LABS AS A STRATEGIC\nACADEMIC IMPERATIVE\n17\nAPPLIED LEARNING\nThe second bug bounty challenge was a resounding success.\nThe top 3 teams of The Mapletree Challenge 2022 with MOS\nLow Yen Ling and senior management of SIT and Mapletree.FOSTERING LEARNING AND INNOVATION\nTHROUGH EXPERIENTIAL CHALLENGES\nFY2022 was an exciting year for SIT students as they\nparticipated in a variety of competitions and hackathons,\nproviding them with enriching, hands-on opportunities\nto apply their knowledge and showcase their skills.\nIn August 2022, SIT collaborated with the Cyber\nSecurity Agency of Singapore (CSA), the Association of\nInformation Security Professionals (AiSP), Group-IB and\nJTC to organise the PDD Connecting Smartness Bug\nBounty 2.0 Contest. Held at the SIT@NYP Building,\nthe event challenged cybersecurity experts to find bugs\nand vulnerabilities in real-world systems, such as the\nLiving Lab Network prototype. The winner, Year 3 ICT\n(Information Security) student Justin Lim Keat Hui, was\nable to bypass the authorisation of a network router and\nexpose its technical information. This open innovation\necosystem serves as a Living Lab for industry partners\nto test and pilot their prototypes in a real-world setting.\nSIT and Target Media Culcreative collaborated on the\n‘Beyond the Screen Ideation Challenge’ for students\nand Punggol residents. The challenge aimed to enhance\ncommunity communications and engagements by\nharnessing technology, content creation, the environment\nand ecosystem, and other disruptive strategies. The\nwinning entry by Year 1 student Kieran Chai Si Yuan,\nfrom DigiPen Institute of Technology (Singapore)’s User\nExperience and Game Design programme, featured a\nsmart and interactive repository comprising a directory\nof nearby amenities, wayfinding, weather forecasts and\ncommunity news.spam detection programme. The event was co-organised\nby SIT’s Community Leadership and Social Innovation\nCentre (CLASIC).\nMapletree Investments Pte Ltd and SIT partnered on\nthe third edition of The Mapletree Challenge 2022 .\nThe challenge, comprising masterclass sessions and an\ninnovation and entrepreneurship forum, culminated in\na grand finale that saw 2 SIT student teams emerging\nas joint champions.\nSIT Senior Management and faculty with SIT participants at the\nTech For Good 2022 innovation festival.The Tech For Good 2022 innovation festival by Engineering\nGood provided SITizens opportunities to collaborate and\ntackle community issues. 3 teams from the Engineering\nand Infocomm Technology Clusters made the finals, where\nthey showcased their assistive technology ideas, including\nan Internet-of-Things device that assists people with\nmuscular dystrophy with photo-taking, a modified ramp\nfor an enhanced game of bowling, and an automated\nThe winning entry of the ‘Beyond the Screen Ideation\nChallenge’ by an SIT student featured a smart directory and\nan interactive repository.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202318\nFORGING BONDS AND\nEXTENDING NETWORKS BEYOND\nCAMPUS AND BORDERS\nIn FY2022, SIT resumed most of its mobility programmes\nto offer students international exposure through cross-\ncultural exchanges. The University also facilitated enriching\nnetworking opportunities and activities for students.\nA total of 735 students participated in various Overseas\nImmersion Programme (OIP) activities, including\nindustry visits, projects and lectures.\nIn May 2022, SIT students and faculty collaborated with\nthe Metropolia University of Applied Sciences in Finland\nUniversity of Glasgow Singapore students enjoyed a campus\ntour of the UofG campus in Scotland.\nSIT faculty and students met up with representatives from the\nMetropolia University of Applied Sciences in Finland.The Culinary Institute of America students at Greystone\ncampus in USA.\nDigiPen (Singapore) students visited DigiPen’s home campus\nin Redmond, Washington, USA.on the ‘Artificial Intelligence (AI) Based Solutions in\nDose Management’ project, a cross-university partnership\nfocused on reviewing research on AI applications to dose\nmanagement in medical radiation imaging and radiation\ntreatment. This multidisciplinary project was funded by\nthe Finnish Education Ministry. A 5-year Memorandum\nof Understanding (MOU) was signed in October 2022\nto extend further student and staff exchanges, joint\nworkshops and applied research opportunities.19\nAPPLIED LEARNING"
}