{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-09/%5BFA%5D%20SIT%20AR%202024_08_Corporate%20Governance.pdf",
  "type": "pdf",
  "content": "Introduction\nSIT was incorporated in September 2009 as a company limited by guarantee under the Companies Act 1967.\nIt is an Institution of Public Character (“IPC”) under the Charities Act 1994.\nSIT is governed by the Singapore Institute of Technology Act 2014. Its key constituent document is the\nMemorandum and Articles of Association which states that the purpose of the University is to promote\nand undertake the advancement of education by providing educational facilities and courses of study in all\nfields of knowledge, promote and engage in research and scholarships and establish, operate, promote and\nmaintain the University as a going concern. SIT has three subsidiaries – Verbosecurity Pte. Ltd. (Company\nRegistration No. 201902376G), which was incorporated on 18 January 20191, SIT Microgrid Pte. Ltd. (Company\nRegistration No. 201926986H), which was incorporated on 19 August 2019, and Foodplant Pte. Ltd. (Company\nRegistration No. 202007139N), which was incorporated on 2 March 2020. The three subsidiaries were\nincorporated to support SIT’s strategic initiatives.\nGood corporate governance is the cornerstone of a well-managed University which is, in turn, critical to\nSIT’s performance and operations. The focus of its governance framework, on which the University’s vision,\nmission and core values are formulated, promotes accountability and transparency and is manifested in\nthe composition of the Board of Trustees (“Board ”) and its Committees, division of powers and duties\nbetween the Board and Management, adoption of checks and balances, and sound measures for internal\nand corporate controls.\nGovernance Evaluation Checklist\nThe University adheres to the Code of Governance for Charities and Institutions of Public Character (“Code”).\nThe University has complied in material aspects with the principles and guidelines set out in the Code. Where\nthere are departures from the Code, these are explained under the relevant sections of the Governance\nEvaluation Checklist (“GEC”).\nAccording to disclosure requirements imposed by the Charity Council, Ministry of Culture, Community and\nYouth, all IPCs are required to publicly disclose their compliance with the Code. The University’s GEC is made\navailable on the website of the Charity Portal at www.charities.gov.sg.\nBoard of Trustees\nThe Board is the highest governing authority of the University and comprises 20 Trustees, chaired by Mr Bill\nChang, Chief Executive Officer, Digital InfraCo, Singapore Telecommunications Ltd. The Board oversees the\nbusiness of the University, ensures that it acts in accordance with its objects, that its funds and assets are\nproperly accounted for and safeguarded and provides guidance and stewardship to Senior Management,\nconferring regularly with them. The Board is accountable to the Minister for Education, Singapore for its\nacts and decisions.\nThe Trustees are eminent persons of good repute and sound judgment who possess collective competencies\nin areas such as the public and private sectors, academia, accounting and finance, law, information technology,\nstrategic planning, engineering, defence, investment and asset management, healthcare, real estate and\nsustainability. New Trustees will continue to be selected and invited to serve on the Board on the basis of\nthe diversity of their experience, skills, knowledge, abilities and insight from time to time to ensure constant\nrefreshing of the Board. The Trustees’ profiles appear on pages 12 & 13 of the Annual Report.There is an objective decision-making process, which allows each Trustee to exercise his or her own\nindependent judgment. The University has established financial authorisation and approval limits for\noperating and capital expenditure, the procurement of goods and services, the acquisition and disposal\nof assets and making investments. The Board approves the annual budget and annual audited financial\nstatements of SIT, amongst other responsibilities. With regard to the reserves policy, the use of the reserves\nis subject to the approval of the Board.\nThe Board is supported by eight Board Committees formed in accordance with Article 53 of the Articles of\nAssociation (“AAs”), namely the Advancement, Audit, Campus Development, Finance, Industry and Research,\nInvestment, Remuneration and Nomination, and Sustainability Committees. Each Board Committee has clear\nTerms of Reference setting out their role, authority, powers and matters requiring their approval. The list\nof Board Committees is on page 38 of the Annual Report.\nBriefly, the responsibilities of the Board Committees are as follows:\n(a)     The Advancement Committee provides oversight and policy guidance on the University’s\nphilanthropic activities.\n(b)     The Audit Committee oversees and reviews the University’s internal controls, integrity of its\nfinancial reporting, legal and regulatory risks, enterprise risk management, internal and external\naudit functions.\n(c)     The Campus Development Committee maintains oversight of the University’s campus development\npolicies and any other matters related to the acquisition, commissioning and management of\nsignificant physical assets or facilities.\n(d)     The Finance Committee provides oversight of the University’s financial policy management.\n(e)     The Industry and Research Committee provides strategic guidance on the University’s industry\nengagement and collaboration, and applied research.\n(f)     The Investment Committee oversees the investment of the University’s endowment and surplus funds.\n(g)     The Remuneration and Nomination Committee oversees and reviews the University’s overall\nremuneration framework and policies, and also oversees succession planning for the Board and\nthe Board Committees.\n(h)     The Sustainability Committee provides strategic guidance on the University’s sustainability strategy,\npolicies and initiatives, as well as the development of the University’s talent and applied research\ncapabilities in sustainability.\nEach Board Committee comprises Trustees with appropriate qualifications and skills and there is a fair\ndistribution of responsibilities amongst the Trustees. Where required, non-Trustees with relevant areas of\nexpertise are invited to provide advice to the Board Committees to enhance the process of decision making.\nThe Board is kept informed of the key matters discussed at each Board Committee meeting.\nNone of the Trustees have general control and management of the University’s subsidiaries.CORPORATE GOVERNANCE For the financial year ended 31 March 2024\n1  Verbosecurity Pte. Ltd. was struck off the Register of Companies on 4 June 2024./36\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024\nBoard Attendance\nA total of four Board meetings were held during the financial year from 1 April 2023 to 31 March 2024. The\nattendance of the Trustees at the Board meetings during the financial year is tabulated below:\nName Percentage (%) of Attendance\nMr Bill Chang 100\nMr Chan Hian Lim 75\nDr Chia Tai Tee 75\nProf Chua Kee Chaing 100\nMr Han Kwee Juan 100\nDr Benjamin Koh 75\nMr Kwee Liong Keng 50\nMs Lim Wan Yong 75\nMrs Margaret Lui 75\nMr Abu Bakar bin Mohd Nor 75\nMs Neo Gim Huay 25\nMs Gail Ong 100\nMs Jacqueline Poh 75\nMr Quek Gim Pew 75\nMr Ravinder Singh 25\nMr Nagaraj Sivaram 100\nMs Susah Soh 100\nMr Soon Sze Meng 100\nMs Tammie Tham 100\nMr Wen Khai Meng 100\nManagement of the University\nThe President of the University, Professor Chua Kee Chaing, is appointed by the Board and is the Chief\nExecutive Officer and the University’s academic and administrative lead. He is responsible to the Board for\nthe conduct, co-ordination and quality of the programmes of the University and its future development.\nHe is empowered with the authority to perform all acts which are necessary to implement the policies,\nprocedures and actions of the Board. As a liaison between the Board and the University, the President is\ntasked with the responsibility of informing each party of the views and concerns of the other that relate\nto the programmes and administration of the University. He also arranges for the annual budget of the\nUniversity to be presented to the Board annually for approval as part of his duties.\nThe profiles of other members of the Senior Management of the University can be found on its corporate\nweb page and at page 14 of the Annual Report.Conflicts of Interest\nThe Trustees and staff are required to act in the best interest of the University at all times. Policies have\nbeen developed to prevent or manage situations where conflicts of interest could arise, by promoting\nintegrity and ethical business conduct.\nThe AAs contain provisions for the management and avoidance of conflicts of interest by members of its\nBoard of Trustees. Such provisions include:\n(a)     permitting a Trustee to be interested in any transaction with the University provided that the\nTrustee has declared the nature of the interest to the other Trustees of the Board as required\nunder the Companies Act of Singapore and complied with the provisions of AAs to abstain from\nvoting on any matter related to the transaction,\n(b)     permitting a Trustee, or a firm associated with the Trustee, to act in any professional capacity for the\nUniversity (except as auditor) and to be remunerated for the provision of professional services, and\n(c)     permitting a Trustee to be reimbursed for out-of-pocket expenses, travelling and other expenses\nproperly incurred by the Trustee in attending and returning from meetings of the Board of Trustees,\nany of its committees, or any general meeting of the University or otherwise in connection with\nthe affairs of the University.\nThe AAs also state that Trustees shall not receive any remuneration for services rendered by them as Trustees.\nIn addition, the University does not have any staff receiving more than S$50,000 in annual remuneration\nthat is a close relative of any Trustee.\nThe University has implemented a Conflict of Interest Policy which all staff must comply with. In accordance with\nthat Policy, staff must ensure that their private activities and interests do not conflict with their professional\nobligations to the University. Where there is a potential conflict of interest, the staff is required to submit\nfull disclosure and request for an appropriate exemption. The University will grant such exemptions at its\ndiscretion. In addition, staff are required to declare their compliance with the University’s prevailing policy\non conflicts of interest annually.\nWhistleblowing Policy\nThe University seeks to uphold the highest standards of governance, ethics, and conduct. To this end, the\nUniversity has a Whistleblowing Policy which provides individuals with a confidential avenue to report, in\ngood faith, any wrongful practices in the University, without fear of reprisal against the whistleblower. The\npolicy and reporting channels are published on SIT’s website.CORPORATE\nGOVERNANCE/37\nSINGAPORE INSTITUTE OF TECHNOLOGY ANNUAL REPORT 2024"
}