{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-08/Master%20of%20Science%20in%20SF%20-%20Module%20Details.pdf",
  "type": "pdf",
  "content": "1\nMaster  of Science  in Sustainable  Food\nAll modules  carry  5 ECTS  Credits  each  with the exception  of Laboratory  Module,  which  carries  10\nECTS  Credits.\nREFRESHER  MODULE\n1) Laboratory Module\nThe laboratory module provides students with the theoretical and practical knowledge in a broad\nspectrum of experimental methods applied in food structure analysis, molecular biology,\nmicrobiology, molecular sensory science, analytical food chemistry and agricultural science (e.g.\nrheology, microbial ana lysis, sensory assessment, high resolution liquid chromatography). The\nmodule aims to give students a first -hand experience in their laboratory applications thus\nfamiliarising with the technical details and potential pitfall in addition to strengthening th eir\ntheoretical background of these methods.\nHours:  90 / Semester:  1\nCORE MODULES\n2) Technofunctionality of Food Components\nThis module enables students to gain an in -depth knowledge of the influence of different ingredients\non the quality and functionality of food. Through review of the chemical properties of the individual\nfood components, students will be able to deepen thei r understanding of their structure -activity\nrelationships linking to their physicochemical and technofunctional properties. The module will also\ndeep dive into essential food nutrients such as proteins, lipids and carbohydrates and their individual\npropert ies in detail.\nHours:  45 / Semester:  1\n3) Nutrition and Microbiome in Health and Disease\nThis module provides insights into the principles of microbial ecologies specifically discussing the\nintestinal eco -system, and introduce measures on how to analyse changes, focusing on the response\nto food intake through the discussion on the anatomy and physiology of the digestive tract. In\naddition, the course will discuss mechanisms of micro -host interactions at the level of gut barrier\nfunctions, the mucosal immune system, the nervous system and human metabolism. Students will\nalso acquire a comprehens ive state -of-the-art knowledge of the role of the microbiome in human\nhealth and disease such as immune -related pathologies and cancer, and metabolic disorders through\ndiscussions on the principles of immune and metabolic disorders; the role of the intesti nal\nmicrobiome in regulating initiation and progression or prevention and treatment of diseases.\nHours:  45 / Semester:  1\n2\n4) Energy Metabolism and Regulation\nThe module imparts knowledge on how quality and quantity of food stuffs affect energy metabolism\nand the role of environmental factors and genetic / epigenetic variation in the regulation of energy\nbalance. The integrative physiology of energy metabolism will be highlighted through the study of\nredundant peripheral and central control mechanisms known to regulate energy intake, turnover\nand storage. Students will be able to elaborate and articulate their knowledge in physiology of\nhuman nutrition and energy met abolism and know examples for pathophysiological disturbances of\nenergy metabolism and regulation and potential treatment options.\nHours:  45 / Semester:  1\n5) Food Structure and Texture Engineering (Food Design)\nThe module sheds light on the principles of structures from a micro - up to macroscopic level in food\nsystems and its functionalities. Students will gain an in -depth understanding of the development and\nmodification of specific structures by engineering app roaches with up -to-date equipment. In detail,\nstructures in food systems and its functionality are covered, diving into the structural hierarchy and\ntheir relationship with quality aspects in food. Students will also gain a comprehensive knowledge on\nthe i nnovative and emerging technologies and processes in relation to their impact on the structure\nof different biopolymers and its functionality in foods such as structuring by thermos -mechanical\npolymer approaches, and texture design by additive manufacturin g.\nHours:  45 / Semester:  2\n6) Molecular Sensory Science\nThe module delves into the principles of odour and taste perception on a molecular level to enable\nstudents to gain state -of-the-art knowledge in Sensomics. Students will advance their understanding\nin flavour perception, and various methods for the analys is of odour active compounds as well as the\nanalysis of taste active compounds using the Sensomics approach to classify these substances by\ntheir aroma value or dose over threshold factor and assess their relevance in food.\nHours:  45 / Semester:  2\n7) Sustainability in Food Systems\nThis module builds on the key concepts of supply chain management, strategy and sustainability to\nprovide students with the necessary competencies to evaluate pertinent issues in the food system. It\nwill deep dive into the value proposition of the food sys tem – creation and capture of added value,\nmanagement of stakeholders of the food system, innovation in supply chains, sustainability as an\ninnovation, sustainable supply chains and ethical issues in supply chain management and the food\nsystem, sustainabil ity measurement, and the implementation of a sustainability strategy as well as\ncosts and benefits of sustainable practices in the food system.\nHours : 45 / Semester:  2\n8) Food Toxins and Toxicants (Food Toxicology)\nThe module provides students a solid understanding of food toxins and toxicants by delving into the\nfundamentals of toxicology covering toxicokinetics, toxicodynamics, and risk assessments and risk\nmanagement of food. Students will deepen their scientific understanding in specific contaminants\nand residues in foods and the environment while developing skills to analyse and apply analytical\nmethods, conduct risk assessment of selected compounds and groups with toxic relevance such as\nbut not limited to mycot oxins, process contaminants, pesticide residues, heavy metals, chlorinated\n3\ncontaminants and emerging contaminants such as Mineral Oil Saturated Hydrocarbons (MOSH) and\nMineral Oil Aromatic Hydrocarbons (MOAH).\nHours:  45 / Semester:  2\n9) Microbial Food Safety from Farm to Fork\nThe module dives into the principles of microbiological food safety focusing on modern food\nproduction systems such as aquaponics growth, and fermenter systems. Students will develop state -\nof-the-art knowledge in issues of microbiological threat for food s afety such as bacteria, antibiotic\nresistance, cyanobacteria, employ risk assessment such as advanced analysis and analytical tools,\nand formulate mitigation strategies such as prevention of contamination and recontamination,\nprevention of unwanted bacteri al toxins and prevention of food spoiling organisms to increase food\nsafety.\nHours:  45 / Semester:  2\nTECHNICAL ELECTIVE MODULES (CHOOSE TWO OUT OF THREE)\n10) Economic and Environmental Life Cycle Assessment\nUsing the concepts and tools of life cycle assessment (LCA), the module aims to impart students with\nthe knowledge and skills to analyse industrial metabolisms as well as products and services regarding\ntheir environmental impacts. Students will gain a deeper understanding of the LCA met hodology and\nprocedure by applying the theoretical knowledge to a practical example, thus gaining a deeper\nunderstanding of the LCA methodology.\nHours:  45 / Semester:  1\n11) Molecularbiological  Methods to assess Authenticity, GMO and Veterinary Drugs in Food\nThe module provides insights into the molecular -biological methods and principles to detect,\nquantify and assess food authenticity, genetic modified organisms and veterinary drugs with focus\non hormones, endocrine hormone disrupters and antibiotics in huma n food by both theoretical\nlectures and practical laboratory training. Students will be able to develop competencies in applying\nthese molecular -biological methods and principles for a successful risk assessment and they can\nconclude the impact of food saf ety and authenticity on human health.\nHours:  45 / Semester:  2\n12) Food Tissue Engineering / Cellular Agriculture\nIn this module, students will be introduced to the concepts of cellular agriculture, its connection to\nfood science and the use of biotechnological methods in producing novel food. Students will acquire\nstate -of-the-art knowledge in cellular agriculture, a nd apply the knowledge to evaluate individual\nstrategies for production of biotechnological alternatives to agricultural food products such as\ncultivated meat including technical and environmental aspects, biotechnological efficiency\nparameters and critica l review of the feasibility of a novel production strategy.\nHours:  45 / Semester:  3"
}