{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/SIT_Commemorative%20Book_Web.pdf",
  "type": "pdf",
  "content": "Journey to\nThis commemorative logo was designed to mark the 10th anniversary of the Singapore Institute of Technology (SIT) as an Autonomous\nUniversity. The number 10 is composed of geometrical shapes, a nod to the multi-faceted journey SIT has taken. The slant of the\nnumber symbolises the steps SIT has taken to solidify its status as one of the top choices of university for students in Singapore.\nThis book documents the story of Singapore’s\nfirst university of applied learning and, within\nits pages, you will appreciate the effort and\ncommitment that all, from the founding team to\nour current management and Board of Trustees,\nhave invested into taking the Singapore Institute\nof Technology (SIT) to where it is today.\nAnd while the journey since we became an\nAutonomous University (AU) 10 years ago has\nbeen filled with many challenges, we continue\nto scale new heights each year as our faculty\nand staff endeavour to bring their best each and\nevery day, in order to fulfil our mission. In the past\ndecade, we have grown to become Singapore’s\nthird-largest AU by undergraduate intake and our\ngraduates continue to make their mark in various\nindustries ranging from engineering, infocomm\ntechnology, allied healthcare, foodtech, fintech\nto hospitality business. Our graduates are among\nthe most employable given their well-rounded\nand industry-oriented development. In the\nnext lap, we will be expanding our Continuing\nEducation & Training (CET) programmes through\nour unique applied learning approach, to deliver\nan even greater impact for our workforce\nand economy.\nSIT’s close nexus with industry has always been\nkey to driving our mission. With the Punggol\nCampus being sited in the Punggol Digital\nDistrict (PDD), those linkages will be manifested\nin various forms – spaces where our SITizens\nand industry come together to work on applied\nresearch projects, multiple touchpoints with\nindustry in order to provide authentic, holistic\nand impactful education that anchors the\nexperiences of our SITizens and makes them\nmore adaptable, responsive and which prepares\nthem for the future. My hope is that we will use this wonderful\nopportunity at our new campus in Punggol\nto develop closer ties with the industry, co-\ninnovate with them with our various living lab\ninitiatives and create distinctive programmes\nto develop our learners holistically. We have\nthe opportunity to develop platforms to better\nserve our enterprises and also to contribute\nto the community and society, in and around\nPunggol, and beyond.\nMore importantly, as we move into our new\nhome, we want to catalyse the community\naround us and make our Punggol Campus a\ndestination that excites, inspires and enthralls\nthose who visit us. We know that a generation\nof SITizens has passed through our doors; and\nthey have passed on the baton to many who\nare looking forward to beginning their learning\njourneys with us. Our Punggol Campus is the\nideal platform for everyone who has contributed\nto SIT’s growth – from our pioneer staff to our\npioneer cohort of SITizens; industry partners and\nalumni – to come together and work with us to\nfuel the next stage of growth.\nI would like to express my appreciation to\neveryone who, in one way or another, has\ncontributed to the success of SIT and to the team\nwho has painstakingly put this commemorative\npublication together. As you go through the\npages, I hope that you will be inspired by the\nstories and by how, from humble beginnings\nin an office along North Bridge Road, we have\nendeavoured to build a university that will\ncontinue to keep innovating and nurturing\nindividuals who will contribute to Singapore’s\nsuccess in the future.\nEnjoy the journey! The Singapore Institute of Technology (SIT) was\nestablished as Singapore’s first university of\napplied learning that aims to educate and train\ntalent that are ready to contribute to industry\nfrom the get-go. Over the past decade, we\nhave done this by fostering a strong nexus with\nindustry and developing an integrated applied\nlearning and research approach.\nThis book chronicles SIT’s rapid growth from our\nearly days. It features the hard work, dedication\nand commitment of our SIT family and partners in\nstriving to maximise the potential of our learners.\nThis rapid growth has paved the way to our new\nhome in Punggol, where the stage is set for\nSIT to grow to become a premier university of\napplied learning.\nOur Punggol Campus presents us with many\nopportunities. It represents the coming together\nof our five polytechnic and Dover campuses. This\ncoming together of all our SITizens, academic\nclusters, applied research and innovation\ncentres as well as our corporate offices allows\nus to not only deepen multidisciplinary and\ninterdisciplinary teaching and learning, but also\nhelps us to better provide a holistic education\nfor our SITizens, where values, character and\ncritical thinking are as important as knowledge\nand skills. Being together gives us the space to\nlearn from, work and grow with one another. This\nhelps us all to become more nimble, responsive\nand future-ready.\nBeing situated in the Punggol Digital District\n(PDD), we are well integrated with industry by\ndesign and purpose-built for applied learning\nand research. The co-location with industry allows\nus to bring education and research together in\nmore intimate and seamless ways. By partnering\nindustry and working with their real-world\nsystems and tackling the problems that matter\nto them, we infuse our curriculum with authentic\nand active learning experiences.By collaborating with industry on applied\nresearch projects to build effective solutions, we\nalso inform our education with the learnings and\noutputs from our research. This loop strengthens\nour ability to deliver an industry-focused,\napplied learning education for our learners,\nand an impactful applied research approach\nfor our industry partners. It drives our mission\n- to maximise the potential of our learners and\ninnovate with industry.\nAs a resident of Punggol, opportunities abound\nfor us to contribute to the local community.\nWhether it is through the sharing of our\nfacilities, working with schools in the region to\npromote STEM education, mentoring of youth,\nbeing the knowledge hub of the community,\nor supporting local organisations in providing\nservices to the community, we will play our part\nin being an active and value-adding Punggol\nresident. Through this, we hope to instill in our\nstudents the SITizen-DNA of being grounded\nin the community and develop the University\nas a good corporate citizen. As individuals and\nas a university, we hope to not only contribute\nto industry, but drive positive change in\nthe community.\nIndividuals, industry and innovation are at the\nheart of SIT. Even as we look ahead towards the\nnext decade, we will continue to focus on our\ncore – to build a university that lives and breathes\nwith industry and community and contributes\nto Singapore and Singaporeans. We hope that\nas we evolve to meet the shifting demands of\nlearners and industry and become a premier\nuniversity of applied learning, you will continue\non this meaningful and impactful journey with us.\nLet us write the next chapter of SIT together!\nMr Bill Chang\nChairman, Board of Trustees,\nSingapore Institute of TechnologyProfessor Chua Kee Chaing\nPresident,\nSingapore Institute of TechnologyForewordJourney to Punggol 005\nForeword\nThe Road That\nTook Us Here:\nBuilding Singapore’s First\nUniversity Of Applied Learning\nIt started with just a P .O. box – an address for students to send\ntheir university applications to. So hurried was the decision to\nset up the Singapore Institute of Technology (SIT) that there\nwas not enough time to build the campus first.\nInstead, SIT shared the spaces of the five polytechnics, using\ntheir facilities and classrooms for its undergraduates. It began\nwith an inaugural batch of 500 students, growing to its annual\nintake of over 3,000 today. The difference now is that there\nis a beautiful campus that SIT can call its own.\n2024 is, in fact, a doubly special year for SIT. It celebrates its\n10th anniversary as an Autonomous University, as well as its\nmove into a new home in the Punggol Digital District (PDD)\n– a well-designed university occupying 9 ha of land.\nBut its history transcends the last 10 years. To fully appreciate\nthe University’s transformation, take a step back further in\nhistory to 2008. This is the amazing story of how Singapore’s\ndetermination to offer students more pathways to success\nand open up more university places led to the formation of\na unique institution – one that integrates applied learning\nand research, and innovates alongside the industry.\nHere is a look at the memorable moments\nthat have led SIT to where it is today.Journey to Punggol 007\nPrologue\n2009\nSIT Is Formed\nThe Ministry of Education announced that the Poly-FSI scheme\nwould be expanded to take in 2,000 full-time students and 1,500\npart-time students by 2015. To do so, a new institute of higher\nlearning would be set up to take over the planning, managing\nand implementation of these joint degree programmes. This new\ninstitute was SIT.\nTo meet the target of serving a total of 3,500 students by 2015,\nSIT needed to be up and running fast. It could not be built from\nscratch. Instead, it would operate from the campuses of the five\nlocal polytechnics first.\nSIT got to work quickly, and began wooing reputable overseas\nuniversities from Germany, the United Kingdom and the United\nStates to come on board as partners.\n“With these new additions, our polytechnics can retain their\nimportant mission of producing diploma graduates that are highly\nsought after by industry,” noted Dr Ng Eng Hen, then-Minister\nfor Education. “Our polytechnics should not drift and become\nweak universities.”\nPolytechnic students across Singapore cheered the setup of\nSIT. They could now obtain a degree from a reputable overseas\nuniversity, from an institute supported by the government, without\nhaving to pay top dollar to go abroad for studies.\nHaving the right leader to helm this fledgling institute was crucial.\nIn November 2009, SIT selected its first President: Professor Tan\nChin Tiong, who had served as the founding Provost and Deputy\nPresident of Singapore Management University (SMU) from 1999\nto 2009.\nIts 14-member board was also established, comprising key\nindividuals from medicine, telecommunications, law and the\ngovernment. Heading the board was Dr Ng Yat Chung, former\nChief of Defence Force.2008\nA Plan To Create\nMore University Places\nThe government had a goal: Raise the university cohort participation\nrate (CPR), which refers to the percentage of a cohort who are given\nplaces in government-funded degree programmes. The figure had\nbeen steadily rising through the years. It stood at 21 per cent in\n2003, and by 2008, had risen to 25 per cent. But the target, which\nPrime Minister Lee Hsien Loong announced at his National Day\nRally a year earlier, was to hit 30 per cent by 2015.\nSingapore’s economy was growing increasingly sophisticated, and\nan expanded university sector would give young students greater\nchoice and room to excel. It would also offer high quality polytechnic\ngraduates more opportunities to access subsidised university\neducation. But the expansion had to be calibrated carefully. Even\nas the CPR is raised, universities had to maintain high standards,\nand ensure the quality and employability of their students.\nA team, chaired by Mr Lui Tuck Yew, then-Senior Minister of State\nfor Education, was assembled to study how this could be done. It\nwas called the Committee on the Expansion of the University Sector.\nAt that time, most students entered university via the A-level\nroute, with a fraction coming from the polytechnics. Diploma\nholders could also enrol in degree programmes offered under the\nPolytechnic-Foreign Specialised Institute (Poly-FSI) scheme that\nwas set up in 2005.\nUnder the scheme, the five polytechnics in Singapore would partner\nreputable overseas universities to offer government-funded degree\nprogrammes to diploma holders, ranging from optometry to naval\narchitecture. It catered to about 300 students per year.\nThe Committee recommended that the Poly-FSI scheme be\nexpanded, as a way to raise the CPR. Polytechnics would increase\nthe number of partnerships with foreign universities, and offer\nmore programmes to students here.\nJourney to Punggol 009\nPrologue\n2011\nPlaces For A-Level\nHolders, Too\nSoon, word about SIT’s intense admissions process – rigorous\ninterview sessions, portfolio review and assessment of candidates’\naptitude and prior work experience – got around. It piqued the\ninterest of A-level graduates too.\nRequests began streaming in. Among them was Jonathan Lee, an\naspiring chef eyeing a place in the CIA-run degree programme at\nSIT. When told that SIT programmes were meant for polytechnic\ngraduates only, the disappointed student, who worked as a chef\nat Middle-Eastern restaurant Artichoke in the evenings, accepted\nan offer to study business at NTU.\nBut the following year, in 2011, in response to growing demand, SIT\nexpanded its admissions criteria to include A-level holders. Lee was\nfinally offered the much-coveted spot in the culinary programme,\nand promptly made plans to switch universities.\nThe University was growing fast and aiming high. Founding President\nProfessor Tan Chin Tiong said SIT’s goal was to evolve into a full-\nfledged university offering its own programmes. “It will take a while\n(so) for a start, we will leverage on the foreign universities first...\nWhen we have the capacity, our end point is that we want to offer\ndual degrees together with the foreign universities,” he added.\nMeanwhile, more spaces in universities were\nopening. Singapore was on track to hit its\ntarget of a 30 per cent CPR by 2015.\nEven then, the government acknowledged that the country could\ndo with more pathways and places to higher education, and the\nCPR could be raised even more.2010\nEnrolment Begins In SIT\nThe excitement and demand for university places from polytechnic\ngraduates was palpable, and SIT needed to move fast. By March\n2010, it was ready to start admitting students – a year ahead\nof schedule.\nIt would offer eight degree programmes from five overseas\nuniversities. They were the Culinary Institute of America (CIA);\nWashington’s DigiPen Institute of Technology; University of Nevada,\nLas Vegas (UNLV); the Technical University of Munich in Germany;\nand the Newcastle University in the United Kingdom.\nThe competition for a place in SIT was\nintense. There were almost 1,500 polytechnic\napplicants vying for 500 spots. The courses\nwere a big hit as they offered quality\neducation at affordable prices.\nTemasek Polytechnic alumnus Kelvin Ong, who had secured a\nspot in UNLV, told the media then: “I’ve always wanted to study\nin Switzerland or UNLV because they are very well-known in the\nhospitality circle. But the courses cost a lot.”\nDespite a decent grade point average of 3.35 out of 4, he could\nnot secure a spot in the business schools in the National University\nof Singapore (NUS), Nanyang Technological University (NTU) and\nSMU. When SIT offered him an opportunity, he seized it.\nJourney to Punggol 011\nPrologue\n2014\nSIT Becomes An\nAutonomous University\nFive years after SIT was established, it became Singapore’s fifth\nAutonomous University in March 2014 – a significant milestone in\nthe higher education landscape.\nWhat makes it even more interesting is how it is different from the\nother four universities. SIT is the first university which focuses on\noffering applied degree pathways, producing degree holders with\nspecialised knowledge and experience of industry needs.\nSIT began with three degree programmes in\nits own name, enrolling about 300 students ––\nbringing its total annual intake to 1,700. As\nthe University continued to grow, it needed\na space of its own.\nIn 2014, SIT would move its headquarters to the former Institute of\nTechnical Education’s (ITE) campus at Dover Drive. The new degree\nprogrammes would also be run out of the Dover site.\nBut at the rate that the University was expanding, the Dover campus\nwas only an interim solution. SIT would eventually need a larger\ncampus that would accommodate its growing degree programmes\nand cohort of students.2012\nA New, Best-In-Class SIT\nThe task to further expand and enhance Singapore’s university\nlandscape went to a 15-member committee chaired by Deputy\nPrime Minister Lawrence Wong, then-Minister of State for Education.\nThe Committee on University Education Pathways Beyond 2015\nreleased a report in August that year, recommending that the\nCPR be raised even further to 40 per cent by adding another\n3,000 university places in all. This would bring the total number\nof publicly-funded university places to 16,000 per year. However\nthe university landscape had to be diversified, and students should\nhave differentiated options. To meet this objective, the committee\nrecommended that SIT be developed as an Autonomous University\nfocused on applied learning, with close links to the industry.\n“The new SIT will be a ‘best-in-class’ institution that is different\nin character but equal in status to the existing AUs,” the report\nsaid. “It will augment the options available in our higher education\nlandscape by offering a distinct degree education that caters to a\nwider spectrum of preferences and abilities, and produces a different\ntype of graduate to meet the diverse needs of our economy.”\nThis model was vastly different compared with Singapore’s existing\nuniversities. In a press conference held by SIT after the report’s\nrelease, incoming President, Professor Tan Thiam Soon, said that the\nUniversity would work towards becoming a full-fledged Autonomous\nUniversity by 2014.\nThe President-Designate was slated to take over the reins from\nPresident Professor Tan Chin Tiong, who was due to return to SMU.\nProfessor Tan Thiam Soon was a veteran from NUS, where he had\nspent 26 years and served as its vice-provost of education in the\nlast seven years. He would go on to lead SIT for the next nine years.\nSIT, he said, was not just focused on putting out new degree\nprogrammes. Instead, it would look closely at the economy to\npinpoint sectors that would require highly trained professionals in\nthe coming years to inform its offerings.\nThe plan was to build deep ties with industry leaders and nurture\nthem as partners. Journey to Punggol 013\nPrologue\nIn 2014, SIT became Singapore’s fifth\nAutonomous University. As the University\ncelebrates a decade of growth, we look\nback at the milestones of the last 10 years.\n2014:\nBlazing A New Trail With SITizens\n4,000  students\n31 degree programmes\nFive years after SIT was established, it became Singapore’s\nfifth and newest Autonomous University. This marked a\nnew dawn in the tertiary education landscape, with SIT\nundergraduates, or SITizens, charting the way forward for a\nnew type of degree holder – individuals with relevant industry\nskills rather than just theoretical knowledge.\nAt that time, SIT had about 4,000 students across 27 degree\nprogrammes offered with Overseas University partners such\nas DigiPen Institute of Technology, Newcastle University and\nthe Technical University of Munich.\nAs a full-fledged Autonomous University, it\nwould be able to run its own programmes.\nThis would bring its total number of degree\nprogrammes offered in the new academic\nyear to 31. Journey to Punggol 017\n2014\n02 01SIT was markedly different from other Autonomous Universities\nwhich had a strong research focus. At SIT, the emphasis was on\napplied learning and a practice-oriented education.\nAcademic knowledge and skills had to be combined with real-world\napplication, and learning paired with industry and community needs.\nTo succeed, SIT needed to build close ties with industry partners\nand identify growth areas of the economy.\nThis was a fairly ambitious task that no university here had attempted\non a large scale. But SIT accepted the challenge. After all, the\nUniversity had accumulated five years of experience working with\nOverseas University partners to design programmes aimed at\nplugging the gaps in different industries.\nPresenting the SIT Bill for it to become an Autonomous University\nin Parliament, Deputy Prime Minister Heng Swee Keat, who was\nthen the Minister for Education, told the House: “By fostering a\nstrong nexus with industry, it will enable our graduates to seize new\nand diverse job opportunities…By integrating a strong theoretical\nfoundation with real-life applications, and by combining hard skills\nand a range of soft skills such as communications, problem solving\nand teamwork, graduates from the applied degree pathway can\ndistinguish themselves.”\nFor SIT, the passing of the Bill was a pivotal landmark. Then-SIT\nPresident Professor Tan Thiam Soon said: “This is an epochal\nmoment for SIT and Singapore’s higher education landscape. The\nestablishment of SIT as Singapore’s fifth Autonomous University will\nenable us to better serve our students and ultimately contribute\nmore to our economy and nation.”\nA new chapter had just begun.\nSIT was ready to make history.\n01 SIT moves into 10 Dover Drive in 2014, its campus also serving\nas its headquarters.\n02 Classes for SIT-conferred degree programmes being conducted\nat the SIT@Dover campus.Journey to Punggol 019\n20142014\nThe applied degree pathway can better meet\nthe broad range of learning preferences,\nstrengths and interests that our young\nSingaporeans possess. This enriched university\nlandscape will meet the individual learning\nneeds of our youths and, in so doing, help them\nfulfil their potential to the fullest.\nMr Heng Swee Keat\nDeputy Prime Minister of Singapore and\nMinister for Education (2011 – 2015)The Bill had been presented, and the debates in\nParliament done. Then it was time to wait – for March\n28, 2014.\nThat Friday, all across SIT’s distributed campuses, students went on\nabout their day and activities carried on as they should. Everything\nlooked the same, yet something had changed. The SIT Act had\ncome into effect.\nSIT was now officially an Autonomous University – the fifth one in\nSingapore. For the last five years, it played the role of a bridge\nto facilitate and connect students here to prestigious degree\nprogrammes offered by Overseas University partners. Now, it\nhad an added responsibility: to offer, in its own name, top-notch,\npractice-oriented degree programmes that combined a strong\ntheoretical foundation with real-world applications. At the second\nreading of the SIT Bill in Parliament, then-Minister for Education\nHeng Swee Keat said SIT will integrate strong theoretical foundation\nwith real-life applications.\nIt would start small, offering degrees in Sustainable Infrastructure\nEngineering, Information and Communications Technology and\nAccountancy. But there was no doubt that bigger plans were in\nthe works.28 March\nHello To Singapore’s Fifth\nAutonomous University\nSIT Act  passed\n3 SIT-conferred\ndegree programmesJourney to Punggol 021\n2014\nDressed in graduation gowns and sporting\nmortarboards in SIT’s iconic shade of bright cherry\nred, 120 graduands gathered at the Suntec Singapore\nConvention and Exhibition Centre.\nThey were the graduating cohort from the Technical University of\nMunich, DigiPen Institute of Technology (DigiPen) and the University\nof Nevada, Las Vegas (UNLV) – three of SIT’s Overseas University\npartners. The graduation ceremony was extra special – it was the\nfirst since SIT became an Autonomous University. Then-President\nProfessor Tan Thiam Soon took the opportunity to update the\ngraduating cohort on the programmes SIT will begin to offer\nin the new academic year, as he sketched out SIT’s plans as an\nAutonomous University. Deputy Prime Minister Heng Swee Keat,\nthen-Minister for Education who graced the occasion, urged SIT\nto focus on three key elements: real-world applications, innovation\nand life skills. 16 May\nA Graduation, And\nA Fresh Chapter\n01\n01\n01\n02\n01 A sea of striking red on Graduation Day as students celebrate\na new milestone in their lives.\n02 Deputy Prime Minister Heng Swee Keat, then-Minister for\nEducation, congratulates the parents of an SIT graduand. Journey to Punggol 023\n20142014\n02\n03As a university of applied learning, industry\npartnerships are crucial for SIT.\nTo give students in its newly launched Bachelor of Accountancy\nwith Honours degree programme a leg up, SIT signed Memoranda\nof Understanding with 11 accounting firms, including the Big\nFour – Deloitte and Touche, Ernst and Young, KPMG Services and\nPricewaterhouseCoopers.\nThese agreements signalled the industry’s support for SIT’s\nAccountancy programme. Students would have opportunities\nto be attached to these firms for their Integrated Work Study\nProgramme (IWSP), SIT’s flagship work experience scheme that\ngives students eight to 12 months of relevant work experience\nthrough a company attachment. With deeper engagements with\nthe industry, SIT could also tailor the IWSP to ensure it fits the\nmanpower needs of individual companies.19 August\nBacked By Industry Leaders\n01 A day of meaningful exchanges as industry leaders gather to\nsupport SIT.\n02 Members of 11 accountancy firms bear witness as SIT marks a\nfresh collaboration with the accountancy industry.\n03 Accountancy leaders put pen to paper as they commit to\nsupporting SIT students with work attachment opportunities.\n01Journey to Punggol 025\n20142014\nFive months after SIT was granted its status as an\nAutonomous University, it welcomed its first intake\nof undergraduates into its own degree programmes.\nBut first, there was Day Zero – SIT’s flagship orientation programme\nfor all freshmen. Over four days from August 29, the students played\ngames, participated in art workshops and attended briefings on\nthe degree programmes they would be embarking on.\nIn his closing address, Professor Loh Han Tong, who was then\nthe Vice-Provost, issued a challenge to the students: blaze a new\ntrail and show the world what SITizens are capable of. “You are\nthe pioneer batch at SIT; you need to create a path which hadn’t\nexisted before,” he said.29 August\nDay Zero Is When\nChange Begins\n01\n02\n02 020302\n01 Professor Ting Seng Kiong, then-Deputy President (Academic)\nand Provost, welcomes the pioneer batch of students of its\ninaugural degree programmes.\n02 Games, art workshops and talks -- Day Zero was a day of\ncommunity bonding.\n03 Professor Tan Thiam Soon, then-SIT President, addresses\nstudents at Day Zero.Journey to Punggol 027\n2014\nThe new academic year also marked the start of the\nfirst three degree programmes awarded by SIT. Prior\nto this, SIT worked with overseas universities to offer\ntheir degree programmes in Singapore.\nThe three new programmes in Sustainable Infrastructure Engineering\n(Land), Information and Communications Technology (Software\nEngineering) and Accountancy aimed to plug gaps in the industry.\nThe Sustainable Infrastructure Engineering programme, for instance,\nis a highly-specialised course focusing on railway engineering and\ndeveloped in collaboration with partners like transport regulator\nLand Transport Authority and rail operators SBS Transit and SMRT.\nSIT would continue to expand its degree programmes over the\nnext few years while keeping an eye on its mission: to produce\npractice-oriented, industry-ready students. September\nDegrees At SIT, By SIT\n01\n01\n01 Then-SIT President Professor Tan Thiam Soon (second from\nright) is joined by (from left) President of Council for Estate\nAgencies Mr Quek See Tiat, then-Deputy President (Academic)\nand Provost Professor Ting Seng Kiong, and Mr Andrew Khaw,\nthen-Senior Director of Productivity Growth Through ICT at\nInfocomm Media Development Authority, as he announces the\nestablishment of new degree programmes conferred by SIT.Journey to Punggol 029\n20142014\nWe want to provide an industry-focused and\ncommunity-involved university experience to our\nstudents. As a university of applied learning, SIT will\nbuild on our students’ unique talents and capabilities.\nDr Ng Yat Chung\nChairman of SIT Board of Trustees (2009 – 2022)SIT was able to get up and running so quickly because\nof one key decision: Decentralisation.\nIn the early days, it operated from satellite campuses across the\nfive polytechnics in Singapore. At the start, SIT ran its lessons\nfrom the polytechnics, using facilities such as lecture theatres\nand laboratories.\nBut as the number of offerings and students grew, SIT needed its\nown building to house its programmes. And so in each polytechnic\nsprang a brand-new SIT building, complete with specialised\nfacilities targeted at specific programmes. At the satellite campus\nin Temasek Polytechnic, for instance, students in the Food Business\nManagement programme have culinary demonstrations and wine\nand beverage training in a 30,000 sq ft facility that includes three\nprofessional teaching kitchens.\nThe satellite campuses across the five polytechnics were ready in\nend-2014. They welcomed their first students the following year\nin 2015. November\nSatellite Campuses\nAt Polytechnics\nReady For Class\n01 SIT@SP Building at Singapore Polytechnic\n02 SIT@NP Building at Ngee Ann Polytechnic\n03 SIT@NYP Building at Nanyang Polytechnic\n04 SIT@TP Building at Temasek Polytechnic\n05 SIT@RP Building at Republic Polytechnic\n01\n02\n03\n05\n04Journey to Punggol 031\n2014\n2015:\nThe University Of\nTheory And Practice\nDuring the 2015 National Day Rally speech, Prime Minister\nLee Hsien Loong quoted a Chinese proverb: “十年树木，百\n年树人”, which means it takes 10 years to grow a tree, and\n100 years to nurture a person.\nHe was underscoring the need for a long-term view when it\ncame to education. Investments made into learners would\nonly bear fruit years down the road – but it was important\nto make them anyway.\nSIT was set up for that very purpose. In the same speech, PM\nLee recounted his inaugural visit to SIT seven months earlier.\n“I met (SIT’s) students and staff, ” PM Lee\nsaid. “They were keen about their future,\npassionate about what they were doing, and\nthe students relished the opportunities for\ninternships to apply what they have learnt\nand to show off their skills. ” Journey to Punggol 033\n2015\nThe positive sentiments they expressed were a good sign that\nSIT was getting off to a promising start. Although it had been an\nAutonomous University for less than a year at that point, its unique\npedagogy was already making an impact – in particular when it\ncame to the “internships” mentioned by PM Lee in his speech.\nA pioneer batch of over 80 students had secured industry\nplacements as part of SIT’s signature IWSP , launched the year\nbefore. Over the course of eight to 12 months, these students\nwould immerse themselves in the working world, learning on the\njob and putting theory into practice.\nSuch working stints went beyond traditional industrial attachments\nin both duration and scope. Besides applying what they learnt in\nthe classroom, IWSP students were also actively encouraged to\nthink outside the box and spark innovation in the workplace.\nPreparing students for industry was a hallmark of the newly\nAutonomous University – and one that deserved national\nrecognition, especially in light of Singapore’s Golden Jubilee.\nAs PM Lee went on to note, education would\nplay a critical role in developing citizens’\n–– and SITizens’ –– self-reliance and ability\nto stay ahead of the pack. These would be\ncritical to the nation’s success in the next\n50 years.\n01 Prime Minister Lee Hsien Loong (second from right) on a visit\nto SIT@Dover campus, accompanied by (from right) then-SIT\nPresident Professor Tan Thiam Soon, then-Senior Minister of\nState for Law and Education Indranee Rajah, and then-Deputy\nPresident (Academic) and Provost Professor Ting Seng Kiong.\n02 The SIT@RP Building is one of SIT’s five satellite campuses.\n02 01Journey to Punggol 035\n2015\nDuring his first visit to SIT at the SIT@Dover campus,\nPrime Minister Lee Hsien Loong chatted with\nmembers of its faculty as well as students.\nAmong those he met was Chen Zhangkai, 27, who had graduated\nfrom SIT’s joint degree programme with the DigiPen Institute of\nTechnology in 2014.\nDespite being a late bloomer, Zhangkai managed to land his dream\njob as an animator. His final-year project and portfolio at DigiPen\nhad impressed the director of an animation company, who offered\nhim an internship and, subsequently, a job.\n“(SIT) is a good example of how we are expanding education paths\nfor Singaporeans,” said PM Lee in a Facebook post on his visit,\nnoting that the University would provide more opportunities for\npolytechnic graduates to upgrade themselves. 26 January\nA Visit From\nThe Prime Minister\n01\n01\n037\n02\n02\n01 Prime Minister Lee Hsien Loong being briefed on developments\nin the University, including enrolment numbers and faculty\nhires, during his first visit to SIT@Dover.\n02 Staff and student leaders of SIT give a warm welcome to Prime\nMinister Lee Hsien Loong and then-Senior Minister of State for\nLaw and Education Indranee Rajah at the SIT@Dover campus.Journey to Punggol 037\n2015\nI had lively meetings with both faculty members\nand students from SIT yesterday. The students\nasked me if having a degree was necessary for\nsuccess. I replied that it is not the degree itself\nthat counts, but what you have learnt.\nMr Lee Hsien Loong\nPrime Minister of Singapore (2004 – Present)27 January\nSIT@RP Building\nOpens Its Doors\nThe first spade hit the ground two years earlier. By\nJanuary 2015, a shining, modern building had sprung\nup on the grounds of Republic Polytechnic (RP), with\nthe SIT logo proudly emblazoned on its facade.\nNamed SIT@RP Building, it was the fifth and final satellite campus\nin SIT’s network of polytechnic campuses. At nine storeys tall, the\nbuilding could house up to 660 students – a third of SIT’s then-\nstudent population of 2,000.\nThe students benefited from the extra space. SIT@RP Building\nbecame home to undergraduate students from the Bachelor of\nScience with Honours in Computing Science programme, a joint\ndegree offered by SIT and the University of Glasgow in Scotland.\nThe space was also home to SIT’s Hospitality Business programme\nwhen it was launched in September that year.\n01 The SIT@RP Building housed the SIT’s Computing Science\nand Hospitality Business degree programmes, both offered in\ncollaboration with Overseas University partners.\n01Journey to Punggol 039\n2015\n01\n01For most SIT students, June marked the start of\ntheir third school trimester. But for students embarking\non their IWSP , it was the halfway mark of their\nworking stint.\nA core component of SIT’s applied learning pedagogy, the IWSP\nallowed students to augment their theoretical knowledge with\npractical industry experience. The pioneer batch of IWSP students\nincluded 63 from the Accountancy programme, who kicked off\ntheir stint in January after going through a competitive recruitment\nprocess held by industry partners.\nThat same year, the University also signed Memoranda of\nUnderstanding with organisations in other industries such as\nmanufacturing. The move opened up more opportunities for SIT\nstudents to gain real-world working experience.\nJune\nIWSP Students Make\nTheir Mark On Industry\n01\n01\n01 The IWSP Preview, a networking event SIT organises for\nundergraduates to meet companies offering work attachment\nopportunities, offers students a window to the working world.\nStudents take the chance to find out more about specific\nindustries and raise queries to potential employers. Journey to Punggol 041\n2015\n01\n02At the start of 2015, SIT announced five new applied\ndegree programmes in a range of up-and-coming\nfields, such as hospitality and information and\ncommunications technology. This brought its total\nnumber of degree programmes offered to 36.\nAs the new school trimester kicked off in September, these\nprogrammes welcomed their first intake. Among the slew of fresh\nofferings was the Bachelor of Hospitality Business (with Honours)\nprogramme, the first hospitality undergraduate degree to be\noffered by an Autonomous University in Singapore.\nOther new courses included the Bachelor of Engineering with\nHonours in Information and Communications Technology (Software\nEngineering), a highly specialised degree programme; and the\nBachelor of Engineering with Honours in Systems Engineering\n(ElectroMechanical Systems) – or SEEMS for short.\nThe latter, offered jointly with the DigiPen Institute of Technology,\nequipped students with multidisciplinary skills to tackle issues in\nhardware and software engineering. September\nFive New Degree\nProgrammes\n01 The Bachelor of Hospitality Business with Honours degree\nprogramme nurtures competent hospitality graduates equipped\nwith strong operational skills that are anchored in solid\ntheoretical knowledge.\n02 Students in the Information and Communications Technology\ncluster are given opportunities to work on applied research\nprojects in fields ranging from software engineering\nto cybersecurity.\nJourney to Punggol 043\n2015\n2016:\nFind Your Rainbow – Be Confident,\nAim High And Do Well\nThe future was on everyone’s mind when SIT held its first\nDialogue with SITizens on October 24, 2016.\nPrime Minister Lee Hsien Loong, the guest speaker,\nhighlighted two key questions in line with the forum’s theme:\nPreparing for the Future Economy. “First, the future — what\nwill it look like? And secondly, what can we do to prepare\nfor it?” he asked.\nWith the economy at a turning point, he told the 500-strong\naudience comprising SIT undergraduates and staff: “Your\nworking careers and pathways in life will be very different\nfrom your parents’ generation. You will experience more\nchanges. Your lives will be less predictable but also, I believe,\nmore varied and rewarding.”\nOne reason for his optimism was SIT, he\nnoted, which offers students the chance to\ndevelop through many different pathways,\nto explore a wide range of opportunities.\nWhile countries in the region experience high youth\nunemployment due to the proliferation of degree holders,\nSingapore does not intend to walk the same path – even\nthough it is increasing the number of university places.\nThe difference is in planning, ensuring that the skills learned\nin universities such as SIT lead “to qualifications which are\nrelevant to the industries”. “That means the opportunities are\nthere, to get a degree first or at least a good qualification and\nultimately, a job, a career, and a bright future,” said PM Lee.Journey to Punggol 045\n2016\n01SIT, which had been granted autonomous status for less than two\nyears at that point, had been busy preparing its students for jobs\nof the future.\nSeven new applied degree programmes were introduced that\nyear, including the Bachelor of Science with Honours in Nursing.\nOffered jointly by SIT and the University of Glasgow, the two-year\nprogramme’s curriculum was co-created and designed with input\nfrom health practitioners across the care continuum and the Ministry\nof Health.\nAll seven degree programmes also featured SIT’s signature IWSP ,\nwhich was launched in 2015 so its students could apply classroom\nknowledge in a real work environment.\nAs Professor Loh Han Tong, then-Provost of SIT, said: “As a university\nof applied learning, we have adopted the approach of integrating\nlearning, industry and community, and ensuring that our degree\nprogrammes are industry-focused and tailored to meet manpower\ndemands in Singapore.”\nFor PM Lee, his advice to SIT students was:\n“You will encounter challenges –– rainy days,\nsometimes even thunderstorms. But if you\npress on through the storms and rain, the\nskies will eventually clear, and then, if you\nhave worked hard to get yourself into the\nright place, you will find your rainbow. So\nbe confident, aim high, and do well. ”\n01 The one-day Career Nexus held every year is a key event\nfor SIT undergraduates, as they meet organisations from\ndiverse industries and learn more about the opportunities\nand expectations in the job market. Journey to Punggol 047\n2016\n18 January\nJoint Nursing Degree To\nOffer Best Of Both Worlds\n01 Professor Anton Muscatelli, Principal and Vice-Chancellor of the\nUniversity of Glasgow (left) and then-SIT President Professor Tan\nThiam Soon launch the new Bachelor of Science with Honours\nin Nursing, which aims to address nursing care needs of the\npopulation in Singapore.\n01To produce nursing staff attuned to Singapore’s needs\nwhile armed with a broad outlook, an agreement was\ninked on January 18 between SIT and the University\nof Glasgow.\nThe two universities would jointly offer the Bachelor of Science\nwith Honours in Nursing, a two-year post-registration degree\nprogramme. The curriculum was designed in tandem with industry\npartners like local healthcare institutions, as well as the Ministry of\nHealth, to ensure it is relevant to Singapore’s healthcare industry.\nSIT’s signature IWSP is a core component of the academic\ncurriculum. Undergraduates are also required to complete a four-\nweek Overseas Immersion Programme (OIP) at the University\nof Glasgow.\nTo this end, we will continue to offer specialised, applied degree\nprogrammes which are industry-relevant, as well as produce\ngraduates who are imbued with the SITizen-DNA and are\nwell-prepared to contribute to the ‘future-proofing’ of Singapore.\nAssociate Professor Ivan Lee\nVice President (Industry and Community), SIT (2015 – 2021) 2016 Journey to Punggol 049\nSIT kicked off its inaugural career fair by offering\nSITizens networking opportunities with over 100\nindustry partners. These included companies in the\nengineering and tech sectors, as well as ministries\nand statutory boards.\nCalled Career Nexus, a highlight of the fair was the ‘Recruiters\nin Residence’ programme, where SITizens took part in a series of\ninterviews conducted by senior HR executives from industry partners\nsuch as Accenture, Kellogg and Unilever. At the end of it, they were\ngiven valuable feedback on their interview skills.\nThe one-day fair also featured an interactive discussion panel\ncalled “Voices of Experience”, where SITizens heard first-hand\nfrom representatives from Google, PSA and more on the industry’s\nexpectations of fresh graduates.\nSIT’s proactive strategy of engaging industry partners for career\npreparation, job search and recruitment aims to better prepare SIT\ngraduates for the job market. 2 March\nLaunch Of Career Nexus To\nOpen Doors For SITizens\n01 SIT students, aptly attired in business wear, are ready to make\nan impression at the annual Career Nexus, a networking event\nthat brings undergraduates and industry partners together.\n01\n01\n100  industry partnersJourney to Punggol 051\n2016\nWe have positioned ourselves as the university that ‘future-\nproofs’ our students and graduates with real-world skills so that\nthey remain relevant throughout their careers. And we do this\nin innovative ways, from the design of curriculum to forging of\nindustry partnerships with SMEs, government agencies and MNCs,\nas well as working with our Overseas University partners to help\nour graduates stay ahead in the changing job market.\nProfessor Tan Thiam Soon\nInstitute Professor and President of SIT (2013 – 2021) To mark its second anniversary as an Autonomous\nUniversity, SIT welcomed then-Deputy Prime Minister\nTeo Chee Hean and his fellow Pasir Ris-Punggol GRC\nMPs to the SIT@Dover campus on March 28, 2016.\nDr Ng Yat Chung, then-Chairman of SIT’s Board of Trustees, and\nProfessor Tan Thiam Soon, then-President of SIT, took DPM Teo\nand his guests on a 60-minute campus tour.\nThroughout the visit, DPM Teo and his guests engaged with\nSITizens and university faculty to learn how applied learning was\nintegrated into the University’s curriculum and how it benefited the\nlocal community. 28 March\nCelebrating Two Years As\nAn Autonomous University\n01 Then-Deputy Prime Minister Teo Chee Hean tours the SIT@\nDover campus with fellow Members of Parliament of Pasir Ris-\nPunggol GRC, including Ms Sun Xueling, Minister of State for\nHome Affairs and Social and Family Development.\n02 Then-SIT President Professor Tan Thiam Soon (second from\nright) leads then-Deputy Prime Minister Teo Chee Hean (first\nfrom left) and NTUC Secretary-General Ng Chee Meng (first\nfrom right) around the SIT@Dover campus.\n01\n02\nJourney to Punggol 053\n2016\n01\n02\n03\n04\nBe confident, aim high, and do well. And a\ngeneration from now, you will have built Singapore\ninto something much better, something beyond\nwhat our imagination can dream of today.\nMr Lee Hsien Loong\nPrime Minister of Singapore (2004 – Present)\n01 Chase the rainbows and seize opportunities, Prime Minister\nLee Hsien Loong tells students.\n02 SIT students take the chance to raise concerns they have about\nschool and life.\n03 Selfie time!\n04 All smiles as then-SIT President Professor Tan Thiam Soon hosts\nPrime Minister Lee Hsien Loong at SIT@Dover.SIT’s first Dialogue with SITizens called for a special\nguest. And that was none other than Prime Minister\nLee Hsien Loong.\nMr Lee engaged with SITizens at the SIT@Dover campus on a broad\nrange of topics, from cybersecurity and politics to the future of\ntourism in Singapore.\nHe also addressed key concerns from some students, who were\nworried that employers may not recognise graduates of a relatively\nnew university like SIT.\nIn response, he said that it was important to prove to employers\nthat SIT graduates would not fall short in comparison with\nother graduates. 24 October\nA Special Guest\nFor A Special Event Journey to Punggol 055\n2016\n2017:\nPowering Up For The Future\nThe groundwork had been laid. Now, it was time for action.\nIn 2017, plans for the upcoming centralised SIT campus at\nPunggol – mentioned at the National Day Rally in the two\npreceding years – began to take shape in earnest.\nA key development was the signing of a Memorandum of\nUnderstanding (MoU) between SIT and SP Group, a leading\nprovider of electricity and gas in Singapore. The MoU marked the\nbeginning of a venture between SIT and SP to build and operate\na multi energy urban microgrid at the University’s upcoming\nPunggol Campus.\nThe microgrid would be the first of its kind for a university\nin Southeast Asia. Supplemented by multiple energy\nstreams, ranging from traditional sources such as gas to\nrenewable solar energy, it would pave the way for an\nemissions-free campus.\nIt would also serve as a platform for students\nand faculty to push the boundaries of applied\nresearch, and to do so in close collaboration\nwith industry stakeholders. In other words,\nthe campus itself would function as a\n“living lab”.Journey to Punggol 057\n2017\nThat such preparations were being made in advance clearly signalled\nthe University’s commitment to being a nexus between academia\nand industry.\n“The aim of the ‘living lab’ is to support Singapore to be a regional\nhub for digital advancements and talent development by integrating\neducation, innovation and research into real-life environments and\nscenarios,” said Professor Steven Wong, Director of SIT’s Centre\nfor Digital Enablement.\nSIT’s Punggol Campus, premised on the “living lab” concept, will\nbe an open innovation ecosystem.\nThis means that industry partners, students,\nfaculty, and even members of the Punggol\ncommunity will be able to share ideas and\ngenerate novel solutions together, using the\ncampus itself as a test-bed.\n01 At the graduation ceremony in 2017, then-Minister for Education\nOng Ye Kung congratulates SIT for producing its first batch of\ngraduates from its own degree programmes.\n02 Following a symposium to discuss workplace safety and major\nhazards, SIT signed a Memorandum of Understanding with the\nEmployment and Employability Institute and the Society of Loss\nPrevention to promote the training of skilled professionals with\nknowledge in process safety.\n02 01\nJourney to Punggol 059\n2017\nSIT is no stranger to graduation ceremonies. But\nFebruary 24, 2017 marked the first time its students\nwere graduating from an SIT-conferred degree\nprogramme since the University gained Autonomous\nUniversity status in 2014.\n“Being the first is always very exciting,” remarked Mr Ong Ye\nKung, then-Minister for Education who attended the ceremony\nas its guest of honour.\nHe went on to note the achievements of this pioneer cohort of\ngraduates, which comprised 82 students from the Bachelor of\nAccountancy with Honours programme. For instance, 84 per cent\nhad received job offers from accountancy firms they had worked\nwith as part of SIT’s IWSP .\nIt was a testament to the success of the University’s applied learning\nmodel. This “pedagogy of choice” was, in turn, transforming its\nstudents into candidates of choice in the working world. 24 February\nSIT Confers Its\nFirst Degrees\n061\n01\n02\n01 With the solemn national anthem, the graduation ceremony\nfor the Class of 2017 officially begins.\n02 Graduands ponder the words of then-Minister for Education\nOng Ye Kung, who encouraged them to dream big and spread\ntheir youthful dynamism at their future workplaces.Journey to Punggol 061\n2017\n01\n01\nWe are shifting to a new paradigm, driven\nby major demographic shifts, technological\ndisruptions and innovations. Our workforce\nmust be able to handle the new jobs that require\ndifferent and continually changing skillsets.\nSIT will continue to develop and nurture a new\ngeneration of young professionals with both the\nright mindset and the skillset to meet the needs\nof the future economy.\nProfessor Tan Thiam Soon\nInstitute Professor and President of SIT (2013 – 2021) It might have been a Saturday, but for some 305 SIT\nstudents and staff members, it was time for some\nserious effort.\nOver the course of one jam-packed morning, they competed in\nnine sports, including basketball, floorball and ultimate frisbee.\nThey made up the inaugural Inter-Cluster Games, which pitted\nSIT’s five academic clusters against each other in a battle for the\nProvost Cup.\nWhile the fighting spirit ran high, only one cluster could emerge\nchampion. That year, the Health and Social Sciences cluster came\nout top dog.\nThe games strengthened the SIT spirit. Prior to competition day,\nstudents from different academic clusters had come together to\ntrain, despite the fact that they would be playing on different teams.\n“One SIT, one family”, read a caption from the Engineering cluster’s\nInstagram page. 4 March\nLet The Games Begin\n01 The Inter-Cluster Games is a time for competition, but also for\ncommunity and bonding.Journey to Punggol 063\n2017\n064\n01\n01In the age of disruption to industry, upskilling is more\nimportant than ever for working professionals who\nwish to stay relevant.\nTo help more working adults access higher education, SIT launched\nits lifelong learning division, SITLEARN  Professional Development,\nin April 2017.\nSITLEARN offers courses and certificates for working adults looking\nto upgrade, as well as customised training courses for companies\nseeking to retrain their workforce. Courses are co-taught by SIT\nfaculty and industry experts.\nBy 2023, more than 16,000 participants from over 1,000 companies\nhave benefited from SITLEARN’s offerings. These include over 240\ncourses in five key domains, ranging from Business, Communication\nand Design to Infocomm Technology. 1 April\nBringing Lifelong Learning\nTo More Working Adults\n01 Across two professional symposiums organised by SITLEARN\nand the Health and Social Sciences Cluster, healthcare\nprofessionals gather to discuss issues on falls in older adults\nand how to care for the elderly with dementia.16,000  participants\n1,000  companies\n240  courses\nJourney to Punggol 065 20142017\nAs plans for our campus in Punggol begin to take shape, our focus\nremains on creating and curating a space that is empowering yet\nwelcoming, a ‘home’ for our students and hotbed of innovation for the\ncreative, digital enterprises that will be co-located within our grounds.\nDr Ng Yat Chung\nChairman of SIT Board of Trustees (2009 – 2022)As an Autonomous University, SIT had to undergo a\nrite of passage: a review conducted under the Quality\nAssurance Framework for Universities (QAFU) put\nout by the Ministry of Education (MOE).\nA regulatory framework for Autonomous Universities, QAFU\nfunctions as a “temperature check” of sorts. In other words, it\nhelps universities get a feel of whether they are developing as\nthey should in matters of governance, management, teaching\nand learning.\nIt is conducted by an External Review Panel (ERP) that includes\nlocal corporate leaders and renowned academics.\nWas SIT staying true to its mission of being a university of applied\nlearning? The answer was a categorical yes.\nIn its report to MOE, the ERP concluded that key SIT initiatives\n– such as its IWSP and Professional Officer Scheme – served to\ndifferentiate it as a university of applied learning.\nThe panel also noted that small and medium-sized enterprises\nthat had partnered with SIT on various projects described SIT’s\nfaculty and students as proactive and energised in creating new\nsolutions for industry. 9 October\nA Temperature Check Journey to Punggol 067\n2017\nSIT’s upcoming campus in Punggol will break ground\nin more than one way.\nApart from being co-located with industry partners in the PDD, it\nwill also be the first campus in Singapore – and the region – to be\nequipped with a Multi-Energy Microgrid (MEMG). When completed\nin 2024, it will be Singapore’s largest private microgrid.\nThe MEMG will draw from multiple energy sources, including solar\nphotovoltaic (PV) panels. Up to 10,000 sqm of PV panels will be\narranged on building rooftops. Once fully operational, it could\ngenerate enough energy to power 40 Housing Development\nBoard flats. This is the equivalent of removing 2,000 vehicles from\nthe roads.\nThe MEMG is a venture between SIT and the SP Group. A\nMemorandum of Understanding was signed by both parties during\nthe 2017 edition of Singapore International Energy Week, witnessed\nby then-Senior Minister of State for Trade and Industry, Ms Sim Ann. 23 October\nMicrogrid,\nMacro Aspirations\n01 SP Group commits to supporting SIT in building Singapore’s\nlargest private microgrid.\n01\nJourney to Punggol 069\n2017\n2018:\nPreparing For A\nNew Waterfront Home\n50-hectare  space\n12,000  students\nSingapore’s very own “waterfront town” of Punggol was\nset to make new waves. Formerly a rural, recreational site,\nit would soon become a technological and innovation hub,\nslated for completion by 2026.\nSpeaking at the launch of the new Punggol masterplan,\nthen-Deputy Prime Minister Teo Chee Hean said: “Over the\nyears, we have all seen how Punggol has grown from a fishing\nvillage to now a vibrant new town that is home to around\n200,000 residents… Now, we are ready to embark on a new\nphase – to develop the new PDD.”\nAt the heart of this 50-ha space would\nbe SIT’s new centralised campus, to be\ncompleted by 2024. The new campus will be\nable to accommodate 12,000 students, nearly\ndouble the combined capacity of its current\nsix distributed campuses.Journey to Punggol 071\n2018\nIt will also be “borderless”. In keeping with PDD’s standing as\nSingapore’s first enterprise town, the University will be part of a\nmixed-use development that integrates industry, academia and\neven residential buildings.\nThis means SIT’s research labs and learning facilities could be\nco-located within the business park buildings belonging to\nJTC Corporation, which is one of the master planners of PDD.\nMeanwhile, start-up labs could be set up on the University\ncampus itself.\nIn other words, Punggol is set to be transformed into Singapore’s\nvery own “mini-Silicon Valley” – a technological nexus where\ninnovation meets commercialisation.\nAs Singapore’s first university of applied\nlearning, SIT is set to be the beating heart\nof PDD –– contributing ideas, research\nand talent to take local and international\nbusinesses to the next level.\n01 01\n01 SIT’s Punggol Campus is uniquely endowed with an existing\nsecondary forest. The design is aimed at preserving the lush\ngreenery, and the campus buildings are integrated with biophilic\ntropical spaces.Journey to Punggol 073\n2018\nOn the infrastructure front, our\nplans for the Punggol Campus to be\nan innovative, stimulating learning\nenvironment are taking shape. It is\nheartening to note that the Punggol\ncommunity has begun to embrace\nour students and faculty through the\nmany community initiatives that have\nbeen undertaken involving residents\nin Pasir Ris-Punggol GRC.\nDr Ng Yat Chung\nChairman of SIT Board of Trustees\n(2009 – 2022)The new kid on the block has now\nbeen around the block a little,\ngrown up a little, and is about to\nsink its roots deeply in Punggol.\nProfessor Tan Thiam Soon\nInstitute Professor and President of SIT\n(2013 – 2021)\nA model of the upcoming PDD was unveiled to the\npublic for the first time on January 21, 2018.\nVisitors to the exhibition at Waterway Point were able to feast their\neyes on gleaming miniature buildings nestled among lush green\nspaces. Among them were buildings belonging to SIT, whose new\ncentralised campus would spring up on the site by 2024.\n“There will be many opportunities for students and teaching staff\nfrom SIT and industry practitioners in the Digital District to interact\nand exchange ideas, and use the Digital District and Punggol\nas a test-bed for new technologies,” said then-Deputy Prime\nMinister Teo Chee Hean, who was the guest of honour at the\nexhibition launch. 21 January\nA Bridge Between\nIndustry And Academia\n2018 Journey to Punggol 075\nOver the course of two days, 300 attendees hailing\nfrom educational institutions and industry converged\nat the Conrad Centennial Singapore for the nation’s\ninaugural Applied Learning Conference.\nOrganised by SIT, the conference brought the local and international\ncommunity together to share strategies and best practices on how\nto prepare students for a rapidly changing industrial landscape.\n“Industry does not work on a five-year cycle or 10-year cycle,” said\nDr Janil Puthucheary, then-Senior Minister of State for Education,\nwho was the guest of honour at the event.\nHe added that getting applied learning “right” means building\nan education system that is responsive to the real-time demands\nof industry.\nToday, the conference is a biennial event that continues to foster\nclose collaboration among experts in this pedagogical field. 25–26 January\nWorking Together To\nAdvance Applied Learning\n01\n01\n01 0101\n01 Over two days, international and local experts from academia\nand industry gather at the Applied Learning Conference to\nshare their thoughts on applied learning, and how pedagogy\nand practice have evolved. Such conferences aim to nurture\ncloser connections between academia and industry.Journey to Punggol 077\n2018\nIt was one of the smallest graduating classes SIT had\nseen in its history, but this batch of 29 engineers and\nInformation and Communication Technologies (ICT)\nmanagers packed a punch.\nHailing from port operator PSA Singapore, these working\nprofessionals had just completed a part-time programme in Systems\nEngineering, offered by SIT’s lifelong learning division, SITLEARN.\nOver a year, they juggled work and school in a bid to rewire their\nminds for the future. It was a timely upgrade. Work was underway\non a mega port in Tuas, which had been announced in 2012. Touted\nas the “port of the future”, Tuas Port will be the world’s largest\nautomated port by the time it fully opens in the 2040s.\nWith the help of the Systems Engineering course, students gained\na better understanding of how to design and maintain complex\nautomated systems – vital for PSA’s new generation of high-tech,\nintelligent container terminals. 23 August\nSmall Cohort, Big Ambitions\n01\n02\n079\n02\n02\n01 Mr Ong Kim Pong, then-Regional Chief Executive Officer of\nSoutheast Asia at PSA International, congratulates graduands\nhailing from PSA Singapore.\n02 On completion of the 12-month Systems Engineering\nprogramme, participants gain renewed understanding of\ncomplex automated systems and their inter-relationships.Journey to Punggol 079\n2018\nWhile it’s not uncommon to have industry or enterprise take\nup space in universities or sponsor research and collaborative\nendeavours in institutes of higher learning, PDD is unique and a\nfirst-of-its-kind in that it is conceived as a fully-integrated district\nthat merges learning spaces within enterprise and vice versa.\nMr Chan Ee Mun\nDirector at WOHA Architects (2002 – Present)\n1 November\nJoint Offerings\nGet A Refresh\nFood delivery via unmanned flying drones? Smart\nbuildings where temperature can be remotely\ncontrolled? In 2018, these sounded like science\nfiction. But they would soon become reality.\nThe rapid pace of technological innovation means that university\ndegrees, too, have to evolve. To that end, SIT signed a collaboration\nagreement with its long-time partner, the University of Glasgow,\nin November 2018.\nThe collaboration distilled and strengthened the joint offerings of\nboth universities. The existing five degree programmes offered by\nthe University of Glasgow and two joint degree programmes were\nmerged into five joint degree programmes, to be rolled out from\n2019. These included Singapore’s first aerospace undergraduate\nprogramme that specialises in unmanned systems, and the first\ncomputing programme offered by an Autonomous University that\nspecialises in the Internet of Things.\nIt was the latest example of how SIT actively teamed up with its\nOverseas University partners to prepare its students for the future.\nJourney to Punggol 081\n2018\n2019:\nBreaking New Ground\nAt Punggol\n2024  completion\nof Punggol Campus\n90% employment rate\nA large lego-like structure with a smart screen enclosed within\nit caught the attention of many. The blocks were in shades\nof red, black and white — representing the colours of SIT.\nOn the smart screen showed a digital mock-up of buildings\nmeant to represent the University’s new centralised campus in\nthe heart of PDD, which was unveiled at the groundbreaking\nceremony in Punggol on September 10, 2019.\nPrime Minister Lee Hsien Loong, who was the guest of honour\nat the ceremony, said that the campus will “strengthen the\nclose nexus that SIT already has with the industry”.\nA well-known unique model in the local\nuniversity landscape, SIT is set to break new\nground and raise the bar further when it\nmoves into its new home. Journey to Punggol 083\n2019\nWhen completed, the 9-ha campus, on two plots of land about\nthe size of 17 football fields, will be able to accommodate 12,000\nstudents. This is far more than the 8,000 students in the University’s\ndistributed campuses in the five polytechnics and Dover currently.\nThe new campus, slated for completion in 2024, is in the heart of the\nupcoming PDD, within JTC Corporation’s business park buildings.\nThis allows for seamless collaboration between SITizens, faculty\nand industry professionals, and will further encourage integrated\napplied research and innovation among SIT and its partners.\nNoting the healthy 90 per cent employment\nrate for SIT graduates, PM Lee added:\n“SIT’s model balances meeting students’\ndegree aspirations, while ensuring they are\nsought after by the industry. ”\n01 Artist’s impression of the sky terraces at SIT’s Punggol Campus.\n02 Buildings have been designed to be porous and interconnected.\n02 01Did you know that when the campus at Punggol\nis completed, it can accommodate 12,000\nstudents, which is nearly twice the combined\ncapacity of SIT’s current distributed campuses?Journey to Punggol 085\n2019\nThe SIT model built upon the strength of our\npolytechnic system and diploma education. Based on\ntheir diplomas, SIT students were granted advanced\nstanding by the university partners, and thus could\ncomplete their degrees faster, in two to three years.\nMr Lee Hsien Loong\nPrime Minister of Singapore (2004 – Present)Thank you for taking the lead to\nsupport SIT and our students at\nthis point of our journey.\nProfessor Tan Thiam Soon\nInstitute Professor and President of SIT\n(2013 – 2021)\nOn July 1, 2019, SIT unveiled the name of its\nauditorium at the interim SIT@Dover campus and\nits future auditorium at the new campus in Punggol.\nBoth were named after developer Ho Bee Land, which\nhad donated $3.25 million to the University.\nAmong those at the unveiling ceremony were Dr Chua Thian Poh,\nChairman and Chief Executive Officer of Ho Bee Land, and then-\nMinister for Education Ong Ye Kung, who was the guest of honour.\nExpressing his appreciation for the generous donation, Professor\nTan Thiam Soon, then-President of SIT, said: “SIT is honoured by\nthe firm support from Ho Bee Land – a Singaporean company with\na global outlook, and a name that is associated with both quality\nand sustainability – the very same outcomes that we are also keen\nto achieve.” 1 July\nSIT Names Auditorium\nAfter Ho Bee Land\nJourney to Punggol 087\n2019\nPrime Minister Lee Hsien Loong officiated at the\ngroundbreaking ceremony of SIT’s new campus on\nSeptember 10, 2019, where he congratulated the\nUniversity on yet another milestone.\nTen years after its founding and five years after its establishment as\nan Autonomous University, SIT was set to move to a new campus\nat PDD.\nDue to be ready in 2024, the campus will be home to Southeast\nAsia’s first Multi-Energy Microgrid, which will aid Singapore’s\ntransition to a low-carbon energy future.\nThis tie-up between SIT and SP Group underscores the University’s\nmission to keep abreast of industry developments through\napplied learning. 10 September\nSIT To Sink Roots\nIn Punggol\nThe completed SIT campus will span\n9 hectares, on two plots of land\nabout the size of 17 football fields.\n01\n02\n01 The courtyard at the Punggol Campus is designed as a\ncommunity park.\n02 When completed, the campus will be by the waterfront, facing\nConey Island.Journey to Punggol 089\n2019\nSIT held its inaugural Staff Appreciation Day on\nSeptember 17, 2019.\nAs a part of the “5+5” celebrations – five years from 2009 to 2014,\nand five years as an Autonomous University from 2014 to 2019 – 89\nstaff members received long-service awards.\n85 staff were awarded five-year service awards and four received\n10-year long-service awards – the first time such accolades were\ngiven out at SIT.\nTo mark the University’s 10th year of founding, staff also toured a\n“Moments Exhibition” that showcased its significant milestones. 17 September\nCelebrating\nLong-Service Staff\n89 long-service\n85 five-year service\n4 10-year service\nWe have the opportunity to build a campus\nthat is approachable and aspirational, fostering\na vibrant environment that is both inviting and\ninspiring. It is indeed a rare opportunity to re-\nimagine what a university campus of the future\nwill be and work towards realising it.\nProfessor Tan Thiam Soon\nInstitute Professor and President of SIT (2013 – 2021) Journey to Punggol 091\n2019\nConstruction for SIT’s new campus commenced in\nOctober 2019. Upon completion, it will be the first\nAutonomous University in north-eastern Singapore.\nThe new grounds are located in the heart of PDD, which is set to\nbecome a vibrant and inclusive tech district. Jointly designed by\nWOHA Architects and RSP Architects, the campus, which will be\ndivided into Campus Heart and Campus Court, will integrate green\ntechnologies with urban architecture.\nCampus Heart, also known as “Campus-in-a-Park”, will house\nthe academic blocks in a forested courtyard. Campus Court,\nwhich overlooks Coney Island and Ho Bee Auditorium, will house\ntwo Super Low Energy buildings that boast best-in-class energy\nefficiency and run on renewable energy.\nThe University will also open some of its facilities to the public to\nstrengthen ties with the community. These include the Campus\nBoulevard, a vibrant space with various retail and F&B offerings. October\nWork Begins At\nSIT’s New Campus\n01\n01\n01 The public will be able to access some of the facilities in the\nPunggol Campus.Journey to Punggol 093\n2019\nOn October 3, 2019, SIT announced a collaboration\nwith the National Environment Agency (NEA) to set\nup an Energy Efficiency Technology Centre (EETC).\nMr Ananda Ram Bhaskar, Deputy Chief Executive Officer\n(Environmental Protection) of NEA, and Associate Professor Ivan\nLee, SIT’s Vice President (Industry and Community), signed the\nMemorandum of Understanding (MoU).\nLaunched at the end of 2019, the centre has three key goals to\naddress shortcomings in the local energy efficiency ecosystem:\nIt will catalyse energy efficiency improvements for SMEs through\nconsultancy services; train a pipeline of engineering undergraduates\nin industrial energy efficiency; and upskill existing engineers with\nhands-on training courses. 3 October\nNEA And SIT Collaborate\nTo Launch EETC\n095\n02\n03\n01 Professor Lock Kai Sang, Head of Energy Efficiency Technology\nCentre, addresses the audience at the National Energy\nEfficiency Conference.\n02 The MoU formalises the partnership between the National\nEnvironment Agency and SIT.\n03 Professor Lock Kai Sang helms a panel discussion at the National\nEnergy Efficiency Conference.\n01Journey to Punggol 095\n2019\nThe aim of the ‘living lab’ is to support Singapore’s\nvision to be a regional hub for digital advancements\nand talent development by integrating education,\ninnovation and research into real-life environments\nand scenarios.\nProfessor Steven Wong\nDirector, Centre for Digital Enablement, SIT\nOn October 29, 2019, SIT was presented with\nthe Singapore Energy Award for Capabilities\nDevelopment by then-Minister for Trade and Industry\nChan Chun Sing.\nSince 2013, the University has been the only institute of higher\nlearning to offer a dedicated Electrical Power Engineering\nundergraduate degree. SIT was recognised for its pioneering role\nin leading manpower and talent development within the sector.\nBeyond an industry-relevant academic curriculum, SIT continually\nstrives to create innovative solutions for the energy sector.\nBesides a Multi-Energy Microgrid, the new campus will also feature\na District Cooling System. The system is a key enabler for improving\nsustainability standards. It will reduce carbon footprint at the estate\nlevel while meeting the campus’ air-conditioning needs. 29 October\nSIT Recognised At Singapore\nEnergy Award 2019\n2019 Journey to Punggol 097\n2020:\nGrowth Amid A Pandemic\nSIT marked a new era in its history with a major milestone.\nIn 2020, it became Singapore’s third-largest university by\nundergraduate enrolment with nearly 8,000 students.\nThe growth could be credited to SIT’s unique pedagogy\nof applied learning, drawing students to its specialised\nindustry-related degrees. Its IWSP , a compulsory company\nattachment that gives students a head start in the workplace, is\nanother highlight.\nBut there was no time to mark this milestone.\nA mysterious virus was sweeping across the\nworld. The COVID-19 pandemic not only\nclosed borders, but also shut down offices and\nschools across the globe as countries tried to\nstem its spread amongst the population.$16.1m  donations\nEnrolment of\n8,000 undergraduatesJourney to Punggol 099\n2020\nLike universities around the world, SIT had to navigate the shift to\nvirtual learning. It also quickly rallied around its students, setting up\nthe Student Relief Fund at SIT (COVID-19) for those hit by financial\nhardship due to the pandemic.\nAppeals for donations were sent out on March 30, and $458,400\nwas raised within three weeks in the form of gifts and pledges.\nThe fund provided grants of up to $2,000 to cover students’ daily\nliving and educational expenses, such as tuition fees and the cost\nof purchasing laptops.\nA grateful Professor Tan Thiam Soon, then-President of SIT, said: “It\nis heartening that this Fund made possible by SIT’s philanthropic\npartners will work in tandem with existing relief measures by the\ngovernment to stabilise our students’ finances during this crisis,\nand help to ensure that their education will not be derailed.”\nThis sense of solidarity and community would\nsee the SIT family through the turbulent year.\n01 The SIT community got together to set up temperature\nscreening stations and ensure the delivery of supplies such as\ntest kits and masks to its various campuses.\n01 01Journey to Punggol 101\n2020\nAs the coronavirus pandemic roiled the world,\nSIT quickly set up the Student Relief Fund at SIT\n(COVID-19) to ease the burden of students grappling\nwith financial emergencies.\nThe fund raised more than $2.2 million in just a year. Total donations\namounted to more than $2.8 million, benefitting 1,218 SITizens.\nEligible SITizens were awarded grants of up to $2,000 to help\ndefray living and educational expenses such as tuition and course\nmaterial fees. 30 March\nA Helping Hand For\nSITizens During COVID-19\nMore than $2.8m\nraised in totalSIT staff, students and partners displayed unity and resilience\nthrough this unprecedented time, often going above\nand beyond their regular work to ensure that business\nwent on as usual…In addition, with the support from our\nphilanthropic partners and donors, the Student Relief Fund\nat SIT (COVID-19) raised more than $800,000 in less than\ntwo months, in aid of students who were impacted by the\npandemic. In the face of these challenges, I am heartened to\nsee how our people here at SIT have risen up to the challenge.\nProfessor Tan Thiam Soon\nInstitute Professor and President of SIT (2013 – 2021) Journey to Punggol 103\n2020\n01\n01To boost its status as an applied research university,\nSIT set up a new Applied Research Office (ARO) on\nApril 1 to facilitate greater strategic partnerships.\nThe ARO oversees research compliance and governance; research\ngrant administration and performance; and research-related\ngovernance for postgraduate research.\nIt also provides financial support to faculty members through\ninternal grants such as the Seed Grant, Ignition Grant and Innovation\nCapability Grant. With these, researchers can jumpstart projects\nand test ideas.\nThese grants also help fund strategic programmes by researchers\nacross various industries, from Energy Resilience to Community\nHealth Transformation.\nIn the long run, these programmes will provide solutions that will\nhelp tackle imminent national challenges. 1 April\nNew Office To Bolster\nResearch Efforts\n01 Professor Lock Kai Sang, Head of the Energy Efficiency\nTechnology Centre (EETC), at a discussion with his teammates.\nThe EETC comes under the Applied Research Office, which\ngoverns applied research and innovation activities.\nJourney to Punggol 105\n2020\nDemand for our programmes continues to remain high, with an overall\napplication rate of 4.5 times. Today, our staff and faculty work hard to\nhelp nearly 8,000 enrolled students achieve their dreams as they look\nforward to joining more than 9,500 alumni who have received degrees\nfrom SIT or one of our Overseas University partners.\nDr Ng Yat Chung\nChairman of SIT Board of Trustees (2009 – 2022)SIT became Singapore’s third-largest Autonomous\nUniversity by full-time undergraduate intake, after\nNUS and NTU.\nAs Singapore’s only university of applied learning, it is constantly\nexpanding its degree offerings to meet evolving industry needs.\nSome 8,000 students are enrolled in its 38 undergraduate courses,\nwhich range from accountancy to speech and language therapy.\nThe robust enrolment signals growing confidence in SIT’s unique\npedagogy of applied learning. 7 September\nSIT Marks New Milestone\n01 Lessons at SIT are a mix of lectures and hands-on experiences,\nwhere students get to integrate knowledge and research with\npractical skills.\n01 01Journey to Punggol 107\n2020\n1 October\nSetting A CLASIC Example\nWorking together on community\nprojects will allow students\nacross disciplines to learn that\nformulating practical solutions for\nissues that impact society often\nrequires a holistic assessment of the\nenvironment and its stakeholders.\nThis is where they can further\ndevelop their creativity, as well as\nanalytical and critical thinking\nskills, which are crucial for the\nfuture economy.\nProfessor Yaacob Ibrahim\nDirector of CLASIC (2020 – 2023)To encourage its students and faculty to give back\nto society, SIT launched the Community Leadership\nand Social Innovation Centre on October 1, 2020.\nCalled CLASIC for short, it serves as a one-stop centre that curates\nand manages community and social innovation projects across the\nUniversity. This is in line with one of the SITizen-DNA – to produce\nstudents who are grounded in the community.\nCLASIC has embarked on more than 10 projects with community\npartners such as schools, hospitals and social service agencies. The\nUniversity also set up a CLASIC project grant scheme to spur further\nservice-learning and social innovation programmes. The pandemic might have upended everyday routines,\nbut life had to go on.\nAdapting to the new normal, SIT moved its orientation online. Its\nfirst e-orientation, held on August 24, saw a strong turnout.\nThrough a microsite designed by four SITizens majoring in Infocomm\nTechnology, the 2,733 participants engaged in various activities,\nsuch as 3D virtual tours of SIT’s satellite campuses.\nThe University also organised a virtual Day Zero – a compulsory\norientation day for all freshmen. Through 140 Zoom sessions\ninvolving over 180 faculty members, incoming students learned\nabout SIT’s applied learning pedagogy. An online club fair, which\nfeatured SIT’s over 90 student clubs and programmes, rounded\nout the induction programme. 24 August\nThe Show Must Go On\nOne-stop  centre\n10+  projects140  Zoom sessions\nJourney to Punggol 109\n2020\nCapping a year of several firsts, SIT launched a\nworkplace learning centre on November 13, 2020.\nNACE@SIT, short for National Centre of Excellence\nfor Workplace Learning at SIT, is the first such centre\nin an Autonomous University.\nA tie-up with SkillsFuture Singapore (SSG), it aims to help\norganisations build workplace competencies.\nA Memorandum of Understanding was also inked between Kwong\nWai Shiu Hospital, SIT and SSG to support the hospital in skills,\ntalent development, healthcare innovation and workplace learning.\nThrough NACE@SIT, the hospital would be able to tap SIT’s\nextensive network of industry partners and experience in applied\nlearning to expand its capabilities. 13 November\nSIT Launches NACE@SIT\nWith SkillsFuture Singapore\nWe recognise the importance of collaborating with\nthe industry – not just for the purposes of our\nstudents’ work attachments and applied research,\nbut also in the building of workplace competencies.\nProfessor Tan Thiam Soon\nInstitute Professor and President of SIT (2013 – 2021) Journey to Punggol 111\n2020\n2021:\nWork, Learn, Level Up\n2021 marked the second year of the COVID-19\npandemic – a global healthcare crisis which laid bare\nthe underlying vulnerabilities in sectors ranging from\nconstruction to transport. To the affected sectors, it\nwas clear that business-as-usual was no longer tenable.\nWith this recognition came a paradigm shift in attitudes\ntowards education.\nIn particular, businesses realised the importance of workplace\nlearning. Employees needed to be given opportunities\nto upskill or re-skill themselves if they were to effectively\nmeet challenges in a world that was becoming increasingly\ndisruptive by the minute.\nAs a champion of lifelong learning, SIT had\na significant role to play. That year, it piloted\nthe Competency-Based Workplace Learning\n(CBWL) pathway, a unique educational\nmodel aimed at making higher education\nmore accessible to workplace learners. Journey to Punggol 113\n2021\nThe CBWL pathway went beyond a part-time degree. Instead,\nit allowed learners to split their time between work and study. It\nalso featured a strong element of industry support, with partners\nin critical growth sectors like cybersecurity and transport chipping\nin to facilitate conducive workplace arrangements for learners.\nThese partners contributed to the design of CBWL programmes,\nensuring that the course material stayed relevant and up to date\nwith the latest industry developments.\nThe launch of the CBWL pathway forged yet another link in the\nchain between SIT and industry.\nBy adopting a coordinated, practical\napproach, SIT and its industry partners\nwere on track to fostering resilience in the\nworkforce and future-proofing sectors, as\nwell as recognising the individual educational\naspirations of workplace learners.Journey to Punggol 115\n2021\nIf we can work with companies to curate workplace learning to\nallow in-employment learners to upgrade and gain relevant higher\ncertifications that are useful to and hence recognised by the companies,\nwe create win-win solutions for both the learners and the companies.\nProfessor Chua Kee Chaing\nPresident of SIT (2022 – Present)New year, new beginnings. Across the island, schools\nwere putting their best foot forward in a bid to woo\na fresh batch of students.\nBut 2021 came with a dampener. Safe management measures were\nstill in force, restricting gathering sizes to eight per group. With\nthat, SIT went virtual instead.\nOver the course of two weekends, it hosted its first ever Virtual\nOpen House (VOH). Prospective students could attend talks from\nthe comfort of their homes and use a “live chat” function to interact\nwith seniors and faculty members.\nThey could also “visit” the grounds of SIT’s distributed campuses,\nincluding lab facilities, through a 360-degree virtual tour.\nThe numbers spoke to the success of the VOH. A microsite specially\ncurated for the event attracted over 81,000 unique visitors, with\nover 25,000 viewing online talks. In comparison, 2020’s open house\nattracted 5,000 people over one weekend. 16 January\nSIT Kicks Off Its First\nVirtual Open House\n81k  microsite visitors\n25k  online talk viewers2021 Journey to Punggol 117\nThe COVID-19 pandemic hit certain sectors hard.\nConstruction, for instance, slowed to a near halt,\nbattered by viral outbreaks among workers and\nsupply chain woes.\nIt exposed the need to strengthen the industry and improve its\nresilience. To that end, SIT established the Construction Technology\nInnovation Laboratory (CTIL) in 2021.\nIt did so with the support of Woh Hup (Private) Limited, a leading\nconstruction and civil engineering company in Singapore. Woh Hup\ncontributed $2 million in funding to CTIL, which aims to provide\na platform for Singapore-based construction companies and SIT\nresearchers to carry out applied research.\nThe goal is for research to translate into impact. The launch of CTIL\nkickstarted research projects in areas such as innovative construction\ntechnologies. In time, these projects could lead to cost savings of\n25 to 30 per cent by improving efficiency on-site. 21 January\nBuilding Foundations\nFor The Future\n$2m  funding\n25-30 % savings2021 Journey to Punggol 119\nHeld at The Theatre at Mediacorp, SIT’s graduation\nceremony in 2021 was significant in more ways\nthan one.\nAs the first Autonomous University in Singapore to conduct a\nphysical graduation ceremony post-COVID, all eyes were on SIT\nto set the precedent for graduating safely and in style. It did this\nby staggering the cohort over 11 sessions, with the ceremony\nspanning five days instead of the usual three.\nClose to 2,200 graduates from 47 undergraduate and postgraduate\nprogrammes received their degree scrolls. Among them were the\npioneer batch of 211 locally trained Allied Health professionals,\nmany of whom had been on the frontlines of the battle against\nCOVID-19 in 2020.\n“Usually, it takes several months for us to get our full certification,”\nshared 25-year-old Ang Xu Kai with The Straits Times at the\nceremony. “But because they needed us in the hospitals, only\na few weeks after I finished my last academic module, I started\nworking at NUH,” added Ang, who was valedictorian in his class\nof 52 diagnostic radiography graduates. 23 February\nIn-Person Graduation\nIs Back With A Bang\n01 Despite having to wear masks to their graduation ceremony,\ngraduands remain in high spirits as they celebrate this\nmomentous milestone.\n02 A graduation ceremony for the new normal, as students and\nstaff mask up to ensure the community stays safe even as\nthey celebrate.\n01\n02\n2,200  graduatesJourney to Punggol 121\n2021\nAt SIT, “learning on the job” means exactly that. In\n2021, it inked two Memoranda of Understanding\n(MoU) with industry partners, cementing its pilot\nCBWL pathway.\nTargeted at workplace learners, the pathway provides more\nopportunities for working adults to pursue a degree while working.\nIt also takes into account learners’ existing competencies.\nThe push for workers to upskill was a timely one. At the signing\nof the MoU, Minister for Education Chan Chun Sing emphasised\nthat the biggest challenge faced by economies was to produce\ngraduates with relevant skills, given rapidly evolving industries.\nFour industry partners from the cybersecurity and transport sectors\nsigned the MoU. Soon after, two pilot programmes were launched.\nThey were the Bachelor of Engineering with Honours in Information\nand Communications Technology (Information Security) and the\nMaster of Engineering Technology and Bachelor of Engineering\nwith Honours in Sustainable Infrastructure Engineering (Land).4 August\nWorkplace Learners\nGet A Boost\nEducation can no longer be\nfront-loaded, but needs to\nbe continual and lifelong.\nProfessor Tan Thiam Soon\nInstitute Professor and President of SIT\n(2013 – 2021)\nJourney to Punggol 123\n2021\nThe underbelly of urban Singapore is made up of\nthousands of kilometres of lines, pipes and cables:\nfrom train lines to sewer pipes to transmission cables\nfor power services.\nThese attest to the importance of tunnelling engineering. In\nanticipation of the growing importance of this field of study,\nSIT established the Centre for Infrastructure and Tunnelling\nEngineering (CITE).\nSet up in collaboration with the Land Transport Authority, CITE aims\nto help workers in the sector reskill by offering them certification\nopportunities. It also gives researchers and industry experts a\ncommon platform to collaborate on research, with the goal of\nproducing industry-specific solutions. 20 December\nGrowing Singapore’s\nUnderground\n01 The Centre for Infrastructure and Tunnel Engineering gets a\nthumbs up from Land Transport Authority’s Chief Executive\nNg Lang (second from left) and SIT President Professor Chua\nKee Chaing (second from right).\n01\nThere’s much to learn, and upskilling\nis like a constantly evolving muscle that\nwe need to keep training so that we\ncan meet fresh challenges head-on.\nMr Jonathan Goh\nSIT alumnus and Principal Engineer at ST Engineering2021 Journey to Punggol 125\n2022:\nSIT Welcomes Its Third President\nKicking off the new year with a new leader at\nthe helm, SIT welcomed its third President,\nProfessor Chua Kee Chaing, in January\n2022. He took over the reins from Professor\nT an Thiam Soon, who stepped down after\nnine years.\nThe University also saw the appointment of new Chairman,\nMr Bill Chang, to its Board of Trustees after over 12 years\nof leadership under founding Chairman, Dr Ng Yat Chung.\nProfessor Chua joined the University in 2019 as Deputy\nPresident (Academic) and Provost, and was instrumental in\ndeveloping key areas such as applied learning and applied\nresearch – both hallmarks of SIT. Journey to Punggol 127\n2022\nProfessor Tan, who joined SIT in early 2013, remains part of its\nleadership as Institute Professor, supporting the new President\nand mentoring the University’s younger leaders.\nAs SIT’s second President, Professor Tan helped push for the\nInstitute to become an Autonomous University in March 2014. Later,\nhe led efforts to secure approval and funding for a new centralised\ncampus in Punggol.\nHe also launched the IWSP , SIT’s flagship programme that has\nbecome the cornerstone of its applied learning pedagogy.\n“Increasingly, the future is not going to be defined by a paper\nqualification. It is going to be defined by real skill sets,” he had\nsaid in an interview.\nProfessor Chua has built on his predecessor’s efforts, rolling out new\ninitiatives to burnish SIT’s standing as Singapore’s first university\nof applied learning.\nFor instance, he oversaw the launch of Singapore’s first\nCompetency-based Stackable Micro-credential (CSM) pathway\nfor working adults, which offers targeted and bite-sized learning\nto arm them with specific skills that add up to a degree – in line\nwith their career aspirations and industry demand.\nSIT’s mission statement was tweaked in 2022 to reflect greater\nefforts towards applied learning: “To maximise the potential of\nour learners and to innovate with industry, through an integrated\napplied learning and research approach, so as to contribute to the\neconomy and society.”\n“I am deeply honoured to be given the\nopportunity to lead SIT into its next phase\nof growth, and I look forward to working\nwith all stakeholders of SIT to further\nstrengthen our mission as Singapore’s\npremier University of Applied Learning, ”\nsaid Professor Chua. Journey to Punggol 129\n2022\nTo keep up with evolving workplace trends and\nensure its graduates stay employable, SIT launched\nthe Industry Ready Skills Framework (IRSF) on\nJanuary 24.\nFive structured transferable skill areas were identified: Thinking\nAgility, People Agility, Digital Agility, Professional Agility and\nChange Agility. By incorporating these into its academic curricula,\nSIT would equip students with the necessary skill sets to grow,\npivot and remain adaptable throughout their careers.\nThe framework also provides SITizens with opportunities to hone\nadditional skills such as Creative Thinking, Digital Data Literacy\nand Professional Ethics. 24 January\nIndustry-ready Graduates\nFrom becoming an Autonomous University to getting\nthe green light for a new permanent campus, SIT\nhit many milestones under the watch of its second\nPresident, Professor Tan Thiam Soon.\nAfter nine years, it was time to pass the baton.\nOn January 1, 2022, Professor Chua Kee Chaing stepped into\nthe role.\nAs SIT’s third President, he would steer the University towards\nthe next phase of growth, deepening applied learning and\napplied research initiatives to produce work-ready graduates\nand postgraduates. 1 January\nPassing The Baton\nI have every confidence that SIT will\ncontinue to grow and thrive under\nthe leadership of Kee Chaing, who\npossesses the strategic vision and\nexpertise to solidify SIT’s reputation\nas Singapore’s premier University of\nApplied Learning.\nDr Ng Yat Chung\nChairman of SIT Board of Trustees\n(2009 – 2022)\n© SPH Media LimitedJourney to Punggol 131\n2022\nIn appreciation of his generous donations over the\nyears, SIT will name the student centre in its new\nPunggol Campus after property magnate Chua\nThian Poh.\nTo be called the Chua Thian Poh Discovery Hub, the student centre\nwill take up two floors in the new campus.\nAt the naming ceremony held on January 26, 2022, where Minister\nfor Education Chan Chun Sing was guest of honour, Mr Chua also\ndonated an endowed gift of $2.6 million to SIT in honour of his\nlate mother, Madam Seah Sar.\nThe donation would fund SIT’s student and academic activities,\nand a new bursary. Called the Chua Thian Poh Bursary, it would\naward $5,000 to eligible SITizens every year.\nMr Chua, the founder of real estate developer Ho Bee Land, is a\nlong-time benefactor of SIT. In 2019, he also donated $3.25 million\nto support the University’s student and academic activities.26 January\nProperty Developer\nMakes His Mark On SIT\n01\n01\n01 0203\n01 SIT Institute Professor Tan Thiam Soon, then-SIT Chairman Dr\nNg Yat Chung, Minister for Education Chan Chun Sing, Mr\nNicholas Chua, Chief Executive Officer of Ho Bee Land, Dr\nChua Thian Poh, Executive Chairman of Ho Bee Land, and SIT\nPresident Professor Chua Kee Chaing at the naming ceremony\nfor the Chua Thian Poh Discovery Hub.\n02 Mr Nicholas Chua, Chief Executive Officer, Ho Bee Land, and\nBoard Chairman, Chua Foundation, addresses the audience.\n03 SIT President Professor Chua Kee Chaing expresses his gratitude\nfor Dr Chua Thian Poh’s firm friendship and support for SIT.Journey to Punggol 133\n2022\nThis is one for the books – SIT received its biggest\ndonation to date, from Ngee Ann Kongsi Foundation.\nThe $25 million would be disbursed annually over\n10 years.\nIt would support the development of SIT’s library, which will be\nnamed Ngee Ann Kongsi Library.\nWhen completed, the library will span 8,637 sqm, the size of\napproximately one-and-a-half soccer fields. It will scale up resources\nin Information, Digital and Media Literacy (IDL) to equip SITizens\nwith information beyond the classroom.\nPart of the donation would also be used to set up the Ngee Ann\nKongsi Emergence Fund, which would enable needy students\nto access learning opportunities such as exchange programmes\nand internships. 4 February\nThe Gift Of Knowledge\n$25m  donation\n8,637m2 library\nJourney to Punggol 135\n2022\nI look forward to working closely with our SIT\nleadership and Board to make SIT Singapore’s\npremier University of Applied Learning, supporting\nindustry innovation and industry transformation.\nMr Bill Chang\nChairman of SIT Board of Trustees 2022 was looking to be a year of many changes.\nFollowing the appointment of its third President, SIT welcomed\nMr Bill Chang as the second Chairman of its Board of Trustees on\nMarch 16, 2022.\nMr Chang, Chief Executive Officer, Digital InfraCo, Singtel,\nsucceeded Dr Ng Yat Chung, who had held the position for more\nthan 12 years.\nMr Chang said: “I am honoured with this appointment as Chairman\nof SIT at an exciting time for the University. SIT’s mission to groom\nyoung talent to be work-ready professionals and lifelong learners\nwho contribute to, and impact both industry and our society,\nresonates strongly with me.” 16 March\nChanging Of The Guard\n01 Mr Bill Chang, Chief Executive Officer of Digital InfraCo\nat Singtel, took over from Dr Ng Yat Chung as the second\nChairman of SIT’s Board of Trustees.\n01\n01Journey to Punggol 137\n2022\n01\n01\n01 0101\nSIT jointly launched Singapore’s first shared facility\nof small-batch food production with Enterprise\nSingapore and JTC Corporation, in a bid to beef up\nthe food innovation scene.\nCalled FoodPlant, the $13 million facility in Senoko Drive enables\nfirms with less financial muscle to test products in small batches,\nexpand their research and development capabilities, and tap\ntraining resources.\nUrging more companies to leverage FoodPlant to enhance their\ncapabilities and forge partnerships, Deputy Prime Minister Heng\nSwee Keat said at the opening ceremony on April 20: “Singapore,\nwith our high food safety standards and diverse cuisines, is well\nplaced to build on our trusted brand and export our food products\nto the region and beyond.”\nFoodPlant is expected to benefit at least 200 food manufacturers\nand aid the development of some 400 new food products by 2026.20 April\nFood Innovation\nGets A Boost\n01 Deputy Prime Minister Heng Swee Keat is hosted by SIT\nPresident Professor Chua Kee Chaing and SIT Chairman Bill\nChang as he tours FoodPlant, a small-batch food production\nfacility that enables smaller, less well-resourced firms to test food\nproducts in small batches. Singapore has the right ingredients\nto be a key node of food and nutrition in Asia, says Mr Heng.\nJourney to Punggol 139\n2022\nNew guidelines were set up to ensure employees\nare given greater support across various aspects.\nKnown as the SIT Staff Well-Being Framework, it features four main\npillars: providing care for staff well-being; nurturing personal and\nprofessional growth; providing a supportive environment; and\nfostering a collaborative and enterprising culture.\nThe framework will focus on three core areas – mental, physical\nand social well-being. The aim is to cultivate an ecosystem of\nsupport, recognition and values to drive employee engagement\nand potential.\nSIT unveiled the Well-Being Framework at its inaugural Staff Well-\nBeing Day on May 19, 2022.\nThemed “Resilience and Me”, the events of the day focused on\nthe importance of building resilience through maintaining one’s\nwell-being to manage change and cope with challenges.19 May\nSIT Staff Get More Support\n01 SIT President Professor Chua Kee Chaing joins the staff at the\nUniversity’s first Staff Well-Being Day.\n02 All smiles at the Staff Well-Being Day, which features games\nand prizes such as vouchers to be won.\n01\n02Journey to Punggol 141\n2022\nSIT teamed up with ENGIE to jointly develop a\ndistrict cooling centre of excellence in Singapore.\nThe Memorandum of Understanding with ENGIE, a\nleader in low-carbon energy and services, was signed\non July 7, 2022.\nThe ENGIE-SIT District Cooling Centre of Excellence will be located\nin SIT’s new campus in Punggol. It aims to spur innovation in cooling\nsolutions across the region.\nIf designed well, district cooling systems can save 30 per cent or\nmore in energy consumption, said Thomas Baudlot, ENGIE CEO,\nEnergy Solutions, and Country Head for Southeast Asia.\n“Our relationship with SIT will not only allow us to train the future\ngeneration of engineers on this cornerstone technology for the\nregion’s energy transition but also to perfect it through a joint\napplied R&D effort,” he added.\nWith the partnership, SITizens can look forward to local work\nattachments and commercial development opportunities\nwith ENGIE.7 July\nHot Trend, Cool Move\nPutting individuals at the heart of everything we do means\nadopting a learner-first approach, and making sure our\ncurriculum is kept up to date with industry demands.\nMr Bill Chang\nChairman of SIT Board of Trustees (2022 – Present)Our relationship with SIT will not\nonly allow us to train the future\ngeneration of engineers on this\ncornerstone technology for the\nregion’s energy transition but also\nto perfect it through a joint applied\nR&D effort.\nThomas Baudlot\nCEO, Energy Solutions and Country\nHead for Southeast Asia, ENGIEJourney to Punggol 143\n2022\nTo nurture a future-ready healthcare workforce, SIT\nextended its partnership with SingHealth by another\nfive years to 2026.\nThe new Memorandum of Understanding was announced at the\nSingHealth Duke-NUS Education Conference on September 9, 2022,\nwhere Dr Janil Puthucheary, Senior Minister of State for Health and\nCommunications and Information, was the guest of honour.\nIt paves the way for SIT and SingHealth, partners since 2016, to\ndrive new innovations and advance practice-oriented healthcare\neducation for students.\nNew interdisciplinary initiatives would support crucial areas of\nhealthcare in view of Singapore’s rapidly ageing population.\nSIT and SingHealth will also co-develop healthcare innovations,\nincluding a co-shared “living laboratory” in the Punggol Campus\nto facilitate innovation design, prototyping and testing.9 September\nTeaming Up To Tackle\nHealthcare Challenges\n01 Thumbs up to a new chapter of partnership between SIT\nand SingHealth!\n02 Then-Chief Executive of SingHealth Dr Ivy Ng and SIT President\nProfessor Chua Kee Chaing ink the agreement to bring the\npartnership between both institutions to the next level.\n01\n02\nJourney to Punggol 145\n2022\nGrateful for their time in SIT, 30 students from its\nclass of 2022 decided to pay it forward by launching\nan annual fundraising drive.\nCalled Class Giving, it encourages each graduating cohort to make\na collective gift in support of their juniors.\nThe donations support the SIT Bursary, which is valued at $3,000\neach and defrays the cost-of-living expenses and tuition fees for\nstudents who require financial aid.\nIn all, 231 donors from the class of 2022 raised $9,000, setting a\nfine example for subsequent cohorts.26 September\nClass Of 2022 Gives Back\n$9k  funds raised\n231  donors\nAmong the bumper crop of SIT graduates in 2022,\none name stood out.\nDr Ng Yat Chung, founding Chairman of its Board of Trustees, was\nconferred the Honorary Degree of Doctor of Letters – making him\nSIT’s first honorary graduate. Dr Ng, who assumed the role in 2009\nand stepped down in 2022, oversaw the growth and development\nof SIT as Singapore’s first university of applied learning.\nOver three days from October 12 to 14, more than 2,200 graduates\nreceived their scrolls. The graduation ceremony, graced by Deputy\nPrime Minister Lawrence Wong, also welcomed the inaugural batch\nof graduates from several degree programmes: Air Transport\nManagement; the Master of Science in Civil Engineering; and the\nSIT-University of Glasgow joint degree programmes in Aerospace\nEngineering, Mechanical Engineering and Computing Science.12 October\nA Graduation Ceremony\nOf Many Firsts\n01 A time of celebration as Mr Bill Chang, Chairman of SIT’s\nBoard of Trustees, (left) confers the University’s first Honorary\nDegree of Doctor of Letters to Dr Ng Yat Chung (right). Dr Ng\nhad served as SIT’s first Chairman of the Board of Trustees for\nmore than 12 years.\n01Journey to Punggol 147\n2022\nWorking adults can now brush up their skills in the\ninformation and communications technology sector\nvia a new pathway at SIT.\nThe pilot programme, known as the Competency-based Stackable\nMicro-credential (CSM) pathway, would allow them to earn\nqualifications in specific topics, such as cybersecurity, that can stack\nup to an SIT degree. The micro-credentials will be offered through\nSIT’s Bachelor of Science with Honours in Applied Computing,\nand may be expanded to more degree programmes in the future.\nTo do so, SIT inked a Memorandum of Understanding with\nsix partners on September 28, 2022 – three industry players\n(NCS, Singtel and Singapore Computer Society) and three\npolytechnics (Nanyang Polytechnic, Singapore Polytechnic and\nTemasek Polytechnic).\nMinister for Education Chan Chun Sing said at the signing\nceremony: “The CSM is the first of its kind to be offered through a\ncollaboration between an Autonomous University in Singapore and\nthe polytechnics. Such just-in-time and flexible learning supplements\nexisting recruitment, retention and upskilling efforts – and will be\nkey to the future of work.” 28 November\nThe New Future Of\nWork With Stackable\nMicro-credentials\n01\n01\n01 The CSM pathway is a critical development to enable people\nand industries to stay relevant, says Minister for Education\nChan Chun Sing.Journey to Punggol 149\n2022\n2023:\nThe Final Push to Punggol\nIt is not every day that Minister for Education Chan Chun\nSing makes a speech wearing a bright yellow high-visibility\nvest and a white safety helmet.\nBut he donned them for a special occasion to mark SIT’s\ntopping out ceremony – a tradition at construction sites to\ncelebrate project milestones – for its new campus at the PDD.\n“I am very happy to see that it has adhered to the basic\nphilosophy of how we want this building to be integrated\nwith the rest of the community, with the industry, and also to\nallow the cross-pollination of ideas across different disciplines\nand different sectors,” said Mr Chan on May 22, 2023.\nIndeed, the Punggol Campus, nestled within\nSingapore’s much-touted first digital district,\nis designed to facilitate such dynamic\nexchanges. Under SIT’s Living Labs\nInitiative , students and faculty will jointly\ndevelop, test and implement research ideas\nwith industry and government partners in\nreal-world settings. Journey to Punggol 151\n2023\nStrategic agreements with two global tech giants, Oracle and\nSalesforce, lay out the blueprint for such tie-ups, which will further\nenhance SIT’s applied learning pedagogy and research capabilities.\nThe SIT-Oracle Living Lab will feature a dynamic digital “sandbox”\nplatform where SIT students, researchers and industry partners can\nteam up to create business solutions and innovation, leveraging\nOracle’s expertise and technologies.\nMeanwhile, the SIT-Salesforce Learning Lab will train up to 50 SIT\nstudents per academic year to develop applications and prototypes\nfor social service agencies. It will be the first learning lab in the\nAsia Pacific region for Salesforce, which specialises in customer\nrelationship management software.\nSIT President Professor Chua Kee Chaing said at the topping out\nceremony: “The move to Punggol presents many opportunities for\nSIT to differentiate and strengthen our education offerings. Our\nLiving Labs represent our commitment to transform learning by\namplifying the capabilities of our students, faculty and researchers.”\nComprising two plots – Campus Heart and Campus Court – SIT’s\nnew 9 ha home will house 10 buildings, including one called The\nHatchery that serves to facilitate cross-campus collaborations\nbetween academia and industry.\nWith just about one-third of the construction\nwork still to go, planning for the big move is\nin full swing. Over 9,000 students, along with\nstaff across SIT’s six satellite campuses, will\nmove to their new home in phases –– just in\ntime for the new academic year in September\n2024. The countdown has begun.Journey to Punggol 153\n2023\nAs Singapore’s University of Applied\nLearning, SIT has grown from strength to\nstrength in nurturing an industry-ready\nworkforce to drive Singapore’s future growth.\nProfessor Chua Kee Chaing\nPresident of SIT (2022 – Present)6 January\nLearning Through\nA Mix Of Work And Study\n01 SIT inks Memoranda of Understanding with six financial\ninstitutions and one tech services provider to develop initiatives\nto support pre-employment training and continuing education\nand training.\n01To further boost students’ job readiness, SIT\nhas launched a new pathway called Term-In\nTerm-Out (TITO) for some degree programmes in\nemerging sectors.\nUnder this scheme, students from Applied Computing (with Fintech\nspecialisation), Digital Supply Chain, and Robotics Systems will split\ntheir time between the University and the workplace every year.\nBy the end of their undergraduate studies, they would have spent\nnearly half of their time learning at the workplace without extending\nthe duration of their degree programme.\nSIT President Professor Chua Kee Chaing said: “The TITO pathway\nexemplifies the foundation of our applied learning pedagogy that\nis ‘learning by doing’, and we believe that this will give students a\nstronger head-start to the working world by exposing them to the\nlatest industry developments, business intricacies and work cultures.”\nJourney to Punggol 155\n2023\n156\n01\n02\n$8.7m  pledged\n220  eligible each yearFinancially needy students can access more aid under\na new SIT initiative launched on January 12.\nCalled Forward SITizen Initiative (FSI), it fully subsidises tuition\nfees for Singaporean undergraduates who meet several criteria,\nsuch as those whose monthly household per capita income does\nnot exceed $690. Some 220 students will be eligible each year.\nAs of January 2023, six donors have pledged $8.7 million to the\nscheme, including a $3 million seed donation from charity group\nQuantedge Foundation. The other benefactors pledged endowed\ngifts through Dou Yee Enterprises Bursary, Kewalram Chanrai Group\nBursary, KKH Bursary, Kwai Fong & Raymond Goh Study Grant,\nand Wilmar Bursary.\nFSI echoes the Forward Singapore road map launched by Deputy\nPrime Minister Lawrence Wong in June 2022, which charts a path\ntowards a more equitable Singapore.12 January\nLaunch of ‘Forward\nSITizen’ Initiative\n01 The Forward SITizen initiative got off to a great start\nwith a $3 million seed donation from charity group\nQuantedge Foundation.\n02 Dr Maliki Osman, Second Minister for Education, addresses\nthe audience at the launch of Forward SITizen.\nJourney to Punggol 157\n2023\nSIT will soon get its own showflat at its upcoming\nPunggol Campus.\nBut the unit, which is designed to look like the interior of a HDB\nflat, serves an educational purpose rather than residential needs.\nCalled the Lim Leng Swan Home Living Lab, it will be used for\ncase simulation to give SIT’s Allied Health and Nursing students\na better grasp of the living conditions of the elderly or those who\nare physically impaired.\nBuilt with a $500,000 donation from the Diana Koh Foundation,\nthe living lab is named after Ms Koh’s late mother, a trained\nnurse. It serves as a reminder of the legacy of Singapore’s pioneer\nnurses. Ms Koh, who died in 2019 at the age of 56, was a veteran\nin the accounting and advisory field who willed her estate to\ncharitable organisations. 3 February\nHDB Flat On Campus\n$500k  donation\nCase simulation\nfor elderly\nand physically\nimpaired patientsJourney to Punggol 159\n2023\nBehind every milestone is a story. And to capture\nthese behind-the-scenes tales, SIT launched its first\nCulture Handbook on March 28.\nThe day also marks SIT Day, which commemorates the institute\nbecoming an Autonomous University. The handbook was distributed\nelectronically across the board to staff and executive management.\nCurated by University Librarian Joan Wee and Senior Manager in\nthe Office of the President Stephanie Peh, the 24-page handbook\ncharts the University’s growth through the years and showcases its\ncore values of purpose and agility, respect and sustainability, and\nintegrity and excellence.\nExplaining the rationale behind the book, SIT President Professor\nChua Kee Chaing said: “Culture is extremely important because\nit will drive the organisation. Developing our culture anchored\non our core values requires very deliberate efforts over a period\nof time – to enable everyone in SIT to understand what our core\nvalues mean fully, internalise them, and act them out in our daily\ninteractions with one another and in performing our duties.” 28 March\nSIT Spills The Beans\nconnection. While we\nwork independently on\nour projects and tasks,\nmany a time we do need\nto depend on others for\nbuy-in, resources support\nand help. If I approach\nsomeone for assistance, I really value the planning\nthat goes into social\nactivities with colleagues.\nPerhaps it’s because I’m\nsomeone who values\nnurturance and connection.\nThere’s a good reason\nfor strengthening this CREATING A CULTURE OF\n‘FUN’ AT WORK\nWhen I joined SIT, I took on\na full-time teaching role — it\nwas my first. Before that\nI had focused mainly on\nresearch work. I had gotten\nmarried around the same\ntime. So, you could say I’ve\nseen how SIT progressed\nthrough the years and\nhave also grown along with\nthe institution. In fact, I\nreceived my 10-year long\nservice award in 2021. And\nI am proud to have been\na Culture Advocate for SIT\nsince 2017.\nPersonally, I love to\nimmerse myself in the\nculture of a place, so\nI can get a real sense\nof the people and the\nenvironment. I find that the\nwork culture here is really\nfun. Especially when we\nget to bond over social\nactivities outside of work.\nIt is great to unwind, enjoy\nthe company of colleagues,\nand take a break from\nthinking about our KPIs.A Page for Everyone to Fill\nWith Associate Professor Alfred Tan,\nEngineering Cluster\nthey will naturally seize\nopportunities to work\ntogether — exemplifying\nthe collaborative nature\nof SIT’s culture. We can\ncreate culture events for\npeople to come and do\nthings together.\nWhen it comes to planning\nculture events, we can\nafford to be really creative.\nWith so many talented\nfaculty and corporate staff\nwho specialise in so many\nvaried disciplines, surely our\nevents can be made even\nmore special by pooling our\nideas and expertise.\nFor instance, instead of\nrelying on external vendors\nand organising an event\nfrom scratch, why not use\nexisting programming and\nthe strengths and talents of\nfellow colleagues to make\nthe events unique? We can\nseek ideas from our food\ntechnology programme\nexperts to advise us on\nthe menu. We can include\nhealthier options like fruit\npopsicles or cold-pressed\nfruit juices in the menu.\nIn addition, we could get\nstaff to take part in making\nthe items from scratch.\nIt was through one such\nevent that I learnt that\neating mangoes makes\npeople happy because it\ncontains tryptophan, which\nconverts into the ‘happiness hormone’, serotonin. I learnt\nthat higher levels of serotonin\ncan help stave off insomnia,\ndepression and even anxiety.\nAnother example is the\nLantern Festival. Instead\nof gifting unsustainable,\nexpensive and elaborately\npackaged mooncakes to\none another, we could\nhave hands-on mooncake-\nmaking workshops to learn\nhow to make the cakes\nourselves. We could even\nhave a booth to make\nlovely origami lanterns. I\nrecall meeting the young\nchildren of our colleagues\nat the booth of a similar\nevent. The children\nenjoyed themselves and\nbrought a part of the\ncelebration home, made\nwith their own hands.\nWe’ve also invited\ncompanies like Mr Bean\nto cater food and also\nshowcase their products.\nIt’s useful learning\nbecause this company\nis known for continually\ninnovating suitable\nproducts for consumers\nwho are lactose-intolerant.\nThe cost was affordable\nat only $5 per head, and\nparticipants didn’t have to\neat unhealthy fried food. It\nwas a good engagement\nopportunity because aside\nfrom having fun, we also\nlearnt from one another. for instance, it helps if I\nknow the person well; and\nit is usually easier to build\nbetter rapport with our\ncolleagues in non-work\nsettings.\nWhen you know your\ncolleagues well, you build\ntrust and don’t treat them\nas colleagues to reach KPIs.\nInstead, you might see\na working mum, a fellow\nhobbyist, or just a friendly\nface; you see many more\nfacets of a person.\nLEARNING FROM ONE\nANOTHER\nWhen people enjoy having\na good time together,\nWhen you know\nsomeone well,\nyou will\nnaturally think\nof them in\nterms of their\ninterests.\nAlfred at the Singapore Science Festival held in 2013.Stories SIT Culture Handbook 15 Stories SIT Culture Handbook 16\nTo maximise the potential of our\nlearners and to innovate with\nindustry, through an integrated\napplied learning and research\napproach, so as to contribute to the\neconomy and society.\nWhat differentiates SIT from its counterparts\nis that its mission extends beyond the\norganisation. We are in the business of\nnurturing the next generation of learners.\nOur students will attain a holistic education\nwith skills and values that can lead to upward\nmobility and allow them to contribute to the\neconomy and society we live in.\nUnderstanding this purpose gives\nmeaning to the work we do. In fact,\nseveral stories in this handbook reveal that\nit is this noble calling that drew many of us\nto SIT in the first place.\nHow do we then ensure that everyone\nworks for this collective purpose? We JOURNEY IN BUILDING\nSIT’S CULTURE\nCULTURE — THE ‘GLUE’ THAT HOLDS\nEVERYTHING TOGETHER\nManagement consultant Peter Drucker\nfamously said, “Culture eats strategy for\nbreakfast.”\nLikewise, SIT’s management understands\nthe importance of culture in reaching\norganisational goals. An organisation\ncould have the finest statements of\nstrategic plans and goals, but they can\neasily be upended by a disruptive or\ncounter-productive work culture.\nCulture is the ‘glue’ that holds everything\ntogether — it serves to motivate people\nto have a shared common vision about the\ninstitution they work for.\nCLEAR PURPOSE AND STRONG VALUES\nAs we discuss culture, it is useful to refer to\nSIT’s mission:ASPIRE\nPURPOSE AND AGILITY\nWe are purposeful and united in\ndelivering on our mission.\nWe are agile in responding to\ndisruptions and opportunities.\nRESPECT AND\nSUSTAINABILITY\nWe respect one another and are\nopen to a diversity of views.\nWe promote sustainability in our\nlifestyle and operations, education\nand research endeavours.\nINTEGRITY AND\nEXCELLENCE\nWe maintain a high level of\nprofessional integrity at all times.\nWe strive for excellence in all that\nwe do.\nPROFESSOR CHUA KEE CHAING\nSIT PRESIDENT\nCulture is extremely important because it will\ndrive the organisation. Developing our culture\nanchored on our core values requires very\ndeliberate efforts over a period of time — to\nenable everyone in SIT to understand what our\ncore values mean fully, internalise them, and\nact them out in our daily interactions with one\nanother and in performing our duties.\nbelieve the answer lies in internalising a\ncollective culture with core values.\nSIT’s efforts in building a strong culture\nstarted from its early days. From 2013, the\nmanagement had already engaged staff in\nconversations on the behavioural attributes\nthat characterise who we are, how we work\nand relate to colleagues, and the way we go\nabout achieving our goals. Five core values\nwere defined: United in Purpose, Respect\nfor Others, Uncompromising Integrity, Purposeful Dynamism, Relentless Pursuit of\nExcellence — with the shorthand, ‘PRIDE’.\nGiven that sustainability increasingly\nimpacts the way we live and work today\n— especially in an institution like a\nuniversity, which plays a role in serving the\ncommunity — sustainability has now been\nadded to our list of core values.\nToday, we articulate our values in the\nfollowing statements:Introduction SIT Culture Handbook 7 Introduction SIT Culture Handbook 8Journey to Punggol 161\n2023\nTenants in the upcoming PDD will be able to work\nwith SIT to scale smart solutions.\nSIT announced its partnership with PDD developer JTC Corporation\nat the PDD Connecting Smartness 2023 event on April 14.\nUnder the PDD Living Lab Programme, SIT and like-minded\npartners can share research capabilities and talent resources to\nmeet three aims: develop a pipeline of future-ready tech talents;\nprovide opportunities for co-innovation and test-bedding; and\ndrive entrepreneurship.\nTo facilitate such collaborations, SIT also inked Memoranda of\nUnderstanding at the event with partners such as UOB, Target\nMedia Culcreative, Wanxiang Blockchain and dConstruct Robotics.\nSIT President Professor Chua Kee Chaing said at the event: “SIT’s co-\nlocation with industry in PDD will facilitate a strong academia-industry\nnexus, which is at the heart of our applied learning pedagogy. The\nPDD Living Lab programme will enable SIT students to collaborate\nclosely with industry partners and work on cutting-edge\ntechnological solutions.” 14 April\nDriving Smart\nSolutions At PDD\n01 The PDD Living Lab Programme will gather partners from\ndiverse sectors to innovate and testbed new ideas alongside\nSIT and JTC.\n02 Minister for Trade and Industry Gan Kim Yong (fourth from left),\nMr Ronnie Tay, SIT’s Deputy President (Administration) and Chief\nFinancial Officer (second from left) and Mr Bernard Nee, SIT’s\nDeputy President (Industry & Community) (fourth from right)\nwith industry partners from the finance, tech and media sectors.\n03 Minister for Trade and Industry Gan Kim Yong congratulates\nJTC, SIT and various partners for bringing the PDD to life.\n01\n01\n02\n03\n01Journey to Punggol 163\n2023\nAs the last structural beam at its new home fell into\nplace, SITizens moved one step closer to coming\nunder one roof.\nAt the topping out ceremony held at the Punggol site on May\n22, SIT President Professor Chua Kee Chaing said: “We are very\nexcited about this impending move not just because this will be a\nbeautiful new campus, but also because the whole of SIT will be\ntogether in one location for the first time.”\nCurrently based in six separate campuses across the five polytechnics\nand its headquarters in Dover Drive, the SIT family will move\nin phases to the Punggol Campus, which can accommodate\n12,000 students. Minister for Education Chan Chun Sing said at\nthe topping out ceremony that SIT “will become a central part of\nthe Punggol Digital District”.22 May\nA New Home AwaitsSIT did not start off with a campus. SIT has been a virtue out of necessity,\nby building on the connections with all the polytechnics. Thus, my second\nwish is that even as SIT has its own campus in time to come, I hope that SIT\nwill never forgo the linkages that you have so painstakingly built up in the\npast, with the polytechnics and the many other institutions.\nThis is what makes SIT stand out as a university that is fully connected to\nall polytechnics and other institutions beyond SIT. I am confident that the\ncurrent and future generations of leaders in SIT will treasure these links.\nMr Chan Chun Sing\nMinister for Education (2021 – Present)\n2023 Journey to Punggol 165\nWhile we can prepare a cohort of 40,000 students to\ngraduate from university every year, we need to retrain\n400,000 to 500,000 adult learners to be current and\nrelevant to market needs. I hope that SIT can take in a\ngood proportion of these adult learners. If we can do\nthat, SIT will not just be an institute of higher learning,\nbut it will be an institute of continuous learning.\nMr Chan Chun Sing\nMinister for Education (2021 – Present)Working adults looking to upgrade their skills\nwill soon be able to do so faster, thanks to a new\nSIT initiative.\nThe SIT Teaching and Learning Academy (STLA), launched at SIT’s\nfourth Applied Learning Conference, aims to bolster the University’s\nefforts in competency-based education. This recognises mastery\nof skills rather than just paper qualifications.\nSTLA will adopt a novel approach called Recognition of Prior\nLearning, which acknowledges past credentials, industry\ncertifications or work experience so learners can attain degrees\nin a shorter time.\nMinister for Education Chan Chun Sing described STLA as “a\nsignificant step towards building new capabilities in our adult\nlearning and education landscape”. 20 July\nNever Too Old\nTo Learn At STLA\nSTLA allows us to move beyond a\ndegree-centric assessment model\nand helps learners embark on more\nmeaningful career pathways that\nare intertwined with learning.\nMr Chan Chun Sing\nMinister for Education (2021 – Present)Journey to Punggol 167\n2023\n2024:\nBuilding Tomorrow, Today\nAfter almost 10 years in the making, SIT’s\npermanent campus was finally unveiled to\nthe public.\nDotted with trees and open spaces, the new centralised\ncampus in the PDD – aptly termed “campus-in-a-park”\n– is alive in more ways than one. Greenery adds a touch\nof the verdant to angular buildings; solar panels glint on\nthe rooftops, feeding electricity back into the University’s\nprivate microgrid.\nIts ideascapes also thrum with life. Built on a “living lab”\nconcept, the University is a test-bed for new prototypes\nand solutions generated at the intersection of academia and\nindustry. This effort is aimed at transforming Singapore into\na thriving innovation hub. Journey to Punggol 169\n2024\nCollaboration with industry partners has already begun. For\ninstance, SIT is working with cyber intelligence firm Group IB to\ndesign and engineer virtual testing environments for start-ups\nlooking to fend off cyberattacks. Group IB is part of the first batch\nof four international firms to set up shop in the PDD, alongside\nBoston Dynamics, Delta Electronics Int’l (Singapore), and Wanxiang.\nSuch projects will only become more common as local and\ninternational firms take root in the PDD. As Singapore’s first\nuniversity of applied learning, SIT will benefit greatly from the\nsurrounding industry network – and, in turn, generate solutions to\nbenefit both its neighbours and industry-at-large.\nBut it’s not just industry partners who are making an impact – so are\nphilanthropists like Mr Kwek Leng Beng, the property tycoon who\ndonated $24 million to SIT in 2023. This donation was matched by\nthe government, bringing the total SIT endowment to $60 million.\n“Through this SIT donation, I am privileged to play a part in building\nfuture generations of talent and professionals for Singapore,\nespecially in hospitality,” said Mr Kwek at the event to announce\nhis donation, which also saw the unveiling of a Lego model of a\nnew administrative building. The model was built by SIT students.\nIn appreciation of Mr Kwek’s endowed gift, SIT has named the\nnew administrative building – which will house academic and\nadministrative staff – the Kwek Leng Beng University Tower.\n01 01\n01 The Punggol Campus is envisioned as a “living lab” that\nintegrates applied research and innovation for SIT and\nits partners. $60m  endowmentJourney to Punggol 171\n2024\nIt certainly is a step up from the University’s humble beginnings as\na distributed campus spread out across Singapore.\nWithout a doubt, SIT has come a long way since its establishment in\n2009. What began as an effort to give more polytechnic graduates\nthe opportunity to further their education evolved into Singapore’s\nfirst university of applied learning.\nOver the years, deep bonds with industry have also been forged,\ngiving rise to innovative solutions that have been taken to market.\nAs SIT continues to make its mark in Singapore and the world,\none thing is clear: all learners are welcome. The University has\nalways been a champion of lifelong learning, and is a pioneer of\nclosely linking education to industry needs to help learners gain\nrelevant skills.\nSIT will continue to shape the future of work\nand skills at its new Punggol Campus. As it\nheads into a new decade, it’s time to write\nthe next chapter.\n01 Artist’s impression of the Canopy Walk, a link bridge that spans\ntwo academic blocks.\n02 Artist’s impression of the food court in SIT’s Punggol Campus.\n02 01Journey to Punggol 173\n2024\nThe intricately woven loops on the opposite page symbolise the collaborative relationship that the Singapore Institute of Technology shares with its SITizens\nand the wider community. The botanical motif is a tribute to the lush greenery that forms the backdrop of the Punggol Campus. SIT Editorial Committee\nCorporate Communications DivisionEditorial\nThe Nutgraf Design\nStudio GiraffePhotography\nTan Eng Keng/Keng Photography\nSamuel He\nPage 130: Berita Harian © SPH Media Limited.\nPermission required for reproduction\nCelebrating a decade of growth and innovation\nWhen the Singapore Institute of Technology (SIT) became an Autonomous\nUniversity in 2014, it had an ambitious goal — to pioneer a new approach\nto higher education, one that would combine academic knowledge\nand skills with real-world applications in the industry. In a world that\nwas rapidly evolving and increasingly complex, SIT needed to give its\nstudents the knowledge, skills, and tools to thrive.\nA decade on, SIT’s model of applied learning has borne fruit. Its degrees\nare sought after, just as its graduates are. SIT is now Singapore’s third-\nlargest Autonomous University by undergraduate student intake, and\nmore than 90 per cent of its students find employment within six months\nof graduation.\nAs the University celebrates a decade of growth, this book looks back at\nthe journey of setting up Singapore’s first university of applied learning,\nand chronicles the memorable milestones of the last 10 years."
}