{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2020-10/Annual_Report_2012.pdf",
  "type": "pdf",
  "content": "ANNUAL REPORT 2012\nBRINGING\nTHE WORLD TO YOU\nEstablished by the Ministry of Education in 2009, SIT’s mission\nis to provide an industry-focused university education for\npolytechnic graduates in partnership with local polytechnics\nand reputable overseas universities to produce highly desired\ngraduates for growth sectors of the economy.PIONEERS IN\nEDUCATION\nEXCELLENCE\nA UNIQUE EDUCATION MODEL\n02\nCONTENT\nCHAIRMAN’S MESSAGE   3\nPRESIDENT’S MESSAGE   4\nBOARD OF TRUSTEES   5\nOUR PARTNERS   6\nMILESTONES   20\nSCHOLARSHIPS & INDUSTRY SPONSORSHIPS   24\nSTUDENT LIFE   25\nFINANCIAL STATEMENTS  28\n03\nThe past year has been an exciting one in the\ndevelopment of the Singapore Institute of\nTechnology (SIT). We witnessed a series of firsts\n– new overseas university partners whom we are\nextremely pleased to bring on board; expanding\nour degree offerings and new scholarship\npartnerships with the industry. On campus, SIT\nstudents add life to their experience with their\nfirst student-led Orientation 2011 and numerous\nstudent activities that involved outdoor sports and\nsocial gatherings.\nOn the partnership front, SIT has built partnerships\nwith three new overseas university partners.\nWe launched seven new degree programmes,\nbringing the total number of programmes offered\nby SIT from 7 to 24. We created a new discipline,\nEducation, to add to our five existing disciplines:\nEngineering and Applied Sciences, Health Sciences,\nDesign, Interactive Digital Media and Hospitality.\nAlong with the growth of degree programmes,\nmore faculty appointments were filled with local\nstaff. The breadth and diversity of our degree\nprogrammes were also reflected in the variety of\nresearch and teaching experience within our faculty.\nWe aim to develop our local staff professionally and increase the level of specialist expertise within our\nteaching staff.\nAs SIT continues to expand and grow, I am pleased\nthat our students, while undertaking rigorous\nacademic work, are fostering the bonds necessary\nto carry them through to graduation and beyond.\nTo deepen such opportunities, we plan to create\nthe space and facilities for our students to interact\nin a deeper and more meaningful way. Part of these\nplans would include constructing campus spaces\nwhich I am certain would help our students\nidentify more strongly with SIT when the buildings\nare ready.\nOur partners and stakeholders have made every\neffort to contribute to SIT’s advancement this\npast year. I am thankful to our students, parents,\npolytechnic partners and overseas university\npartners for their support and enthusiasm in being\na part of this journey with us. The passion shown by\nour partners in industry, donors, faculty, staff and\nstudents is infectious and encouraging. SIT’s future\nlooks bright with the support of such an enthusiastic\ncommunity. I have every confidence that SIT will\nadd a new pathway to Singapore’s dynamic\neducational landscape.CHAIRMAN’S\nMESSAGE\nA word from our Chairman\nMr Ng Yat Chung\n04\nOur focus this year was growth. Having laid the\ngroundwork in 2009 and 2010, we worked on\nexpanding the organisation. Internally, our staff\nstrength has increased to approximately 100\nmembers and this number continues to grow\nas we expand our degree offerings and take in\nmore students. This year also saw an exponential\nincrease in activities for both staff and students.\nWe were further delighted to welcome Overseas\nUnion Enterprise Limited (OUE) as one of our new\nscholarship providers for our hospitality students.\nOn the academic front, SIT welcomed three new\nmembers as overseas university partners: Trinity\nCollege Dublin, The Glasgow School of Art, and\nWheelock College. We launched five new degree\nprogrammes with our new partners in the areas\nof Occupational Therapy and Physiotherapy,\nCommunication Design and Interior Design, and\nEarly Childhood Education respectively. SIT further\nexpanded its degree offerings with a current\npartner of ours – the University of Glasgow – to\ninclude Aeronautical Engineering and Aerospace\nSystems. We now have six academic disciplines:\nEngineering and Applied Sciences, Health Sciences,\nDesign, Interactive Digital Media, Education\nand Hospitality.I am very pleased that our senior SIT students\nstepped up to initiate a variety of student-led\nactivities that injected much vibrancy to SIT. The\nsenior SIT students worked hard to welcome our\nnew intakes of students for Academic Year 2011/12\nby organising SIT’s first student-led Orientation.\nOur students were also very active in organising\nvarious outdoor sports activities such as a water\nsports carnival, beach games and participated in\nthe OCBC Cycle challenge. We even had a LAN\ngaming and paintball face-off with our overseas\nuniversity partners. I am very proud of the immense\neffort that our students and staff put in to make\nthese activities such great fun and a huge success.\nOur overseas university partners also showed great\nsupport for our student activities. Such activities\ncreate the pulse in SIT and this pulse is indeed\nbeating strongly.\nOur SIT staff have played a significant role in SIT’s\nstellar growth to date. Their pride and dedication in\nbuilding SIT up is unparalleled and I am honoured\nto lead a group of such fine colleagues. As SIT\ncontinues its rapid growth, we will work hard to\ncement a sense of belonging and community\nwithin SIT for our staff, students and partners.\nSIT is undoubtedly creating a resounding\nimpact that reverberates through Singapore’s\neducational landscape.PRESIDENT’S\nMESSAGE\nA word from our President\nProfessor Tan Chin Tiong\n05\nBOARD OF\nTRUSTEES\nCHAIRMAN\nMr Ng Yat Chung\nGroup President and CEO\nNeptune Orient Lines Limited (NOL)\nDEPUTY CHAIRMAN\nMr Ng Cher Pong\nDeputy Secretary (Policy)\nMinistry of Education\nMEMBERS\nDr Abdul Razakjr Bin Omar\nConsultant, Cardiologist\nRaffles Heart Centre\nDr Beh Swan Gin\nPermanent Secretary\nMinistry of Law\nMs Rachel Eng Yaag Ngee\nManaging Partner\nWongPartnership LLP\nProfessor Hang Chang Chieh\nHead, Division of Engineering & Technology Management\nNational University of Singapore\nDr Richard Charles Helfer\nChairman\nRCH International Pte Ltd\nMr Allen Lew Yoong Keong\nChief Executive Officer, Singapore\nSingapore Telecommunications Ltd\nDr Lim Khiang Wee\nExecutive Director, A*Star Graduate Academy (AGA)\nAgency for Science, Technology and Research (A*Star)\nMr Pek Hak Bin\nPresident\nBP Singapore\nMr Roy Quek Hong Sheng\nDeputy Secretary (Health)\nMinistry of Health\nMr Michael Yap Kiam Siew\nDeputy Chief Executive Officer\nMedia Development Authority\nMs Mary Yeo Chor Gek\nVice President, Supply Chain Operations for South Asia Pacific\nUnited Parcel Services Singapore Pte LtdEX OFFICIO MEMBER\nProfessor Tan Chin Tiong\nPresident\nSingapore Institute of Technology\nOUR\nPARTNERS\nOVERSEAS UNIVERSITY PARTNERS\nNEWCASTLE UNIVERSITY\nTECHNISCHE UNIVERSITÄT MÜNCHEN\nUNIVERSITY OF GLASGOW\nTRINITY COLLEGE DUBLIN\nTHE UNIVERSITY OF MANCHESTER\nTHE GLASGOW SCHOOL OF ART\nDIGIPEN INSTITUTE OF TECHNOLOGY\nWHEELOCK COLLEGE\nTHE CULINARY INSTITUTE OF AMERICA\nUNIVERSITY OF NEVADA, LAS VEGASPOLYTECHNIC PARTNERS\nSINGAPORE POLYTECHNIC\nNGEE ANN POLYTECHNIC\nTEMASEK POLYTECHNIC\nNANYANG POLYTECHNIC\nREPUBLIC POLYTECHNIC\n07\nWe bring a world of opportunities to our students with\noverseas university partners that are among the best in\nEngineering and Applied Sciences, Health Sciences, Design,\nInteractive Digital Media, Education and Hospitality.\nOur degree programmes equip our graduates with industry-\nrelevant skills and global knowledge to achieve their ambitions\nand excel in their chosen careers. OVERSEAS\nUNIVERSITY\nPARTNERS\nCATALYSTS IN GLOBAL EDUCATION\n08\nNEWCASTLE\nUNIVERSITY (NU)\nNU is one of United Kingdom’s most reputable\nhigher education institutions and a member of\nthe UK’s elite Russell Group of 24 internationally-\nrecognised universities. Acclaimed for teaching\nexcellence informed by world-class research, NU\noffers a wide range of industry-relevant degrees\nin Singapore. It has an enviable reputation for\ngraduate employment and a global network\nof alumni.\nProf Eshan Mesbahi, Dean (Singapore Campus), Chief\nExecutive, NUIS: “Newcastle University’s collaboration\nwith Singapore Institute of Technology goes from\nstrength to strength. We started with delivery of three\nprogrammes in 2010 and by 2013 we shall be offering\nmore than seven undergraduate programmes to over\n700 full-time students. More than 250 students will\nbe graduating next year with a Newcastle degree\nparchment in their hands. I am very proud to say\nthat both quality and quantity of our applicants have\nrisen sharply for all our programmes during the last\ncouple of years. We also have the highest number of\nsponsored students who are receiving full or partial\nscholarships from various stakeholders. These are clear\nindications of relevant content, highest quality and\nindustrial approval of what we are providing to our\nstudents and their prospective employers.”Programmes offered in partnership with SIT:\nBachelor of Engineering with Honours\nin Chemical Engineering\nBachelor of Science with Honours in Food\n& Human Nutrition\nBachelor of Engineering with Honours\nin Marine Engineering\nBachelor of Engineering with Honours\nin Naval Architecture\nBachelor of Engineering with Honours\nin Offshore Engineering\nBachelor of Engineering with Honours\nin Mechanical Design and\nManufacturing Engineering\n09\nTECHNISCHE\nUNIVERSITÄT MÜNCHEN (TUM)\nFounded in 1868 by King Ludwig II, Technische\nUniversität München (TUM) has long established\nitself as a premier institute of higher learning\nin Germany. Ranked as Germany’s number one\nuniversity in the 2011 & 2012 Shanghai Ranking\n(ARWU), TUM has earned itself the reputation of\nbeing an institute that produces world-changing\ntechnologies, with a total of 13 TUM Nobel Prize\nLaureates to date. This 2012, TUM will celebrate\nthe 10th year anniversary of TUM Asia, marking a\ndecade of German academic excellence here in\nSingapore. Moving forward, TUM Asia strives to\nlaunch more Master and Bachelor programmes that\ncontinue to be industry-focused and in tune with\nthe needs of the global economy.TUM Asia Managing Director, Dr Markus Wächter:\n“It is never easy to find an academic partner that\nshares the same vision. Now two years into TUM\nAsia’s collaboration with SIT, I can proudly say that\nour Bachelor programmes are in good hands, and\nwe eagerly look forward to many years of great\npartnership to come.”Programmes offered in partnership with SIT:\nBachelor of Science in Chemical Engineering\nBachelor of Science in Electrical Engineering &\nInformation Technology\n10\nFounded in 1451, UOG is the fourth-oldest university\nin the English-speaking world. It is also part of the\nUnited Kingdom’s distinguished Russell Group of\nleading UK Universities and a founding member\nof Universitas 21 - an international network of\nuniversities, established as an international reference\npoint and resource for strategic thinking on issues of\nglobal significance. It is associated with seven Nobel\nLaureates and boasts alumni like Adam Smith, Lord\nKelvin and James Watt. UOG’s School of Engineering\nsustains a broad portfolio of leading-edge research\nfunded by industry, research funded by industry,\nresearch councils and governmental agencies around\nthe world.UNIVERSITY\nOF GLASGOW (UOG)\nProgrammes offered in partnership with SIT:\nBachelor of Engineering with Honours\nin Aeronautical Engineering\nBachelor of Engineering with Honours\nin Aerospace Systems\nBachelor of Engineering with Honours\nin Mechanical Design Engineering\nBachelor of Engineering with Honours\nin Mechatronics\nPrincipal & Vice Chancellor, Prof Anton Muscatelli:\n“University of Glasgow Singapore and Singapore\nInstitute of Technology (SIT) took our existing\ncollaboration further at a high-level signing ceremony.\nWe launched two additional programmes, one in\nAeronautical Engineering, and the other in Aerospace\nSystems. This was an extremely positive event and\nalthough relatively new to the concept, we are\ndetermined to expand the provision of Glasgow\ndegree programmes in Singapore.”\n11\nTRINITY\nCOLLEGE DUBLIN (TCD)\nTrinity College Dublin (TCD) boasts a history that\ndates back to 1592. As Ireland’s oldest and sole\nconstituent college of the University of Dublin, TCD\nis recognised internationally today as a premier\nuniversity and research centre in Ireland. TCD also\nshares industrial ties with the National Institute of\nHealth (NIH) in Washington DC, the Dresden Centre\nfor Radiation Research in Oncology and other\nprominent health organisations.\nDr Juliette Hussey, TCD Academic Director for SIT\nProgrammes: “Trinity College Dublin is\ndelighted with the partnership with SIT. The\nprogrammes in Physiotherapy and Occupational\nTherapy will commence in September 2012. We\nlook forward to a long and productive relationship\ncollaborating in teaching and research.”\nProfessor Jane Ohlmeyer, Vice Provost for Global\nRelations: “Trinity College Dublin warmly welcomes\nthis innovative strategic partnership with SIT. It serves\nas a fabulous foundation on which future educational\nand research collaborations can be built.”Programmes offered in partnership with SIT:\nBachelor in Science (Occupational Therapy)\nBachelor in Science (Physiotherapy)\n12\nThe University of Manchester was established in\n1824 as England’s first civic university and is now\nthe largest campus-based university in the UK.\nA member of the esteemed Russell group, the\nUniversity of Manchester has a proud history of\nachievements with 25 Nobel Laureates among its\nstaff and alumni. UOM was the first university in\nEngland to offer a nursing degree and appoint a\nProfessor of Nursing. UOM continues to influence\nhealth care policy, practice, education and\nresearch by producing national and international\nnursing leaders.\nThe University of Manchester’s innovative two year\nhonours degree programme has seen the first\ncohort of students move into their final year. The\nresearch focus of this programme equips graduates\nto make evidence-based decisions in their\npractice, preparing them to influence the changing\nlandscape of Singapore’s health care. Already, these\nstudents are demonstrating emergent leadership\nqualities through the Manchester Leadership\nProgramme. UOM Programme Director, Dr\nChristine Brown Wilson looks forward to welcoming\nfuture cohorts of students as the SIT-UOM\npartnership moves from strength to strength.THE UNIVERSITY\nOF MANCHESTER (UOM)\nProgramme Director (Academic Matters), Dr Christine\nBrown Wilson: “This has been a ground breaking\nyear for UOM and SIT as they forge their partnership\nin nurse education. I look forward to working closely\nwith colleagues here in Singapore in supporting\nnursing practice through research relating to long-term\nconditions and older people.”\nProgramme offered in partnership with SIT:\nBachelor of Science with Honours in\nNursing Practice\n13\nFounded in 1845 as a government School of Design,\nThe Glasgow School of Art (GSA) is one of Europe’s\nleading higher education institutions for creative\neducation and research in design, fine art and\narchitecture. A GSA education is practice-based, face-\nto-face, professionally-oriented and socially engaged\n- GSA is ranked top in the UK for visual arts, according\nto the Guardian University Guide 2012’s Specialist\nInstitutions league table, and was ranked in the “Hot\n50” as Global Leader in its field by Design Week\nmagazine. Students may choose to study honours\ndegree programmes in Communication Design or\nInterior Design in Singapore.THE GLASGOW\nSCHOOL OF ART (GSA)\nProgrammes offered in partnership with SIT:\nBachelor of Arts with Honours in\nCommunication Design\nBachelor of Arts with Honours in Interior Design\nProgramme Director, Mr Frazer Macdonald Hay:\n“Staff and students at the GSA share a passion and\nconcern for visual culture. Our education produces\ngraduates who are creative, innovative and critical\nthinkers who can be found across the world\ncontributing to the communities and economies\nthey are part of. Working with Singapore Institute of\nTechnology, the GSA is delighted to be contributing\nto the growth and development of Singapore as the\ncreative hub of South-East Asia.”\n14\nDigiPen Institute of Technology is a global leader in\ngame development education. As the first school\nin the world to offer a bachelor’s degree in game\ndevelopment, DigiPen has advanced the game\nindustry for more than two decades by empowering\nstudents to become world-class programmers,\nengineers, designers, and artists. Located in\nRedmond, Washington, with branch campuses\nin Singapore and Bilbao in Spain, DigiPen offers\nundergraduate and graduate degrees in video game\ndesign and development, hardware and software\nengineering applied to simulation, fine arts and\ndigital art production, sound design, as well as youth\nprogrammes and Continuing Education and Training\ncourses. DigiPen students have won more awards\nat the prestigious Independent Games Festival than\nthose of any other school. Most recently, during the\n2011 Independent Games Festival held in China, three\nof the six finalists in the Student Game competition\nwere DigiPen student games, and the winner was the\nDigiPen game “Pixi”. DigiPen graduates have gone on\nto create ground breaking games like Valve Software’s\nPortal series, and have joined companies that are\ngiants of the industry such as Microsoft, Nintendo,\nand Ubisoft.DIGIPEN INSTITUTE\nOF TECHNOLOGY (DIGIPEN)\nProgrammes offered in partnership with SIT:\nBachelor of Science in Computer Science in\nReal-Time Interactive Simulation\nBachelor of Science in Game Design\nBachelor of Fine Arts in Digital Art\nand Animation\nBachelor of Arts in Game Design\nMr Claude Comair, Founder & President of DigiPen\nInstitute of Technology: “We are delighted with our\nongoing working relationship with SIT. I have full\nconfidence that the collaboration will be instrumental\nin providing the innovation and manpower needs to\nbuild a world-class interactive digital media and visual\neffects industry in Singapore. I believe that in the\nyears ahead, our graduates will form a core group of\nprofessionals who will create world-renowned\n“Made-in-Singapore” products for the global market.”\n15\nWHEELOCK\nCOLLEGE (WLC)\nSince 1888, Wheelock College (WLC) of Boston, USA,\nhas sought to provide a transformational education to\nstudents who are passionate about making the world\na better place, with special emphasis on preparing its\nlearners to teach, mentor and nurture young children\nand their families.\nThe Wheelock degree programme balances the need\nto incorporate both theory and the development of\nreal-life skills into its curriculum, leading its graduates\nto become skilful practitioners and leaders in the\nprofession of Early Childhood Education. Its broad-\nbased, globally-focused degree provides a distinctly\ninteractive classroom experience for its students, with\nmany of the modules co-taught by experienced Boston\nand Singapore instructors. Executive Director & Visiting Scholar, Dr David Fedo:\n“Wheelock College from Boston, USA is delighted to\ncollaborate with the Singapore Institute of Technology\nin providing Singapore students access to the highest\npossible quality of education anywhere in the critical\nfield of early childhood education. Teaching and\nmentoring students who have the passion and acquire\nthe knowledge to work with young children is of\nsurpassing importance to the planet, and no one does\nthis better than SIT-Wheelock.”Programme offered in partnership with SIT:\nBachelor of Science in Early\nChildhood Education\n16\nSince its establishment in 1946, The Culinary Institute\nof America (CIA) has set the global benchmark for\nculinary education. Its proven programmes have\nproduced over 46,000 culinary professionals including\ntop chefs such as Anthony Bourdain, Cat Cora and\nRoy Yamaguchi. The historic SIT-CIA partnership marks\nthe first time that the CIA is offering its programmes\nin Asia.THE CULINARY\nINSTITUTE OF AMERICA (CIA)\nManaging Director, CIA Singapore, Chef Eve Felder:\n“The relationship of overseas universities with\nlocal universities is a model that will impact global\neducation. Through the Singapore Institute of\nTechnology, the Ministry of Education is providing the\ninfrastructure to educate future leaders by making it\npossible for world-renowned colleges to operate in\nSingapore. The sharing of educational best practices,\nculture, curriculum, operational and technological\nadvancements is preparing our students to embrace\nthe complex future in a world market place. Singapore,\nagain, leads the way.”Programme offered in partnership with SIT:\nBachelor of Professional Studies in Culinary\nArts Management\n17\nUNIVERSITY OF\nNEVADA, LAS VEGAS (UNLV)\nProgramme offered in partnership with SIT:\nBachelor of Science in Hotel Administration\nAssociate Dean for Singapore, Richard C. Linstrom:\n“With over 550 students enrolled at the Singapore\nInstitute of Technology, UNLV has found a partner\nequally committed to the provision of its Bachelor of\nScience degree to the students of Singapore.”Founded in 1957, UNLV offers more than 200\nundergraduate, graduate and professional degree\nprogrammes. It is a public, research-intensive\nand fully accredited institution with about 28,000\nstudents and some 2,800 faculty and staff at its\n350-acre main campus, located within view of the\nfamous “Las Vegas Strip” resort corridor.\nUNLV’s William F. Harrah College of Hotel\nAdministration has been granting the U.S. Bachelor\nof Science in Hotel Administration in Singapore\nat its facility in the National Library Building since\n2006. Graduates obtain the knowledge to begin\ntheir careers in the hospitality-related sector, and\nalso gain the general skills to move into responsible\npositions in other industries or to further their\nstudies toward an advanced degree, such as an MS,\nMBA, JD, or PhD.\n18\nOur partnership with the five local polytechnics allows us to\nbuild on their reputations and strengths to provide an optimal\ndegree pathway for polytechnic graduates. This model brings\ndegree-level education right to the students’ doorstep,\nproviding them with world-class infrastructure and excellent\nfacilities to enhance student life. In addition, with SIT’s planned\nconstruction of our own distributed campuses within each\npolytechnic, we continue to make great progress as we\nexpand our offerings.POLYTECHNIC\nPARTNERS\nBRINGING HIGHER\nEDUCATION TO YOU\n19\nSP Principal, Mr Tan Hang Cheong: “Singapore Polytechnic is honoured to partner SIT\nto host world-renowned universities in our campus to offer high quality undergraduate\ndegree programmes to polytechnic graduates.”SINGAPORE\nPOLYTECHNIC\nNP Principal, Mr Chia Mia Chiang: “The Singapore Institute of Technology has grown from\nstrength to strength. With prestigious overseas universities coming on board, the degree\ncourses under SIT add to the diversity of pathways for polytechnic graduates to pursue\nundergraduate studies.”NGEE ANN\nPOLYTECHNIC\nTP Principal & CEO, Mr Boo Kheng Hua: “Temasek Polytechnic is proud to host degree\nprogrammes offered by The Culinary Institute of America, University of Nevada, Las\nVegas and The Glasgow School of Art in collaboration with SIT. With the SIT building on\nour campus ready in 2014, we hope to grow our partnership to enable more polytechnic\ngraduates to further their tertiary education with leading universities from around the\nworld, right here in Singapore.”TEMASEK\nPOLYTECHNIC\nNYP Principal & CEO, Mr Chan Lee Mun: “Nanyang Polytechnic is pleased to host five\ndegree programmes under the SIT umbrella. These programmes are offered by The\nUniversity of Manchester in Nursing Practice, Newcastle University in Mechanical Design\nand Manufacturing Engineering and in Food & Human Nutrition, and Trinity College Dublin\nin Occupational Therapy and in Physiotherapy. These programmes provide polytechnic\ngraduates with an additional avenue to further their education with reputable universities.\nWe welcome more of such upgrading opportunities for polytechnic graduates.”NANYANG\nPOLYTECHNIC\nRP Principal & CEO, Mr Yeo Li Pheow: “Republic Polytechnic is pleased to work with\nSingapore Institute of Technology to host and support industry-focused degree\nprogrammes. We look forward to the diversity and exciting opportunities for our\npolytechnic graduates who aspire to upgrade and acquire a university education.\nIndeed, this collaboration will bring much added value to Singapore as a centre of\nexcellence for education.”REPUBLIC\nPOLYTECHNIC\nMILESTONES\nPACESETTERS IN A NEW\nEDUCATION JOURNEY\nThe makings of a great year in education are marked by\nimportant milestones. And at SIT, we celebrate a host of\nnew partnerships, initiatives and courses that were forged\nthroughout 2012.\n21\n14 AUGUST 2011\nSIT WELCOME\nCEREMONY\nSIT welcomed its second cohort of students on\n14 August 2011. Our student performers wowed\nthe audience comprising SIT Senior Management,\nOverseas University partners, Polytechnic partners and\nparents as they put up two dance items and a unique\npercussion performance.\n04 JULY 2011\nSIT-OUE SIGNING\nCEREMONY\nThis event marked the beginning of SIT’s\npartnership with Overseas Union Enterprise Limited\n(OUE). With the high level of industry relevance\nof degree programmes offered through SIT, OUE\nstepped forward to offer scholarships to our\nstudents enrolled in hospitality programmes. Some\nof our current students were also invited to the\nevent and had opportunities to interact with Mr\nLawrence Wong, then Minister of State, Ministry of\nDefence & Ministry of Education.\nSIT’s very first student-led Orientation proved to be\na hit as students across our Overseas Universities\ncame together to plan the two-day event. Staff\nfrom the Student & Career Services Division also\njoined in the fun by forming an all-star team to\ncompete with the students. The event ended\nwell with a buffet dinner and many new students\nthanking their “senior SITizens” for the amazing two\ndays of Orientation.20/21 AUGUST 2011\nSIT ORIENTATION 2011\n22\n13 JANUARY 2012\nPRESS CONFERENCE\n& SIT-WLC-NP\nSIGNING CEREMONY\nOur Press Briefing was held on 13 January 2012\nat Raffles Hotel to announce new initiatives for\nAY2012/13. New programmes with existing\nOverseas University partners as well as new\nOverseas University partners were introduced\nto the media. Following the Press Briefing, the\ncollaboration with Wheelock College and\nNgee Ann Polytechnic was made official in a\nsigning ceremony.\nOn 14 & 15 January 2012, the SIT Open House 2012\nwas held at Suntec City Convention Centre for the\nfirst time. Our current students and staff, together\nwith our current and new Overseas University\nPartners, were on-ground to promote our degree\nprogrammes. The Muttons from 98.7FM were also\npresent on Saturday to give on-air live updates and\ninterviewed some representatives from our\nOU partners.14/15 JANUARY 2012\nSIT OPEN HOUSE 2012\n04 JANUARY 2012\nSIT ORIENTATION\nJANUARY INTAKE\nOur current and new students came together on 4\nJanuary 2012 for Orientation Day. Students bonded\nand formed new friendships through games and\nactivities and most importantly, they were exposed\nto SIT’s vibrant student life. All the best to our\nnew students!\n23\n27 MARCH 2012\nSIT-UOG-SP SIGNING\nCEREMONY\nA signing ceremony was held to mark the launch of\ntwo new degree programmes: Bachelor of Engineering\nwith Honours in Aeronautical Engineering and\nBachelor of Engineering with Honours in Aerospace\nSystems with University of Glasgow (UOG) and\nSingapore Polytechnic. Guests who were present\nincluded representatives from UOG, our five\npolytechnics involved in Aerospace and Aeronautical\nprogrammes, as well as our industry partners from the\nAerospace Industry.\n16 FEBRUARY 2012\nREACH FOR THE\nSTARS 2012\nOrganised specially for our scholars, Reach\nFor the Stars 2012 was held at Mandarin\nOrchard Singapore on 16 February 2012. At\nthis networking session, our scholars met\ntheir sponsors and were able to share their\nexperiences at SIT. We also showed our\nappreciation to our industry partners for their\nstrong support in the provision of scholarships\nfor our students.\n24\nSCHOLARSHIPS\nAND  INDUSTRY\nSPONSORSHIPS\nBRINGING AMBITION TO YOU\nOver the course of the past year, SIT has worked closely with various industry partners to bring a\nworld of opportunities to deserving undergraduates through scholarships and financial aid.\nOur partners also benefit by sending their employees to SIT to upgrade their skills and gain\nnew knowledge in the course of obtaining their degrees. This has gone a long way in creating a\nstudent body that is diverse and vibrant, encouraging a deeper sharing of experiences\nand knowledge.\nThe following industry partners have indicated scholarship/sponsorship support to SIT:\n•\t Alexandra\tHealth\n•\t Association\tof\tSingapore\tMarine\tIndustries\n•\t Agri-Food\t&\tVeterinary\tAuthority\nof Singapore\n•\t Changi\tGeneral\tHospital\n•\t China\tOceanis\tPhilippines,\tIncorporated\n•\t Far\tEast\tOrganization\n•\t Fairmont\tSingapore\t&\nSwissôtel The Stamford\n•\t Iggy’s\tPrivate\tLimited\n•\t Infocomm\tDevelopment\nAuthority of Singapore\n•\t Jurong\tHealth\tServices\n•\t Keppel\tCorporation\n•\t MaritimeONE\n•\t Ministry\tof\tCommunity\tDevelopment,\nYouth and Sports\n•\t Media\tDevelopment\tAuthority\nof Singapore •\t Methodist\tWelfare\tServices\n•\t Ministry\tof\tDefence\n•\t National\tCouncil\tof\tSocial\tService\n•\t National\tHealthcare\tGroup\n•\t First\tCampus\tNTUC\n•\t Overseas\tUnion\tEnterprise\tLimited\n•\t PAP\tCommunity\tFoundation\n•\t Raffles\tMedical\tGroup\n•\t Resorts\tWorld\tSentosa\tSingapore\n•\t Sakae\tHoldings\tLimited\n•\t Sembcorp\tIndustries\tLimited\n•\t Sembcorp\tMarine\tLimited\n•\t Singapore\tHealth\tServices\n•\t Singapore-Industry \tScholarship\n•\t Singapore\tPower\tLimited\n•\t ST\tEngineering\n•\t Starhub\tPrivate\tLimited\n•\t Wilmar\tInternational\tLimited\nA student’s life isn’t just about academic excellence. It is about\nnew experiences and extracurricular activities that complete\ntheir education experience. In 2012, SIT students formed new\nfriendships and memories through various sporting events,\ntalks, and other enriching activities.STUDENT  LIFE\n26\n07 JANUARY 2012\nSIT WATER SPORTS\nCARNIVAL\nSIT’s Water Sports Carnival Organising Committee,\ncomprising students from NU, UNLV and UOG,\nbrought students from all the seven OUs together\nfor an afternoon of fun in the sun to promote\nwater sports and bonding. Our students\nexperienced Dragonboating and Kayaking along\nthe Kallang River.\nUndaunted by setbacks in his education path to\nbecoming an SIT scholar, Zhang Kai, one of our\nstudents from DigiPen Institute of Technology\n(DigiPen), shared his experiences and some\nwords of advice to students at Macpherson\nPrimary School. 03 FEBRUARY 2012\nMOTIVATIONAL TALK\n@ MACPHERSON\nPRIMARY SCHOOL\n06 JANUARY 2012\nSIT LAN PARTY\nOF THE YEAR\nSIT-DigiPen Student Management Committee\norganised our very own LAN Party of the Year\nat E2Max Cineleisure Orchard to bond SITizens\nthrough sharing of DigiPen’s gaming culture. It was\nan afternoon of fun and laughter as students and\nstaff competed through friendly game competitions\nand showed off their dance moves.\n27\n04 MARCH 2012\nOCBC CYCLE\nSINGAPORE 2012\n“OCBC Cycle Singapore 2012 - Community Ride\n(19km)”, was organised jointly by our Student Life\nand Human Resource Divisions to bring SIT staff and\nstudents together. The group started off at the F1 Pit\nBuilding, cycled to Bayfront Avenue, continued on to\nEast Coast Park and circled back to Raffles Boulevard.\n19 FEBRUARY 2012\nSURF N SWEAT 2012\n19 of our students represented SIT at Surf N\nSweat 2012 held on Sentosa’s Siloso Beach.\nGames included Surf & Run, Volleyball, Frisbee\nand Captain’s Ball. Our staff also showed great\nsportsmanship and joined in the fun.\nSenior Management (SM) Dialogue Sessions were\nheld with students from different OUs to share\nabout the developments in SIT. We used this\nopportunity to ask students how they were coping\nwith their studies, and also to gather feedback on\nany issues they might have encountered so far. 08, 09, 16 MARCH 2012\nSM DIALOGUES - NU,\nUOM & UNLV LEADERS\n24 MARCH 2012\nNO PAIN(T) NO FUN\nOrganised by the SIT-TUM Student Management\nCommittee, No Pain(t), No Fun Paintball took place for\nthe first time at Bottle Tree Park, Yishun. About 150\nstudents from all the different OUs showed up and\nfaced off in a game of wit and courage.\nFINANCIAL\nSTATEMENTS\n29\nSTATEMENT OF COMPREHENSIVE INCOME  30\nBALANCE SHEET  31\nSTATEMENT OF CHANGES IN FUNDS AND RESERVES 32\nSTATEMENT OF CASH FLOWS 33CONTENT\nIMPORTANT NOTE: The Financial Statements set out on pages 30 to 33 are extracted from Singapore Institute of Technology\n(SIT) Audited Financial Statements for the year ended 31 March 2012. It may not contain sufficient information to allow for a full\nunderstanding of the results and the state of affairs of the Company.\nFor further information, please refer to the complete audited Financial Statements published in the SIT official website at\nSingaporeTech.edu.sg.\n30\nSTATEMENT\nOF COMPREHENSIVE\nINCOME\nFOR THE FINANCIAL YEAR ENDED\n31 MARCH 2012\n2012\n$2011\n$\nRevenue 14,226,885 3,730,979\nOther income 500,488 15,931\nOperating expenditure\nStaff and related expenses\nDepreciation and amortisation expenses\nProgramme-related expenses\nRental and other facilities expenses\nOther operating expenses(10,830,401)\n(278,831)\n(26,443,907)\n(1,100,083)\n(3,688,939)(7,401,531)\n(137,677)\n(7,505,513)\n(1,082,108)\n(2,380,734)\n(42,342,161) (18,507,563)\nDeficit before government grants\nGovernment grants(27,614,788)\n33,366,684(14,760,653)\n21,823,361\nNet surplus and total comprehensive income 5,751,896 7,062,708\n31\nBALANCE\nSHEET\nAS AT 31 MARCH 2012\n2012\n$2011\n$\nASSETS\nCurrent assets\nCash and cash equivalents\nFees and other receivables\nOther current assets35,357,174\n4,342,027\n3,487,08413,643,366\n6,543,819\n2,417,365\n43,186,285 22,604,550\nNon-current assets\nProperty, plant and equipment\nIntangible assets\nStudent loans\nOther non-current assets6,877,204\n439,977\n26,459\n4,108557,692\n70,006\n-\n9,940\n7,347,748 637,638\nTotal assets 50,534,033 23,242,188\nLIABILITIES\nCurrent liabilities\nTrade and other payables\nGrants received in advance10,696,264\n18,560,1683,983,461\n11,217 ,225\n29,256,432 15,200,686\nNon-current liabilities\nDeferred capital grants 7,317,181 627,698\n7,317,181 627,698\nTotal liabilities 36,573,613 15,828,384\nNET ASSETS 13,960,420 7,413,804\nFUNDS AND RESERVES\nEndowment funds\nAccumulated surplus\n- General funds794,720\n13,165,700-\n7,413,804\n13,960,420 7,413,804\nFunds’ net assets managed on behalf of\nMinistry of Education 2,768,329 670,265\n32\nBALANCE\nSHEET\nAS AT 31 MARCH 2012 STATEMENT OF\nCHANGES IN FUNDS\nAND RESERVES\nFOR THE FINANCIAL YEAR ENDED\n31 MARCH 2012\nTotal\nfunds\n$\n2012\nBeginning of financial year\nNet surplus and total comprehensive income\nEndowment funds7,413,804\n5,751,896\n794,720\nEnd of financial year 13,960,420\n2011\nBeginning of financial year\nNet surplus and total comprehensive income351,096\n7,062,708\nEnd of financial year 7,413,804\n33\nSTATEMENT OF\nCASH FLOWS\nFOR THE FINANCIAL YEAR ENDED\n31 MARCH 2012\n2012\n$2011\n$\nCash flows from operating activities\nDeficit before government grants\nAdjustments for:\n- Depreciation and amortisation\n- Interest income\n- Donations\n- Loss on disposal of property, plant and equipment\n- Allowance for impairment of receivables(27,614,788)\n278,831\n(46,842)\n(450,000)\n1,291\n17,274(14,760,653)\n137,677\n(5,487)\n(10,000)\n-\n-\n(27,814,234) (14,638,463)\nChange in operating assets and liabilities\n- Fees and other receivables\n- Other current assets\n- Trade and other payables\n- Other non-current assets\n- Student loans(970,411)\n(1,069,719)\n6,712,803\n5,832\n(26,459)(2,127,787)\n(2,348,852)\n3,065,976\n124,433\n-\nCash used in operations\nDonations(23,162,188)\n450,000(15,924,693)\n10,000\nNet cash used in operating activities (22,712,188) (15,914,693)\nCash flows from investing activities\nPurchase of property, plant and equipment\nPurchase of intangible assets\nInterest received(6,526,666)\n(442,939)\n46,842(350,955)\n(37,156)\n5,487\nNet cash used in investing activities (6,922,763) (382,624)\nCash flows from financing activities\nOperating grants received\nDevelopment grants received\nOther grants and funds received47,150,212\n4,040,638\n157,90928,119,296\n1,132,956\n-\nNet cash provided by financing activities 51,348,759 29,252,252\nNet increase in cash and cash equivalents\nCash and cash equivalents at beginning of financial year21,713,808\n13,643,36612,954,935\n688,431\nCash and cash equivalents at end of financial year 35,357,174 13,643,366\nSingaporeTech.edu.sg\nFacebook.com/SingaporeTech"
}