{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-11/SIT%20Personal%20Data%20Complaints%20Procedure%20Nov%202024.pdf",
  "type": "pdf",
  "content": "Personal  Data  Complaints  Procedure\nLast updated: 1 November 2024\nSingapore Institute of Technology ( “SIT” ) processes personal data to support its functions as an\nautonomous university, including admission of candidates, teaching, research, administration,\nand student development.  For more  information  on how SIT processes  your personal data  in\naccordance with the Personal Data Protection Act 2012 ( “PDPA” ), please refer to our Personal\nData Protection Policy  (“PDPP ”).\nThis document does not apply t o requests for access  or correction  of, or withdrawal of consent\nrelating to , the personal data that you have previously provided to SIT. For  access,  correction  and\nwithdrawal  of consent  requests, please  use the relevant  forms  set out in SIT’s PDPP .\nWhat  to do if you have  a complaint\nIf you wish to lodge a complaint with SIT in relation to its handling of your personal data, please\nsend an email to SIT’s  Data  Protection  Officer  at dpo@singaporetech.edu.sg  and provide  us with\nthe information below.\na. The name of the SIT employee (including his/her department if available) whom you have\nbeen in contact with  and the nature of your relationship with SIT ;\nb. Full name  of the person lodging the complaint *;\nc. Telephone number ;\nd. Email address; and\ne. Details  of your complaint  which shall include but not be limited to the  nature of the issue, the\ndate on which you became aware of the issue, the timeframe  over which  the issue  occurred\nand the parties relevant and/or involved with the issue . You are also welcome to submit any\ndocumenta tion in support  of the complaint.\nThe information submitted by you is necessary for SIT to process your complaint. SIT will only\nuse the information submitted to identify you and to address your complaint. Any inaccuracies,\nerrors or omissions in the information submitted by you may result  in delays in processing or affect\nSIT’s ability to process your complaint. Should SIT require additional information to look into your\ncomplaint, SIT ’s Data Protection Officer will reach out to you for the same.\n*If you are submitting this complaint on behalf of another person, please send us documentary\nproof of your authority to act on behalf of that person. Please also provide us alternative contact\ndetails (if any).\nWhat happens after submitting your complaint?\nUpon  receiving  your complaint,  SIT’s  Data  Protection  Officer  will write to you to confirm receipt of\nyour complaint. The Data Protection Officer will also indicate when investigations into your\ncomplaint will be commenced , and provide  you with an estimate  of when SIT will provide an update\non your complaint.\nSIT is committed to completing investigations into complain ts within a reasonable timeframe.\nOnce investigations are complete, SIT’s Data Protection Officer will notify you  in writing  of the\noutcome of  investigation s and whether any remedial or disciplinary action has been taken against\nthe offending party. For the avoidance of doubt, where SIT’s investigations reveal that the complaint\nlodged is frivolous  or vexatious  in nature , SIT may exercise its rights of recourse against the\ncomplainant (s).\nWhat can you do if you are not satisfied with the outcome of investigations?\nIf you feel that your complaint has not been resolved satisfactorily,  you may appeal  for your\ncomplaint to be surfaced  to the members  of the Senior  Management  of SIT for resolution. This\nappeal must be submitted within  fourteen  (14) days of receipt of the written notice from SIT’s  Data\nProtection Officer on the outcome of the investigations into your complaint . Once SIT’s Senior\nManagement has concluded its review of your complaint, SIT’s Data Protection Officer will convey\nthe outcome of their review to you  in writing .\nIf you remain unsatisfied with the outcome of this round of review, you may appeal for your\ncomplaint  to be surfaced to the President of SIT for resolution. This appeal must likewise be\nsubmitted within fourteen (14) days of receipt of the written notice from SIT’s  Data Protection\nOfficer on the outcome of SIT’s  Senior Management ’s review of your complaint . Once SIT’s\nPresident has concluded his review of your complaint, SIT’s Data Protection Officer will convey\nthe outcome of his review to you in writing."
}