{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/When%20Support%20Comes%20Full%20Circle.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  10/16\nAt one point during her undergraduate studies, Ms Ailin Ng had contemplated\nleaving school altogether to take up a full-time job so that she could support her\nfamily. But thanks to the Mapletree Bursary, which she received in both Academic\nYears 2015/16 and 2016/17, Ms Ng can now persevere with her university education.\n“I no longer think about dropping out of school,” said Ms Ng, who is now in her final\nyear in the Accountancy programme.\nMs Ng was one of the recipients who were invited by Mapletree Investments to a\ntea session at their corporate headquarters in Pasir Panjang on 29 March 2017. The A group of undergraduates and alumni from the Singapore\nInstitute of Technology (SIT) recently volunteered at a charity\nexhibition opening and dinner, which were organised by\nthe Nanyang Confucian Association and The Kongzi Culture\nFund Ltd on 20 April 2017 and 22 April 2017 respectively.\nBoth were held in honour of notable philanthropist\nMdm Wong Mah Jia Lan’s 80th birthday.\nMdm Wong had in 2014 made possible the endowed\nWong Kwok Leong Bursary to nurture financially\ndisadvantaged students at SIT in perpetuity. A total of\nseven Wong Kwok Leong Bursaries have been awarded\nsince it was established.\nBoth events were held at the Singapore Chinese Cultural\nCentre and included the sale and auction of finger painting\nand various artwork and items from Madam Wong’s private\ncollection to raise funds for various charitable causes. SIT\nMapletree’s Firm Friendship\nEmpowers Young Talents  When Support\nComes Full Circle\nThank you, Mapletree! Prof Ng Siu Choon, Assoc Provost (Students),\nSIT (extreme right), and the recipients of the Mapletree Bursary\npresent a sweet treat to Mr Hiew Yoon Khong, Group CEO,\nMapletree Investments (second from right).Mdm Wong Mah Jia Lan (fourth from right) and Prof Tan Thiam Soon, President,\nSIT, (fourth from left) with several SIT students and alumni during the Charity Dinner.SIT students, Ms Dhyllis Lim (left) and Ms Lovevin Chia (right) with Mdm Wong\nMah Jia Lan at the opening of the Charity Exhibition.\nThe visitors from SIT also toured Mapletree\nInvestments corporate headquarters.\nCorporate donor’s forward-thinking philanthropy makes it possible for its\nbursary recipients at SIT to flourish and achieve their dreamsPhilanthropist Mdm Wong Mah Jia Lan auctions off\nher artworks to raise funds for charities – with some\nassistance from SITizens whom she has helped\nstudents and alumni, some of whom were recipients of the\nWong Kwok Leong Bursary, assisted with the exhibition\nopening, helped welcome guests and supported the stage\nceremonies during the dinner.\nThe guest of honour for the exhibition was Ms Sim Ann,\nSenior Minister of State, Ministry of Culture, Community\nand Youth & Ministry of Trade and Industry whereas Mr\nHeng Chee How, Senior Minister of State, Prime Minister’s\nOffice was the guest of honour at the dinner. Prof Tan Thiam\nSoon, President, SIT, also attended the charity dinner.\n“Helping out at these events was especially meaningful for\nme. It was inspiring to see how Mdm Wong’s philanthropy\nseemed to know no bounds as she donated all the red\npackets she received from the dinner guests to charity,” said\nMr Jeremy Wong, an alumnus from the Marine Engineering\nprogramme and a recipient of the Wong Kwok Leong Bursary.\ncompany had made possible the\nendowed Mapletree Bursary in\n2014, and to date a total of 22\nMapletree Bursaries have been\nawarded to 15 recipients.\nProf Ng Siu Choon, Associate\nProvost (Students), SIT, who\naccompanied the students\non their visit along with SIT\nfaculty and staff, remarked\nthat Mapletree’s willingness to\nsupport financially disadvantaged\nundergraduates from all fields of\nstudy and to continue nurturing\ndeserving students for more than\none academic year is “especially\nwonderful and far-sighted”.\nPursuing a degree in Game Design,\nMr Chua Kok Tung, another bursary\nrecipient, said that it has always\nbeen his dream to work in the\ngame industry or even start up his\nown studio as games had inspired\nhim when he was young.\n“The Mapletree Bursary has\nallowed me to spend more time\nworking on my game project that\nwill one day be a crucial part of\nmy portfolio when I enter the\nworkforce,” added Mr Chua."
}