{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20220510lhzb-7-minexercise.pdf",
  "type": "pdf",
  "content": "7分钟锻炼全身主要肌群\n包含12项动作的“7分钟运\n动”获科学验证，持续练习就能达到锻炼肌力、降体脂及提高胰岛素敏感度等功效。新加坡理工大学物理治疗系的副教授与学生分别受访讲解并示范各动作的练习重点，本周介绍前六个动作，下周介绍其余六个。\n示范学生：\n新加坡理工大学物理治疗系三年级学生：朱薇璟（左）和梁力宇。朱薇璟示范开合跳、靠墙深蹲、登阶上椅和深蹲；梁力宇示范伏地挺身和卷腹。\n① 开合跳\nJumping jacks\n做法：双脚与肩同宽，双手往上拍，同时跳一下，让双脚合并。接着，双脚跳回原来姿势，双手放在身侧。重复。\n穿着鞋子练习；双脚落地时\n尽量放轻；手脚动作要同步做。\n双脚落地时，膝盖不宜过于\n弯曲。★加快速度即可增加难度，想减轻难度就减速。② 靠墙深蹲Wall sit\n做法：双脚与肩同宽，背部贴着墙，膝盖向前，臀部与膝盖同高，像坐在无形椅上往后“坐”。\n膝盖弯度保持\n90度，膝盖与脚踝保持同个垂直面。\n膝盖不应往内\n弯（右图）。★如觉得吃力，臀部高度可以稍微提高。反之，手提哑铃，可增加动作难度。\n③ 伏地挺身Push-ups\n做法：双脚微微宽于臀部，肩部在手腕上方，身体维持直线。身体往下时，视线向着双手前方。接着身体往上撑，回到原来的姿势。\n练习时核心持续用力，臀部\n收紧，伸展小腿肌肉。\n臀部不宜翘高，以免给肩膀\n肌肉施压。★太吃力可改而让膝盖着地，双脚弯起。想加强难度，可同时背着装有重物的小背包。④ 卷腹Crunches\n做法：平躺，膝盖弯曲，双脚贴地，手往前碰膝盖上方，再回到原来位置。\n身体抬起时，核心用力，运\n用腹肌的力量。\n避免颈部弯曲，或错用手臂\n之力。★加速或是身体抬起的时间较长，即可增强难度；要减轻难度，可把手臂放在身体两侧。\n⑤ 登阶上椅\nChair step-ups\n做法：右脚踩上椅子，接着整个人站上去，右脚踩回地面，然后左脚落地。接着换左脚先上，重复练习。\n往上踩\n时，膝盖应该指向第二根脚趾。\n避免膝\n盖往内弯曲或朝外(右图)。\n⑥ 深蹲Squats\n做法：双脚与肩同宽，趾尖向前，像要坐椅子一样往后坐，再回到原来姿势。\n背部保持直线。\n意膝盖位置，避免给膝盖关\n节造成太大负荷。时间不够用，没空出外运动？其实只需七分钟，一\n张椅子，一面墙，就能好好锻炼全身主要肌群。　　“7分钟运动”（7-minute workout）共12项动作，每个动作持续做30秒，接着休息10秒，再换下一个动作，总时长即七分钟，是一种高强度间歇训练。　　12项动作包括：开合跳、靠墙深蹲、伏地挺身、卷腹、登阶上椅、深蹲、三头肌撑体、棒式、原地高抬腿、弓步蹲、伏地挺身加转体以及侧棒式。\n并非人人能完成所有动作\n新加坡理工大学副教授兼保健与社会科学课程总监孙智钦博士说：“有些动作需要一定的体能和肌力才能做到，所以并非每个人都能完成所有动作。如果平时可以完成日常生活活动，应该可以做这些运动，但每个动作能做几次，依照个人体能水平而异。”　　不过，如果无法做伏地挺身，或是平时爬楼梯会觉得吃力，那七分钟运动可能过于剧烈。孙智钦博士建议应先锻炼心血管适应能力以及手脚的肌力，锻炼方法包括快走以及使用哑铃。\n加强体力后再挑战组合训练\n从来没有运动习惯，运动前应咨询医生，并试做体能活动适应能力问卷（简称PARQ，适合15至69岁人士）。　　如果是运动初学者，或是长久以来久坐不动，不妨先练习个别动作。熟悉各动作的正确做法，也加强了体力，再挑战7分钟的组合训练，以免不小心受伤。　　“7分钟运动”已获科学验证— —根据美国运动学会（ACSM）在《健康与适能期刊》（Health Fitness Journal）发表的文章，只要做好这12项动作，就能达到锻炼肌力、降低脂肪以及提高胰岛素敏感度等功效。美国运动学会建议，一天可视体力重复几次，30分钟为限。 陈映蓁／报道\nyingzhen@sph.com.sg\n龙国雄／摄影\nSource: Lianhe Zaobao © SPH Media Limited. Reproduced with permission.Publication: Lianhe Zaobao\nDate: 10 May 2022\nHeadline: 7 minutes to exercise the main muscle groups\nof the whole body"
}