{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20220331bt-setsailwiththemarineandoffshoreindustry.pdf",
  "type": "pdf",
  "content": "THE marine and offshore (M&O)\nsector churns out mammoth\nships and platforms the size of\nskyscrapers, which for most\npeople, gives the impression of\na traditional industry with a high carbon foot-\nprint and heavy reliance on labour.\nYet when you see some of the shipyards\nin Singapore, you will see gleaming automa-\ntion such as robotic welding, digitalisation\nsuch as smart watches and equipment, the\nuse of solar power to power operations, and\neven a floating lab to testbed new energy\nsolutions. That is but a microcosm of the in-\ndustry’s drive towards sustainability and di-\ngitalisation.\nSpearheading the green charge is just one\nthrilling prospect in M&O. Not many know\nthat Singapore is a leader in many aspects of\nthis global industry. At the same time, M&O\nis a significant contributor to the local eco-\nnomy. The opportunities are vast as the\nocean.\n\u0000O\u0000n \u0000 \u0000t\u0000h\u0000e \u0000 \u0000g\u0000r\u0000e\u0000e\u0000n \u0000 \u0000w\u0000a\u0000v\u0000e \u0000 \u0000o\u0000f \u0000 \u0000t\u0000r\u0000a\u0000n\u0000s\u0000i\u0000t\u0000i\u0000o\u0000n\nThere is an exciting sea change happening in\nthe sector and Singapore is at the forefront.\nAs the world’s largest bunkering port\nserving thousands of ships yearly, we have\nthe unique opportunity to steer unpreceden-\nted change for the environment.\nIndustry leaders such as Keppel Offshore\n& Marine (Keppel O&M) are contributing to\nthe energy transition by driving the adop-\ntion of cleaner fuels. The Singapore com-\npany’s pivot towards cleaner energy has\nbeen in effect for about a decade, starting\nfrom Liquefied Natural Gas (LNG).\nLNG is a cleaner energy source to power\nships in place of traditional fossil fuels and\nSingapore has been actively developing the\ninfrastructure for LNG bunkering. Keppel\nO&M is the first to supply LNG to vessels in\nSingapore through its joint venture, FueLNG.\nKeppel is also developing Singapore’s first\ncomprehensive electric vessel supply chain,\nwhich will help decarbonise Singapore’s har-\nbour craft industry.\nAmid the uncertainty in the oil and gas in-\ndustry, such energy transition efforts are\nnot only a boon to the planet, but to the pro-\nspects of the M&O sector too. Singapore has\nblazed a trail in this aspect. Extensive re-\nsearch and development on alternative ship-\nping fuels such as ammonia and hydrogen is\nalready being carried out here. Keppel O&M’s\nFloating Living Lab, the first-of-its-kind float-\ning testbed in Singapore, will accelerate such\neco-conscious efforts.\nThe industry is also leveraging its expert-\nise to contribute to the renewables sector. In\nthe past 2 years, Keppel O&M has secured\nSS$1.3 billion worth of offshore wind pro-\njects such as substations and wind turbine\ninstallation vessels. A growing demand in\nplaces such as Taiwan will continue to pro-\npel demand for these projects. The market is\nexpected to contribute 25 per cent of Asia’s\ntotal market share for offshore wind by\n2025.\nAccording to a Rystad Energy report,\nglobal offshore wind expenditure is expec-\nted to grow at a compound annual growth\nrate of 11 per cent this decade and the mar-\nket will be worth US$126 billion by 2030.\nAs the world evolves, so does the M&O in-\ndustry. The industry has withstood the ups and downs over the past decades, adapting\nand continuing to meet the needs of the\nworld. Now, M&O is no longer just about\nshipbuilding,  but  supporting  the  fight\nagainst climate change.\n\u0000G\u0000o \u0000 \u0000g\u0000l\u0000o\u0000b\u0000a\u0000l\nThere’s literally a whole world of possibilit-\nies as more than 80 per cent of global trade\nvolume traverses the sea. Singapore’s stra-\ntegic location means much of this trade goes\nthrough our port. The nation’s relentless ef-\nfort to become a global port of call means it\nis connected to more than 600 ports across\n120 countries. In addition, offshore renew-\nable energy is expected to contribute signific-\nantly to the world’s electricity needs.\nWith a thriving maritime ecosystem that\nhosts the world’s biggest M&O companies, it\nis no surprise that the industry can thrive\nwith bright prospects.\nSingapore is thus a perfect launchpad for\ncompanies to serve global clientele. The\nM&O sector is a truly global one and our local\ntalent has clinched contracts in the farthest\nreaches.\nSome of Singapore’s small-and-medium\nenterprises are even global leaders in sub-\nfields such as crew boat building and equip-\nment manufacturing.\nOur technology, solutions and know-how\nhave been tested in the most extreme condi-\ntions of the North Sea and the Arctic region.\nIf you are looking for the challenge of creat-\ning solutions in remote areas, M&O gives you\nthe perfect platform.\nAs a global industry, there are also plenty\nof opportunities to work overseas, servicing\nmarkets that require local content such as\nthe US and Brazil. For instance, Keppel O&M\nhas a yard in the US building the first Jones\nAct (built and operated in the US) wind tur-\nbine installation vessel.\n\u0000U\u0000n\u0000i\u0000q\u0000u\u0000e \u0000 \u0000o\u0000p\u0000p\u0000o\u0000r\u0000t\u0000u\u0000n\u0000i\u0000t\u0000y\nThe M&O sector offers a dynamic environ-ment with a wide spectrum of career\nchoices. These include firms that specialise\nin maritime technology, law, transportation,\nship trading and finance, digitalisation and\nartificial intelligence, classification societies\nand regulators, and so on. Many people may\nthink of professions in the sector as mainly\nengineers involved in the construction of\nvessels, but that is only one aspect of it.\nIn Singapore, the ecosystem has grown\nfrom 4 domestic marine firms 50 years ago\nto more than 1,000 companies today. In\n2019, the sector accounted for S$11.5 billion\nin total output and employed more than\n75,000 workers. Human capital remains the\nmost crucial ingredient.\nIndustry leaders are highly cognisant of\nthis and many are personally involved in the\ninstitutes of higher learning to provide stu-\ndents with the best mentoring.\nInitiatives such as the Singapore Institute\nof Technology’s Integrated Work Study Pro-\ngramme, crafted in close partnership with\ncompanies including Keppel O&M, give pro-\nspective M&O professionals an unparalleled\ninside look into the industry. The cur-\nriculum is regularly updated with cutting-\nedge developments from the sector as SIT\npartners with M&O companies in areas such\nas digitalisation and decarbonisation. In-\ndustry leaders also give guest lectures to\nkeep students abreast of the sector’s trends.\nThe increasing use of technology, such as\naugmented reality, autonomous operations\nand digital twinning, will further appeal to\nthe young. The launch of the Marine and Off-\nshore Engineering Industry Digital Plan last\nyear will give the industry a boost.\nIn an engineering industry accustomed to\ngetting on with the job, perhaps it is time to\ncelebrate some of our successes and capture\nthe imagination of the next generation. The\nsea, after all, can be mesmerising.\nChris Ong is chief executive of Keppel Offshore\n& Marine, and Kenneth Low is an associate\nprofessor at Singapore Institute of TechnologyAs the world evolves, so does the M&O industry. It has withstood the ups and downs over\nthe past decades, adapting and continuing to meet the needs of the world. Now, M&O is no\nlonger just about shipbuilding, but supporting the fight against climate change. BT  FILE  PHOTOSet  sail  with  the  marine\nand  offshore  industry\nM&O  is  a  significant  contributor  to  the  local  economy,  the  opportunities  are  vast  as  the\nocean. BY CHRIS ONG AND KENNETH LOWPublication: The Business Times\nDate:\n31 Mar 2022\nSource: The Business Times © SPH Media Limited. Reproduced with permission."
}