{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-10/5%20-%20Shaping%20the%20Future%20of%20Robust%20Autonomous%20Vehicles%20with%20SIT.pdf",
  "type": "pdf",
  "content": "SIT Internal\nShaping the Future of Robust Autonomous Vehicles with SIT\nSIT invites you to join our groundbreaking research project focused on enhancing the\nrobustness of Autonomous Vehicle (AV) perception systems - a key area that ensures the safety\nand reliability of self -driving cars in real -world environments.\n• Innovative Defence Paradigm: Our research focuses on the Moving Target Defence (MTD)\nstrategy, a cybersecurity game -changer recognised by the U.S. Federal Networking and\nInformation Technology Research and Development (NITRD) Program. MTD represents a\ngroundbreaking approach to secure AV perception tasks on object detection, depth\nestimation, and semantic segmentation against adversarial attacks.\n• Industry and Academia Collaboration: In collaboration with researchers from NTU, this\nproject is funded by AI Singapore and strategically guided by DSO National Laboratories\nSingapore. This partnership ensures that our work has a direct and significant imp act on\nthe industry. Our strong ties with DSO, along with collaboration from academic experts\nat NTU, UIUC, CityU HK, and TU Delft, guarantee that the techniques developed will be\nboth practical for real -world AV systems and influential in advancing academ ic\nknowledge.\n• Significant Funding & Resources for AV Research: With over S$1.3 million in funding at\nSIT (S$4M for the whole project), our project is equipped with state -of-the-art resources,\nincluding multiple advanced GPU workstations and an EV testbed with latest Car bone\nLiDAR and cameras, which is used to test and refine the proposed solutions and any\nother research tasks related to AV perception system.\n• Real-World Impact: Beyond theory, this project emphasises real -world application. Our\nsolutions will be tested and deployed in DSO’s AV, competing in this AI Singapore grand\nchallenge to prove their effectiveness in real -world scenarios.\nJoin us at SIT to work at the forefront of AV technology and make a difference in the future of\ntransportation.\nSIT AV perception testbed & real -world test using DSO’s AV.\nPapers under this project so far:\n1. Dongfang Guo, Yuting Wu, Yimin Dai, Pengfei Zhou, Xin Lou, Rui Tan, Invisible Optical Adversarial\nStripes on Traffic Sign against Autonomous Vehicles, The 22nd ACM MobiSys, 2024. (Acceptance\nratio: 43/263=16.3%)\n2. Yuting Wu, Xin Lou, Pengfei Zhou, Rui Tan, Zbigniew T. Kalbarczyk, Ravishankar K. Iyer, Resilient\nAutonomous Driving against Learning -Based Action Space Attacks, under Journal review."
}