{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2020-10/Annual_Report_2017.pdf",
  "type": "pdf",
  "content": "ANNUAL REPORT 2017\n2017 has been a year of consolidation\nand growth as the university continues to\nestablish its reputation as a university of applied\nlearning. Our students continue to make waves\nas they head out into industry as part of their\nlearning, as well as give back to community\nby working together on various projects, all the\nwhile demonstrating the SIT-DNA traits. As we\nlook back on the year gone by, we are encouraged\nby the ever-deepening relationships being formed\nboth externally and within the university.\nThe interlocking hexagons symbolize dynamism\nand unity within a structured framework, with the\ninterplay of colours demonstrating how each\ngroup within the university works\ntogether to achieve common\noutcomes.\nABOUT SIT\n06 SIT at a Glance\n07 Organisation Chart08 Chairman’s Message09 President’s Message10 Senior Management 12 Board of Trustees14 Highlights of Key Events\nAN SIT EDUCATION\n26 Academic Year in Review27 Applied Learning at SIT30 Centre For Learning Environment &\nAssessment Development\n31 Professional Of ﬁ cers Division\n32 Our Overseas University Partners36 Our Polytechnic Partners38 Student Life44 SIT LEARN  Professional Development\nINDUSTRY & COMMUNITY\n48 Overview\n49 Career Services53 Technology, Innovation & Enterprise58 Community\nA ROBUST ORGANISATION\n62 Communications & Information Technology63 Corporate Governance & Board Committees65 Internal Audit\nA STIMULATING LEARNING ENVIRONMENT\n68 SIT@Dover70 SIT@Punggol\nFINANCIAL SUPPORT FOR STUDENTS\n74 Sponsorships & Scholarships75 Donor Acknowledgement\nFINANCIAL STATEMENTS\n77 Statement of Comprehensive Income78 Balance Sheet79 Statement of Changes in Funds and Reserves80 Statement of Cash FlowsCONTENTS\n2\n3\nABOUT SIT\n4\nABOUT SIT\nSingapore Institute of Technology (SIT) is Singapore’s university of applied learning. SIT offers degree\nprogrammes targeted at growth sectors of the economy with a unique pedagogy that integrates work and study. It also offers degree programmes in partnership with world-class universities.\nSIT aims to cultivate in its students four distinctive traits, or the SIT-DNA, which will prepare them to\nbe ‘thinking tinkerers’, who are ‘able to learn, unlearn and relearn’, be ‘catalysts for transformation’ while remaining ‘grounded in the community’.\nVISION\nA leader in innovative university education by integrating learning, industry and community.\nMISSION\nTo develop individuals who build on their interests and talents to impact society by providing a nurturing environment that is uniquely enriched by world-class partners.\n5\n5 STRATEGIC GOALS\n1\n2345To produce highly employable graduates who are adaptable to a fast-changing economy\nTo build a symbiotic relationship with industry and communityTo evolve sustainable and strategic partnerships with Overseas University partners\nTo be an innovative, dynamic and enterprising People Organisation\nTo develop a stimulating learning environment\nSIT AT A GLANCE\nNUMBER OF STAFF\n5 PROGRAMME CLUSTERSGRADUATE EMPLOYMENT SURVEY 2015\n11 OVERSEAS UNIVERSITY PARTNERS6 CAMPUSES44 DEGREE PROGRAMMES\nSIT@Dover\nSIT@NP BuildingSIT@NYP BuildingSIT@RP Building\nSIT@SP BuildingSIT@TP BuildingSIT Programmes\n12 SIT-OU Joint Degree Programmes21 Overseas University Programmes11\n12\n21\nNewcastle University\nThe Glasgow School of Art\nThe University of Manchester\nUniversity of Glasgow\nUniversity of LiverpoolPeriod\nFY2015\nFY2016Faculty\n115146Corporate\n300348\nMedian gross salary of  $3,055  across all degree programmesFull-time permanent\nemploymentOverall\nemployment rateWork in jobs related to\nﬁ eld of study90.5% 85.4%\n82.9%\nTrinity College Dublin\nTechnical University of Munich Massey University DigiPen Institute of Technology\nThe Culinary Institute of America\nWheelock CollegeEngineeringChemical\nEngineering\nand Food\nTechnology\nInfocomm\nTechnologyHealth\nand Social\nSciencesDesign and\nSpecialised\nBusinesses\n77ORGANISATION CHART\nPRESIDENT\nDEPUTY PRESIDENT\n(ACADEMIC) &\nPROVOST\nACADEMIC\nCLUSTERS\nPROFESSIONAL\nOFFICERS DIVISIONDEPUTY PRESIDENT\n(ADMINISTRATION) &\nCHIEF FINANCIAL\nOFFICER\nASSISTANT\nPROVOST\n(APPLIED\nLEARNING)\nCENTRE FOR\nCOMMUNICATION\nSKILLS\nCENTRE FOR\nLEARNING\nENVIRONMENT &\nASSESSMENT\nDEVELOPMENTASSOCIATE\nPROVOST\n(SKILLSFUTURE\n& STAFF\nDEVELOPMENT)\nSITLEARN\nPROFESSIONAL\nDEVELOPMEMT\nMOE\nWORK STUDYCOMMUNICATIONS\n& INFORMATION\nTECHNOLOGY\nESTATES\nFINANCE\nHUMAN\nRESOURCES\nLEGAL\nLIBRARYCAREER\nSERVICES\nGLOBAL\nEXPERIENCE\nTECHNOLOGY,\nINNOVATION &\nENTERPRISE\nADVANCEMENT\n& ALUMNI\nCORPORATE\nCOMMUNICATIONSSAFETY &\nHEALTH\nSTRATEGIC\nPLANNING &\nCOORDINATIONVICE PRESIDENT\n(INDUSTRY &\nCOMMUNITY)VICE PRESIDENT\n(PLANNING)INTERNAL AUDIT\nASSOCIATE\nPROVOST\n(STUDENTS)\nACADEMIC\nPROGRAMMES\nADMINISTRATION\nADMISSIONS\nREGISTRAR’S\nOFFICE\nSTUDENT\nLIFE(as at 1 April 2017)\n8CHAIRMAN’S MESSAGE\nIn FY2016, SIT continued to strengthen its reputation\nas a university of applied learning. Besides enhancing our academic offerings, we broadened and deepened our links with industry to ensure that our students are well-prepared to take on the challenges of a future driven by demographic and technological changes.\nAs we strive to ensure that the workforce of the future\nacquires the knowledge and skills to help them ﬁ nd\ngood jobs so that they can achieve their aspirations while ful ﬁ lling industry needs, SIT will continue to\nrespond and adapt to the changing landscape by regularly recalibrating our teaching methods to address technological disruptions.\nOn the national level, SIT continues to support the\nSkillsFuture effort through various programmes that involve both education and industry partners. The launch of our continuing education unit, SIT LEARN  Professional\nDevelopment, is yet another step towards creating a seamless learning environment where the line separating students and alumni becomes less distinguishable. For this, we are grateful to our numerous industry partners from government agencies, trade associations, MNCs and SMEs for their generous support and understanding as we chart new territory and our students begin to make their mark on industry, in particular, during their Integrated Work Study Programme (IWSP).\nOver the past year, the rise of Big Data, coupled with the\ngrowing population of students and staff, necessitated a revamp of our IT systems in order to empower senior management and staff to make more informed business decisions. I am pleased to note that the new Student Information System, a one-stop portal designed for students to access university-based information and services seamlessly, has been launched and, to support our expanding operations, more systems are being rolled out in phases.\nTechnological innovations and trends such as digitisation,\ndata analytics and robotics are transforming our economic landscape. To be an innovative university, SIT must adopt a visionary leadership stance. We need to be able to move rapidly to respond to change, and be cognizant of the new, evolving skills required for the different sectors earmarked for change under the Government’s Industry Transformation Maps.\nIndeed, as Singapore transforms, we will aim to do\nour part by working together with the community in Punggol to galvanise and de ﬁ ne the future Punggol\nDigital District. As plans for our campus in Punggol begin to take shape, our focus remains on creating and curating a space that is empowering yet welcoming, a ‘home’ for our students and hotbed of innovation for the creative, digital enterprises that will be co-located within our grounds.    I am heartened by the progress that our young university\ncontinues to make on various fronts. Looking ahead, I am conﬁ dent that our efforts will not only create an effective\npathway for more Singaporeans to ful ﬁ l their career\naspirations through innovation and lifelong learning, but that we help close the gap between job demand and supply in the future economy. While achieving all these goals is analogous to piecing together a massive jigsaw puzzle, getting the applied tertiary education piece right is certainly proving to be a game-changer for Singapore. I am con ﬁ dent that as SIT continues to progress, we will\ncontinue to rede ﬁ ne our nation’s educational landscape\nfor many more years to come.\nMR NG YAT CHUNG\n9In the past ﬁ nancial year, SIT continued to grow as a\nuniversity of applied learning. Guided by our vision and mission, we are con ﬁ dent that SIT is on the right track.\nOn the academic front, we continued to expand our\nofferings by converting existing degrees offered by Newcastle University to joint degrees, while introducing a new joint degree in Civil Engineering with the University of Glasgow. It is heartening to note that demand for our applied degree programmes continues to grow. Applications for AY2017 saw a new record high with nearly 14,000 applicants vying for about 2,600 places. These numbers clearly indicate that SIT’s programmes and initiatives are resonating well with potential students.\nSIT’s Integrated Work Study Programme (IWSP) is\nproving to be a success, with our Accountancy students blazing the trail and setting benchmarks for succeeding cohorts of SIT students to continue to impress their potential employers. Yet, far from resting on our laurels, we will continuously review and strengthen our nexus with industry to meet changing industry needs.\nLast year, we embarked on a number of important\nindustry collaborations. MOUs were inked with various key infrastructure players such as PSA and LTA and were aimed at producing graduates with the requisite skills to support advanced port technologies and local public transport manpower requirements. Similarly, agreements inked with other industry players such as Samwoh, Kiso-Jiban and DSM Nutritionals have paved the way for us to enhance our students’ learning journeys through the establishment of Industry Labs (I-Labs). These labs provide a real work environment for our students and strengthen our collaborations with these companies.\nOver the next few years, as we look ahead to the building\nof our new centralised campus in Punggol, leveraging on the support of our partners is crucial. This means working with the various government agencies and other key stakeholders, to realise the dream of creating a world-class campus that will provide a nurturing, enlightening and empowering environment for our students as well as the community.\nWe are already starting to make some inroads into\nPunggol with a few outreach activities involving students from various neighbourhood schools as well as residents. I am con ﬁ dent that as we ramp up our community\ninnovation initiatives, SIT will evolve to become more than just a good neighbour by the time we break ground.\nAs a university whose focus is on applied learning,\nwe are integral to SkillsFuture and our graduates will need to play their role to help shape Singapore’s future economy. To ensure this, we must continually stay ahead of the curve, and strive to align our academic offerings and faculty expertise with the ongoing transformation of industry.PRESIDENT’S MESSAGE\nPROFESSOR\nTAN THIAM SOON\n10Professor Tan Thiam Soon was appointed President, Singapore\nInstitute of Technology (SIT) on 1 February 2013. He was a Professor of Civil Engineering and held various positions including Vice-Provost (Education) and Dean of Admissions at the National University of Singapore. He is a registered Specialist Professional Engineer and expert on land reclamation and other geotechnical problems. A Colombo Plan scholar, he graduated from University of Canterbury (New Zealand) and obtained his Master’s degree and PhD from California Institute of Technology. Professor Tan sits on the board of Singapore Workforce Development Agency, and is a member of the Council for Skills, Innovation and Productivity (CSIP).PROFESSOR TAN THIAM SOON\nPresident\nProfessor Loh Han Tong joined Singapore Institute of Technology\n(SIT) as Vice-Provost on 2 September 2013, and was appointed Deputy President (Academic) & Provost on 1 October 2015. Prior to joining SIT, he was Vice-Dean of the Faculty of Engineering, Deputy Head of the Department of Mechanical Engineering, Director of Education in the Design Technology Institute Limited, and Director of Bachelor of Technology Programme in the Faculty of Engineering at the National University of Singapore. He was also a Visiting Scholar at Stanford University and a Fellow of the Singapore MIT Alliance. A Colombo Plan scholar, Professor Loh graduated with First Class (Honours) in Engineering from University of Adelaide, Australia. He obtained his Masters of Engineering from National University of Singapore and his PhD in Mechanical Engineering from University of Michigan under the NUS Overseas Postgraduate Scholarship.PROFESSOR LOH HAN TONG\nDeputy President (Academic) & Provost\nMr Chan Wing Leong was appointed Chief Financial Of ﬁcer\n(CFO) of Singapore Institute of Technology (SIT) on 1 July 2009. He assumed appointment as Deputy President (Administration) & Chief Financial Of ﬁcer on 1 January 2013, covering the\nadditional functions of estates, information technology, human resources and administration. Prior to joining SIT, he was Executive Chairman of Easycall Ltd, Chief Financial Of ﬁcer and\nPresident of New Businesses at Sembcorp Ltd, and was Chairman of Paci ﬁc Internet and Delifrance. Mr Chan graduated with First\nClass Honours in Economics from the National University of Singapore and joined the Administrative Service. He also worked at MINDEF companies and the Economic Development Board, before becoming an investment banker in Schroders and Bankers Trust in Singapore and Hong Kong. He currently sits on private and public-listed company boards, as well as boards of charities and institutions of public character.MR CHAN WING LEONG\nDeputy President (Administration) & Chief Financial Of ﬁcerSENIOR MANAGEMENT\n11Associate Professor Ivan B.H. Lee was appointed Vice President\n(Industry & Community), Singapore Institute of Technology (SIT) on 1 October 2015. He joined SIT in 2013 and has taught manufacturing operations, engineering design and entrepreneurship courses. Prior to joining SIT, he has over 27 years of experience in high-tech manufacturing, R&D, management and consulting. He also founded two start-up companies, BLC Solutions Pte Ltd in 2004 and TrueZ Pte Ltd in 2013. Associate Professor Lee graduated with a silver medal award from Singapore Polytechnic and obtained a First Class (Honours) in Engineering and PhD from the National University of Singapore.ASSOCIATE PROFESSOR IVAN LEE BOON HONG\nVice President (Industry & Community)\nMr Tsoi Mun Heng was appointed Vice President (Planning),\nSingapore Institute of Technology (SIT) on 1 April 2015. Before joining SIT, he was Director, Energy and Environment Research Directorate at National Research Foundation (NRF), and Director, Defence Industry and Systems of ﬁce at MINDEF. Mr Tsoi is\na Chartered Engineer in Aerospace Engineering and was also a Brigadier General with the Republic of Singapore Air Force. He graduated from the National University of Singapore with a Bachelor of Engineering (Mechanical) in 1986, and obtained his Masters of Science in Aeronautics and Astronautics from Stanford University in 1993.MR TSOI MUN HENG\nVice President (Planning)\n12PROFESSOR HENG CHYE KIANG\nTrustee\nSingapore Institute of Technology Appointed on 16 Sep 2015\nLum Chang Chair Professor\nSchool of Design and EnvironmentNational University of Singapore\nMS LAI WEI LIN\nTrusteeSingapore Institute of Technology Appointed on 1 Jan 2017\nDeputy Secretary (Policy)\nMinistry of EducationMS RACHEL ENG\nTrusteeSingapore Institute of Technology Appointed on 21 Mar 2011\nDeputy Chairman\nWongPartnership LLPPROFESSOR TAN THIAM SOON\nPresidentSingapore Institute of TechnologyAppointed on 1 Feb 2013\nDR LIM KHIANG WEE\nTrusteeSingapore Institute of Technology Appointed on 23 Sep 2009\nExecutive Director, CREATE\nNational Research FoundationMR NG YAT CHUNG\nChairman, Board of TrusteesSingapore Institute of TechnologyAppointed on 23 Sep 2009\nExecutive Director\nSingapore Press Holdings Ltd DR RICHARD\nCHARLES HELFER\nTrustee\nSingapore Institute of Technology Appointed on 23 Sep 2009\nChairman\nRCH International Pte Ltd\nBOARD OF TRUSTEES\n13MR ABU BAKAR BIN MOHD NOR\nTrustee\nSingapore Institute of Technology Appointed on 16 Sep 2015\nManaging Director\nKeppel SingMarine Pte Ltd\nMS TEOH ZSIN WOON\nTrusteeSingapore Institute of Technology Appointed on 1 Apr 2013\nDeputy Secretary (Development)\nMinistry of HealthMR NAGARAJ SIVARAM\nTrusteeSingapore Institute of Technology Appointed on 16 Sep 2015\nPartner\nAssurance ServicesErnst & Young LLPMRS MARGARET LUI\nTrusteeSingapore Institute of Technology Appointed on 16 Sep 2015\nChief Executive Of ﬁ cer\nAzalea Asset Management Pte Ltd\nMR WEN KHAI MENG\nTrusteeSingapore Institute of Technology Appointed on 16 Sep 2015\nSenior Advisor, Group Strategy\nCapitaLand LimitedMR T K UDAIRAM\nTrusteeSingapore Institute of Technology Appointed on 16 Sep 2012\nChief Operating Of ﬁ cer\nSheares Healthcare Management Pte Ltd\n14HIGHLIGHTS OF KEY EVENTS\nMAY 2016 JUNE 2016\nJULY 20165 March – 10 May\nSITLEARN  Professional\nDevelopment’s FirstOpen Programme\nThe ﬁ rst of its kind, Digital\nExperience Design Studio (DXDS) is an intensive course that engages participants in a hands-on, practical and reiterative process over a sustained period of learning. Led by SIT Assistant Professor Jawn Lim and co-taught by user experience (UX) practitioners from the industry, participants were coached on how innovation and digital experience design is currently being practised in the industry.\n11 May\nIWSP Preview: Sustainable InfrastructureEngineering (Land)\nThe ﬁ rst cohort of 67 SIT\nSIE (Land) students met with over 60 representatives from 14 participating companies at the Integrated Work Study Programme (IWSP) Preview. Employers were impressed that students had clear goals and were looking at the IWSP not as a short-term internship but as a long-term commitment leading to their future careers after graduation.\n12 May and 9 March 2017\nSIT Alumni Movie Nights\nOrganised by the SIT Alumni\nLeisure Network, the SIT Alumni Movie Night is always a popular event for alumni. Attendees were treated to the blockbuster movie ‘Captain America: Civil War’ in May, and the movie ‘Logan’ in March. The screenings, which were held at Bugis+ and preceded by a buffet dinner, gave attendees a chance to reconnect with fellow SITizens, SIT faculty and staff. 25 – 26 June and\n25 – 27 August SIT Student Orientation\nThe two camps welcomed more\nthan 1200 freshmen and gave students a great opportunity to bond with one another and their seniors from various degree programmes. Students were also introduced to the SIT-DNA traits – Thinking Tinkerers;\nAble to Learn, Unlearn and Relearn; Catalysts for Transformation; Grounded in the Community.\n1 July\nSAF Day Combined Rededication Ceremony 2016 (West Zone)\nSIT hosted the Singapore Armed\nForces (SAF) Day Combined Rededication Ceremony (CRC) for companies within the West Zone. The event was also supported by Naval Diving Unit, Republic of Singapore Navy, National Service Affairs Department and SAF. Over 420 guests from 31 organisations reafﬁ rmed their commitment\nto the defence of the nation. The event was graced by Ms Grace Fu, Minister for Culture, Community and Youth.\n10 – 19 July\nASEAN University Games\nThe 18th ASEAN University\nGames (AUG) was held in Singapore from 10 to 19 July. SIT, together with ﬁ ve other\nSingapore universities, collaborated to host this bi-annual regional competition. AUG welcomed a total of 1,900 athletes and of ﬁ cials from the\n10 ASEAN member countries\n15\nAUGUST 2016\n11 August\nIWSP Preview: Information and Communications Technology\nThe Information and\nCommunications Technology (ICT) Integrated Work Study Programme (IWSP) Preview was held for 68 ICT students going for their IWSP in 2017. Organised in a speed-networking format, the preview session was attended by 57 companies offering 350 job vacancies.\n27 August\nSIT Carnival\nMore than 1,800 freshmen\nand their families mingled with seniors, faculty and staff at the SIT Carnival. Apart from booths manned by student clubs and staff, performances and talks were also held to showcase the vibrancy and diversity of campus life at SIT.\n31 August – 15 October\nSingapore University Games\nSingapore University Games\n(SUniG) is the highlight of the local university sporting calendar. 252 SIT athletes competed in 19 sports, with the introduction of SIT’s ﬁ rst Basketball (Women’s),\nFootball (Women’s) and Tchoukball (Women’s) teams. Growing from strength to strength, the Football (Men’s) team beat NUS and subsequently SMU to clinch their ﬁ rst SUniG\nmedal, a respectable Bronze. and Timor Leste. SIT organised\nthe Football Competition and oversaw the Medical Functional Area. Two SIT students, Michelle Tan (SIT-TUM) and Justin Seah (SIT-UofG), represented Singapore in Volleyball (Women’s) and Swimming respectively.\n28 July\nFaculty & Staff Giving Roadshow\nThe Faculty & Staff Giving\ninitiative to support the SIT Bursary, one of the most accessible ﬁ nancial aid\ninstruments for undergraduates at SIT, was ﬁ rst introduced in\n2015. The third Faculty & Staff Giving Roadshow held in July 2016 at SIT@Dover campus, brought together SIT Bursary recipients as well as supportive SIT faculty and staff. Thanks to the collective giving by faculty and staff, as well as gifts from corporate and individual donors, the University has been able to award a total of 37 SIT Bursaries in AY2016/17 to deserving students. SITizens enjoyed youtiao  and otak-otak  at the\nthird roadshow, as well as coffee and tea served up by alumnus Ms Sharlene Sou, who runs a mobile coffee catering business.\n28 July\nMOU Signing with Association of Information Security Professionals (AISP)\nAt the of ﬁ cial opening of\nthe CREST Examination Facility at SIT, the Association of Information Security Professionals (AISP) and SIT signed an MOU to further collaborations in the areas of education, training and certiﬁ cations in Information\nSecurity.\n16HIGHLIGHTS OF KEY EVENTS\nSEPTEMBER 2016\n1 September\nSIT-NUS Collaborative Agreement Signing\nOn 1 September 2016,\nSIT inked its ﬁ rst Collaborative\nAgreement (CA) with the National University of Singapore (NUS), to jointly deliver courses for SIT’s Allied Health degree programmes. These are the Bachelor of Science degrees in Physiotherapy, Occupational Therapy, Diagnostic Radiography and Radiation Therapy.\nThe ﬁ ve-year collaboration\nentails the co-development and co-teaching of curricula, and pedagogical research. Lectures and tutorials will be held in SIT’s campus at Dover, and lab sessions will be conducted at nearby NUS. In addition, SIT’s faculty will co-teach Anatomy and Physiology modules with NUS.\n10 September\nKreta Ayer Community Outreach\nSixty SIT students brought\nsome cheer to the elderly residents of Kreta Ayer through some interactive games and simple exercises. The event also celebrated the 100th year anniversary of Chop Wah On.16 September\nAppreciation Lunch for Khoo Chwee Neo Foundation\nUndergraduates who\nparticipated in SIT’s Project Cambodia had an opportunity to showcase an example of student volunteerism at this appreciation lunch held by SIT for the Khoo Chwee Neo Foundation. The foundation’s chairman, Ms Peggy Goh, also met with the recipients of the Khoo Chwee Neo Foundation Bursary, which was established at SIT in 2016 with an endowed gift from the foundation.\n20 September\nAppreciation Lunch for Accountancy IWSP Industry Partners\nAn appreciation lunch was\nheld on 20 September 2016 at SIT@Dover to thank the 16 Accountancy Integrated Work Study Programme (IWSP) industry partners and to celebrate the successful completion of the ﬁ rst round of\nIWSP . Eleven of them partnered with SIT since the programme was launched in 2014 and have continued to actively participate in the IWSP journey with us. The event reinforced the university’s commitment to IWSP as well as reaf ﬁ rmed\nthe partnerships.\n20 September\nIWSP Preview: Accountancy\nFourteen companies and over\n40 representatives attended this IWSP Preview to meet 114 Accountancy students. Students found it a good platform to understand more about the various ﬁ rms and to network\nwith their potential employers.\n17\nOCTOBER 2016\n22 September\nAppreciation Lunch for Kewalram Chanrai Group\nThe Kewalram Chanrai\nGroup Scholarship is the ﬁ rst\nScholarship at SIT established speci ﬁ cally to nurture talented\nfemale undergraduates. The ﬁ rst three recipients of the\nScholarship had the perfect opportunity to personally thank Kewalram Chanrai Group Chairman, Mr Narain Girdhar Chanrai, who was invited to a special lunch hosted at SIT@Dover. The Group had made possible the Scholarship with an endowed gift to SIT in 2015.\n23 September\nCareer Peers Roadshow\nThe Career Peers Programme\nis a new initiative by Career Services, and was launched with a roadshow at the Academic Plaza foyer. The programme aimed at building a career-focused peer mentoring programme, to develop students who can contribute to the mission of SIT Career Services and to support SIT students in career development. October – March\nChillOut@SIT\nClose to 3,500 students and\nfaculty had a respite from their academic work at ChillOut@SIT, which was held at all the six campuses. Each ChillOut featured interactive games, live music and scrumptious food during lunch hour, allowing students and faculty to bond outside the classroom.\n14 October\nSIT-National Instruments MOU Signing\nSIT and National Instruments (NI)\nsigned a three-year agreement to train and groom telematics talent. NI will support SIT with training through the NI LabVIEW Academy programme, to enhance the learning and research experience of students. As the ﬁ rst university in\nSingapore to facilitate NI LabVIEW certi ﬁ cation at the\nundergraduate level, SIT welcomed the ﬁ rst cohort of\nSIT’s Bachelor of Engineering in Telematics (Intelligent Transport Systems Engineering) students in August 2016.\n15 – 17 October and\n24 – 26 February 2017 Leadership Development Programme\n140 student leaders participated\nin two camps, held at Kota Tinggi, Malaysia and Bintan. The programme aimed to develop their leadership skills and provided an opportunity for student leaders to interact and share ideas.\n18HIGHLIGHTS OF KEY EVENTS\nNOVEMBER 2016\nOCTOBER 2016\n4 November\nNew Alumni Welcome Party\nThe hottest party of the year\nfor new graduates drew more than 200 attendees when it was held at Hard Rock Café (Orchard Road). Revellers enjoyed a session with SIT’s very own student band ‘Muzeka’ and Hard Rock Café’s resident band ‘Jive Talking’. Also present were Dr Richard Charles Helfer, Board of Trustees; Prof Loh Han Tong, Deputy President (Academic) & Provost; and Mr Chan Wing Leong, Deputy President (Administration) & Chief Financial Of ﬁ cer, SIT.\nThe crowd was kept entertained with a lip-sync contest and a mentalist performance.\n7 November\nSIT-CSA MOU Signing at the National Security Conference\nCyber Security Agency will\ncollaborate with SIT on skills development and new initiatives designed to boost cyber resilience in Singapore. One key objective of this MOU is to enable SIT students to be more industry-ready upon their graduation.\n10 November\nSIT Scholarship Awards and Appreciation Ceremony 2016\nThirteen outstanding students\nwere awarded the prestigious SIT Scholarship. Recipients were selected based on various criteria including academic excellence and stellar co-curricular activities. Seven undergraduate students were also awarded the SIT Final-Year Scholarship and eight undergraduates from SIT-conferred degree 24 October\nDialogue with SITizens\nStudents at SIT had the privilege\nto interact with Prime Minister Lee Hsien Loong, who spoke at SIT’s inaugural ‘Dialogue with SITizens’ on the future economy. The event was attended by more than 500 participants consisting of students and staff from SIT as well as polytechnic principals and heads of SIT’s overseas university partners.\n26 October\nCommencement of SITLEARN  Professional\nDevelopment’s Process Safety Workshop Series\nThis series of eight continuing\neducation workshops was specially designed to help workers tasked with safety responsibilities gain the engineering and management expertise needed to safely operate a plant in Singapore. The ﬁ rst workshop held on\n26 October was attended by participants from P ﬁ zer, MSD,\nSano ﬁ  and Amgen. SIT LEARN\nProfessional Development aims to run this workshop series annually.\n26 October\nRecognition of Excellence\nThe second ‘Recognition of\nExcellence’ celebrated the achievements of SIT students and recognised donors whose gifts support student excellence through non-bonded scholarships and student performance awards. At the annual ceremony, 15 named scholarships were awarded to 35 students. In addition, 24 book prizes and three outstanding student awards were presented to recognise and encourage academic excellence.\n19\n17 – 28 December\nProject Vietnam\nSixteen SIT students participated\nin this service-learning trip to Hue City, Vietnam, in partnership with local Non-governmental Organisation (NGO) ‘Hearts for Hue’. They worked alongside local college students to install a new irrigation system for a kindergarten’s garden. Students also immersed themselves in the local culture, visiting households supported by a local micro ﬁ nance scheme.\n19 December –\n1 January 2017 Project Cambodia\nSixteen SIT students visited\nTrang Village, Phnom Penh, Cambodia as part of their service-learning trip in partnership with local NGO ‘Project Khmer H.O.P .E., Trang’. They conducted English lessons for the local children and helped to complete the building project for the local community school including renovating its kitchen and levelling the ﬂ ooring within\nits grounds.DECEMBER 2016\nprogrammes were awarded the SIT Mid-Term Scholarship. Since its inception in 2012, more than 150 deserving students have received these in-house scholarships.\n11 November\nMOU Signing with e2i and NTUC OPEC\nSIT signed an MOU with e2i\nand NTUC’s Labour Movement’s (LM) Oil, Petrochemical, Energy and Chemicals (OPEC) cluster during a seminar aimed to raise awareness of the new safety requirements for Major Hazards Installations (MHIs) under the Workplace Safety and Health Act. The three-year MOU aims to deepen skills and build a core pool of skilled professionals through development of training programmes such as workshops and masterclasses on Process Safety.\n19 November\nEstablishment of RCBJ Endowment Fund at SIT\nMembers of the Rotary Club\nof Bugis Junction (RCBJ) donated generously to enable SIT to establish the Rotary Club of Bugis Junction Endowment Fund to nurture undergraduates at SIT in perpetuity. This endowed fund supports the Rotary Club of Bugis Junction Scholarship and the Rotary Club of Bugis Junction Outstanding Students Award, as well as the Rotary Club of Bugis Junction Bursary at SIT.\n20HIGHLIGHTS OF KEY EVENTS\nJANUARY 2017\n14 and 15 January\nSIT Open House 2017\nHeld at the Suntec Singapore\nConvention & Exhibition Centre, the event attracted close to 5,000 visitors. The two-day event complemented the start of the 2017 Admissions Exercise and showcased three key elements of SIT – degree offerings, applied learning pedagogy and the ‘soul’ of SIT. Talks provided insights to prospective students on SIT’s industry-relevant degree programmes and information on the launch of SIT’s seven joint-degree programmes for AY2017. Student performances and activities added buzz to the event.6 January\nIWSP Preview: Hospitality Business\nThe event was organised for\nthe second cohort of Hospitality Business (HB) students. Attended by 120 students and 37 participating companies, the preview event also included Year 1 students who were about to embark on their Industry Attachment. As part of the event, a lunch networking session was also organised for the industry partners to interact with SIT faculty and colleagues.\n10 January\nSamwoh Corporation Cheque Presentation & SIT-Samwoh Collaborative Agreement Signing\nStudents from the newly\nlaunched SIT-UofG BEng (Hons) Civil Engineering programme would bene ﬁ t from the Samwoh\nCorporation Global Immersion Study Grant, thanks to an endowed gift of $500,000 made by Samwoh Corporation Pte Ltd. SIT also signed a Collaborative Agreement with Samwoh to establish an Industry Lab (I-Lab) to provide SIT students with early industry exposure and applied learning opportunities, in addition to work-study opportunities.13 February\nSIT-GovTech MOU Signing\nGovTech and SIT will share a\ncommon goal to develop and enhance the capabilities and competencies of students in the technology ecosystem comprising Institutes of Higher Learning (IHLs), and commercial entities through opportunities offered by the public sector to work on smart technologies.\n15 February\nSIT-DSM Collaborative Agreement Signing\nDSM Nutritionals, a global\nscience-based company active in health, nutrition and materials, signed a Collaborative Agreement with SIT to develop commercial and scienti ﬁ c opportunities for\nundergraduate students in the food technology sector.FEBRUARY 2017\n21\n16 February\nAppreciation Lunch for The Silent Foundation\nBoard members of The Silent\nFoundation, led by Mr Teng Ngiek Lien, its Founder and Executive Chairman, held a meeting at SIT@Dover before they were hosted to a lunch by Professor Tan Thiam Soon, President, SIT. The Silent Foundation has been supporting SIT students since 2015. The foundation made possible the Silent Minority Bursary, which was established at SIT to nurture ﬁ nancially-disadvantaged,\nminority Singaporean undergraduates in perpetuity. The lunch gave the Bursary recipients an opportunity to interact with the Foundation’s board members.\n21 February,\n10 March and 17 MarchSSO Appreciation Dinner/Sports Appreciation Dinner/Student Leaders’ Appreciation Dinner\nThree appreciation dinners\nwere held in recognition of the contributions made by the university’s student athletes and leaders. More than 500 students attended these events.\n22 February\nSIT-Kiso-Jiban Collaborative Agreement Signing\nA Collaborative Agreement\n(CA) signing with Kiso-Jiban Consultants Co Ltd will see students from SIT’s newly- launched Civil Engineering degree programme bene ﬁ t from early\nindustry exposure through the establishment of an Industry Lab (I-Lab). With the resources and expertise of Kiso-Jiban’s Soil and Rock Laboratory, SIT students can look forward to learn and engage in research in soil investigation,\ngeotechnical instrumentation and laboratory testing.\n23 February\nMOU Signing with LTA and INCOSE\nIn an effort to advance and\nbuild up Systems Engineering capabilities in Singapore, the Land Transport Authority (LTA), SIT and International Council on Systems Engineering (INCOSE) signed an MOU at the launch of Singapore Rail Academy (SGRA). The three-year MOU paves the way for LTA, SIT and INCOSE to develop skilled manpower in Systems Engineering to support the local public transport manpower requirements, and to prepare Systems Engineering graduates to be industry-ready.\n24 February\nSIT Graduation Ceremony\nSIT celebrated the graduation\nof its ﬁ rst cohort of students\nreading the SIT-conferred degree, with 82 graduands conferred with the Bachelor of Accountancy with Honours degree. About 420 guests attended this joyous occasion, which was graced by Guest-of-Honour Mr Ong Ye Kung, Minister for Education (Higher Education and Skills) and Second Minister for Defence.\n22\nHIGHLIGHTS OF KEY EVENTS\nMARCH 2017\n4 March\nInter-Cluster Games\nThe inaugural Inter-Cluster\nGames saw 305 students, faculty and staff competing in ﬁ ve sports. The Health and\nSocial Sciences Cluster emerged victorious and won the Provost Cup.\n3 March\nFirst SIT LEARN  Professional\nDevelopment Symposium\n4 and 5 March\nWorkshop: Mobility, Balance and Falls in Older Adults\nSITLEARN  Professional\nDevelopment successfully organised its ﬁ rst healthcare\nsymposium on Mobility, Balance and Falls in Older Adults. More than 40 participants attended the symposium from 14 healthcare organisations. Featuring guest speakers from various healthcare organisations in Singapore, the Symposium covered topics such as the epidemiology of falls and other pertinent issues.\nFollowing the symposium,\nSITLEARN Professional\nDevelopment organised its inaugural two-day physiotherapy workshop led by guest trainer Professor Dale Avers from SUNY Upstate Medical University. Through case studies and hands-on exercises, 34 participants comprising physiotherapists and physiotherapy aides learned to apply the principles of motor learning theory in interventions to improve balance of adults, from the very active to the frail elderly. 8 March\nReach For the Stars\nSIT’s annual ﬂ agship scholarship\ngala event saw close to 500 guests which included SIT Senior Management, senior polytechnic representatives, OU partners and scholars. Held at Raf ﬂ es City\nConvention Centre, it offered an opportunity for the scholars to network with their sponsors, thus af ﬁ rming the valuable\nrelationship between SIT and its industry partners. The night also showcased a video montage of scholars from different clusters – each with a unique story, from noteworthy internships to mid-career switch, all with support from their sponsoring organisations.\n10 March\nCareer Nexus 2017\nCareer Nexus 2017 was\norganised to enable NU, TUM, UofG and UoL graduating students to network with potential employers. It was well attended by 95 companies and 486 students. 45% of the companies participated for the ﬁ rst time and 56% of\nthe companies had hired SIT graduates as full-time employees before. As part of Career Nexus, there were career talks, alumni sharing and also ‘Recruiters in Residence’ mock interviews conducted by industry partners at the event.\n10 March\nMOU Signing with PSA\nDuring Career Nexus 2017,\nSIT signed an MOU with PSA Corporation Ltd to collaborate and develop talents for the industry. PSA will provide Integrated Work Study Programme (IWSP) opportunities for SIT\n23\nstudents reading the following\nprogrammes: Information & Communications Technology, Systems Engineering (ElectroMechanical Systems), Electrical Power Engineering, Sustainable Infrastructure Engineering, and Telematics (Intelligent Transportation Systems Engineering) programmes.\nThe MOU also paves the way\nfor SIT LEARN  Professional\nDevelopment to develop a 16-month part-time Systems Engineering training programme to equip over 90 of PSA’s employees with the competencies to design, develop and maintain complex integrated systems vital for PSA’s new generation of intelligent container terminals. To enable synergies between academic and industrial research, PSA and SIT will also collaborate on applied research projects to explore solutions to business problems.\n11 March\nSIT Information Sessions\nThe SIT Information Sessions\nwelcomed close to 1,200 prospective students and their families to SIT@Dover. The event provided an excellent opportunity for them to  learn about SIT-conferred and joint-degree programmes through a series of talks and counselling sessions on admissions, student activities and career prospects. It was a platform for Returning NSmen to network with professors, faculty staff and SIT students.\n11 March\nExpresSIT 2017 – The Throwback\nFor the second year running,\nSIT’s Performing Arts clubs – Muzeka, Just Singers, Dancesport, Soundbox and Vocalist Insight – collaborated to revive\nExpresSIT. The concert proved to be a roaring success with the audience captivated by a selection of dance and musical numbers featuring evergreen classics.\n17 March – 7 April\nIntroduction to Experience Design programme by SITLEARN  Professional\nDevelopment\nTwelve participants from\norganisations such as NETS, NCS and CapitaStar were led through seven sessions of interactive workshops and small group coaching to learn how to map the experience journeys of customers. Taught by SIT Assistant Professor Jawn Lim, this practice-oriented programme surveys human-centred research and design methods and prepares participants to be hands-on, practical and reiterative.\n28 March\nCXO Lean Summit\nThe CXO Lean Summit 2017\non 28 March was well-attended by more than 600 participants. Keynote speaker, Mr John Shook, Chairman & CEO of Boston-based Lean Enterprise Institute (LEI), shared on how lean leadership can be applied in organisations in today’s VUCA (volatile, uncertain, complex and ambiguous) world. Company representatives from Mount Alvernia Hospital and TPSC Asia Pte Ltd, who have embarked on Lean Transformation Innovation Centre (LTIC)’s Lean Skills Development Programme also shared their lean experience and journey.\n24\n25\nAN SIT\nEDUCATION\nACADEMIC YEAR IN REVIEW\nAPPLICATIONS VS INTAKE STUDENT PROFILE\nSIT PIONEER COHORT GRADUATIONAY2016/17 INTAKE BREAKDOWNMale\nSingapore\nCitizens\nFrom PolytechnicsFemale\nPRs\nEngineering\nInfocomm Technology\nDesign and Specialised Businessesapplications          intake\n364\n459\n519524693Chemical Engineering and\nFood Technology\nHealth and Social SciencesAY2015/16 9600\n207625592580\n(target)13,00014,000\nAY2016/17 AY2017/18\nStudents 82\nfrom AY2014 Intake\n24 Feb 2017Graduated on\nAS AT 3 OCT 2016, 9AM44.1%\n95.9% 2.4%\n94.8%55.9%\n27Applied Learning at SIT is de ﬁ ned as a pedagogy\nthat connects academic knowledge and skills with real world applications in industry and the community. SIT distinguishes itself by pioneering a distinct applied degree pathway that has a close nexus with industry. Its Applied Learning framework fosters the development of in-depth domain speci ﬁ c knowledge, industry readiness\nand transferable skills in its graduates who ‘know that’ and also ‘know how’ (Schwartzman and Henry, 2009). In essence, SIT integrates learning, industry, and community.\nSTUDENT-CENTRED APPROACH TO APPLIED LEARNING\nStudent-centred learning approaches such as experiential learning, ﬂ ipped classrooms, problem-based learning\nand integrative active learning methodologies lie at the heart of an Applied Learning philosophy. Curricula and courses are designed and developed by academic staff who are experts in their respective ﬁ elds. They play\na key role in facilitating students’ learning by providing the industry and community context. In addition, SIT ensures the relevance of its programmes by continually aligning curricula with evolving industry needs through consultation and collaboration with the industry. SIT students who undergo the Integrated Work Study Programme (IWSP) are immersed in the real working environment of industry for eight to 12 months to integrate what they learn in the classroom with industry practice.SIT’s Professional Of ﬁ cers, who are armed with extensive\nindustry experience, act as coaches and mentors to students during their IWSP , supporting them in their project work and in career development. They also support faculty and Technology, Innovation & Enterprise\n(TIE) division  in applied research projects that involve\nstudents and industry collaboration.\nTo further complement the student-centred approach,\npeers also play an important role in Applied Learning by offering constructive and critical feedback, which serves as a support system to help each other learn better.\nELEMENTS OF APPLIED LEARNING AT SIT\nw\nwAPPLIED LEARNING AT SIT\n28have had an in-depth understanding of the dimensions\nof applied learning, which includes active learning and proximity to industrial environment, industry projects and the Integrated Work Study Programme (IWSP) .IMBUING APPLIED LEARNING\nIn AY2016, the Centre for Learning Environment &\nAssessment Development (CoLEAD) deliberately embedded the applied learning concept into much of the work undertaken at the Centre.\nSIT’s applied learning environment aims to build a\nlearning culture that promotes developing a growth mindset, where students are willing to experiment and learn from their mistakes. Instead of looking for one right answer, students are encouraged to seek different\nways of solving a problem and consider the trade-offs that competing solutions may present. In doing so, SIT aims for its students to give and use feedback to further enhance their learning journey. The value of the SIT degree pathway lies in the coherence of the applied elements that permeate the character, curriculum and pedagogy throughout the whole institution.\nAPPLIED LEARNING AT SIT\nFaculty Development\nIn faculty development related programmes such as the Teaching Induction and Teaching Foundation programmes, content on applied learning is added to the curriculum to reinforce the importance of pedagogy to the academic staff. After the sessions, academic staff\nNon-destructive Testing Video Series\nby Associate Professor Edmund Liew,\nEngineering Cluster\nPharmaceutical Sciences\nVideo Series by Assistant\nProfessor Cheow Wean Sin,\nChemical Engineering and\nFood Technology Cluster\n29Media Production\nCoLEAD is also committed to promoting the practice\nof applied learning at SIT through media production. In one example, the team of media producers worked closely with faculty in creating ﬂ ipped classrooms\nwhere students read up on their materials prior to the lesson and spend time in class engaging on exercises, projects or other meaningful discussions related to the module. A series of online video tutorials were created for speci ﬁ c modules such as Non-Destructive\nTesting (NDT), Patient Care and Safety & Radiographic Positioning Terminologies. Instructional step-by-step videos of lab experiments were also ﬁ lmed as a visual\naccompaniment to existing lab manuals.Other Events\nThe theme for the faculty retreat held in May 2016 was ’Applied Learning‘. The retreat was one of the platforms used to reiterate the signi ﬁ cance of applied learning and\nto reach out to the faculty by sharing some examples of how the pedagogy was embedded at both the module and programme levels in SIT.\nIn collaboration with Career Services, CoLEAD organised\nthe ‘Integrated Work Study Programme (IWSP): Two Years On’ event on 29 November 2016. The objective of the event was to share with all SIT staff the journey of IWSP since its inception. The event also served to highlight the efforts of various divisions in putting together IWSP .\nGeneral Radiographic Practices\nby Ms Sng Li Hoon, Health and\nSocial Sciences Cluster\nPhysiotherapy Interview Case Studies\nby Assistant Professor Benjamin Soon, Health and Social Sciences Cluster\n30The Centre for Learning Environment & Assessment Development (CoLEAD) was established to develop positive\nteaching, learning and assessment practices that support the overarching educational vision of SIT. CoLEAD seeks to imbue good learning and teaching frameworks for all degree programmes right from the beginning, with clear intentions and directions to develop the SIT-DNA.\nMISSION\nCoLEAD has teams of learning designers and educational media producers who support the faculty’s learning needs in classroom teaching through the use of technology. Its mission is to:\nDevelop pedagogy based on\nIT-enhanced learning experience and promote\nan ICT-enabled learning environment.\nFacilitate academic staff\nin embracing and adopting good\nassessment design practices that\ndrive students’ learning and measure\ntheir ability reliably.Induct and provide on-going support\nfor faculty members in effective\nteaching and learning practice.\nDrive the learning outcome of SIT and\ndevelop the necessary assessment tool\nto realise it.\nEngage in and promote the\nscholarship of teaching and learning\nwithin and beyond SIT.\nCONNECT AND COLLABORATE WITH CoLEAD\nCoLEAD constantly reaches out and connects with academic staff to drive effective teaching and assessment practices in SIT. The infographic illustrates some activities that were put in place.CENTRE FOR LEARNING ENVIRONMENT\n& ASSESSMENT DEVELOPMENT\n31\nProfessional Of ﬁ cers Division (POD) was set up to\ncentrally manage SIT laboratory capabilities and resources, and provide mentoring to students during laboratory work, projects and Integrated Work Study Programmes (IWSP). POD also supports delivery of applied research outcomes to industry projects together with faculty. With their industry experience, Professional Ofﬁ cers (POs) support the functions of the division to\nenhance the applied learning experience for our students.\nTo date, POD has set up and operationalised\n42 laboratories for 15 SIT academic programmes’ laboratory teaching modules and project activities. Increased students’ usage of laboratories has created more opportunities for POs to interact and mentor students, as well as drive the sharing of SIT laboratory capabilities and resources. To meet the growing needs of new academic programmes, POD continues to be relentless in its effort to set up new laboratories and share existing resources, while maintaining a safe laboratory environment.\nOur POs continue to build on their role in mentoring\nstudents with their hands-on projects, and during IWSP for the following programmes in AY2016:\nAccountancy, Hospitality Business, Sustainable Infrastructure Engineering, and Infocomm Technology. The student-mentoring role of POs will continue to increase through more student-based projects, as well as more IWSPs for SIT’s degree programmes.\nIn the past year, 24 POs also supported faculty and\nworked on 22 applied research projects funded by Technology, Innovation & Enterprise (TIE) division and external funding agencies.\nPOD is also involved in the planning of laboratories in\nSIT’s future SIT@Punggol campus. A Laboratory Task Force, led by POD with members from SIT’s faculty, TIE and Estates divisions, was formed in January 2017 to map out the university’s strategies and principles for the new campus laboratories. POD is working closely with faculty to determine the technical requirements of the laboratories in the new campus. The preparatory work by different stakeholders enables SIT to have a purposeful engagement and collaboration with the Multidisciplinary Team (MDT) for the new campus. PROFESSIONAL OFFICERS\nDIVISION\n31Senior Professional\nOfﬁ cer Janet Tan (right)\nwith an Accountancy student during her IWSP stint, together with the student’s IWSP industry supervisor\nProfessional Of ﬁ cer Rajkumar\ns/o Abdul Rasheed Khan conducting\na laboratory session on\nNon-Destructive Testing (NDT)\nfor students in the\nSustainable Infrastructure Engineering\n(SIE) programmeStudents interacting with\nProfessional Of ﬁ cer Lee Yen Yen\nduring a Food Technology\nlaboratory session\n32\nOUR OVERSEAS UNIVERSITY\nPARTNERS\nDIGIPEN INSTITUTE OF TECHNOLOGY\nMR CLAUDE COMAIR\nPresident and Founder\n“We are delighted with our ongoing working relationship with SIT. I have\nfull con ﬁ dence that the collaboration will be instrumental in providing the\ninnovation and manpower needs for building a world-class interactive digital media and visual effects industry in Singapore. I believe that in the years ahead, our graduates will form a core group of professionals who will create world-renowned ‘Made-in-Singapore’ products for the global market.”\nNEWCASTLE UNIVERSITY\nPROFESSOR IAN POSTLETHWAITE\nFREng, CEO and Dean (Singapore)\n“Newcastle University is proud of its successful undergraduate teaching\npartnership with SIT. We are also proud of our strong research reputation, which gives our staff the knowledge and expertise to deliver courses that produce graduates ready to contribute to industry and their professions in a fast-changing, modern world. We are delighted to be working in Singapore and contributing to the country’s ambitions for continued economic growth and technological innovation.”MASSEY UNIVERSITY\nPROFESSOR JAN THOMAS\nVice-Chancellor\n“Massey University of New Zealand is proud to partner with the Singapore\nInstitute of Technology (SIT) and congratulates SIT on another successful year in the higher education sector.\nUnder an agreement signed in early 2016, Massey and SIT have, since\nSeptember 2016, jointly delivered our internationally-recognised Bachelor of Food Technology with Honours quali ﬁ cation at the SIT@Dover campus. The\nprogramme focuses on food product technology, combining food science, food engineering and food business. It educates and equips students with the fundamentals of food science and applied food technology skills required for global careers in the food industry.\nTogether, Massey and SIT are addressing one of the big issues the world faces\n– ﬁ nding ways to increase the production and distribution of nutritious and safe\nfood to meet the demands of growing global markets.”\n33TECHNICAL UNIVERSITY OF MUNICH\nPROFESSOR DR-ING. ULF SCHLICHTMANN\nChairman, Electronic Design Automation\nProgramme Director, Electrical Engineering and Information TechnologyDepartment of Electrical and Computer Engineering\n“TUM has partnered with SIT from the very beginning. It is a great honour for\nus to contribute to the excellence of engineering in Singapore, drawing on our tradition of German Engineering, and we remain enthusiastic about the chance to contribute to the establishment of a new university in Singapore. Our programme attracts students that cherish what engineering is – a great career opportunity that also allows students to continuously improve our world. We are looking forward to many more years of collaboration with SIT, and to many more SIT students experiencing Munich every year in their Overseas Immersion Programme.”\nTHE GLASGOW SCHOOL OF ART\nMR CHRIS HAND\nProgramme Director\n“The specialist design programmes and teaching at The Glasgow School of Art\nprepare our students for entry into the increasingly challenging and evolving world of creative industries. We encourage bold, critical and conceptual thinking and clear communication of ideas. Our graduates are skilled, con ﬁ dent and\nenabled to contribute to, as well as shape, current and future knowledge and creative economies – locally, nationally and globally.” THE CULINARY INSTITUTE OF AMERICA, SINGAPORE\nCHEF EVE FELDER\nManaging Director\n“The Culinary Institute of America – in collaboration with SIT – provides industry-\nrelevant education that meets the economic demands of our times. With a broad understanding of the emerging opportunities available to food business leaders globally, CIA and SIT prepare graduates to explore new ideas, innovate, and challenge the status quo in all aspects of the food world.”\n34\nTHE UNIVERSITY OF MANCHESTER\nDR JOHN COSTELLO\nAssociate Professor\nProgramme Director, BSc (Honours) Nursing Practice\n“The programme is near completion and our students are focusing on their\nend-of-course dissertation. This is a stressful time because the ﬁ nal piece of work\ncarries a lot of academic credit and is in ﬂ uential in achieving a good degree\nclassi ﬁ cation. The dissertation also represents the culmination of two years of\nhard work, perseverance and intellectual growth. Students should emerge from the programme not only book smart but also more aware of what SIT, UoM and the Singaporean nursing profession expects from them. As potential leaders, researchers, teachers, innovators and clinical experts of the future, there is a lot of pressure to do well. The pride of having ful ﬁ lled the requirements of\nthe programme should help them form the positive characteristics which the programme has helped them to develop. This huge academic achievement is made possible by support from friends and family as well as guidance from the combined teaching teams of SIT and UoM, who have worked together to help students reach their full potential. It has been my pleasure and privilege to have shared in this academic journey.”\nUNIVERSITY OF GLASGOW\nPROFESSOR ANTON MUSCATELLI\nPrincipal & Vice-Chancellor\n“This marks the seventh year of our partnership with SIT, and I am delighted to\nsee it going from strength to strength. Our new joint degree in Civil Engineering is another major step and a clear testament of the growing partnership between our two institutions. I look forward to building on this to further strengthen our relationship as the university continues to make a difference, preparing our students to play their full part in today’s and tomorrow’s world.” OUR OVERSEAS UNIVERSITY\nPARTNERS\nTRINITY COLLEGE DUBLIN\nASSOCIATE PROFESSOR JOHN GORMLEY\nTCD Academic Director for SIT programmes, School of Medicine\n“The programmes in Diagnostic Radiography and Radiation Therapy are now\nin their fourth year alongside the Physiotherapy and Occupational Therapy programmes in their sixth year. We have gathered such great experience from all concerned with positive feedback from students, graduates, and employers as well as the faculty teaching the programmes. Trinity College Dublin is delighted to continue its collaboration with Singapore Institute of Technology.”\n35UNIVERSITY OF LIVERPOOL\nDR LEON MOOSAVI\nDirector, University of Liverpool, Singapore\nSenior Lecturer, Department of Sociology, Social Policy and CriminologySchool of Law and Social Justice\n“In just a few years, the BA (Hons) Criminology and Security has grown from just\n40 students to almost 300 students. The teaching team has expanded from three to 12 and a new community has been born. We are pleased to continue this growth in partnership with SIT and look forward to more progress ahead. As the fourth year of the programme is drawing to a close, we can proudly say that the programme is ﬁ rmly established thanks to the hard work of many colleagues at\nUoL and SIT. The past year has also seen our ﬁ rst cohort of graduates and we are\nnow aiming to build up our distinct alumni network. Aside from introducing new modules speci ﬁ c to the Singapore programme, we are also hoping to implement\nnew opportunities for our students, such as enabling them to spend a semester in Liverpool. We continue to be delighted at being involved in something so meaningful and successful.”\nWHEELOCK COLLEGE SINGAPORE\nMS BETH FREDERICKS\nExecutive Director\n“As more and more countries commit to early learning as a priority essential to\ntheir economic and civic future, Wheelock College continues to provide highly-trained early childhood educators as a crucial building block for nations to remain competitive and dynamic. Our students are exploring in an increasingly complex, rapidly-changing world fuelled by technology and automation. The future will likely demand that our educators become original thinkers, creators, artists, inventors, and entrepreneurs. As the need for early childhood expertise grows across sectors – technology, media, museums/libraries, business – our graduates will be job creators, not job seekers who are willing to pursue and test new ideas, take risks, learn from failure, and share their ﬁ ndings.”\n36\nNANYANG POLYTECHNIC\nMS JEANNE LIEW\nPrincipal & CEO\n“SIT is a very valuable partner for Nanyang Polytechnic (NYP), as it provides our\ngraduates with opportunities for further studies in a wide variety of sectors, to meet their degree aspirations and deepen the skills they have been equipped with in NYP . The strong demand and growing number of applicants for SIT’s courses is indeed a testament to the value of an SIT education.”\nNGEE ANN POLYTECHNIC\nMR CLARENCE TI\nPrincipal\n“We congratulate SIT for achieving a high graduate employment rate in its recent\nsurvey. SIT has shown that it has given its graduates a great career head start, which in part can be attributed to its strong emphasis on real-world learning. At Ngee Ann Polytechnic, we share the same practice-oriented approach to learning. We are therefore con ﬁ dent that our graduates, who are adept at\napplied learning, will continue to do well in SIT.  We look forward to partnering with SIT to nurture professionals with the mindset and competencies to thrive in the future economy.”\nREPUBLIC POLYTECHNIC\nMR YEO LI PHEOW\nPrincipal & CEO\n“As institutes of higher learning, Republic Polytechnic (RP) and SIT share\na common objective in providing learning opportunities to all who seek knowledge and look to deepen their skills. The completion of the new SIT building in February 2015 on RP’s campus, provides a platform for SIT and its overseas university partner, the University of Glasgow, to prepare future-ready graduates who will drive our economy forward. As RP celebrates its 15th anniversary, we afﬁ rm our continued commitment to our partnership in education.” OUR POLYTECHNIC PARTNERS\n37SINGAPORE POLYTECHNIC\nMR SOH WAI WAH\nPrincipal & CEO\n“The nation-wide emphasis on skills-based training has made SIT, an institution\nthat seeks to integrate work and study, an attractive place for polytechnic graduates. SP will continue to partner with SIT to help young and adult students in Singapore deepen their skills and help transform Singapore’s economic landscape.”\nTEMASEK POLYTECHNIC\nMR PETER LAM\nPrincipal & CEO\n“SIT has enabled our polytechnic graduates to further their specialised training\nlocally. The outcomes have been heartening, with high graduate employment rates pointing to the value of the applied learning programmes SIT offers. Temasek Polytechnic looks forward to building on our strong partnership with SIT in ensuring that our youth are ready and able to realise their dream careers.”\n38STUDENT LIFE\nTAN WEI QIN, KEITH\nB (Hons) Hospitality Business, SIT\nPresident, SIT-HB SMC 2015/16\nI joined SIT- Hospitality Business (HB) Student Management Committee (SMC)\nwith the aim of bringing people together, forging strong friendships and creating memorable experiences. As part of the pioneer cohort of HB students, it was important to foster a sense of identity and belonging to SIT. I wanted to contribute to creating an inclusive environment where all students can work hard and play hard together.\nA key experience for me was #XperienceSIT16, the ﬁ rst outreach programme\nfor prospective students to visit the university campus and learn more about the degree programme from faculty members and current students. It was heart-warming and inspiring to witness everyone working towards a common goal, putting our best foot forward for prospective students. With strong support from SIT Student Life, the team was awarded “Outstanding Student Management Committee” at the 2016 Student Leaders’ Appreciation Dinner. At SIT, I learnt that anything is possible as long as one works hard for it.\nANG CIN YIN CRISTY\nBSc (Hons) Occupational Therapy, SIT\nTeam Member, Project Myanmar\nUpon joining SIT, I was thrilled by the wide variety of student clubs. Project\nMyanmar came across to me as a unique overseas community project that I had to sign up for. I had worked as an early childhood educator before joining the university and Project Myanmar provided a platform for me to exchange teaching knowledge with similar educators in another country. The eco-garden we built during the trip was such a rewarding experience, creating positive learning spaces within nature for the children at Canossa Home.\nParticipating in an overseas community project is not just about giving back to\nthe community. It involves the sharing of knowledge and culture with our hosts, learning to work through different situations as a team, and growing through a period of self-discovery. It was exactly what I wanted to experience as I began my journey as an undergraduate.\nAt SIT, I learnt that your university life is REALLY yours to create. There are many\nopportunities for one to learn new skills and develop into a more dynamic individual. As the university continues to expand and explore new initiatives, we should be open to being a part of it and never be afraid of setbacks.\nAt SIT, we venture forward with our students, creating transformative and exhilarating experiences in a diverse equal-opportunity campus.\nWe spark passion and vitality, and we strive to inspire a student community\nof change makers, innovators and leaders.\nHear what our students have to say:\n39\nMUHAMMAD HANAFIE BIN HALLIL\nBEng (Hons) Aerospace Systems, SIT-UofG\nPresident, SIT Muzeka\nAs a freshman, I was looking for an outlet that could help me cope with my\nanxiety. Singing and song-writing are my passion, so I chose to join Muzeka and Just Singers, student clubs in Arts & Culture. As I performed at several school events, doors began to open and I was soon performing at the annual ExpresSIT in 2016 and 2017.\nExpresSIT exposed me to the requirements and expectations of organising a\nsuccessful public event. The highlight of my student life, ExpresSIT gave me the opportunity to work with different people, explore and manage various music styles, and work within budget!\nAt SIT, I learnt that I would never know until I try. I was initially uncertain if I could\ngrow my talent in expressive art, but the team at Student Life and my peers continuously motivated and assured me that I could improve.  To me, SIT offers a conducive environment for students to be brave enough to try new things.\nCHUNG KA YAN\nBA (Hons) Interior Design, SIT-GSA\nVice President, SIT Rock Climbing Club\nI believe in reaching out to, and inspiring, new leaders, and sharing what\nI have learnt throughout my journey at SIT. By taking on a leadership role, I learnt things I never expected to. Everyone is different. And I appreciated the networking opportunities afforded by the Leadership Development Programme (LDP). When like-minded people get together, such as during LDP , exciting ideas come to life!\nSuch leadership opportunities taught me how to manage both time and people.\nIt has shaped me into who I am today. I have learnt to be more patient and seek solutions within tight deadlines. The friendships I gained along the way are so valuable to me. We each have our unique strengths and skills, and we can all bene ﬁ t each other through a marriage of our merits.\nAs you grow, it is important to pass on what you have gained from people who\nhave taught you along the way. It’s about reciprocity.\nKARTHIAYINI D/O SANTHA KUMAR V R\nBEng (Hons) Pharmaceutical Engineering, SIT\nHarvard Business Mentorship Programme Mentee\nI participated in the Harvard Business Mentorship Programme to learn more about\nmyself and how I carry myself when meeting someone for the ﬁ rst time. The\nfeedback given to me has been invaluable. Being a mentee on this programme has brought me closer to achieving my goals.\nTogether with the mentors, I worked on improving my teamwork, communication\nand leadership skills. The mentors provided advice that helped me shape my career path. Self-re ﬂ ection done during mentoring sessions gave me new insights on\nmyself and my strengths. As the saying goes, “You are better than what you think.” I grew more con ﬁ dent of myself and what I can offer to the industry.\nAt SIT, I learnt that, it is important to learn, unlearn and relearn in different situations\nand circumstances, to absorb valuable skill sets. I feel that SIT emphasises the importance of nurturing ourselves into con ﬁ dent young individuals who know what\nwe are capable of and doing our best wherever it may be.\n40SANDRA POESCHMANN\nBEng (Hons) Sustainable Infrastructure Engineering (Building Services), SIT\nAthlete, Canoeing\nI’ve always had a thing for water sports and I jumped at the opportunity to join\nSIT Canoeing. Little did I know that a leisurely and recreational activity turned into a competitive endeavour.\nRepresenting SIT alongside my teammates at the Singapore Canoe Marathon\n2016 was a key milestone for me. We trained hard as a team and all the determination and passion really paid off. Despite the common perception that canoeing is a tough sport, I realised that passion and determination give me the drive to strive. Be it sport or life in general, there will always be tough times, times that push you to the point of quitting. The desire to push on beyond that point is tremendously rewarding when all your hard work pays off.\nPursuing my sport has helped me focus on my academics too! Being a student\nathlete taught me valuable lessons which I apply to my studies, particularly the need for proper time management and goal-setting.\nSTUDENT LIFE\nMOHAMAD HADI BIN MOHAMAD NAJIB\nBSc (Hons) Physiotherapy, SIT-TCD\nPresident, SIT Floorball Club\nAt SIT, I learnt the meaning of true friendship and the value of humility. I was\npreparing for my ﬁ rst Physique competition and was juggling both physical\ntraining and studies. With lectures, tutorials, quizzes, on top of daily physical training, I felt extremely exhausted and struggled to keep up with my assignments. My friends never failed to spur me on, helping with little things like printing notes and buying food for me.  They were a pillar of emotional support. I believe true friendship is about being present. It involves empathy and being a friend’s anchor in times of apprehension and adversity.\nWhen the journey to achieve your goal becomes treacherous, and you feel like\ngiving up, friends remind you how strong you are, to even start the journey in the ﬁ rst place. My friends at SIT taught me that if you want to go far, go together.\nAU HOE WENG NICHOLAS\nBA (Hons) Criminology and Security, SIT-UoL\nPresident, SIT Community Service Club\nPrior to enrolling at SIT, I was working in the public service sector. Volunteerism\nwas an extension of my career and a signi ﬁ cant part of my life. The SIT Community\nService Club was the perfect space for me, as a student, to spend my time meaningfully, and with my peers.\nMy time as President of this Club was a life-changing experience. It was my ﬁ rst\nleadership role and it debunked many of my pre-conceived notions about what it takes to be a leader. It taught me that leading is more than just passing down instructions and getting things done. A little appreciation goes a long way, and I learnt to lead by empowering others, and validating everyone’s efforts.\nAt SIT, I learnt that no man is an island, and that there is (S)trength (I)n (T)eamwork.\nRegardless of how capable one is, there will always be tasks insurmountable without the assistance of others.\n41\n41\nAILIN NG HUI PENG\nB (Hons) Accountancy\nPresident, SIT Rotaract Club\nQuoting Colin Powell, “Effective leaders are made, not born. They learn from\ntrial and error, and from experience.” I decided to be the President of SIT Rotaract Club to learn and expose myself to new tasks and challenges.\nOne of my most memorable experiences was a visit to elderly residences\nwithin the Kaki Bukit neighbourhood. Those we visited do not have the ability to clean their own homes. One of the homes I visited had cockroaches in the refrigerator and bed bugs lying around. Nevertheless, everyone pulled together and managed to give the home a makeover.\nSuch experiences have given me the opportunity to learn more about myself\nand my abilities. They give me a sense of completeness because I am doing something meaningful for the community I live in. I also feel a sense of accomplishment whenever I see the smiles on their faces. In addition, I was able to build my self-con ﬁ dence, having worked with people from all walks of life.\nAt SIT, I learned that soft skills are extremely important regardless of academic\nachievement. No one is born an effective leader. Hence, I take every step to develop the necessary qualities, move out of my comfort zone and challenge myself.\nYEO XIN LE, GORDON\nBEng (Hons) Aeronautical Engineering, SIT-UofG\nAthlete, Ultimate Frisbee\nI was entrusted to coach the Ultimate Frisbee Team despite having no prior\ncoaching experience. With my playing background, I wanted to guide the team to greater heights. I believe the team helped me grow beyond my expectations, teaching me important values and priceless lessons. This journey gave me an unforgettable chapter in my life.\nI had faith that the team would create unexpected waves as the ‘underdog’. Our\nBronze medal win in SUniG 2015 was a rewarding end to the season. It assured the team that winning is always possible, and that we could deal with losses, draw lessons from them, be thankful and improve.\nA quote from André Gide, French author and winner of Nobel Prize in Literature\nin 1947, resonates with me. “One doesn’t discover new lands without consenting to lose sight, for a very long time, of the shore.” I, like many of my peers, took up a role I was unfamiliar with. The team and I adapted and overcame challenges. And we achieved. Thank you, SIT, for providing such a conducive platform for us to constantly stretch our limits.\n42STUDENT LIFE\nMOHAMAD NUR HAFIDZ BIN AHMAD FUA’AD\nBEng (Hons) Chemical Engineering, SIT-NU\nCommittee Member, SIT Just Singers\nI auditioned for SIT Just Singers in 2014. At ﬁ rst I thought this club was just\nsinging solo, not in a group. I was hesitant to go for practice after I was assigned as the bass singer for an Acapella group. My notes were ﬂ at and off and I found it\nhard to project my voice. I was quiet by nature too. Despite that, it was my peers in SIT Just Singers who brought out the best in me. Joining this club was about becoming a good singer and, more importantly, it was the fun and meaningful journey as a club which made me grow as an individual.\nSinging with my peers enabled me to de-stress from a hectic school life. I met\nstudents from different programmes, and, because I performed at several school events, I also overcame my fear of standing in front of a huge crowd.\nWhat resonates with me, when I think about my SIT experience, would be the\nfriendships I’ve made and the encouragement and support from lecturers. They had left a lasting, positive effect on me.\nI’ve changed as a person. I’ve grown from someone who doesn’t talk much and\nhas anxiety issues to a person who is more sociable and self-con ﬁ dent. Your\ngrades don’t de ﬁ ne you. What is essential is that you develop new skills and\nbecome a holistic individual, ready for the workforce. Throughout my three years at SIT, I have created wonderful and sweet memories.\n43\nCreating a Stimulating Campus Environment\nApart from activities and events that engage and integrate students, SIT also focuses\non creating an inclusive learning campus environment.\nIn 2016, the annual Student Experience Survey reported an overall student satisfaction rate of 89.9%.\nStudents were satis ﬁ ed with campus facilities, learning experiences and student support.\nStudent lounges have been\nset up in all six campuses. Students can access these lounges equipped with games, facilities, charging stations and rest areas.\nPantries were made available,\nwith fridge, microwave and toaster. Students can store their meals and heat them up any time. Vending machines stocked with drinks and snacks are also close by for a quick bite.\nIntroduced in February 2015,\n59 students have received refurbished laptops. This scheme has been such a success that SIT is reviewing how more students can bene ﬁ t and achieve their\nuniversity goals.“The lounge facilities allow me and\nmy friends to take a break from our\nhectic projects. The wide variety of\nentertainment in the lounge gives us a\nnew experience every time we step in!”\nRainier   SIT–NU\n“The pantry allows me to bring food\nfrom home as it is well-equipped with\noven, microwave, water dispenser,\nand refrigerator. Regular checks\nare conducted to ensure that the\npantry is in good condition.”\nGary   SIT–ICT\n“The laptop support scheme eases\nthe strain on ﬁ nances. My family and\nI do not have to worry about purchasing\na laptop for me to complete my\nassignments.  I’m grateful that SIT\nis always there to assist.”\nDanial   SIT–UofG\nHERE’S WHAT\nMADE THE DIFFERENCE AT SIT\nADDING VIBRANCY AND A POP OF COLOUR\nSTUDYING LATE, NO WORRIES\nLAPTOP SUPPORT SCHEME – LEARNING MADE POSSIBLEINCREASED SPACES FOR\nCOLLABORATION AND INNOVATION\n89.9 %\nStudent Overall\nSatisfaction 2016\n151\nStudy Benches13\nStudy Pods118\nDiscussion\nRooms\n6 Campuses\n44SITLEARN  Professional Development is SIT’s new\nlifelong learning unit, which was established to support Singapore’s national SkillsFuture movement. LEARN stands for Lifelong Education for Adaptability, Relevance and Nimbleness. SIT LEARN  Professional Development\ncaters to mature, working adults who are keen to upgrade their skills, and offers multiple pathways for individuals to gain access to higher education learning.Building on SIT’s reputation as the pioneer of the\napplied learning model for autonomous universities in Singapore, SIT LEARN  Professional Development’s\nprogrammes emphasise the integration of theory with hands-on application, and are co-taught by SIT faculty and industry experts.\nSITLEARN  PROFESSIONAL DEVELOPMENT OFFERS TWO MAIN TYPES\nOF PROGRAMMES: SITLEARN PROFESSIONAL\nDEVELOPMENT\nProgrammes for Individuals\nOpen programmes that comprise courses ranging from\none-day master classes to multi-week short courses offering individuals ﬂ exibility and options to develop\ntheir skills at different points in their careers.\nSITLEARN  Professional Development will also provide\nopportunities for individuals to take selected modules from a degree without having to enrol in a degree programme. By successfully ful ﬁ lling the learning and\nassessment requirements of these modules, they will earn credit units that can be stacked towards a degree or certi ﬁ cate at SIT.Custom Programmes for Organisations\nTailored to a company’s speci ﬁ c training needs,\ncustom programmes are the culmination of extensive consultation with the client organisation to understand their business context and capability development goals.\nCurrently, SIT LEARN  Professional Development is\nin discussion with several organisations and funding agencies in Singapore to develop niche, custom programmes for the industry. It is also working with various SIT faculty to roll out more open programmes in the second half of 2017.\n4545\n46\n46\n47\n47INDUSTRY\nANDCOMMUNITY\n48SIT is committed to building a symbiotic relationship with industry.\nThe tight nexus begins with developing SIT programmes through extensive\nconsultations and collaborative efforts with industry. SIT also caters\nto industry’s needs in manpower development and innovation through reskilling\nand upskilling programmes, as well as industry projects.\nOn the other hand, industry provides SIT students with real work\nexperience through the Integrated Work Study Programme (IWSP)\nand collaborative projects. This mutually bene ﬁ cial relationship is a key feature\nof SIT’s Applied Learning pedagogy that enables SIT to\nproduce graduates who are highly adaptable and employable.\nTRIPARTITE RELATIONSHIP – STUDENTS, ACADEMIC STAFF AND INDUSTRY\nAccess to manpower and\ntalent pipeline;Get innovative solutionto problemsOVERVIEW\nStay current and relevant to\nindustry through exposure to\nindustrial problems\nReceive authentic learning in an industrial setting\nwith real challenges\n49CAREER SERVICES\nCareer Services provides a myriad of activities such as\nCareer Nexus, networking events, workshops, industry talks and company visits to help students in their career development process. The division also works with the industry to secure opportunities for SIT’s Integrated\nWork Study Programme (IWSP) and students’ full-time employment.\nCareer Services coaches and guides students to plan\nand achieve career success. From exploring career options to identifying employment opportunities, students are equipped with the essentials to forge their career path. In the past year, Career Services worked with 970 students in career planning, resume review and interview coaching sessions.\nCareer Services also conducted 36 Career Success Workshops for 781 students. These workshops focused\non:\n• Job Offer Evaluation and Negotiation• Job Search Strategies in an Economic Downturn• Mastering Interview Skills• Networking Skills• Resume Writing• Succeeding in an Assessment CentreCONNECTING COMMUNITIES. EMPOWERING EMPLOYABILITY.\nCAREER READINESS\nGRADUATE TESTIMONIALS\nCALVIN TAN WEI KOON\nDesign Engineer, ST Kinetics\nNewcastle University, BEng (Hons) Mechanical Design and Manufacturing Engineering\n“Career Services organised workshops on resume, cover letter writing and\ninterview skills. I am thankful that they pointed out the areas for improvement in my resume and taught me the dos and don’ts in a job interview. I was con ﬁ dent\nduring my actual job interview and it landed me my current job.”\nTHAN WEI SIN\nIndustry Development Of ﬁ cer, Institute of Materials Research & Engineering, A*STAR\nUniversity of Glasgow, BEng (Hons) Mechanical Design Engineering\n“My career coach and I went through questions that could be asked in the\ninterview. It was like doing past-year exam papers before going for the real exam and it helped me to increase my con ﬁ dence. Apart from that, Career Services\nalso made me realise my strengths and passions, which guided me towards the direction of my current job.”\n50\nCareer Services also actively reaches out to industry to secure positions for IWSP . In the past year, Career Services\nfacilitated the recruitment cycle of four programmes:\n*programmes with pioneer batch of IWSP students\nCareer Services also secured 89 positions for the pioneer batch of 55 Year-One Hospitality Business students pursuing their Industry Attachment. A visit to RedMart,\narranged by the SIT Geeks Club and Career ServicesINDUSTRY CONNECTIONS\nINDUSTRY EXPERIENCE\nProgramme No. of IWSP\nStudentsTotal No.\nof Companies\nEngagedNo. of Companies\nwhich Provided\nIWSP Positions\nAccountancy 96 14 14\n*Hospitality Business 19 41 23*Sustainable Infrastructure Engineering (Land) 67 31 18\n*Information and Communications Technology\n(Information Security/Software Engineering)67 165 67\nTotal 249 251 122CAREER SERVICES\nCareer Services organises numerous networking\nsessions throughout the year where the key event is Career Nexus, a networking platform for graduating students and employers. In 2017, the division  organised four networking events for students and industry partners participating in the Integrated Work Study Programme (IWSP). The IWSP Preview is a platform to connect students with industry partners before commencement of the of ﬁ cial IWSP job application.\nIWSP Previews were organised for the Accountancy, Hospitality Business, Information and Communications Technology (Software Engineering) and Sustainable Infrastructure Engineering programmes, which involved 122 companies and 369 students. Over the last year, Career Services also arranged for\nvisits to companies such as DSM Nutritional Products and GovTech Hive. The visits gave students a glimpse into the working culture of the companies and how they operate.\nIn addition, Career Services organised industry and\nrecruitment talks by companies such as Singapore Power, Google, and Intercontinental Singapore. Students gained a clearer understanding of the companies’ hiring processes and had an opportunity to apply for full-time employment.\n51\nSTUDENT AND EMPLOYER TESTIMONIALS\nLEE XIANG HAN\nBEng (Hons) Sustainable Infrastructure Engineering (Land), Class of 2018\nRolling Stock Trainee, SBS Transit Ltd\n“During my IWSP , we were given the opportunity to see the workings of the\ncompany and how engineers carry out their daily tasks. When I started my IWSP , I didn’t have much knowledge about the industry and company culture. But along the way, not only did my con ﬁ dence improve, I also learned how to give\npresentations to my superiors. I managed to work well with my colleagues and adapt to the company culture. I gained deeper knowledge about trains too!\nIWSP has been an invaluable experience – one I could not have gotten from\nthe textbook.”\nJOSEPH TAN ZHEN HUI\nB. Accountancy (Hons), Class of 2016\nAudit Associate, KPMG\n“IWSP has allowed me to apply classroom knowledge to real-life audit work.\nFor example, modules such as ‘Company Accounting and Investment Analysis’ enhanced my understanding of ﬁ nancial reporting standards and ﬁ nancial\ninstruments used when performing audit ﬁ eldwork. Even the writing and\ninterview skills picked up in the ‘Career and Professional Development’ module are applied in my daily emails and interviews conducted with clients.\nIWSP has also given me opportunities to practise problem-solving skills to\novercome obstacles experienced during work. On top of that, I was able to pick up knowledge and skills that are outside of the curriculum and build my character so as to become a better team player and a competent auditor.” JOYCE CHUA\nFront Of ﬁ ce Manager, InterContinental Singapore\n“Unlike normal internships, students from SIT are put through two or three rounds\nof interviews, both with Human Resources and then again with the respective heads of each operating department. This allows both teams to gain a better assessment of candidates in order to determine their suitability of available placements. The process also enables employers to customise an on-the-job training programme for candidates.\nAnother unique feature of the IWSP is the accountability that the student has\nwhen they are here with us. Because of the duration of the programme, it allows us to customise the programme more intensively, where we can give them real accountability and real on-the-job objectives.”\n52\nCAREER MENTORINGCAREER SERVICES\nIn September 2016, Career Services launched the Career\nPeers Programme, a new initiative to develop students who can contribute to the SIT Career Services’ mission. The initiative provides a supporting role to the career coaches. Nine students were selected from a pool of 31 applicants through a rigorous selection process which\nincludes an Assessment Centre and interview. As part of their training and development, the nine\nstudents attended a suite of workshops including MBTI, Personal Branding & Promotion, Grooming & Business Etiquette, and Mentoring & Facilitation. They also supported events such as Career Nexus and IWSP Preview where they helped to host industry partners while gaining exposure to various industries in the process.\n53INDUSTRY & COMMUNITY INNOVATIONTECHNOLOGY , INNOVATION &\nENTERPRISE\nIn FY2016, Technology, Innovation & Enterprise (TIE) division continued to receive strong interest from faculty\nto embark on industry and community projects. The projects are complemented by TIE’s grant management scheme – Ignition Grant. The grant scheme helps to support projects, build capabilities, and allow faculty to remain relevant in the industry. Some 18 industry collaboration projects (involving 39 faculty members, 10 Professional Ofﬁ cers and 101 students) were awarded.\nASSISTANT PROFESSOR VICTOR WANG\nProject: Numerical Analysis and Optimisation of a Hollow Fibre Membrane Module\nIndustry Partner: Hy ﬂ ux Ltd\n“The Ignition Grant has allowed SIT faculty to kick-start a collaboration with\nHyﬂ ux. Through this, SIT has the opportunity to showcase our faculty’s,\nProfessional Of ﬁ cers’ and students’ ability to work on an industry-related\nproject. The grant has also allowed us to invest in design tools and resources that not only bene ﬁ tted the project, but also our students.”\nASSOCIATE PROFESSOR FUNG HO-KI\nDevelopment of a Novel Computational Plant Scheduling Tool for Factories in Singapore\nIndustry Partner: Tan Seng Kee Foods Pte Ltd\n“The Ignition Grant gave me an opportunity to manage an applied research\nproject, to better understand industry needs, and to nurture long-term collaboration with a local company. The project also provided me with excellent authentic materials to teach at SIT.”Here is some feedback from our faculty on the Ignition Grant:\nASSISTANT PROFESSOR ANDREW NG\nProject: Intelligent Aquaponics Automation System with Wireless Sensor Network\nIndustry Partner: Malaysian Feedmills Farms Pte Ltd\n“The Ignition Grant enables me to work closely with the industry partner,\nMalaysian Feedmills Farm, SIT students and staff on a challenging project. In particular, a smart and sustainable aquaponics – aquaculture and hydroponics combined – automation system that can increase livestock production and proﬁ tability, while reducing labour and operating costs.”\nASSOCIATE PROFESSOR INDRIYATI ATMOSUKARTO\nFace Detection, Tracking and Masking for Privacy Protection in Video Surveillance\nIndustry Partner: ST InfoComm\n“The Ignition Grant made it possible for us to kickstart the project and showcase\nSIT applied research capabilities to the industry, thus opening the door for other collaborations. The Ignition Grant bene ﬁ tted not only the industry and faculty,\nbut also gave opportunities for students to contribute to the project and apply what they have learned in class to real-world problems. We had two student helpers who presented their results to our industry partners that made them very pleased with their results.”\n54TECHNOLOGY , INNOVATION &\nENTERPRISE\nTHEMATIC TECHNOLOGY INNOVATION CENTRES\nBesides supporting broad-based applied research, there\nis also a need to build in-depth vertical components of the T-shaped model by focusing on key technology themes. One effort is to initiate Technology Innovation Centres (TICs) – specialised centres with deep expertise on industry needs.The development of technology competencies and TICs\nis strategic to SIT and allows for:\n• faculty to work with organisations looking\nfor innovative solutions for industry-specific  technological challenges;\n• faculty to initiate the development of technology\nclusters by identifying critical needs of the industry.\nIndustry\nProjectsAccess\nto\nStudents\nas\nTalents\nThematic\nTechnology Innovation CentresJobs &\nSkills\nTrainingPlatform for staff  to work closely\nwith the industry to stay relevant\nOpportunity for students  to learn in authentic environments\nTIE innovation activities to academic programmes\nBy forging partnerships with the industry, we are not\nonly building the university’s technical competency, but also establishing a symbiotic relationship with industry to make SIT the university of choice for industry collaboration and project work. This will, in turn, help\nstudents apply theory into practice and enable them to experience a truly authentic learning opportunity.\n55THE CATALYST\nSIT students being exposed\nto the ‘makers mindset’ and given the opportunity to build their own Masterpiece.\nCollaboration with other MakerSpaces\nThe Catalyst forged a partnership with One Maker Group\n(from National Design Centre) to leverage on external makers’ community, programmes and resources. The partnership would allow SIT students to be trained by external expert makers, participate in a diverse set of makers’ programmes, as well as gain access to a wider\nvariety of makers’ equipment in central Singapore during and after of ﬁ ce hours, and on weekends.\nThe Catalyst is our state-of-the-art MakerSpace for all\nSIT students and staff to share resources and knowledge, work on projects, network and build prototypes. The Catalyst is equipped with tools and machines to support building of prototypes using different kinds of materials such as wood, metal, plastics, leather and electronic components. The Catalyst also organises workshops and programmes to equip users with necessary skills.\nThe Catalyst also serves as a platform to facilitate\ncross-pollination of ideas, multidisciplinary project collaborations and sharing of technical expertise amongst like-minded SIT students and staff. Some of the projects supported by The Catalyst include:  • Fabrication of a sedimentation tank in the facility\nAssociate Professor Ryan Tay, Chemical Engineering\nand Food Technology Cluster\n• Design and develop a motion-sensing watching\neye which provides security-friendly features to  prevent vandalism.\nAssociate Professor Alfred Tan, Engineering Cluster\nTo equip SIT students and staff with prototyping skills\nand requisite safety knowledge in operating tools and machines, The Catalyst designed a training programme called ‘Ideas-to-Action’ workshop, where the workshop participants are empowered to let their ideas take ﬂ ight\nand be made into real prototypes. The workshops are structured in three tiers (bronze, silver and gold), with\nincreasing skill complexity. To date, The Catalyst has supported the creation of 17 prototypes with industry and community partners.\nIdeas-to-Action Workshop at The Catalyst\n56TECHNOLOGY , INNOVATION &\nENTERPRISE\nLEAN TRANSFORMATION INNOVATION CENTRE\nSIT Senior Management\nat the CXO Lean Summit 2017 with Chief Executive of Boston-based Lean Enterprise Institute, Mr John Shook (third from the left).To support local companies in their transformation\njourney towards achieving lean manpower growth, SIT, Boston-based Lean Enterprise Institute (LEI) and former-Singapore Workforce Development Agency (now known as SkillsFuture Singapore (SSG)) signed a Memorandum of Understanding (MOU) on 10 March 2016 to set up the Lean Transformation Innovation Centre (LTIC). LTIC is envisioned to be the focal resource centre for Small and Medium-sized Enterprises (SMEs) to acquire relevant knowledge, provide manpower training and also co-develop technological solutions that will help them to be more manpower-lean.\nTo date, LTIC has worked with seven companies in their\nlean transformation journeys through the Lean Skills Development Programme (LSDP). Designed to address business challenges and build lean capability within organisations, the LSDP equips company champions with lean knowledge, develops in-house problem solvers through lean improvement projects, and also co-innovates technological solutions. Lean projects undertaken include enhancing customer experiences, managing inventory, streamlining back-end of ﬁ ce\nprocesses and achieving sales targets.The LSDP is based on a new training method, known\nas ‘The Learning Enterprise Model’ whereby employees are trained in lean thinking and management skills while working on actual business challenges in their workplace with guidance from a Lean Coach and SIT faculty. As most parts of the coaching and training take place in the actual work environment, participants are able to acquire new skills and make relevant applications in their respective work context. At the same time, they can minimise work disruption during their training. This highly-contextualised learning strengthens the nexus between skills acquisition and utilisation.\nThe CXO Lean Summit 2017 held on 28 March 2017\nwas well-attended by more than 600 participants. The keynote speaker was Mr John Shook, Chairman and CEO of Lean Enterprise Institute (LEI). Mr Shook  shared on lean leadership application techniques in today’s VUCA (volatile, uncertain, complex and ambiguous) world. Company representatives from Mount Alvernia Hospital and TPSC Asia Pte Ltd, who have embarked on LSDP , shared their lean experiences and journeys, and how they cultivate sustainable lean culture in their organisations.\nMount Alvernia Hospital\nsharing their lean experience and\njourney during the Lean Skills\nDevelopment Programme (LSDP).\n57ENTREPRENEURSHIP ECOSYSTEM\nFY2016 saw an extension of early initiatives and continued development of the entrepreneurship ecosystem at SIT.\n57SIT students receiving a safety brie ﬁ ng\nbefore their Enterprise Immersion Programme in Kanazawa Institute of Technology, Japan.\nMr Benny Se Teo,\nFounder of Eighteen Chefs,\nsharing his entrepreneurship\njourney with SIT students\nand staff.\nNurturing a Global Mindset and Adopting Good\nPractices for Start-Ups\nFor the ﬁ rst time, students were required to undergo\ntraining in basic business skills in Singapore before they embarked on their study trip to one of several overseas locations to learn from local experts and observe how business concepts were applied in start-ups. Study trips included countries such as the Netherlands, Japan and China. Students were also given the opportunity to observe the best-in-class service excellence and business practices delivered by The Walt Disney Company in Shanghai and Tokyo.\nLearning from Experience\nEntrepreneurs such as Mark Lim from 3D matters, Melissa Phey from Daily Scoop and Benny Se Teo from Eighteen Chefs, were invited to share their start-up experiences with students. Students gained insights on the satisfaction and challenges that an entrepreneur faces at different phases of the entrepreneurial journey. Business owners had the opportunity to play their parts as role models to the students.Extending In ﬂ uence beyond SIT\nSIT helped Millennia Institute (MI) to place some pre-\nuniversity students interested in entrepreneurship, in four start-ups and small companies. These companies were Express in Music, ThinkersBox, Stirring Hearts and BWG Consulting. The students had the opportunity to meet with the senior management, understand the company operations, and participate in meetings during their attachment. They learned to appreciate the diverse roles of the management team and their daily activities in running the businesses.\nThrough its continued efforts, TIE was able to reap the\nfruits of its labour in building the SIT entrepreneurship ecosystem by incorporating ﬁ ve start-ups by students\nand alumni to date.\n58COMMUNITY\nCOMMUNITY INNOVATION\nTechnology, Innovation & Enterprise (TIE) division’s\nCommunity Innovation Learn & Act Programme (i-LEAP) provides the platform for students and faculty with the ‘innovating-by-doing’ experience that can impact the community through innovation. SIT faculty and students are change agents trained to apply their expertise and knowledge to create technology-based solutions to address issues through team-based collaboration with organisations within the community.Community i-LEAP thus offers support and opportunities\nto community organisations, social enterprises, start-up companies which have ideas, but often may feel held back in pursuing them due to their resource and capacity constraints. Community i-LEAP will integrate problem-solving techniques, ideation, design thinking, project work, and relevant local and overseas implementation trip through the ‘innovating-by-doing’ experience.\n59Completed Community Innovation Projects in FY2016:\nImproving Eldercare for Kwong Wai Shiu Hospital\nSIT-GSofA students and staff contributed several\ninteresting and innovative conceptual designs of a Community Café to encourage the elderly to socialise and age-in-place. The students’ ideas emphasised how an elderly-friendly design of an eldercare facility can play an important role in a patient’s recovery.\nPortable Bocce Court Design for Movement for\nthe Intellectually Disabled of Singapore (MINDS)\nSIT-UofG students and staff embarked on a community\ninnovation initiative with MINDS to tinker, design and build a portable Bocce court, using TIE’s ‘The Catalyst\nMakerSpace’ facility. The prototype could potentially solve MINDS’ logistical problem of gaining access to public venues to train their special-needs teams in Bocce sport to compete at the Special Olympics Competition.\nThe SIT team used tough plastic trunking material\nto form the frame of a portable Bocce court to give a balance to the structural strength against the weight of the frame. Simple stainless steel locks were used to hold individual modular sections together, thus allowing enhanced portability during assembly and dismantling of the frame.\nWhy art? Art has always been used as a tool for therapy to help people\nexpress their feelings and communicate well with their friends. Studies\nshow that art therapy can enhance communication, brain function and social interaction for the elderly and dementia patients. Visual art can trigger dormant memories and emotions, inspiring conversations\namong these patients who normally struggle to express themselves.\nIn this community cafe, painting is introduced as a fun activity where\npatients will be able to express themselves through the different colours to create an artwork. It also provides young and older family members\nto interact through the activity. Imagine a grandchild ﬁnally having a chance to connect with a grandparent who was not too long feeling  depressed and hopeless.\nThe design elements in the newly designed cafe are simple and clear\nto help the elderly patients be at ease and familiar with the environment. The concept of home gives a sense of peace where the elderly may feel comfortable where they can reminiscence about the time when they are\nback at home having conversations with their family and doing activities together.COMMUNITY CAFE\nExpressing emotions through art\nlegend\n1 PANTRY\nscale     1:501\n2\n32\nA small kitchen where\nlight snacks and drinks are prepared by the caretakers\n2 Common area\nChilling area for snacks and\nsocial interaction between the patient and their family\nmembers\n3 ACTIVITY AREA\nCenter area of the cafe. A bright coloured peg\nboard is installed to create a sense of visual hierachy in the space to help the patients to differentiate spaces in the cafe.\n2 13\nJOEL TAM\n60\n61\nA ROBUST\nORGANISATION\n62COMMUNICATIONS &\nINFORMATION TECHNOLOGY\nThe Communications & Information Technology (CIT) division\nwas set up in 2010 to cater to the IT needs of SIT. During SIT’s transition to becoming an autonomous university (AU), CIT gradually upgraded and replaced original stand-alone systems with more integrated IT solutions, which provided a user-friendly and highly ef ﬁ cient network infrastructure to\nenable collaborative environments for working and learning. CIT’s organisational structure also evolved, especially in the areas of Academic Applications, Enterprise Applications, IT Infrastructure, End-User Computing, as well as IT Governance & Security.\nThe core IT strategy is to move all systems into integrated\nsolutions and fully adopt cloud computing and technologies, thus making SIT the ﬁ rst AU without a data centre. The IT\nsystem was closely devised with other key groups, such as Academic Group, to ensure that the learning environment was fully technology-enabled with a state-of-the-art wireless and network access environment. In addition, CIT continues to adopt robust IT security protocols and controls, provide end-user support and manage tight, but appropriate IT governance structures.\nIn 2013, CIT commenced sourcing for the implementation of\nenterprise-wide systems to build a sustainable IT system that would take SIT well into the future. With much coordinated efforts, the university completed its enterprise resource planning (ERP) implementation in November 2016 – known as the SAP ERP (S-PORT) system that replaced the Finance and HR systems.\nThe Student Information System, known as In4SIT, is the\nsecond system which is signi ﬁ cantly larger in scope and\ncurrently being implemented. It is based on the Oracle Campus Solution system that aims to replace and enhance IT needs for academic-based systems over the entire student life cycle. Phase 1 of In4SIT was successfully launched in January 2017, in time for the 2017 Admissions Exercise, with subsequent phases scheduled for launch by December 2017.\nThe above-mentioned ERP systems will form the backbone\nof the IT enterprise software at SIT. Over time, new business information reporting systems and speci ﬁ c application\nsoftware will be incorporated over the ERP core. CIT is currently moving all university-wide applications and servers to cloud computing platforms and technologies, starting with Microsoft’s cloud-based Of ﬁ ce365 and eventually extending\nto S-PORT and In4SIT.\nSIT has further deployed technology-enabled learning tools\nfor the teaching of modules through online platforms with a cloud-based Learning Management System (LMS). xSiTe is the system used as the teaching and learning platform. Besides generic IT laboratories that serve the needs of commonly used software, programme-speci ﬁ c computer laboratories have\nbeen set up with appropriate software to simulate a real work environment.\nIn the network environment, SIT’s IT policy deploys connectivity\nthat facilitates seamless work linkages for both staff and students with high bandwidth wireless connectivity and a\nvirtual private network. This connectivity enables staff and students to work anywhere and anytime, with strong streaming capabilities. SIT’s network environment is protected by a series of processes and controls in several layers of IT security and governance. New, emerging and frequent IT threats call for the university to remain vigilant against intrusion access and possible loss of data. SIT’s IT policies also fully support the Personal Data Protection Act (PDPA) to ensure data protection.\nAn IT steering committee, called the ‘SIT IT Committee’,\nwas formed in 2015 to oversee all IT strategies, policies and operations in the university. The committee is chaired by the Deputy President (Administration) & Chief Financial Of ﬁ cer,\nwith the involvement of key personnel from the academic and industry & community groups. The committee also monitors the progress of IT projects, discusses emerging needs and resolves con ﬂ icting demands, with the aim of sustaining an\nIT environment that is complementary in nature within the university, and not duplicated at any point. The committee also places attention to change management, training and regular communication on changes to IT systems.\n63Introduction\nSIT was incorporated in September 2009 as a Company\nlimited by guarantee under the Companies Act (Cap. 50). It is an Institution of Public Character (“IPC”) under the Charities Act (Cap 37).\nSIT is governed by the Singapore Institute of Technology Act\n(Cap 299B). Its key constituent document is the Memorandum and Articles of Association which states that the purpose of the University is to promote and undertake the advancement of education by providing educational facilities and courses of study in all ﬁ elds of knowledge, promote and engage in\nresearch and scholarships and establish, operate, promote and maintain the University as a going concern.\nGood corporate governance is the cornerstone of a well-\nmanaged University which is, in turn, critical to SIT’s performance and operations. The focus of its governance framework, on which the University’s vision, mission and core values are formulated, promotes accountability and transparency and is manifested in the composition of the Board of Trustees (“Board”) and its Committees, division of powers and duties between the Board and Management, adoption of checks and balances and sound measures for internal and corporate controls.\nGovernance Evaluation Checklist\nThe University adheres to the Code of Governance for Charities and Institutions of Public Character (“Code”). The University has complied in material aspects with the principles and guidelines set out in the Code. Where there are departures from the Code, these are explained under the relevant sections of the Annual Report or the Governance Evaluation Checklist (“GEC”).\nAccording to disclosure requirements imposed by the Charity\nCouncil, Ministry of Culture, Community and Youth, all IPCs are required to publicly disclose their compliance with the Code. The University’s GEC is made available on the website of the Charity Portal at www.charities.gov.sg.\nBoard of Trustees\nThe Board is the highest governing authority of the University and comprises 13 Trustees, chaired by Mr Ng Yat Chung. The Board oversees the business of the University, ensures  that it acts in accordance with its objects, that its funds and assets are properly accounted for and safeguarded and provides guidance and stewardship to Senior Management, conferring regularly with them. The Board is accountable to the Minister for Education, Singapore for its acts and decisions.\nThe Trustees are eminent persons of good repute, sound\njudgment who possess collective competencies in areas such as the public and private sectors, academia, accounting  and\nﬁ nance,  law,  information  technology,  strategic  planning,\nlogistics, healthcare and hospitality management and industry knowledge. New Trustees will continue to be selected and invited to serve on the Board on the basis of the diversity oftheir experience, skills, knowledge, abilities and insight from\ntime to time to ensure constant refreshing of the Board. The Trustees’ names and designations appear on pages 12 – 13 of the Annual Report.\nThere is an objective decision-making process, which allows\neach Trustee to exercise his or her own independent judgment. The University has established ﬁ nancial authorisation and\napproval limits for operating and capital expenditure, the procurement of goods and services, the acquisition and disposal of assets and making investments. The Board approves the annual budget, the use of operating reserves and annual audited ﬁ nancial statements of SIT, amongst other\nresponsibilities.\nThe Board is supported by seven Board Committees formed\nin accordance with Article 53 of the Articles of Association (“AAs”), namely the Academic Advisory, Audit, Campus Development, Finance, Investments, Partnership Approval and Remuneration Committees. Each Board Committee has clear Terms of Reference setting out their role, authority, powers and matters requiring their approval.  The list of Board Committees is on page 64 of the Annual Report.\nBrieﬂ y, the responsibilities of the Board Committees  are\ndescribed as follows:-\n(a) The Academic Advisory Committee advises the Board\non all academic strategies, policies and issues.\n(b) The Audit Committee oversees and reviews the\nUniversity’s internal controls, integrity of its ﬁ nancial\nreporting, legal and regulatory risks, enterprise risk  management, internal and external audit functions.\n(c) The Campus Development Committee assists the\nBoard in maintaining oversight of the campus  development policies and any other matters related  to the acquisition, commissioning and management of signi ﬁ cant physical assets or facilities.\n(d) The Finance Committee provides oversight of the\nUniversity’s ﬁ nancial policy management.\n(e) The Investments Committee oversees the investment\nof the University’s endowment and surplus funds.\n(f) The Partnership Approval Committee assists the Board\nin the review of the ﬁ nancial and legal viability of SIT’s\nacademic partnerships between the University and its  overseas university partners.\n(g) The Remuneration Committee provides independent\nadvice, oversight and policy guidance in employee  compensation matters.\nEach Board Committee comprises Trustees with appropriate\nquali ﬁ cations and skills and there is a fair distribution of\nresponsibilities amongst the Trustees. Where required, non-Trustees who have experience in their respective areas of expertise are invited to provide advice to the Board CORPORATE GOVERNANCE &\nBOARD COMMITTEES\n64Committees to enhance the process of decision making.\nThe Board is kept informed of the key matters discussed at each Board Committee meeting.\nManagement of the University\nThe President of the University, Professor Tan Thiam Soon, is appointed by the Board and is the Chief Executive Of ﬁ cer\nand the University’s academic and administrative lead. He is responsible to the Board for the conduct, co-ordination and quality of the programmes of the University and its future development. He is empowered with the authority to perform all acts which are necessary to implement the policies, procedures and actions of the Board. As a liaison between the Board and the University, the President is tasked with the responsibility of informing each party of the views and concerns of the other, relating to the programmes and administration of the University. He also arranges for the annual budget of the University to be presented to the Board annually for approval as part of his duties.\nThe pro ﬁ les of other members of the Senior Management of\nthe University can be found on its corporate web page and in\npage 10 – 11 of the Annual Report.\nConﬂ icts of Interest\nThe Trustees and staff are required to act in the best interest\nof the University at all times. Policies have been developed to prevent or manage situations where con ﬂ icts of interest could\narise, by promoting integrity and ethical business conduct.\nThe AAs contain provisions for the management and avoidance\nof con ﬂ icts of interest by members of its Board of Trustees.\nSuch provisions  include:(a) Per mitting a Trustee to be interested in any\ntransaction with the University provided that the Trustee has declared the nature of the interest to the  other Trustees of the Board as required under the  Companies Act of Singapore and complied with the  provisions of AAs to abstain from voting on any matter related to the  transaction,\n(b) Permitting a Trustee, or a ﬁ rm associated with the\nTrustee, to act in any professional capacity for the  University and to be remunerated for the provision of professional services, and\n(c) Permitting a Trustee to be reimbursed for out-of-\npocket expenses, travelling and other expenses properly  incurred by the Trustee in attending and returning from  meetings of the Board of Trustees, any of its committees,  or any general meeting of the University or otherwise in  connection with the affairs of the University.\nThe AAs also state that Trustees shall not receive any\nremuneration for services rendered by them as Trustees.\nThe University has implemented a Con ﬂ icts of Interest\nPolicy which all staff must comply with. In accordance with that Policy, staff must ensure that their private activities and interests do not con ﬂ ict with their professional obligations to\nthe University. Where there is a potential con ﬂ ict of interest,\nthe staff is required to submit full disclosure and request for an appropriate exemption. The University will grant such exemptions at its discretion. In addition, staff are required to declare their compliance with the University’s prevailing policy on con ﬂ icts of interest annually.CORPORATE GOVERNANCE &\nBOARD COMMITTEES\nInformation correct as at 7 June 2017BOARD COMMITTEES\nBoard Committee Member Board Committee Member\nAcademic Advisory\nCommitteeChairman: Dr Lim Khiang Wee\nProf Heng Chye Kiang Prof Tan Thiam SoonInvestment Committee Chairman: Mrs Margaret Lui\nMr Ng Yat ChungDr Chia Tai Tee (Co-opted)\nAudit Committee Chairman: Mr Nagaraj Sivaram\nMs Teoh Zsin WoonMr Abu Bakar Bin Mohd NorPartnership Approval\nCommitteeChairman: Ms Rachel Eng\nMr Abu Bakar Bin Mohd Nor Ms Lai Wei Lin\nCampus Development\nCommitteeChairman: Dr Richard\nCharles HelferMs Teoh Zsin Woon Prof Heng Chye Kiang Mr Wen Khai MengRemuneration\nCommitteeChairman: Mr Ng Yat Chung\nMs Lai Wei LinDr Lim Khiang Wee Mr T K Udairam\nFinance Committee Chairman: Mr T K Udairam\nMrs Margaret Lui Mr Wen Khai Meng\n65INTERNAL AUDIT\nInternal Audit provides independent, objective assurance\nand consulting services designed to add value and improve the university’s operations. Internal audit activity is guided by a value-driven philosophy of partnering with other departmentsto enable SIT to meet its business objectives. Our key role\nis to assist Management in evaluating their risk management, control and governance processes so that business objectives can be met.\n66\n67\nA STIMULATING\nLEARNINGENVIRONMENT\n68SIT@DOVER\nIn addition to planning for the new Punggol Campus, SIT has completed the refurbishment of various teaching\nfacilities at SIT@Dover for Academic Year 2017.\nHealth Sciences Laboratories and Clinics\nCompleted in September 2016, these laboratories consist of one computer laboratory, an HDB mock-up unit, three Teaching Clinics and two Anatomy laboratories for the programmes in the Health and Social Sciences (HSS) cluster. Adopting the common labs approach, the labs are shared among the four-year Allied Health and Nursing programmes. They were designed to be ﬂ exible\nand serve multiple uses so as to cater to the diverse needs of the different programmes.\nFor an authentic learning experience, equipment in these\nlabs are of medical grade, similar to systems found in the local healthcare sector. Real-size and high-quality\nanatomical models are provided and an Anatomage Table, currently the most technologically-advanced anatomy visualisation system, is placed in a dedicated lab allowing students to learn at their own pace.\nOne of the Teaching Clinics is an HDB mock-up unit\ncomplete with a kitchen and is used for practical lessons such as learning Activity Analysis. This Clinic is suitable for experiential learning, whereby young children are brought in for students to conduct assessments on.\nTelematics Programme – Transportation Systems Laboratory\nCompleted in September 2016, this lab caters to the curriculum for the Bachelor of Engineering with Honours in Telematics (Intelligent Transportation Systems Engineering) and Sustainable Infrastructure Engineering (SIE-Land) programmes.\nThe equipment in this lab is partially funded by Land\nTransport Authority (LTA) through the Public Transport Manpower Development Fund (PTMDF), on subsidies\nfor specialised training facilities and on-seed grant for programme development. To develop and train railway and transport engineering manpower, this lab will be used to conduct practical hands-on sessions for Telematics and SIE (Land) programmes using simulation tools for railway engineering simulation and public transport modeling.Anatomy Lab Anatomage Table Teaching Clinic\n69Civil Engineering Laboratory\nThis Civil Engineering Laboratory consists of an\nEnvironmental lab, Hydraulics lab, Geotechnical lab and Structural Mechanics lab, all of which are housed in one location. Completed in January 2017, the ﬁ rst lesson\nfor this laboratory will commence in September 2017.\nFood Pilot Plant\nFood Technology Programme - Food Pilot Plant\nCompleted in January 2017, the new laboratory was designed and constructed to meet the needs of the SIT-Massey University joint degree programme in Food Technology.\nThe Food Pilot Plant boasts the latest state-of-the-art\nequipment for:\n1. Bakery & Pasta2. Beverage & Ice Cream3. Fermentation4. Extrusion5. Canning, retort & meat processing6. Freezing & freeze-dryingStudents will gain valuable hands-on experience in\nfood technology during product development in this laboratory.\nCivil Engineering Lab (to be ﬁ tted-out)\n70SIT@PUNGGOL\nMasterplan\nIn 2014, SIT engaged WOHA Architects Pte Ltd (WOHA)\nthrough an open competition to masterplan the 18.6 ha of land with a view towards creating a campus for 12,500 full-time undergraduate students. WOHA, a Singapore-based architectural practice, gained global recognition for their integration of environmental and social principles at every stage of the design process, and their best-knownprojects have been widely publicised as benchmarks for sustainable design. The SIT masterplan aptly embraces a rainforest tree metaphor where there will be distinct, self-sustaining layers with their own unique environment and ecosystems. The SIT Masterplan studies were completed in Q3 2016.\nStakeholder Engagement\nA Campus Development Taskforce (CDTF) comprising Estates, Finance, and the Strategic Planning & Coordination divisions chaired by VP (Planning) was set up to gather input from internal stakeholders and formulate requirements for the masterplan studies. Six Campus Themes – namely Way ﬁ nding; University Workplace;\nLiving Spaces; Public Realm; Building & Infrastructure; and Info-enabled Campus – were conceived to develop vision statements and strategies for the new campus. Three special groups were also formed to focus on the future library, sustainability and smart technologies. Theinternal stakeholder engagement process was a rigorous\none that involved both the faculty and the administration staff across all clusters and divisions; where appropriate, students were also roped in. The discussions have been progressing well, and the various groups were invited to present their ﬁ ndings and recommendations to the\nCampus Development Steering Committee (CDSC) chaired by President, SIT, with a view to crystallising the requirements for the new Campus to the design consultants by Q3 2017. (Left and Centre) Artist Impression of SIT@Punggol | (Right) 3D model of the completed Master Plan\nFollowing the announcements by Prime Minister at the 2015 and 2016 National Day Rallies as well as MOF/MOE’s in-principle approval of the budget, planning for the SIT@Punggol Campus has been progressing fervently. SIT’s campus will be integrated with JTC\nCorporation (JTC)’s Punggol Digital District (PDD) to form the Punggol North Enterprise District.\nConcept of a\nRainforest Tree Metaphor\n71Consultant Team\nIn addition to stakeholder engagement, SIT has\ncommissioned  HASSELL Design (Singapore) to\nundertake a future workspace and laboratory infrastructure study to establish the strategic brief for the staff workspace and to propose a workspace model for incorporation in the design of the new campus. The studies were completed in Q1 2017.\nArcadis Project Management Pte Ltd (Arcadis) was\nappointed the Project Manager for the new campus through an open tender in Q4 2016. Arcadis is one of the leading Project Management ﬁ rms in Singapore and\nhas committed an experienced team with the necessary resources to the project. Similarly, Davis Langdon KPK (Singapore) Pte Ltd (DLKPK) was also appointed as the Quantity Surveyor in Q4 2016. At the same time, with the 18.6 ha of the land separated\nby a dual three-lane road, thus giving rise to two plots, it was decided to outsource the design consultancy services of the Punggol Campus project to two multidisciplinary design consultancy teams to oversee design and development of the two plots named the ‘Campus Heart’ and ‘Campus Court’ respectively.\nFollowing the launch of an open exercise seeking\nExpressions of Interest in November 2016, SIT received overwhelming response from well-established ﬁ rms,\nsome of whom had partnered reputable international ﬁ rms. The prequali ﬁ ed ﬁ rms were put through a rigorous\ntender process in which SIT received several high-quality concept proposals.\n72\n73\nFINANCIAL\nSUPPORT FOR STUDENTS\n74SPONSORSHIPS AND SCHOLARSHIPS\nThrough generous contributions from our industry partners, government agencies and partner organisations, our\nstudents have been able to receive various forms of scholarships or sponsorships to pursue their degree programmes.\nThe following industry partners have provided scholarships/sponsorships to SIT students:\nAgency for Integrated Care\nAgri-Food & Veterinary Authority of SingaporeAlexandra HealthAng Mo Kio Thye Hua Kwan HospitalAssociation of Singapore Marine IndustriesBuilding and Construction AuthorityCentre for Strategic Infocomm TechnologiesEarly Childhood Development AgencyEastern Health AllianceFar East OrganizationInfocomm Development Authority of Singapore Jumbo Group of RestaurantsJurong Health ServicesKeppel Offshore & MarineLand Transport AuthorityMaritimeONEMedia Development Authority of SingaporeMENDAKIMinistry of Communications and InformationMinistry of DefenceMinistry of Home AffairsMOH Holdings Pte Ltd\nNational Council of Social ServiceNational Environment AgencyNational Healthcare GroupNational University Health SystemNTUC First CampusOverseas Union Enterprise LimitedPublic Utilities BoardRafﬂ es Medical Group\nRen Ci HospitalSBS TransitSembcorp Industries LtdSembcorp Marine LtdSingapore Health Services Pte LtdSingapore-Industry Scholarship (SgIS)Singapore Power LimitedSingTelSociety for the Physically DisabledSt Luke’s HospitalThe Salvation Army\nM\nnommunications\nry of Defence\ntry of Home A ffairs\n75DONOR ACKNOWLEDGEMENT\nWe wish to express our deepest appreciation to our generous donors who have made possible non-bonded\nscholarships, study grants, bursaries and excellence awards to nurture and inspire students at SIT.\nDonor Listing (for the ﬁ nancial year ending 31 March 2017)\nAbwin Pte Ltd\nAmazon Web Services Singapore\nPrivate Limited\nApplied Materials South East Asia\nPte Ltd\nArdent Group of CompaniesAscendas Funds Management (S)\nLimited\nBaker Tilly TFW LLPBDO LLPBuddhist Compassion Relief Tzu\nChi Foundation (Singapore)\nCA Trust PACCEI LimitedCentre for Strategic Infocomm\nTechnologies\nMr Choo Chiau BengMr Choo Chong NgenChop Wah OnCore Concepts Pte LtdCPA Australia LtdCyclect Electrical Engineering\nPte Ltd\nDBS Bank LtdDeloitte & Touche LLPDou Yee Enterprises (S) Pte LtdDrilmaco Pte LtdECM Libra FoundationEnGro Corporation LimitedEPS Computer Systems Pte LtdFar East OrganizationFEINMETALL Singapore Pte LtdFoo Kon Tan LLPMr Foong Hock MengGIC Private LimitedMr Jeff GohGoh Bee Gah Foundation through\nSymAsia Foundation Limited\nGoh FamilyGoh FoundationGoodrich Global Holdings Pte LtdHiap Chuan Hardware (Pte) LtdHock Seng Hoe Metal Company\nPte LtdHome-Fix DIY Pte Ltd\nHong Leong FoundationInstitute of Materials (East Asia)JCS-Echigo Pte LtdJing King Tech Holdings Pte LtdJUMBO Group LimitedKCTex International LtdKenyon Pte LtdKeppel Care FoundationKeppel Corporation LimitedMr Jeffrey KhooKhoo Chwee Neo Foundation LtdKim Leng Tee Investments Pte LtdMr Kuok Khoon HongKwan Im Thong Hood Cho TempleMr Kevin LiangMr Lim Joo BoonMr Lim Siah MongMr Low Ming WahLions Community Service\nFoundation (Singapore)\nMalayan Daching Co Pte LtdMapletree Investments Pte LtdMcLink Asia Pte LtdMicrosoft Operations Pte LtdMun Siong Engineering LimitedNehemiah Foundation through\nSymAsia Foundation Limited\nNexia TS Pte LtdOcean Tankers Pte LtdParsing Pte LtdPerfect Team Engineering Pte LtdPKF-CAP LLPPwC SingaporeQ’son Kitchen Equipment Pte LtdRohde & Schwarz Asia Pte LtdRotary Club of Bugis Junction,\nSingapore\nRotary Club of Jurong Town,\nSingapore\nRSM Chio Lim LLPSafety Systems Engineering Pte LtdSamwoh Corporation Pte LtdSATS Ltd\nSCAL Resources Pte Ltd and\nmembers of The Singapore Contractors Association Ltd\nSembcorp Industries LtdSembcorp Marine LtdMs Elsie SimSingapore Chemical Industry\nCouncil Limited\nSingapore Chinese Chamber Of\nCommerce Foundation\nSingapore Computer SocietySingapore Food Manufacturers’\nAssociation\nSingapore Leong Khay Huay KuanSingapore Power LimitedSingapore Technologies\nEngineering Ltd\nSintit Realty Pte LtdTAK Products & Services Pte LtdTaylor & Francis Asia Paci ﬁ c\nTech Metal Machines Pte LtdTeknor Apex Asia Paci ﬁ c Pte Ltd\nMr Allan Teo Kok JinTexas Instruments Singapore (Pte)\nLimited\nThe Copyright Licensing and\nAdministration Society of Singapore\nThe Ireland Funds SingaporeThe Silent Foundation LtdThomson Shin Min FoundationTME Systems Pte LtdMr Toe Teow HengWilmar International LimitedWing Tai Retail Management\nPte Ltd\nMr Albert WongDr Steven Wong Kai JuanMs Wong Kai YunMrs Wong Kwok Leongwww.hardwareonline.com.sgYangzheng FoundationYeakin Plastic Industry Pte LtdZicom Holdings Private Limited\n76\nFINANCIAL\nSTATEMENTS\nIMPORTANT NOTE:\nThe following Financial Statements are extracted from Singapore Institute of Technology’s Audited Financial\nStatements for the year ended 31 Mar 2017. It may not contain suf ﬁ cient information to allow for a full understanding\nof the results and the state of affairs of the Company. For further information, please refer to the complete audited ﬁ nancial statements published on the SIT of ﬁ cial website at SingaporeTech.edu.sg.\n77STATEMENT OF\nCOMPREHENSIVE INCOME\n2017       2016       2017        2016    2017     2016\n$       $       $        $    $     $\nRevenue 55,180,058 45,176,520 - - 55,180,058 45,176,520\nOther income 936,093 1,334,249 1,200,892 1,492,604 2,136,985 2,826,853\nOperating expenditure\nStaff and related\nexpenses(64,924,241) (48,041,802) - -(64,924,241) (48,041,802)\nDepreciation and\namortisation expenses(37,264,513) (30,220,893) - -(37,264,513) (30,220,893)\nProgramme and student-\nrelated expenses(62,960,668) (57,277,352) (1,505,450) (910,620) (64,466,118) (58,187,972)\nRental and other facilities\nexpenses(20,209,264) (18,283,788) - -(20,209,264) (18,283,788)\nOther operating\nexpenses(16,738,881) (13,763,628) (594,257) (547,684) (17,333,138) (14,311,312)\nTotal operating\nexpenditure(202,097,567) (167,587,463) (2,099,707) (1,458,304) (204,197,274) (169,045,767)\n(Deﬁ cit)/surplus before\ninvestment income    and government    grants(145,981,416) (121,076,694) (898,815) 34,300 (146,880,231) (121,042,394)\nNet investment\nincome/(loss)1,066,527 381,911 44,834,456 (16,512,302) 45,900,983 (16,130,391)\n(Deﬁ cit)/surplus before\ngovernment grants(144,914,889) (120,694,783)\n43,935,641                   (16,478,002) (100,979,248) (137,172,785)\nGovernment grants 176,434,443 141,349,096 - -176,434,443 141,349,096\nNet surplus/(de ﬁ cit) and\ntotal comprehensive    income/(loss)31,519,554 20,654,313 43,935,641 (16,478,002) 75,455,195 4,176,311Endowment and\nterm fundsGeneral funds TotalFor the ﬁ nancial year ended 31 March 2017\n78BALANCE SHEET\n2017                    2016\n$                    $\nASSETS\nCurrent assetsCash and cash equivalentsFinancial assets, at fair value through pro ﬁ t or loss\nFees and other receivablesStudent loansOther current assets147,993,484\n389,923,422\n48,350,239\n142,551\n6,305,529130,281,892\n345,657,818\n30,122,947\n133,096\n6,203,466\n592,715,225 512,399,219\nNon-current assets\nProperty, plant and equipmentIntangible assetsStudent loansOther non-current assets211,208,679\n6,478,647\n563,166\n80,618,645232,364,580\n2,133,688\n363,484\n81,836,074\n298,869,137 316,697,826\nTotal assets 891,584,362 829,097,045\nLIABILITIES\nCurrent liabilitiesTrade and other payablesDeferred tuition fee incomeGrants received in advance31,712,152\n9,021,139\n47,698,38323,794,579\n7,640,483\n61,568,303\n88,431,674 93,003,365\nNon-current liabilities\nDeferred capital grantsOther deferred grants217,628,279\n83,482,328234,488,511\n86,780,063\n301,110,607 321,268,574\nTotal liabilities 389,542,281 414,271,939\nNET ASSETS 502,042,081 414,825,106\nFUNDS AND RESERVES\nEndowmentAccumulated surplus    - General funds    - Endowment and term funds386,293,632\n82,792,215\n32,956,234374,531,852\n51,272,661\n(10,979,407)\n502,042,081  414,825,106\nFunds managed on behalf of Ministry of Education (“MOE”) 20,626,374 15,424,915As at 31 March 2017\n79STATEMENT OF CHANGES\nIN FUNDS AND RESERVES\n$                   $                  $\n2017\nBeginning of ﬁ nancial year 51,272,661 363,552,445 414,825,106\nTotal comprehensive income 31,519,554 43,935,641 75,455,195\nGovernment grants and donations - 11,761,780 11,761,780\nEnd of ﬁ nancial year 82,792,215 419,249,866 502,042,081\n2016\nBeginning of ﬁ nancial year 30,618,348 371,835,065 402,453,413\nTotal comprehensive income/(loss) 20,654,313 (16,478,002) 4,176,311Government grants and donations - 8,195,382 8,195,382\nEnd of ﬁ nancial year 51,272,661 363,552,445 414,825,106Endowment\nand\nterm fundsAccumulated\nsurplus -\nGeneral fundsTotalFor the ﬁ nancial year ended 31 March 2017\n80STATEMENT OF CASH FLOWS\n2017                   2016\n$                   $\nCash ﬂ ows from operating activities\nDeﬁ cit before government grants\nAdjustments for:   - Depreciation and amortisation   - Donations   - Net loss on disposal of property, plant and equipment   - Interest income   - Dividend income   - Fair value (gain)/loss on ﬁ nancial assets, at fair value through pro ﬁ t\nor loss and currency exchange loss(100,979,248)\n37,264,513\n(1,200,892)\n620\n(1,604,234)\n(159,429)\n(44,137,320)(137,172,785)\n30,220,893\n(1,492,604)\n1,855\n(423,861)\n(1,805)\n16,556,057\n(110,815,990) (92,312,250)\nChange in operating assets and liabilities\n- Fees and other receivables   - Student loans and other assets   - Trade and other payables(2,331,320)\n906,229\n11,146,4853,125,456\n(2,565,324)\n1,240,562\nNet cash used in operating activities (101,094,596) (90,511,556)\nCash ﬂ ows from investing activities\nPurchase of property, plant and equipment and intangible assetsProceeds from disposal of property, plant and equipmentPurchase of ﬁ nancial assets, at fair value through pro ﬁ t or loss\nProceeds from disposal of ﬁ nancial assets, at fair value through pro ﬁ t\nor lossSettlement of currency forwardsInterest receivedDividends received(23,305,274)\n16,701\n(19,877,597)\n20,475,709\n-\n1,223,842\n159,429(36,495,358)\n-\n(24,577,634)\n59,392,537\n(13,819,772)\n321,637\n1,805\nNet cash used in investing activities (21,307,190) (15,176,785)\nCash ﬂ ows from ﬁ nancing activities\nOperating grants receivedDevelopment grants receivedOther government grants receivedEndowment funds receivedDonations received110,660,227\n11,117,430\n5,373,049\n11,761,780\n1,200,892135,992,666\n33,446,014\n1,572,3188,195,3821,492,604\nCash provided by ﬁ nancing activities 140,113,378 180,698,984\nNet increase in cash and cash equivalents\nCash and cash equivalents at beginning of ﬁ nancial year17,711,592\n130,281,89275,010,643\n55,271,249\nCash and cash equivalents at end of ﬁ nancial year 147,993,484 130,281,892For the ﬁ nancial year ended 31 March 2017\nSingapore Institute of Technology\nSIT@Dover, 10 Dover Drive, Singapore 138683\nTel: 6592 1189\nFax: 6592 1190\nAdmissions\nTel: 6592 1136\nEmail: Adm@SingaporeTech.edu.sg\nRegistrar’s Of ﬁ ce\nTel: 6592 2091\nEmail: Registrar@SingaporeTech.edu.sg\nStudent Life\nTel: 6592 1191\nEmail: SLD@SingaporeTech.edu.sg\nAlumni Of ﬁ ce\nTel: 6592 2013/6592 1137\nEmail: Alumni@SingaporeTech.edu.sg\nGiving to SIT\nTel: 6592 1138/6592 1094\nEmail: Advancement@SingaporeTech.edu.sg\nCareer Services\nTel: 6592 8150\nEmail: CareerServices@SingaporeTech.edu.sg\nTechnology, Innovation and Enterprise\nTel: 6592 6917\nEmail: Innovate@SingaporeTech.edu.sgCONTACT US\nSINGAPORE INSTITUTE OF TECHNOLOGY\n10 Dover Drive\nSingapore 138683\nRegistration No. : 200917667D\nSingaporeTech.edu.sg\nSingaporeTech         @SingaporeTech @SingaporeTech\nSingaporeTech.edu.sg"
}