{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2020-10/Annual_Report_2015.pdf",
  "type": "pdf",
  "content": "SingaporeTech.edu.sg\nSingaporeTech.edu.sg\nANNUAL REPORT 2015\nwe are\nThinking\nTinkerersABLE TO LEARN,\nUNLEARN AND RELEARNCATALYSTS\nFOR TRANSFORMATIONGROUNDED\nIN THE Community\nIt’s in OUR DNA.\nChairman’s Message\nBoard of Trustees\nPresident’s Message\nSenior ManagementOrganisation Chart\nMilestones\nOur Polytechnic and Overseas University PartnersSIT Blueprint\nSIT-conferred Degree Programmes\nEnterprise & Innovation Hub (E&I Hub)Professional Officers Division (POD)\nIntegrated Work Study Programme (IWSP)\nOur GraduatesDonors and Scholarships\nCorporate Governance\nInternal AuditQuality Assurance\nSIT Board Committees\nFinancial Statements12\n7\n8\n10\n12\n23\n31\n32\n34\n37\n38\n39\n41\n44\n4545\n46\n47CONTENTS\nA WORD FROM\nOUR CHAIRMAN\nMR NG YAT CHUNG\n2014 was a pivotal year for SIT as we celebrated five challenging\nand fruitful years in higher education since our inception in September 2009. Our growth has been astounding, with many significant milestones achieved along the way.\nWhen we welcomed our pioneer cohort of 500 students in\n2010, we had 10 degree programmes in partnership with five overseas university (OU) partners. Today we have expanded our offerings to 27 degree programmes with 10 OU partners. In 2012, we commenced groundbreaking for the five SIT@Poly Buildings to house our rapidly growing student population.\nIn the same year, Prime Minister Lee Hsien Loong announced\nat the National Day Rally that SIT would become Singapore’s\nfifth public university. We welcomed the news with excitement,\nrecognising the challenges and opportunities to contribute to Singapore’s higher education landscape.\nOn 28 March 2014, SIT was officially conferred the status of an\nautonomous university by the Singapore Government. This was yet another significant milestone for SIT as we launched our first three SIT-conferred degree programmes. The response to these new degree programmes proved overwhelming and exceeded\nour expectations. Since then, we have continued to set new\nrecords for application numbers. Going into academic year 2015/2016, we saw our 36 programmes (27 OU degrees, 7 SIT-conferred degrees and 2 joint degrees) oversubscribed by 4.6 times – an encouraging situation for a new university. I attribute this positive response to SIT’s commitment towards offering applied degree programmes which are not only industry relevant, but also build on our students’ training in their polytechnic days.\nAs the Singapore economy\ncontinues to evolve, the\nUniversity remains committed\nto ensuring that our applied\nlearning pedagogy stays relevant, with significant application of theory to real-world situations. In doing so, we strive to develop deep specialists, imbued with relevant skills and the SIT-DNA. As deep specialists, our graduates must be adaptable to an ever-changing economy. We believe that the SIT-DNA is central to students acquiring a strong sense of professionalism that will aid them to succeed in\ntheir careers. The SIT-DNA will also be instrumental in shaping\nour students’ approach to lifelong learning.\nOver the past two years, SIT has also started to make its mark on\nindustry. We are proud to have inked several major MOUs with industry associations and key industry leaders, and we continue to evolve our partnerships with key industry players so as to be the nexus between industry and education. The tremendous support given to us by our industry partners enables us to truly\nenhance our students’ learning opportunities, especially in the\narea of the Integrated Work Study Programme (IWSP), where students embark on an eight to 12-month work stint during their course of study. Looking ahead, we are in the midst of launching a few exciting initiatives involving key industry partners in the areas of enterprise and innovation projects. These will certainly enhance our student experiences and add value to their learning journeys with us.\nAnother significant milestone this year was the completion of\nour five SIT@Poly Buildings, a mere three years after we first broke ground within the polytechnics. These state-of-the-art buildings, which currently host our overseas university partners and their degree programmes, have certainly added to the growing awareness of SIT among the general population. As a result of our expansion, we relocated our entire administration and faculty into the former ITE HQ at 10 Dover Drive, which currently houses students reading the SIT-conferred degree\nprogrammes. In January 2015, we took over the buildings\nlocated at 20 Dover Drive and we look forward to welcoming our new intake of students this September.\nAlthough we are still in our early years as a new AU, we continue\nto look ahead and plan for expansion numbers in anticipation of more degree programmes being launched. It is timely that SIT plans to consolidate its resources in a new campus and we envision an open campus facility which is integrated within the\nlarger community and which will serve the needs of industry.\nThe new SIT campus will inject energy and vibrancy into the surrounding community. In the first five years, we have laid the foundation to create a different kind of university. The members of the Board of Trustees, benefactors, management, staff, students, alumni and industry partners work together to add diversity and help reshape Singapore’s higher education landscape. We have\ncause to celebrate many achievements in the past five years.\nThe road ahead is still exciting and full of opportunities as the University continues to develop to meet the needs of its students, industry and the community. I look forward to more exciting developments from SIT in the years ahead.\nMS RACHEL ENG\nTrustee\nAppointed on 21 Mar 2011Rachel Eng is the Joint Managing Partner of\nWongPartnership LLP. She also handles corporate advisory, corporate governance & compliance and financial services regulatory work.\nMs Eng is an independent non-executive\ndirector of StarHub Ltd. and a board member of Certis CISCO Security Pte Ltd. She is also a board member of the Public Utilities Board, the Singapore Accountancy Commission, Wopa Services Pte Ltd and 89 Holdings Pte Ltd. She sits on the Board of Trustees of Singapore Institute of Technology (SIT) and is the Chairman of the Partnership Approval Committee. She serves on the Advisory Board of School of Law of the Singapore Management University and the Council of the Singapore Business Federation.\nMs Eng is a member of the Singapore Capital\nMarkets Committee and a Supervisory Committee member of ABF Singapore Bond Index Fund established by the Monetary Authority of Singapore. She sits on the board of the Singapore chapter of the Asia Pacific Real Estate Association (APREA), the Capital Markets and Financial Advisory Services (CMFAS) Exams Board of the Institute of Banking & Finance, the Reuters Editorial Advisory Board and Best Lawyers Advisory Board.\nMs Eng is an Honorary Legal Adviser to the Real\nEstate Developers Association of Singapore (REDAS). She is also a Fellow of the Singapore Institute of Directors. She was invited to be and is one of the champions for BoardAgender, a not-for-profit organisation that promotes gender diversity in the boardroom. She is also a mentor for the Young Women’s Leadership Connection (YWLC).BOARD OF TRUSTEES\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 2\nMr Ng Yat Chung is Chairman, Singapore Institute of Technology and was appointed to the position in September 2009. Mr Ng was appointed Group President and Chief Executive Officer (CEO) of Neptune Orient Lines Limited (NOL) in October 2011 and Executive Director of NOL in May 2011.\nPrior to joining NOL, Mr Ng was a Senior\nManaging Director and the Head of Energy & Resources, Co-Head of Australia & New Zealand as well as Co-Head of Strategy at Temasek Holdings (Private) Limited. Before joining Temasek\nHoldings, he was the Chief of Defence Force in\nthe Singapore Armed Forces (SAF).Mr Ng is also a Director of APL (Bermuda) Ltd, Automar (Bermuda) Ltd, APL Limited, APL Co. Pte Ltd, Eagle Marine Terminal Holdings Pte Ltd, NOL Global Shared Service Centre Pte Ltd, Triton Shipping Pte Ltd, NOL Liner (Pte) Ltd and the World Shipping Council.\nHe also serves as a Member on the United\nKingdom Mutual Steam Ship Assurance Association (Bermuda) Limited, the International Advisory Panel of the Singapore Maritime Institute and the Advisory Panel of the Chartered Institute of Logistics and Transport, Singapore.\nMr Ng is also a Chairman of the Government\nBoard on NOL Fellowship Programme, National University of Singapore.\nMR NG YAT CHUNG\nChairman\nAppointed on 23 Sep 2009\nBOARD OF TRUSTEES\nDr Richard Charles Helfer is the Chairman of\nRCH International Pte Ltd and Creo Lifestyle International Pte Ltd. He was the founding Chairman/Chief Executive Officer (CEO) of Raffles International from 1989 to 2003 and\nPresident and CEO of Raffles Holdings from\n1995 to 2003.\nPrior to joining Raffles, Dr Helfer was a Senior\nExecutive at Westin Hotels and Resorts. He was also a Member of the Senior Management Committee of DBS Land Limited and later its successor CapitaLand Limited in regards to property development in the hospitality and\ntourism sectors.\nDr Helfer serves as a Chairman and Director\nof Alpen Wald Pte Ltd, Celestica International Ltd, Celestica Ltd, Food Journeys (Singapore) Pte Ltd, Yanua International Pte Ltd, One Farrer Pte Ltd and Sculpture Square Limited. He is also a Director of Little India Arcade Pte Ltd,\nWharton Scott Pte Ltd, The Farrer Park Company Pte Ltd, Farrer Park Hospital Pte Ltd, Farrer Park Medical Centre Pte Ltd, Farrer Park Hotel Pte Ltd, Singapore Institute of Technology (SIT) and Cambodian Living Arts.\nDr Helfer is the Chairman, Advisory Committee\nof School of Hospitality, Republic Polytechnic. He is also an Advisory Council Member, MIR Investment Management Limited and Advisory Board Member, National Book Development Council. He is a Trustee of Singapore Institute of Technology (SIT) and Chairman of the Campus Development Committee.\nIn addition to sitting on a number of public listed/\nprivate boards of directors and being advisor to a select group of government/private organisations and companies, Dr Helfer has and continues to be professionally involved in sustainable social enterprises and community developments and at board level in the education sector.\nDR RICHARD CHARLES HELFER\nTrustee\nAppointed on 23 Sep 2009\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 20153\nProf Hang Chang Chieh has been appointed the founding Head, Division of Engineering & Technology Management, Faculty of Engineering, National University of Singapore (NUS) since 2007. He was the founding Director\nof Engineering Systems Initiative, Faculty of\nEngineering of NUS since January 2005. He has also assumed the appointment as Chairman, Management Board for Interactive & Digital Media of NUS since May 2007.\nProf Hang was an Executive Deputy Chairman\nof Singapore’s Agency for Science, Technology and Research (A*Star) from 2001 to 2003. At NUS, he served in various positions from 1977 to 2000, he was the Vice-Dean of Engineering, Head of\nElectrical Engineering, and the Deputy Vice-\nChancellor from 1994 to 2000 and the founding Director of the Singapore-MIT from 1998 to 2002. He also served as a founding Chairman of the Intellectual Property Office of Singapore from April 2001 to 2009 and founding Deputy\nChairman of Singapore’s National Science and\nTechnology Board from 1991 to 1999.  Prior to his academic career, Prof Hang was a Computer and Systems Technologist with the Shell Eastern Petroleum Company (Singapore) and the Shell International Petroleum Company (The Netherlands) from 1974 to 1977.\nProf Hang was elected Fellow of the Institute of\nElectrical and Electronics, USA, in 1998, Fellow of the Academy of Sciences for the Developing World, in 1999 and Foreign Member of the Royal Academy of Engineering, UK in 2000. He was awarded the 1998 Public Administration Medal\n(Gold) and the 2000 National Science and\nTechnology Medal by the Singapore Government. In 2004, he was named Distinguished Fellow of the Singapore-MIT Alliance and he was awarded the IES/IEEE Medal of Excellence. In 2006, he received the Outstanding Service Award from the NUS. He was elected Fellow, ASEAN Academy of Engineering & Technology in 2006.\nProf Hang is a Director on the Board of the Amplus\nCommunication Pte Ltd, Ampere Vehicles Pte Ltd and Dou Yee Enterprises (S) Pte Ltd. He is also a Trustee of Singapore Institute of Technology and\nChairman of the Academic Advisory Committee.\nPROF HANG CHANG CHIEH\nTrustee\nAppointed on 23 Sep 2009\nDR LIM KHIANG WEE\nTrustee\nAppointed on 23 Sep 2009BOARD OF TRUSTEES\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 4Dr Lim Khiang Wee is the Executive Director\nof CREATE (Campus for Research Excellence and Technological Enterprise) of Singapore’s National Research Foundation (NRF) since August 2013.\nPrior to Dr Lim’s current appointment, he was\nthe Executive Director of the A*STAR Graduate Academy (A*GA). A*GA oversees A*STAR’s talent development through scholarships, fellowships, collaborative and Outreach Programmes and concurrently the founding Executive Director of Intellectual Property Intermediary\n(IPI), Singapore.\nAt A*STAR, Dr Lim served as the Executive\nDirector of a research institute from 2002 to 2010, leading the Singapore Institute of Manufacturing Technology (SIMTech) and the Institute for Materials Research and Engineering (IMRE). He was also a member of the founding leadership team at the Science and Engineering\nResearch Council from 2001.Before joining A*STAR, Dr Lim has held academic\nappointments at the University of New South Wales in Sydney and the National University of Singapore where he was concurrently Head of the Division of Power Engineering and the\nAssociate Dean at the University’s Office\nof Research. He has consulted for industry in Sydney and Singapore and worked as a Development Engineer at Motorola Penang.\nDr Lim is Trustee and Chairman of the Finance\nCommittee of Singapore Institute of Technology. He is also a Member on the Engineering\nAccreditation Board of Institute of Engineers\nSingapore, Singapore Youth Award Panel of National Youth Council, NUS High School Mathematics & Science Board of Governors, Mechanobiology Institute of Singapore Governing Board and an Adjunct Professor of Division of Engineering and Technology Management, NUS.\nMr Pek is the head of the Energy and Natural Resources practice at KPMG in Singapore. He leads the KPMG energy team in Singapore to provide consulting, business transformation, risk management, performance improvement,\nmergers-and-acquisitions and market research\nservices to energy clients in Asia-Pacific. The energy sector includes the oil and gas,\npower and utilities, chemicals, mining and maritime industries.Mr Pek served as the Country President of BP Singapore from 2007 to 2013. He has worked in different disciplines of the energy industry in a career spanning more than 20 years. He is a well-known energy specialist in Asia. He spent\nfive years in China pioneering BP’s investments\ninto China, headed BP Thailand for three years and headed BP Singapore in the last six years.\nMr Pek is a Board Member of Inland Revenue\nAuthority of Singapore and a Non-Executive Director of Energy Market Authority of Singapore. He is a Trustee of Singapore Institute of Technology (SIT) and Chairman of the\nAudit Committee.\nMR PEK HAK BIN\nTrustee\nAppointed on 23 Sep 2009\nMr Lam Yi Young is the Deputy Secretary (Policy)\nof the Ministry of Education, Singapore. Prior to his appointment in the Ministry in January 2014, Mr Lam was the Chief Executive of the Maritime and Port Authority of Singapore from May 2009\nto December 2013.\nSince joining the Singapore Civil Service in\n1996, Mr Lam has also served as an Engineer in the Ministry of Defence, as an Assistant Director in charge of the Budget Policy in the Ministry of Finance, as a Deputy Director of the Personnel Division in the Ministry of Education and as a Director Manpower in the Ministry of Defence.Mr Lam also sits on the boards of the Agency for Science, Technology and Research (A*STAR), CapitaLand Commercial Trust Management Limited, Education Fund, Lee Kong Chian School of Medicine, Lifelong Learning Endowment\nFund Advisory Council, SIM University\n(UniSIM), Singapore Institute of Technology, Singapore University of Technology and Design,\nSingapore Workforce Development Agency, and\nYale-NUS College.\nMR LAM YI YOUNG\nTrustee\nAppointed on 24 Jan 2014\nMR ALVIN TAN\nTrustee\nAppointed on 16 Sep 2012\nBOARD OF TRUSTEES\nMS TEOH ZSIN WOON\nTrustee\nAppointed on 1 Apr 2013Ms Teoh Zsin Woon was appointed as a\nDeputy Secretary of Development at Ministry\nof Health (MOH), Singapore in 2013. Prior to\nher appointment at MOH, she has served in\nvarious Civil Service roles including the National\nEnvironment Agency, Ministry of Defence,\nMinistry of Manpower, Workforce Development Agency and Ministry of National Development.Ms Teoh sits on the Board of Trustees of Singapore Institute of Technology (SIT). She is a Member of\nthe Audit Committee and Campus Development\nCommittee of SIT.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 20155Prof Tan Thiam Soon is the President and\nTrustee of Singapore Institute of Technology (SIT). He is a Member of the Academic Advisory Committee of SIT.\nPrior to joining SIT, Prof Tan was with National\nUniversity of Singapore (NUS) for more than 26\nyears and was a Professor of Civil Engineering. While in NUS, he held various positions including Vice-Provost (Education) and Dean of Admissions.\nProf Tan’s main research interests are in\nland reclamation, soil improvement and soil\ncharacterisation. In particular, he has played\na leading role in the development of alternate fills for land reclamation purposes, such as the reuse of unwanted soils from underground construction activities.\nProf Tan was the lead organiser and editor in the\ntwo forums on Characterisation and Engineering\nProperties of Natural Soils in 2002, and 2006  respectively, that resulted in a nearly 2800-page\nproceedings on natural soils from around the world, comprising four-volumes and 68 papers.\nProf Tan received the ASTM’s C.A. Hogentogler\nAward in 2007 and the Best Research Paper Award\n2008 from the Japanese Geotechnical Society.\nHe was also awarded the Public Administration Medal (Silver) and Minister of Transport’s Distinguished Innovation Award in 2008.\nProf Tan is a registered Specialist Professional\nEngineer (Geotechnical) in Singapore and has\nbeen involved in numerous consulting jobs in\nSingapore concerning land reclamation, deep excavation and other geotechnical problems. He is a Member of the Lifelong Learning Endowment Fund Advisory Council and SkillsFuture Council, Singapore Workforce Development Agency. Prof Tan is also a Member of the Advisory Council on Community Relations in Defence (ACCORD),\nMinistry of Defence.\nPROF TAN THIAM SOON\nTrustee & President\nAppointed on 1 Feb 2013Mr Alvin Tan is the Assistant Managing Director\nof the Singapore Economic Development Board (EDB). He oversees EDB’s initiatives in\nHuman Resources, Information Technology,\nAdministration, Human Capital and New Businesses (Contact Singapore).\nPrior to this, Mr Tan was the Executive Director of\nHuman Resources in EDB. He also held Director-\nlevel appointments in Resource Development\nand North America Operations from 2001 to  2007. Mr Tan is a Board Member of Council for Private Education, Ministry of Education and Human Capital Leadership Institute, Ministry\nof Manpower. He sits on the Board of Trustees\nof Singapore Institute of Technology (SIT) and is also a Member of the Audit Committee and Partnership Approval Committee of SIT.\nMR TK UDAIRAM\nTrustee\nAppointed on 16 Sep 2012Mr TK Udairam is the Group Chief Executive\nOfficer of the Eastern Health Alliance (EH Alliance). Prior to this, Mr Udairam served as the Chief Executive Officer of Changi General Hospital from 2000 to 2012. He has 36 years\nof experience in healthcare operations,\nadministration and management.\nMr Udairam was involved in a number of\nnational projects including the development and implementation of the Medisave scheme.\nMr Udariam is a Director of Mercy Relief,\nIntegrated Health Information System, Temasek\nPolytechnic (TP) Board of Governors, Institute of\nTechnical Education (ITE), Board of Governors,\nSingapore Medical Association (SMA) Charity Fund and Singapore Totalisator Board. He serves as a Member of Nanyang Polytechnic Health\nSciences Advisory Committee, St Andrew’s Community Hospital Management Committee, ITE Technical Advisory and Certification Council.\nMr Udairam sits on the Board of Trustees of\nSingapore Institute of Technology (SIT) and is Chairman of the Investment Committee and Member of the Finance Committee. He is also the Chairman of ITE Healthcare Academic Advisory Committee, TP Applied\nScience Advisory Committee, Sree Narayana\nMission (Singapore) Medifund Committee\nand Changi Simei Inter-Racial and Religious\nConfidence Circle.\nBOARD OF TRUSTEES\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 6\nMs Mary Yeo is the Vice President for Supply\nChain Operations in UPS South District, based in Singapore. Prior to her current appointment, Ms Yeo was\nthe Managing Director of UPS Singapore and\nwas responsible for the strategic management of the Singapore business. She was a Member on the Board of the Central Provident Fund (CPF), Infocomm Development Authority of Singapore (IDA), Employment and Employability Institute (e2I), National Family Council, Ministry of Social and Family Development, and the Singapore International Chamber of Commerce (SICC) Logistics Committee.\nMs Yeo serves as a Trustee and a Member of\nthe Finance Committee of Singapore Institute\nof Technology. She is a Non-Executive Director, Mapletree Industrial Trust Management Ltd and an Authority Member, Civil Aviation Authority\nof Singapore.\nMS MARY YEO\nTrustee\nAppointed on 23 Sep 2009MR MICHAEL YAP\nTrustee\nAppointed on 23 Sep 2009Mr Michael Yap is founder and Chairman of\nSkyvest Ventures Pte Ltd.\nMr Yap was the Deputy Chief Executive\nOfficer (CEO) of the Media Development\nAuthority (MDA). Concurrently, he was the\nExecutive Director of the National Interactive\nDigital Media Programme Office, chartered to\ndevelop the new media sector in Singapore.\nPrior to MDA, Mr Yap was the Managing Director of Oracle Corporation Singapore,\nthe Vice President Business Development\nof Oracle Asia Pacific, the founder and CEO\nof Commerce Exchange (Comex) and the\nCEO of National Computer Board. He was\na Board Member, National Library Board,\nSingapore Science Centre and Chairman of the Board of Institute of Systems Science, National University of Singapore (NUS).\nMr Yap is the Advisor to the President’s Office\nof Nanyang Technological University, the\nExecutive-in-Residence of National University\nof Singapore and the Panel of Advisors of\nOMGTel Pte Ltd. He serves as a Trustee\nand a Member of the Campus Development\nCommittee of the Singapore Institute of Technology. Mr Yap is also a Director and\nShareholder of Azeus Systems Holdings Ltd\n(Bermuda), Taidii Pte Ltd, Matchimi Pte Ltd,\nThe Co-Foundry Pte Ltd, Minds N Hands Pte\nLtd and Skyvest International Limited (British\nVirgin Islands).\nA WORD FROM\nOUR PRESIDENT\nPROFESSOR TAN THIAM SOON\n2014/2015 has been another exciting year for SIT as we made\nsubstantial progress in terms of increasing the breadth and depth of our educational offerings.\nAs we welcome our new intake of almost 2100 students for\nacademic year 2015, our SIT student enrolment has grown to\nnearly 4600, with classes commencing for five new applied degree programmes which were launched in early 2015.\nThe strong enrolment numbers for these new applied degree\nprogrammes certainly speak volumes for the fact that we are on the right track in pioneering applied learning at the university level. The programmes we offered are not only in sync with industry needs, but also aligned with the national\nSkillsFuture movement.\nThe five new applied degree programmes are offered in the\nareas of Sustainable Infrastructure Engineering (Building Services), Pharmaceutical Engineering, Information and Communications Technology (Information Security), Hospitality Business, and Systems Engineering which is a new joint degree with DigiPen Institute of Technology. All these degree programmes include the unique Integrated\nWork Study Programme (IWSP) as a core component of\ntheir curricula.\nTo cater to the expansion in the number of degree programme\nofferings and increased enrolment, we have been ramping up hiring of faculty members significantly. In June 2014, we also moved our headquarters to Dover Drive and we opened\nour doors to the pioneer cohort of students\nreading SIT-conferred degrees in\nAugust 2014.\nOver the past year, we have\nforged new partnerships with key companies representing various industry sectors. In November 2014, we launched our partnership with the Association of Small and Medium Enterprises (ASME) to increase our collaboration with local companies in creating value through technology development and enterprise. This collaboration will enable us to address manpower issues by aligning the skills training of SIT students\nwith industry requirements, as well as develop and expand\nthe talent pool for SMEs in Singapore.\nSIT also signed a Memorandum of Understanding with\nSingapore Manufacturing Federation (SMF) in January 2015 to address the manufacturing industry’s need to overcome the existing manpower crunch by grooming a sustainable workforce of innovation-driven graduates equipped to tackle productivity challenges. Besides upgrading manpower\ncapabilities in productivity improvement for the manufacturing\nsector, we will collaborate on enhancing SIT students’ career opportunities through SIT’s IWSP.\nIn October 2014, we launched a new Enterprise & Innovation\nHub (E&I Hub) to enable innovation-driven students to engage directly with industries to develop critical learning skills. It also serves as a platform for developing collaborative projects with industries.\nAll these initiatives will strengthen SIT’s foundation as\nan autonomous university, which is underpinned by an empowering ‘SIT-DNA’ that nurtures Thinking Tinkerers who are Able to Learn, Unlearn, Relearn so that they may be Catalysts for Transformation in the workplace and the economy, while remaining Grounded in the Community.\nAs a pioneer university of applied learning in Singapore, we\nare well-poised to develop innovation-driven students and\ntrain best-in-class specialists who can make substantial contributions to their industries. In addition, we continue developing our partnerships with well-known overseas universities in the areas of joint degrees, exploring new ground so as to offer the most advanced and cutting-edge knowledge in pertinent fields of industry. Delivering the best education possible will empower our talent pool to become the best industry experts.\nWe remain grateful to all our partners, whose contributions\nare vital to our efforts in remodeling an education landscape that synergises with industry. Together, we hope to deliver quality graduates who will continue excelling and breaking new ground in their chosen fields.\nProfessor Ting was appointed the Deputy President (Academic) of Singapore Institute of Technology\n(SIT) on 1 October 2009. On 1 January 2013, he was appointed Provost. He was the Associate\nDean (Undergraduate Studies) of the College of Engineering at the Nanyang Technological University as well as the founding Director of the Lien Institute for the Environment. He is a\nregistered Professional Engineer in Singapore and has been involved in numerous structural and\ngeotechnical consultancies. He graduated with First Class Honours in Civil Engineering from\nMonash University, Australia under the President’s and Colombo Plan scholarships. He has a\nMaster of Engineering from the National University of Singapore. He obtained his SMCE and ScD\n(Structural Engineering) from Massachusetts Institute of Technology.\nMr Chan was appointed Chief Financial Officer of Singapore Institute of Technology (SIT) on\n1 July 2009. Subsequently, he assumed appointment as Deputy President (Administration) on\n1 January 2013 covering the additional functions of estates, information technology, human\nresources and administration. Prior to joining SIT, he was Executive Chairman of Easycall Ltd,\nChief Financial Officer and President of New Businesses at Sembcorp Ltd, and was Chairman of\nPacific Internet and Delifrance while at SembCorp. Mr Chan graduated with First Class Honours in Economics from the National University of Singapore in 1981 and joined the Administrative\nService. He also worked at M INDEF  companies and the Economic Development Board, before\nbecoming an investment banker in Schroders and Bankers Trust in Singapore and Hong Kong. He currently sits on private and public listed company boards, and on the boards of charities or\ninstitutions of public character, in addition to his appointment at SIT.PROFESSOR TING SENG KIONG*\nDeputy President\n(Academic) & Provost\nSingapore Institute of Technology\nMR CHAN WING LEONG\nDeputy President (Administration)\n& Chief Financial Officer\nSingapore Institute of Technology\n*Stepped down on 30 Sep 2015.SENIOR MANAGEMENT\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 8Professor Tan was appointed the President of Singapore Institute of Technology (SIT) on\n1 February 2013. He was a Professor of Civil Engineering and held various positions including the\nVice-Provost (Education) and Dean of Admissions at the National University of Singapore. He is a registered Specialist Professional Engineer and is a well-known expert on land reclamation, and\nother geotechnical problems. A Colombo Plan scholar, he graduated from University of Canterbury\n(New Zealand) and obtained his Master’s degree and PhD from California Institute of Technology.\nPROFESSOR TAN THIAM SOON\nPresident\nSingapore Institute of Technology\nProfessor Loh joined Singapore Institute of Technology (SIT) as Vice-Provost on 2 September 2013,\nand appointed Deputy President (Academic) & Provost on 1 October 2015. Prior to joining SIT,\nhe was Vice Dean of the Faculty of Engineering, Deputy Head of the Department of Mechanical Engineering, Director of Education in the Design Technology Institute Limited and most recently,\nDirector of Bachelor of Technology Programme (BTech Programme) in the Faculty of Engineering\nat the National University of Singapore. He was also a Visiting Scholar at Stanford University\nand a Fellow of the Singapore MIT Alliance. A Colombo Plan scholar, he graduated with First\nClass (Honours) in Engineering from University of Adelaide, Australia. He obtained his Master\nof Engineering from National University of Singapore, and PhD in Mechanical Engineering from\nUniversity of Michigan under the NUS Overseas Postgraduate Scholarship.\nPROFESSOR LOH HAN TONG\nVice-Provost\nSingapore Institute of Technology\nPRESIDENT\nADVANCEMENT\n& ALUMNIINTERNAL AUDIT\nENTERPRISE &\nINNOVATION HUB\nDEPUTY PRESIDENT\n(ADMINISTRATION)\n& CHIEF FINANCIAL\nOFFICER\nLEGAL\nLIBRARYHUMAN\nRESOURCESESTATES\nFINANCEDEPUTY PRESIDENT\n(ACADEMIC) & PROVOST\nVICE-PROVOST ASSOCIATE\nPROVOSTSACADEMIC ANALYSIS\n& PLANNING\nCENTRE FOR\nCOMMUNICATION\nSKILLSFACULTY\nINTERNATIONAL\nCOLLABORATIONS OFFICEADMISSIONS\nSTUDENT LIFEREGISTRAR’S OFFICEACADEMIC PROGRAMMES\nADMINISTRATION\nPROFESSIONAL\nOFFICERSCENTRE FOR LEARNING\nENVIRONMENT & ASSESSMENT\nDEVELOPMENTCOMMUNICATIONS\n& INFORMATION\nTECHNOLOGYVICE PRESIDENT\nSTRATEGIC PLANNING\n& COORDINATION\nSTRATEGIC PLANNING\n& COORDINATIONSAFETY & HEALTHVICE PRESIDENT\nEXTERNAL RELATIONS\nCAREER\nSERVICES\nINDUSTRY &\nCOMMUNITYCORPORATE\nCOMMUNICATIONS\nMr Tsoi is the Vice President (Strategic Planning & Coordination) of Singapore Institute of Technology\n(SIT), appointed on 1 April 2015. Before joining SIT, he was the Director, Energy and Environment\nResearch Directorate at National Research Foundation (NRF), and Director, Defence Industry and Systems Office at MINDEF. Mr Tsoi is a Chartered Engineer in aerospace engineering and was also\na Brigadier General with the Republic of Singapore Air Force. Mr Tsoi graduated from the National\nUniversity of Singapore with a Bachelor of Engineering (Mechanical) in 1986, and obtained his\nMaster of Science in Aeronautics and Astronautics from Stanford University in 1993.\nMR TSOI MUN HENG\nVice President\n(Strategic Planning & Coordination)\nSingapore Institute of TechnologySENIOR MANAGEMENT\nAssociate Professor Yee is the Vice President (External Relations) of Singapore Institute of Technology (SIT), appointed on 1 July 2013. Prior to joining SIT, he was the Vice President of Singapore Technologies\nEngineering Ltd. Within the ST Engineering group of companies, he held senior management positions in technology development and investment, advanced engineering and business development.\nHe was the founding Director of the Precision Engineering and Application Centre and concurrently,\nDirector (Administration) of the Singapore Productivity and Standards Board. He graduated from the\nNational University of Singapore with Bachelor and Master degrees in Mechanical Engineering, and\nobtained his PhD from the Nanyang Technological University.\nASSOCIATE PROFESSOR YEE FOOK CHEONG*\nVice President (External Relations)\nSingapore Institute of Technology\n*Stepped down on 30 Sep 2015.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 20159\nPRESIDENT\nADVANCEMENT\n& ALUMNIINTERNAL AUDIT\nENTERPRISE &\nINNOVATION HUB\nDEPUTY PRESIDENT\n(ADMINISTRATION)\n& CHIEF FINANCIAL\nOFFICER\nLEGAL\nLIBRARYHUMAN\nRESOURCESESTATES\nFINANCEDEPUTY PRESIDENT\n(ACADEMIC) & PROVOST\nVICE-PROVOST ASSOCIATE\nPROVOSTSACADEMIC ANALYSIS\n& PLANNING\nCENTRE FOR\nCOMMUNICATION\nSKILLSFACULTY\nINTERNATIONAL\nCOLLABORATIONS OFFICEADMISSIONS\nSTUDENT LIFEREGISTRAR’S OFFICEACADEMIC PROGRAMMES\nADMINISTRATION\nPROFESSIONAL\nOFFICERSCENTRE FOR LEARNING\nENVIRONMENT & ASSESSMENT\nDEVELOPMENTCOMMUNICATIONS\n& INFORMATION\nTECHNOLOGYVICE PRESIDENT\nSTRATEGIC PLANNING\n& COORDINATION\nSTRATEGIC PLANNING\n& COORDINATIONSAFETY & HEALTHVICE PRESIDENT\nEXTERNAL RELATIONS\nCAREER\nSERVICES\nINDUSTRY &\nCOMMUNITYCORPORATE\nCOMMUNICATIONS\nAs of 1 April 2015.SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 10\nMILESTONES\nFrom welcoming our inaugural batch of students reading\nSIT-conferred degree programmes to commemorating partnerships with industry players, SIT has had a thrilling year. We look forward to marking our calendars with more milestones\nas we grow.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 12\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201513SIT signed a Memorandum of\nUnderstanding (MOU) with Cloud\nSecurity Alliance (CSA) to collaborate\non education and research efforts in cloud security. SIT is CSA’s first\neducational partner and aims to\ncollaborate on applied R&D projects to push the frontier of research in\nsecurity for cloud computing.105 graduands from Technische\nUniversität München (TUM), DigiPen\nInstitute of Technology (DigiPen),\nand the University of Nevada, Las Vegas (UNLV) attended the first\nSIT graduation ceremony for the\nyear. Held at the Suntec Singapore Convention & Exhibition Centre,\nthe ceremony was presided by\nMr Heng Swee Keat, Minister for Education. Offering his felicitations\nto the graduating students, Minister\nHeng also encouraged SIT to press forward with its focus on real world\napplications, innovation and life skills\nduring his keynote speech.\nOver 100 participants formed teams and pitted their skills against one\nanother in friendly matches at this\nannual sports event organised by SIT Basketball Club and SIT Netball\nClub. Street BasNet was a wonderful\nopportunity to strengthen bonds between the two clubs.APRIL 2014\nSIT-CSA MOU\nSigning Ceremony\n1 Apr\nStreet BasNet\n5 AprSIT Graduation\nCeremony\n16 May\nA total of 80 companies and more than 400 students attended Career\nFair 2014, organised in collaboration\nwith our OU Partners, namely, DigiPen Institute of Technology (DigiPen),\nNewcastle University (NU), University\nof Glasgow (UofG) and Technische Universität München (TUM) at\nSingEx. 280 FYP posters were put\non display, and students had the opportunity to talk about their FYP\nto industry partners individually.\nCompanies such as Cyclect Engineering, Far East Organization,\nHyflux, ST Engineering and iPtec,\nconducted recruitment talks which gave students an overview of the\ncompanies and their businesses.\nAt DigiPen’s exhibition area, companies had the opportunity to\nsee the display of game projects,\nanimation reels and portfolios created by the students.MAY 2014\nCareer Fair 2014\n4 Apr\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 14Close to 200 alumni and graduating\nstudents attended the SIT Alumni\nMovie Screening of X-Men: Days of\nFuture Past at Filmgarde, Bugis+ organised by the SIT Alumni\nLeisure Network. At this popular\nevent which was sold out weeks before, SIT alumni mingled with\nSIT senior management, faculty\nand staff over dinner and drinks before settling in with their popcorn\nsets to catch the blockbuster. There\nwas also a lucky draw in which 10 alumni were picked as winners.SIT Alumni Movie\nScreening\n29 May\nThe alumni futsal team came back for the first time to SIT@Dover to\nchallenge SIT staff over a friendly\ngame of futsal. Organised by the SIT Alumni Sports Network, the match\nmarked the inaugural game in the\nseries and offered an opportunity for the alumni team to make use of the\nfacilities available at the SIT@Dover\ncampus.Past vs Present: Futsal\n5 July\nThe SIT Alumni Sports Network held its first-ever Laser Tag\nAdventure at Laser OPS, an\nindoor laser tag arena at Dhoby Ghaut. The event saw alumni and\ngraduating students competing in\nteams of five for the ‘Best Team’ and ‘Top Shooter’ prizes.Laser Tag Adventure\n19 July\nJULY 2014\nAUGUST 2014\nPast vs Present:\nBasketball\n16 Aug\nFormer members of SIT’s Basketball Team returned to SIT@Dover to\ncompete with the current team\nmembers, who were preparing for the Singapore University Games\n(SUniG) in a game organised by\nthe SIT Alumni Sports Network. The alumni team showed it still had\nthe basketball chops and beat the\ncurrent players with a score of 21-10.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201515More than 800 freshmen and\nstudent facilitators were involved\nin the SIT Student Orientation (SSO),\na 3-day, 2-night camp. The SSO is an annual programme that\nwelcomes freshmen to the university\nprior to the commencement of the semester. Through various activities\nat the camp, SIT freshmen bonded\nwith one another and got acquainted with SIT-DNA values.The Singapore University Games is one of the most highly anticipated\nsporting events of the year for\nundergraduates. This year, a total of 185 athletes from SIT took part in\n12 events. Through these sporting\nevents, SIT students displayed their athletic skills and showed\ntheir team spirit.\nAUGUST 2014\nSEPTEMBER 2014SIT Student Orientation\n18 – 20 Aug\nSingapore University\nGames 2014 (SUniG)\n1 Sep – 1 Oct LURning Camp\n5 Sep\nHeld at the SIT@Dover campus,\nthis event’s theme riffed off one\nof SIT’s key DNA traits – “Able\nto Learn, Unlearn and Relearn”. The camp was filled with a series\nof group exercises that would\ncultivate in undergraduates a new mindset that aligned with SIT’s\nindustry-focused ethos. Professor\nLoh Han Tong, Vice-Provost, SIT, urged the new intake of SIT-degree\nstudents to blaze a bright trail\nas pioneers.\nSIT-ACC MOU Signing\nCeremony\n19 Aug\nSIT formalised its partnership\nwith some of Singapore’s key\naccounting firms on its Integrated\nWork Study Programme (IWSP) at an MOU signing ceremony.\nThese firms include Baker Tilly,\nBDO, Deloitte, Ernst & Young,\nFoo Kon Tan, KPMG, Nexia,\nPKF-CAP, PwC, RSM Chio Lim, and\nUHY Lee Seng Chan & Co. The IWSP is a key feature of the university’s\napplied learning pedagogy – through\nthe IWSP applied learning platform, SIT undergraduates are immersed in\na real-work environment when they\nare attached to their host companies for between eight to 12 months.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 16SITizens received tips on how to\nachieve work-life balance at ‘Work\nSmart, Live Happy’, a career talk\norganised by the SIT Alumni Career Network at Grand Park City Hall.\nMr Kirby Chua, Counselling Psychologist from Grace Counselling Centre, guided the attendees\nthrough various exercises on\nhow to identify ‘life stressors’. Participants also learned how to\nkeep tabs on their stress levels at\nwork such that they would be able to find more equilibrium and meaning\nin their lives.The ‘IWSP Preview: A Networking\nSession with Accounting Firms’ took\nplace at the SIT Heritage Gallery\nwith 11 accounting partners and 85 students. Students seized this\nopportunity to raise their queries\nand learn more about the industry, as well as find out more about the\nIWSP positions that these firms were\noffering. The event also provided a platform for the firms to increase their\npresence among the SIT student\nbody before the IWSP application.More than 800 freshmen partied at Zouk at the SIT Welcome Bash\n2014, held on 12 September. The\nevening was also held in conjunction with SIT’s annual pageant, with\nthe crowning of Mr and Miss SIT.\nPerformances by SIT’s very own Muzeka were also part of the\nentertainment lineup.\nWork Smart, Live Happy\n18 SepIWSP Preview:\nA Networking Session with\nAccounting Firms\n19 Sep\nSIT Welcome Bash 2014\n12 Sep\nChillout@SIT marks a season of fun\nand good cheer on the SIT calendar\nwith interactive games, jamming\nsessions and great food. The first Chillout session was held at SIT@\nDover in Oct 2014 and the event\nhas since travelled to the other SIT@Poly Buildings.Chillout@SIT\nOct - Mar\nOCTOBER 2014\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 20151731 industry partners from a\nspectrum of business sectors came\ntogether for a night of networking\nand sharing of experiences with SIT students. A lively panel discussion\ngave some 130 graduating students\ntips and ideas of work experiences in an SME. SIT also formalised its\npartnership with Association of Small\nand Medium Enterprises (ASME) with an MOU signing ceremony.\nHeld at SIT@Dover, the event marked the first broad SIT university-industry partnership on projects\nfocusing on technology development\nand enterprise.Enterprise Nexus\n6 Nov\nNOVEMBER 2014\nStudents got an opportunity to learn and engage with SIT’s\nmanagement team and build their\nconfidence in networking. It was a cosy session as students learnt from\nthe SIT management team’s career\njourneys and experiences.LURning\nConversation with SIT\nManagement\n14 Nov\nLittle Twinkles\n11 Oct\nScholarship\nAwards & Appreciation\nCeremony 2014\n30 Oct\nSIT Community Service Club, in collaboration with Autism\nAssociation of Singapore, held a\nChildren’s Day Celebration for the kids at Eden’s Children Centre and\ntheir family members. More than\n170 student volunteers, organisers, beneficiaries and their families,\ntook part in the event. It was a day\nfilled with games and sing-along sessions as SIT students mingled\nwith children from the centre.SIT’s inaugural Scholarship Awards\n& Appreciation Ceremony was\nheld at SIT@Dover to celebrate\nthe achievements of its new and graduating scholars. During the\nceremony, 12 SIT scholars as well\nas 8 recipients of the SIT Final Year scholarship formally received their\nawards. Eleven graduating SIT\nScholars were also presented their scholarship certificates.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 18SIT Graduation Ceremony\n26 Nov\nNew Alumni\nWelcome Party 2014\n28 NovOver 1300 guests and 344 graduates\nattended the SIT Graduation\nCeremony which was held at\nthe Suntec Singapore Convention & Exhibition Centre. The graduands\nwere students from SIT’s overseas\nuniversity (OU) partners, including Technische Universität München\n(TUM), Newcastle University (NU),\nDigiPen Institute of Technology (DigiPen), The Culinary Institute\nof America (CIA), University of\nNevada, Las Vegas (UNLV), The Glasgow School of Art (GSofA),\nWheelock College (WLC), Trinity\nCollege Dublin (TCD), The University of Manchester, and\nUniversity of Glasgow (UofG).\nThe ceremony also marked a time for the graduates to look back on\ntheir SIT years as video montages\ncapturing the highlights of the past academic year went on display in\nthe event hall.\nHeld at Hard Rock Café (Orchard\nRoad), the New Alumni Welcome\nParty 2014 attracted over 200\nnewly-minted alumni, SIT senior management, faculty, staff and\nrepresentatives from the overseas\nuniversity (OU) partners. This was an important event on the\nUniversity calendar, marking the\nrite of passage from student to alumnus. The welcome evening\nfeatured students and alumni from\nthe band Muzeka, a mentalist show, and various lucky draws.\nThe 17th ASEAN University Games 2014 was held in Palembang,\nIndonesia. SIT student, Hannah Lee,\nmade Singapore proud when she won the Bronze and Silver medals\nin the Women’s Discus and Shot Put\ncategories respectively.15 SIT students travelled to Hue City, Vietnam to engage with\nchildren from the Tay Xuan Daycare\nCentre. Apart from spending time with the children, SIT students also\nworked to build a fence at the centre\nto improve its security. The trip also provided SIT undergraduates\nan opportunity to interact with the\nlocal college students over food\nand games.ASEAN University Games\n(AUG)\n9 – 19 DecProject Vietnam\n21 Dec\nDECEMBER 2014\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201519SIT hosted Prime Minister\nLee Hsien Loong during his\ninaugural visit to the university’s\nSIT@Dover campus. He was accompanied by a delegation\nled by Ms Indranee Rajah, Senior\nMinister of State, Ministry of Law and Education. PM Lee\nwas first updated on the newest\ndevelopments in SIT by Professor Tan Thiam Soon, President, SIT,\nbefore meeting with over 40 student\nleaders. The Prime Minister was also taken on a tour of the SIT@\nDover campus followed by a meet-\nand-greet session with more than 20 faculty members at the Student\nActivities Centre. Prime Minister\nLee Hsien Loong visits SIT\n27 Jan\nSIT Open House 2015\n17 – 18 Jan\nSIT Open House 2015, which was\nthe university’s first Open House\nevent following its new status\nas an autonomous university, featured a series of student-led\nperformances and activities during\nthe two-day event. Held at the Suntec Convention and Exhibition\nCentre, the Open House saw the\nparticipation of more than 4500 prospective students and parents\nwho interacted with faculty, staff and\nstudents and obtained first-hand information on the various degree\nofferings at SIT. SIT launched a new joint\ndegree programme in Systems\nEngineering (ElectroMechanical\nSystems) [SEEMS] with overseas university (OU) partner, DigiPen\nInstitute of Technology (DigiPen),\nat a signing ceremony. The new\nmulti-disciplinary degree programme\nwill bring together the fields of\nmechanical, electrical, electronic,\nand computer engineering with\na holistic approach to system\ndevelopment. SEEMS focuses on the engineering of complex\nmechanical systems that are\ncontrolled by microprocessors and microcontrollers.\nSEEMS Joint Degree\nProgramme Signing Ceremony\n13 Jan\nSIT Press Conference\n13 Jan\nJANUARY 2015\nSIT kicked off the new year by announcing the launch of its five\nnew applied degree programmes at\na press conference. The university also announced the launch of an\nEnterprise & Innovation Hub (E&I\nHub) which serves as a platform that allows SIT undergraduates\nto develop critical learning skills\nand drive innovation at the\nworkplace. The Hub will also\nengage industry partners on applied\nprojects to enhance the value chain of relevant technology.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 20SIT held two appreciation events\nfor the university’s athletes and\nstudent leaders respectively. Close\nto 300 athletes and student leaders attended the events, held separately\nat Hotel Fort Canning and Chijmes.\nThese were organised in recognition of the contributions made by SIT’s\nstudent athletes as well as student\nleaders.FEBRUARY 2015\nStudent Appreciation\nDinner (Sportsmen and Student\nLeaders)\n9 Jan & 6 Feb\nSIT signed a Memorandum of Understanding (MOU) with\nSingapore Manufacturing Federation\n(SMF) to collaborate on enhancing SIT students’ career opportunities\nthrough SIT’s Integrated Work\nStudy Programme (IWSP). The partnership also involved working\nto upgrade manpower capabilities\nin productivity improvement for the manufacturing sector.SIT-SMF MOU Signing\nCeremony\n30 Jan\nVolunteers Appreciation\nDinner\n30 JanStudent Leaders’ Retreat\n31 Jan – 2 FebThe SIT Alumni Team hosted dinner for a group of volunteers at\nCups N Canvas at Selegie Road.\nComprising alumni and graduating students, the volunteers made\ngreat contributions to the smooth\nplanning and organisation of SIT alumni events over the past year. The\ndinner also provided the volunteers\nwith an opportunity to get to know each other better.\nOver 40 student leaders gathered for a two-night retreat at Eco Kulim\nTrail Resort, Ulu Tiram, Johor,\nMalaysia in early 2015. The retreat helped SIT students learn more\nabout leadership and organisational\nskills. It also served as a platform for fellow student leaders to network\nand share experiences.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201521It was a lively affair at Suntec\nSingapore with 97 companies\nand more than 500 students. An\ninteractive dialogue session between students and industry professionals\ntitled “Voices of Experience” was\nintroduced this year. Industry partners and alumni were invited to\nshare their personal career journeys\nand what it takes to succeed in their respective industries.\nCompanies left with a positive\nimpression of SIT students –\nconfident, mature, and able to ask\nappropriate questions. Students also highlighted that the fair provided a\nvaluable opportunity to engage with\npotential employers, and came away with new knowledge and valuable\ncareer advice.SIT brought together top hospitality\nindustry leaders, faculty and\ninternational scholars to discuss\ntrends and challenges facing the hospitality industry in Singapore\nand beyond. The topic, ‘Shaping the\nFuture of Hospitality in Singapore’, sparked insightful discussions on\ninternational hospitality experiences,\nboosting productivity and innovation in an evolving economy, as well\nas the need for skilled personnel\nwho will shape Singapore’s future hospitality industry.\nHospitality Business\nSymposium\n4 MarMARCH 2015\nCareer Fair 2015\n4 Mar\nSIT organised its second SIT Industry Appreciation Dinner to\nthank the university’s industry\npartners for their contributions over the past year. Guest of Honour,\nMr Quek See Tiat, Chairman, Building\n& Construction Authority (BCA) led the annual tradition of ‘Lo Hei’ to\nsignal the commencement of dinner.\nThis year, guests were also invited to pen their well-wishes on gold flowers\nand pin them on an interactive ‘Tree\nof Prosperity’.Industry Appreciation\nDinner\n26 Feb\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 22More than 330 guests were hosted\nat the Singapore Marriott Hotel for\nSIT’s flagship scholarship event. The\nevening saw SIT’s Board of Trustees, key representatives from SIT Senior\nManagement, polytechnics, overseas\nuniversity (OU) partners and industry representatives mingling\nwith more than 230 scholars.\nIn its second consecutive run,\n‘Reach for the Stars’ is not just an\nopportunity for scholars to network\nbut also allows SIT to express its appreciation to industry partners and\ndonors for their continued generosity\nand support.In honour of the late Mr Lee Kuan Yew,\nSingapore’s founding father, SIT\nobserved a minute of silence at the\nmemorial service, which was live-streamed to students at various\nSIT@Poly Buildings island-wide. The\nmemorial service included a video tribute celebrating the life of Mr Lee.\nA Tribute Room was set up next to\nthe SIT@Dover Auditorium to allow SIT staff and students to pen their\nmessages of condolence.\n‘Reach for the Stars’\n10 MarMemorial\nService for former\nMinister Mentor\nMr Lee Kuan Yew\n24 Mar ‘Tips on Managing Your\nFinances’\n28 Mar\nA ‘Tips on Managing Your Finances’\ntalk was organised by the SIT\nAlumni Career Network at Hotel Jen\n(Orchard Gateway). The session was led by Mr Daniel Chong, who\nhas two decades of experience\nin the financial services sector.\nMr Chong provided tips to the 23\nalumni and graduating students\non various aspects of financial management. Participants also\nwent through a case study where\nthey had to make sound financial recommendations.\nPOLYTECHNIC PARTNERS\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201523SIT works closely with the five local polytechnics – Singapore Polytechnic, Ngee Ann Polytechnic, Temasek Polytechnic, Nanyang\nPolytechnic and Republic Polytechnic – to prepare students as they transition from polytechnic to university and become valuable players in today’s competitive world.\nTEMASEK POLYTECHNIC\nPrincipal & CEO, Mr Boo Kheng Hua\n“TP is pleased to partner SIT in our shared endeavour to train and prepare graduates\nin areas relevant to Singapore’s future growth and development. SIT offers great opportunities for polytechnic upgraders who are keen to pursue and deepen their skills and competencies in their professional disciplines.”\nNANYANG POLYTECHNIC\nPrincipal & CEO, Ms Jeanne Liew\n“NYP is happy that since 2011, SIT’s Overseas University partners have been\nconducting classes for eight undergraduate programmes on Nanyang Polytechnic\nCampus. Since January 2015, these classes have been running at the newly built SIT@NYP Building. These degree programmes do provide polytechnic graduates\nwith more opportunities to enhance their expertise and build on their industry-\nrelevant education and training received at the polytechnics, and we look forward to\nour continued collaboration with SIT. ”\nREPUBLIC POLYTECHNIC\nPrincipal & CEO, Mr Yeo Li Pheow\n“Republic Polytechnic congratulates Singapore Institute of Technology on the\ncompletion of its new SIT building on our campus. In the ever-evolving educational landscape, we proudly partner SIT in the continued quest to help our younger generation and adult learners gain a deeper understanding and appreciation for lifelong learning.”SINGAPORE POLYTECHNIC\nPrincipal & CEO, Mr Tan Choon Shian\n“SP is proud to be part of SIT’s blueprint which has transformed into reality.\nThe SIT-DNA marries well with SP’s vision of developing a caring community of inspired learners committed to serve with mastery. SP welcomes all SIT students to the SP campus and wishes SIT all the best as it continues to groom polytechnic graduates into masters in their chosen fields.”\nNGEE ANN POLYTECHNIC\nPrincipal, Mr Clarence Ti\n“With the introduction of five new degrees offered by SIT this year, there are now\nmore pathways for polytechnic graduates to upgrade their skills and qualifications. The new degree programmes focus on skills mastery and are very much aligned with the national SkillsFuture movement. I am confident that SIT will continue to nurture graduates with the right competencies to succeed in today’s global economy.”\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 24SIT continues to value its strong ties with overseas university partners and provides a\nworld-class education for students to achieve their highest aspirations. With 10 overseas university partners from Europe and the US providing degree programmes from naval\narchitecture to culinary arts management, students are grounded in industry-focussed\ndegrees, ensuring professional relevance when they graduate. OVERSEAS UNIVERSITY\nPARTNERS\nNEWCASTLE UNIVERSITYProgrammes offered in partnership\nwith SIT:\n• Bachelor of Engineering with Honours in\nChemical Engineering\n• Bachelor of Engineering with Honours in\nElectrical Power Engineering\n• Bachelor of Engineering with Honours in  Marine Engineering\n• Bachelor of Engineering with Honours in\nNaval Architecture\n• Bachelor of Engineering with Honours in  Offshore Engineering\n• Bachelor of Engineering with Honours in  Mechanical Design and Manufacturing\nEngineering\n• Bachelor of Science with Honours in\nFood & Human Nutrition\nNewcastle University (NU) is one of the\nUK’s most reputable higher education institutions. It is a member of the Russell Group, comprising the United Kingdom’s 24 leading research-intensive universities, and it is acclaimed for its multidisciplinary research, teaching excellence, and for the preparedness of its graduates for their professional careers. NU’s work has been recognised by prestigious awards including Queen’s Anniversary Prizes for Higher and Further Education.\nNU can trace its origins back to 1834 but\nit was the founding of Armstrong College\nin 1871 which introduced fundamental\nsubjects such as chemistry, mathematics\nand physics to the University. Armstrong College also had a focus on the applied\nsciences, such as agriculture, engineering\nand naval architecture, which underpinned\nNewcastle’s economic growth. This\nfocus continues today in NU’s Faculty of Science, Agriculture and Engineering\nand in the seven degree programmes\nwhich NU offers in Singapore. Each of\nthese programmes delivers a modern\ninterpretation of the industrially-relevant degree and our students develop skills,\nknowledge and understanding which allow them to compete successfully in the job market and build successful and satisfying professional careers.\n“Newcastle University is bridging academia, industry and government to deliver\ninnovative solutions for Singapore’s economic future and a pool of world-class talent. Newcastle University, one of the UK’s most established research-intensive universities, is working in partnership with Singapore Institute of Technology to deliver 7 Newcastle degree programmes to over 700 undergraduate students in Singapore. Newcastle University’s core research strengths in science, technology and engineering are advantageously aligned with Singapore’s strategic challenges. Newcastle University aims to work with the government to help Singapore reach its economic and technological aspirations by developing translational research\nand educating human talent. Newcastle University researchers in Singapore\ncollaborate with top institutions and companies such as A*STAR and SembCorp, and work at the forefront of critical areas such as high-tech energy, transport, process and systems. Newcastle University is cultivating future transindustry innovators and leaders through education, and students benefit from NUIS’s deep\nconnections with the public and private sector.”\n- Professor Ehsan Mesbahi, Dean (Singapore),\nChief Executive, Newcastle University International Singapore (NUIS)\nTECHNISCHE UNIVERSITÄT MÜNCHENProgrammes offered in partnership with SIT:\n• Bachelor of Science in Chemical Engineering\n• Bachelor of Science in Electrical Engineering\nand Information Technology\nUNIVERSITY OF GLASGOWProgrammes offered in partnership with SIT:\n• Bachelor of Engineering with Honours in\nAeronautical Engineering\n• Bachelor of Engineering with Honours in Aerospace Systems\n• Bachelor of Engineering with Honours in\nMechanical Design Engineering\n• Bachelor of Engineering with Honours in Mechatronics\n• Bachelor of Science with Honours in Computing ScienceFounded in 1868 by King Ludwig II,\nTechnische Universität München (TUM) has long established itself as a premier institute of higher learning in Germany, producing a total of 13 Nobel Laureates to date. Besides being ranked as Germany’s #1 University for 3 consecutive years - 2011, 2012 and 2013 Shanghai Ranking (Academic Ranking of World Universities, ARWU), TUM is also in the world’s top 50 “Since the start of our partnership, both\nSIT and TUM Asia have believed in a\ncommon vision – to shape students\ninto “thinking tinkerers”. Now five years into this collaboration, we\nhave seen the vision fulfilled and we\nare excited to see our partnership take to new heights.”\n- Dr Markus Wächter,\nManaging Director, TUM Asia\nAs the fourth-oldest university in the\nEnglish-speaking world, UofG has been inspiring people for over 550 years. It is also part of the United Kingdom’s distinguished Russell Group of leading UK universities and a founding member of Universitas 21 – an international network of universities established as an international reference point and resource for strategic thinking on issues of global significance. It is associated with seven Nobel Laureates\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201525for engineering and biological sciences, including placing 20th for Chemistry in the QS World University Rankings by Subject 2015. In 2002, TUM Asia, the branch campus of TUM, was set up in Singapore to bring German academic excellence to Asia. TUM Asia strives to continuously provide industry-focused education offerings in tune with the needs of the global economy.\nand boasts alumni like Adam Smith, Lord\nKelvin and James Watt. UofG’s School of Engineering sustains a broad portfolio of leading-edge research funded by industry, research councils, and governmental agencies around the world.\n“Our partnership with SIT goes from\nstrength to strength and we are delighted\nthat we are continuing to work together\nso effectively to provide first class programmes for immensely talented\nstudents. International collaborations\nare increasingly vital and relevant in today’s world and the University of\nGlasgow is proud to be working with SIT\nfor the mutual benefit of our staff, and students, equipping them to contribute\nfully to our shared global challenges\nand opportunities.”\n- Professor Anton Muscatelli,\nPrincipal & Vice-Chancellor\nProgrammes offered in partnership\nwith SIT:\n• Bachelor of Science in Computer Science\nin Real-Time Interactive Simulation\n• Bachelor of Science in Computer Science\nand Game Design\n• Bachelor of Fine Arts in Digital Art\nand Animation\n• Bachelor of Arts in Game Design\nProgramme offered jointly with SIT:\n• Bachelor of Engineering with Honours\nin Systems Engineering\n(ElectroMechanical Systems)\nDIGIPEN INSTITUTE OF TECHNOLOGY\nDigiPen Institute of Technology (DigiPen)\nis a dedicated, world-renowned leader in education and research in computer interactive technologies. As a leading institute of higher education, DigiPen is committed to fostering academic growth and inspiring creativity in all its students. As the first school in the world to offer a bachelor’s degree in game development, DigiPen has advanced the game industry for more than 25 years by empowering students to become skilled software developers, computer scientists, engineers, designers, and digital artists. Located in Redmond, Washington, U.S.A., with branch campuses in Singapore and Bilbao, Spain, DigiPen offers undergraduate and graduate degrees in disciplines related to video game design and development, hardware and software engineering applied to simulation, computer science, fine arts and digital art production, as well as sound design, and youth programmes. Over the years, DigiPen has won more awards for its student games at the\n“We are delighted with our ongoing working relationship with SIT. I have full confidence\nthat the collaboration will be instrumental in providing the innovation and manpower\nneeds for building a world-class interactive digital media and visual effects industry\nin Singapore. I believe that in the years ahead, our graduates will form a core group of professionals who will create world-renowned ‘Made-in-Singapore’ products for\nthe global market.”\n- Mr Claude Comair, President and Founder\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 26prestigious Independent Games Festival\nthan any other school in the world. Since 2011, 10 out of the 24 total finalists in the IGF China student competition have been games from DigiPen Institute of Technology Singapore, DigiPen (Singapore). Graduates of DigiPen (Singapore) have gone on to work on ground-breaking game franchises, such as Bungie’s Destiny and have joined some of the top game and animation studios in Singapore — including Ubisoft, Lucasfilm, Koei Tecmo, and more.\nTRINITY COLLEGE DUBLINProgrammes offered in partnership with SIT:\n• Bachelor in Science (Physiotherapy)\n• Bachelor in Science (Occupational Therapy)• Bachelor in Science (Radiation Therapy)\nProgramme offered jointly with SIT:\n• Bachelor in Science (Diagnostic Radiography)\nTrinity College Dublin (TCD) is Ireland’s\nhighest-ranked university with a history that dates back to 1592. Situated in the very heart of Dublin city, Trinity College Dublin is recognised as a top international centre for research with a high level of international collaboration. As Ireland’s University on the World stage, Trinity is recognised for academic excellence and a transformative student experience. The unique combination of TCD’s academic excellence, vibrant student experience, and convenient city-centre location means\n“Since the inception of the Physiotherapy and Occupational Therapy programmes\nin 2012, and the Diagnostic Radiography and Radiation Therapy programmes in 2014 the Trinity degree programmes have received good feedback from students,\ngraduates, and employers. The programmes are very popular and Trinity is delighted\nto continue and develop its collaboration with SIT.”\n- Associate Professor John Gormley, TCD Academic Director for\nSIT programmes, School of Medicine\nTHE UNIVERSITY OF MANCHESTERProgramme offered in partnership with SIT:\n• Bachelor of Science with Honours in Nursing Practice\nThe University of Manchester (UoM) was\nestablished in 1824 as England’s first civic university and is now the largest campus based university in the UK. A member of the esteemed Russell group, the UoM has a proud history of achievements with 25 Nobel Laureates among its staff and alumni. The UoM was the first university in England to offer a nursing degree and appoint a Professor of Nursing. The UoM continues to influence health care policy, practice, education, and research by producing national and international nursing leaders. The UoM’s innovative two-year honours degree programme equips “The UoM degree programme\ncontinues to grow from strength to strength. The first 48 graduates\nfrom the initial cohort have achieved\nsuccess both in terms of employment and now as our illustrious alumni. The next cohort to graduate have produced\nexcellent results and we are very proud\nof their achievements.”\n- Dr John Costello, Associate\nProfessor, Programme\nDirector, BSc (Honours)\nNursing Practice\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201527students, scientists, and scholars from all\nover the world continue to choose TCD as a study destination.\ngraduates to make evidence-based\ndecisions in their practice, meeting the challenges of the changing demographics in Singapore health care. Clinical attachments allow Registered Nurses to develop and apply analytical skills in practice while the Manchester Leadership Programme provides opportunities to develop leadership skills. The UoM Programme Director, Dr John Costello, looks forward to consolidating the\nSIT-UoM partnership and the provision of a high standard of educational achievement.\nTHE GLASGOW SCHOOL OF ARTProgrammes offered in partnership\nwith SIT:\n• Bachelor of Arts with Honours in\nCommunication Design\n• Bachelor of Arts with Honours in\nInterior Design\nThe Glasgow School of Art is internationally\nrecognised as one of Europe’s leading university-level institutions for the visual creative disciplines. Our studio-based approach to learning and teaching brings disciplines together to explore problems in new ways to find new innovative solutions. The studio creates the environment for inter-disciplinarity, peer learning, critical enquiry, experimentation and prototyping, helping to address many of the grand challenges confronting society and contemporary business.\nSince the School was founded in 1845\nas one of the first Government Schools of Design, as a centre of creativity promoting good design for the manufacturing industries, our role has continually evolved and redefined to reflect the needs of the communities we are part of, embracing the late 19th century fine art and architecture education and today, digital technology. Then as now, our purpose remains the same – to contribute to a better world through creative education and research.\n“The specialist design programmes and teaching at The Glasgow School of Art\nproduce graduates able to make a significant contribution to cultural and creative production in SE Asia and the world.\n“Our shared visual language transcends national boundaries – whether based in\nGlasgow or Singapore our graduates leave equipped to engage and contribute globally, able to adapt to the changing economic role of creativity and innovation in\nthe knowledge economy and the skilled graduates that it demands.”\n- Mr Thomas Greenough, Acting Director, GSA Singapore\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 28All GSA degree programmes are validated\nby the University of Glasgow. Established in 1451, the University of Glasgow is a member of the prestigious Russell Group of leading UK research universities and a founder member of Universitas 21, an international grouping of universities dedicated to setting worldwide standards for higher education. Students may choose to study honours degree programmes in Communication Design or Interior Design in Singapore.\nWHEELOCK COLLEGEProgramme offered in partnership with SIT:\n• Bachelor of Science in Early Childhood Education\nFor over 127 years, Wheelock College\n(WLC) of Boston, USA, has been an outstanding institution that seeks to provide a transformational education for students who are passionate about making the world a better place, with a special emphasis on preparing its learners to teach, mentor, and nurture young children and their families. The Wheelock degree balances a deep understanding of theory with the development of real-world skills in its curriculum and internships, guiding its graduates to become skilful, sought-after practitioners and leaders in the professions of education, social work, child life, and juvenile justice and youth advocacy. Its broad-based, globally-focused degrees provide a distinctly “As more and more countries commit\nto early learning as a priority essential to their economic and civic future,\nWheelock College continues to provide\nhighly trained early childhood educators as a crucial building block for nations to remain competitive and dynamic. As\nthe need for early childhood expertise\ngrows across sectors – technology, media, museums/libraries, business – our graduates will be the creative problem-solvers who are willing to seek out and\ntest new ideas, take risks, learn from\nfailure, and share their findings.”\n- Ms Beth Fredericks, Executive\nDirector, WLC Singapore\nTHE CULINARY INSTITUTE OF AMERICAProgramme offered in partnership with SIT:\n• Bachelor of Professional Studies in\nCulinary  Arts Management\nSince its establishment in 1946, The\nCulinary Institute of America (CIA) has set the global gold standard for culinary education. Its proven degree programmes have produced more than 48,000 culinary professionals, including top chefs such as Anthony Bourdain ’78, Cat Cora ’95, and Roy Yamaguchi ’76. The historic SIT-CIA partnership marked the first time that the CIA offered its programmes in Asia.“The Singapore Institute of Technology, through its partnership with world-class\nuniversities, and its own degree programs, prepares students to not only be critical thinkers with the uncanny ability to problem solve and innovate but provides the best\ntalent of Singapore with the requisite skills to lead in fields that are the drivers of the\neconomy. Students and faculty through the collaborative process are able to have access to alumni of both SIT and the overseas partner. These relationships provide a platform of support which broadens the SIT network of committed and educated\nprofessionals who are world-class leaders in their fields of expertise and research.\nThe Culinary Institute of America is delighted to be on the cutting edge, with SIT, of developing the leaders of the hospitality and food and beverage industries now and for the future.”\n- Chef Eve Felder, Managing Director, CIA Singapore\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201529              interactive classroom experience for\nits students, and its early childhood programme offered in conjunction with SIT employs a unique co-instruction model where most of its courses are taught jointly by Wheelock’s internationally renowned faculty members and Singapore instructors. In-coming Wheelock College Executive Director Beth Fredericks joins the Wheelock-Singapore programme focussed on an on-going commitment to ensuring a rigorous curriculum taught by caring and committed world-class faculty members. This, together with the immersion programme in Boston and tight bonds formed among students, promotes innovation and transformation in the lives of young children and their families.\nProgramme offered in partnership\nwith SIT:\n• Bachelor of Arts with Honours in\nCriminology and Security\nUNIVERSITY OF LIVERPOOL\nThe University of Liverpool is one of the UK’s leading research institutions with an annual turnover of £465 million, including £89 million for research. Ranked in the top 1% of higher education institutions worldwide, Liverpool is a member of the prestigious Russell Group of the UK’s leading research universities.\nThe University has 32,000 students,\n7400 of whom travel from all over the world to study there, and 195,000 alumni in 200 countries. Its global focus has led the institution to establish a university in Suzhou near Shanghai, in partnership with Xi’an Jiaotong University, as well as a campus in London. The University is the largest provider of 100% online postgraduate degree courses in Europe with over 10,000 students studying for Liverpool degrees around the world.  “The BA (Hons) in Criminology and Security offered by the University of Liverpool in\npartnership with SIT is an extremely popular course. We are thrilled to have received more than 700 applications in 2015 to join our growing student body. In September\nwe will welcome our third cohort which will increase our student numbers to over\n200. This year is also exciting because it is the first time we are taking our students for their overseas immersion programme in Liverpool for four weeks of academic activities, educational visits and sightseeing too.\nAs well as having a dynamic student body, the academic staff are growing in\nnumber as well, meaning we are able to bring in expert social scientists to pursue internationally-recognisable research from their base in Singapore. It is a great privilege to be involved in expanding Singapore’s first and only criminology degree\nin partnership with SIT, and it is highly rewarding to witness the great strides that our\nstudents are making in relation to their understanding of complex and challenging ideas about human society.”\n- Dr Leon Moosavi, Programme Director and Lecturer in Sociology,\nUniversity of Liverpool\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 30\nSingaporeTech.edu.sg\nSIT BLUEPRINT\nIn keeping with its vision of being a leader in innovative university education by\nintegrating learning, industry and community, SIT has mapped out its strategic plans for the next 10 years.\nThis strategic blueprint will be instrumental to SIT’s continued growth, as the university\nof applied learning sets for itself a planned annual intake of 3500 students by 2020, rising to over 10,000 enrolled students by 2024.\nNotably, the plan for strategic action will take into account a unique and key feature of\nthe university’s applied learning pedagogy – Integrated Work Study Programme (IWSP) – where SIT undergraduates are immersed in a real-work environment for between eight to 12 months.\nThis blueprint will also ensure that the SIT graduate will be able to compete ever\nmore intensely in a globalised world facing various disruptive changes. These very SIT graduates will each be imbued with the SIT-DNA, comprising four traits, namely: ‘Thinking Tinkerer’, ‘Able to Learn, Unlearn and Relearn’, ‘Catalysts for Transformation’, and ‘Grounded in the Community’.\nThe trajectory which SIT is embarking on will be oriented towards five strategic goals,\nas follows:\n1\n35 24To produce highly employable\ngraduates who are adaptable\nto a fast-changing economy\nTo evolve sustainable and\nstrategic partnerships with overseas university partnersTo develop a stimulating learning environmentTo build a symbiotic relationship with industry and communityTo become an innovative, dynamic and enterprising\nPeople’s Organisation\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201531\nSingaporeTech.edu.sg\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 32\nSIT’s applied degree programmes place a strong emphasis on skills mastery through enhanced collaboration with industry partners.\nAll SIT degree programmes will feature the IWSP, ranging from eight to 12 months as a core component of its curriculum.\nSIT’s very own applied degree programmes are as follows:\nDeveloped in consultation with the Building and Construction Authority (BCA)\nSingapore, this degree programme aims to produce graduates trained in the areas\nof Efficient Energy Management, Heating Ventilation and Air Conditioning (HVAC)\nand Building Information Modelling (BIM). Students will have the opportunity to obtain professional certifications in Green Mark Certification, Fire Services Safety\nManagement and Work Place Safety and Health.\nUndergraduates will go through rigorous academic training and have a chance to\nimmerse themselves in the Singapore land and transport industry through work stints with organisations such as Land Transport Authority, Singapore Technologies and\nSembcorp Industries.\nThe first of its kind offered in Singapore, this programme will equip undergraduates with\nknowledge and skills pertaining to drug manufacturing, including drug development\nand production, process development, operations, validation, regulation and\ncompliance. Students will also be trained in core competencies in the development and manufacture of the two largest classes of pharmaceutical drugs in biologics and\nsmall molecule drugs. Master of Engineering Technology\n& Bachelor of Engineering with Honours in Sustainable Infrastructure Engineering\n(Building Services)\nMaster of Engineering Technology\n& Bachelor of Engineering with Honours in Sustainable Infrastructure Engineering (Land)\nBachelor of Engineering with\nHonours in Pharmaceutical Engineering\nA four-year undergraduate degree programme that aims to provide a holistic coverage\nof the entire information security process from the securing of software to the defence,\nmonitoring and recovery of information systems, as well as the governance and\nmanagement of information security in an organisation.Bachelor of Engineering with\nHonours in Information and Communications Technology (Information Security)\nThis highly specialised degree programme covers the development of software\nas well as the design, operation, analysis, optimisation, security, maintenance\nand management of software in a holistic and systematic manner. This is a highly\nspecialised programme that focuses on depth rather than generic breadth in key areas. Bachelor of Engineering with\nHonours in Information and Communications Technology (Software Engineering)SIT-CONFERRED DEGREE\nPROGRAMMES\nSingaporeTech.edu.sg\nA three-year honours programme, the SIT Accountancy programme will not just\nallow undergraduates to go through rigorous academic training but immerse\nthemselves in the accounting and finance industry through work stints with\nestablished accounting firms including Deloitte, Ernst & Young (EY), KPMG and PricewaterhouseCoopers (PwC).\nDesigned to develop the next generation of transformational leaders for local and\nglobal hospitality markets, this degree programme will equip undergraduates with\nsolid industry knowledge and sound business analytical skills that are essential for middle management in the hospitality industry.\nGraduates of this honours degree programme will extend their knowledge and\nskills to be able to undertake more advanced and evidence-based practice.\nStudents will participate in a six-week clinical placement in Dublin.Bachelor of Accountancy\nwith Honours\nBachelor of Hospitality Business\nwith Honours\nBachelor in Science\n(Diagnostic Radiography) –\na joint degree programme offered\nwith Trinity College Dublin\nA multi-disciplinary degree programme that brings together the fields of mechanical,\nelectrical, electronic and computer engineering with a holistic approach to system\ndevelopment. SEEMS focuses on the engineering of complex mechanical systems\nthat are controlled by microprocessors and microcontrollers. Bachelor of Engineering with\nHonours in Systems Engineering (ElectroMechanical Systems) [SEEMS] - a joint degree\nprogramme offered with DigiPen Institute of Technology\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201533\nENTERPRISE &\nINNOVATION HUB\nSIT’s Enterprise & Innovation Hub (E&I Hub) was officially launched this year. The Hub is a meeting point for\nchampioning industry collaboration, promoting student enterprises and managing grant schemes that support\nfaculty in industry projects.\nThe mission of E&I Hub is:\n• To be the focal centre for industry projects and collaboration with companies. Companies can advance the development\nof their innovative products and services at SIT by leveraging on the expertise of our technology experts and students.\n• As a leader in moulding enterprising and innovative students by enhancing their learning experience through\nindustry collaboration.\nSIT partners with the industry to develop industry projects. When working on projects, SIT will consider the following\nguiding principles:\n• Enhancement of Student Learning\nThe projects must enhance student’s learning. Through these industry projects, students are provided with first-hand experience in project management and product development.\n• Close Nexus with the Industry and SIT\nThe projects undertaken by SIT are co-created with the industry, and this will provide the project the best chance for test-bedding and commercialisation.\n• Promote Collaboration\nThe partnership between SIT and industry will strengthen collaboration, drawing like-minded organisations and academic institutions together to work on translational work, and thus advancing the development of innovative products and services.\nSIT’s positioning as the industry’s partner of choice has been well-received. Since its inception, it has made headway in attracting interest from industry to collaborate\nwith SIT faculty on projects. SIT is currently working in\npartnership with companies from the Association of Small & Medium Enterprises, multinational companies\nand government agencies on industry projects.WHY PARTNER SIT?\nIndustry Partners with SIT receive support in these areas:\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 34DOMAIN\nEXPERTISE\nPROJECT\nSPACE &\nMENTORSHIPAPPLIED\nRESEARCH\nSIT\nENTERPRISE &\nINNOV ATION\nHUBINTEGRATED\nWORK STUDY\nPROGRAMME\n(IWSP)INDUSTRY-\nCENTRIC\nINTELLECTUAL\nPROPERTYINDUSTRY\nFUNDINGREDEFINING INNOVATION\nKEY STRATEGIC CONSIDERATIONS\nCHAMPIONING INDUSTRY COLLABORATION\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201535\nSIT introduced an internal fund to support industry projects in July/August 2015. The grants are set up to provide early-stage\nfunding support for faculty to embark on industry projects involving students and companies in Singapore. These industry\nprojects are expected to have strategic alignment with SIT’s strategic goals so as to enhance students’ learning experience\nand provide opportunities for SIT faculty to work on real industry projects.\nIGNITION GRANT\n• 1-year funding scheme to support\nproof-of-concept  (POC) project\n• To translate project ideas  to prototypesINNOVATION GRANT\n• 2-year funding scheme to support\nproof-of-value (POV) project\n• To convert project prototypes into\ncommercial solutions that can be adopted by the industryIDEA PROTOTYPE VALUEGRANT CATEGORIES AND DURATIONGRANTS TO SUPPORT FACULTY\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 36E&I HUB\nENTREPRENEURSHIP\nECOSYSTEM\n• The Enterprise Immersion Programme  which was launched this year. Students honed their\nbusiness skills in local programmes, strengthening them by participating in overseas programmes.\nThe overseas programmes exposed students to different culture and practices, and the increasing globalised nature of business. In May and August 2015, SIT partnered with National University of Singapore Research Institute in Suzhou (NUSRI) to host over 40 students to learn Sun Tzu‘s Art of\nWar and Laozi‘s leadership philosophy by applying them into their business ideas.\n• A $100,000 Catalyst Fund  that was launched to aid\nstudents’ innovative business ideas. Seed funding,\ncapped at S10,000 per idea, aims to help students translate their ideas into business solutions. Where necessary, SIT will help students seek external funding.\n• A Co-working Space  also known as The Catalyst,\nallows students to work on their enterprising ideas and build prototypes. It is also a place to network with other enterprising students, exchange ideas and collaborate.\n• SIT also works with business individuals to mentor\nand guide our start-ups. The mentors’ industry expertise and experience will shorten the learning curve and smoothen idea implementation.\nMOVING AHEAD\nAt the heart of our work is our students’ experience. By working closely with industry partners, we are able to enhance their skills and competencies, and ensure that they gain a deep understanding of the projects they are assigned.\nBy forging partnerships among SIT’s unique project-based pedagogy, technology providers and enterprises, we strive to\naccelerate the commercialisation process, and make SIT the university of choice for industry collaboration and project work. E3\nAs part of SIT‘s enterprise and innovation strategy, the Entrepreneurship Development Unit was set up to promote an enterprising spirit in SIT. The unit strives to build a vibrant entrepreneurship ecosystem to equip business skills, support enterprising ideas and groom start-ups. The efforts include the following:\nLOCAL\nENTERPRISE\nIMMERSION\nPROGRAMME\nINCUBATIONNETWORK\nMENTORSHIPSEED\nFUNDINGOVERSEAS\nENTERPRISE\nIMMERSION\nPROGRAMME\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201537\nPROFESSIONAL\nOFFICERS DIVISION\nEstablished within the Academic Group\nunder the Vice Provost’s Office\nin January 2015, the Professional\nOfficers Division (POD) manages labs, equipment and Professional Officers\nas a centralised resource, as well\nas supporting SIT Academic Staff in supervising students on IWSP and\nfinal year projects. POD works closely\nwith Faculty to promote sharing of lab facilities with the goal of achieving higher\nutilisation.\nProfessional Officers (POs) are specialists\nwith applied expertise in their fields, having\nmany years of industry experience. The POs work closely with SIT Academic Staff\nto develop, design, plan and conduct lab\nexperiments, supervise students’ work in the labs while managing the facilities\nefficiently, and ensuring compliance to\nsafety and health regulations.  POs also support SIT Academic Staff in externally\nfunded applied research projects.Since the establishment of POD, a\nseries of key policies, processes and\nprocedures have been implemented.\nThese include the Integrated Logistics Support (ILS) approach to lab set-up\nand operations, lab safety and security\npolicy, lab evaluation and review policy for new lab requirements, as well as policies to support IWSP and E&I Hub\nprojects. In addition, POD has ensured\nthat students benefit from a real work environment in all labs by applying\nindustrial discipline and standards,\nsuch as the ILS approach and 5+2S workplace organisation tool (sort,\nstraighten, shine, standardise, sustain\n+ safety and security).\nIn conjunction with the launch of SIT\ndegree programmes for AY14 and\nAY15, the division worked closely with Academic Staff and other divisions to\nset-up and commission over 30 labs from\nSeptember 2015 onwards. In addition, POD has successfully mentored students\nfrom the AY14 Accountancy programme\nwho went through their IWSP from January to April 2015. Looking ahead,\nthe division is poised to shift into higher\ngear to, setting up more labs within the university and preparing to support a\nlarger student cohort for IWSP in AY15.\nINTEGRATED WORK\nSTUDY PROGRAMME\nSIT created the Integrated Work Study Programme (IWSP), a salient feature of the\nuniversity’s educational experience, which provides students with opportunities to integrate the knowledge they have gained in the classroom with real-world practice. The programme is a win-win for both industry partners and students – IWSP is an excellent platform for students to gain work experience, while industry partners gain access to a pool of resources in terms of work-ready employees.\nStudents will be immersed in a real work environment for eight to 12 months, longer\nthan traditional internships, enabling true integration into the workforce. Faculty and company work supervisors will work together to achieve the following objectives:\n1\n2\n3\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 38Building Career and Professional Skills\nStudents will go through the experience of the job marketplace by applying to\nparticipating companies for IWSP positions, and undergoing their employee selection processes, subsequent induction and training in the real work environment. This will\nprepare them to be effective employees in their career and professional life.\nIntegrating Knowledge and Practice\nStudents will be guided to apply theory to practice under the close supervision of a\nfaculty member. Learning objectives will prompt students to reflect on how classroom\nknowledge and skills relate to real work situations.\nDeveloping Skills for Innovation in Companies\nStudents will be challenged during the IWSP to initiate innovation projects. Through such\nprojects, students will have the opportunity to apply innovation skills and develop solutions.\nIn January 2015, 63 Accountancy students embarked on the inaugural round of\nIWSP at the following companies: BDO, Deloitte, Foo Kon Tan, KPMG, PKF-CAP, PwC, and RSM Chio Lim.\nIndustry Talks and\nCompany Visits\nIn the past year, Career Services set up\n10 industry talks in collaboration with\ncompanies such as Gemalto and Baxter\nBioScience. The division also organised 15 company visits to companies such as\nAirbus Helicopter and BOEING Training\n& Flight Services to provide students with opportunities to meet with potential\nemployers. At these events, students\nwere able to learn more about various company cultures and potential job\nprospects. These sessions also provided\nstudents networking opportunities with industry experts.\nCareer Skills Workshops\nCareer Services organises the following career skills workshops:\n• Career Planning and Management\n• Resume and Cover Letter Writing\n• Interview Skills\n• Job Search Strategies\nOver the past year, a total of 22 workshops were conducted for 529 students across different degree programmes.OUR GRADUATES\nAt SIT, students engage in the career development process through a myriad of activities organised by the university such as Career Fair, networking events, career skills workshops, industry talks and\ncompany visits. The university’s career coaches conduct resume review sessions for students on\na one-to-one basis. These career coaches also support students by conducting mock interviews with them.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201539\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 40Jackson Soh\nManufacturing Engineer, REC Solar Pte Ltd\nTechnical University of Munich, BSc Electrical Engineering & Information Technology, Class of 2014\nKoo Yi Jie\nEnglish Teacher, The Caterpillar’s CoveWheelock College, BSc Early Childhood Education, Class of 2015\nI attended the Resume and Cover Letter Writing workshop conducted by SIT Career Services. The instructor gave suggestions on\nhow to present my resume in a clear and concise manner. I found the workshop very helpful.\nI also attended the Career Fair in 2013. One of the companies I spoke to was REC (Renewable Energy Corporation), which is where\nI am working now.\nMy advice to juniors is to refine your resume, manage your career expectations, and research the company you’re targeting. Your\nresume should not only be concise and clear; it has to be relevant to what the industry is looking for. I strongly recommend the Resume and Cover Letter Writing workshop organised by Career Services.\nDuring my study in SIT, Career Services prepared me for my career in various ways. They provided me with networking opportunities\nwith potential employers. They also sent us regular emails about job vacancies posted by companies in the job portal. The job vacancies posted are from different industries to cater to students from the different degree programmes.\nMy career coach also guided me in preparing my first ever resume. She taught me how to format it, and highlighted key points that\nwould make my resume look professional and stand out from the rest. She also gave me tips on how to prepare myself and respond to questions that are commonly asked during an interview. Her advice and tips were useful and gave me more confidence during the interviews. I was able to secure a job before my final examinations.\nI would like to advise my juniors to make the effort to meet their career coaches. They are experienced and know what the industry\nis looking for. Their advice helped me with my job search process and prepared me for the job market.Muhammad Khairul Bin Jumali\nSafety Engineer, Sembcorp Marine\nNewcastle University, BEng (Hons)   Marine Engineering, Class of 2015\nThroughout my academic career in SIT, I greatly benefitted from the school visits organised by Career Services. The visits provided\nme with opportunities to visit notable preschools and understand their pedagogy, culture and values. It made me consider my teaching values and philosophy and evaluate my future career choices. Furthermore, the school visits provided me with plenty of networking opportunities with many early childhood leaders and inspired me to be an effective early childhood advocate. I would strongly encourage my juniors to participate in company visits and recruitment talks hosted by Career Services as it broadened my\nperspective of early childhood education in Singapore.\nDONORS AND\nSCHOLARSHIPS\nFinancial assistance is given to deserving students enrolled at\nSIT. The financial aid covers expenses including tuition fees and expenses for overseas immersion programmes. SIT is firmly committed to a policy that strives to ensure students are not denied university admission because of financial difficulties.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201541\nAgri-Food & Veterinary Authority of Singapore\nAlexandra HealthAsia Pacific Breweries FoundationAssociation of Singapore Marine IndustriesCentre for Strategic Infocomm Technologies\nEarly Childhood Development Agency\nEastern Health AllianceFar East OrganizationInfocomm Development Authority of Singapore Jumbo Group of RestaurantsJurong Health ServicesKeppel Offshore & MarineMaritimeONEMedia Development Authority of Singapore\nMENDAKI\nMinistry of Communications and InformationMinistry of DefenceMinistry of Home AffairsMOH Holdings Pte LtdNational Council of Social ServiceNational Environment AgencyNational Healthcare Group Through generous contributions from our industry partners, government agencies and organisations, our students have\nreceived various forms of scholarships or sponsorships to pursue their degree programmes.\nDONORS AND\nSCHOLARSHIPS\nNational University Health System\nNovartis Singapore Pharmaceutical Manufacturing Pte LtdNTUC First CampusOverseas Union Enterprise LimitedPublic Utilities Board\nRaffles Medical Group\nRen Ci HospitalSakae Holdings LtdSembcorp Industries LtdSembcorp Marine LtdSingapore Civil Defence ForceSingapore Health Services Pte LtdSingapore-Industry Scholarship (SgIS)Singapore Power Limited\nSingTel\nSociety for the Physically DisabledSt Luke’s HospitalThe University of ManchesterTHE FOLLOWING INDUSTRY PARTNERS HAVE PROVIDED SCHOLARSHIPS / SPONSORSHIPS TO SIT STUDENTS\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 42\nDONOR\nACKNOWLEDGEMENT\nIn grateful appreciation of our generous donors, whose active philanthropic commitment to support non-bonded scholarships,\nstudy grants, bursaries and excellence awards at SIT is enabling and inspiring our students to realise their fullest potential – as tomorrow’s community-grounded professionals and catalysts for transformation.\nAscendas Funds Management (S) Limited\nBaker Tilly TFW LLP      Centre for Strategic Infocomm Technologies Char Yong (Dabu) Foundation LtdMr Choo Chiau Beng Mr Choo Chong NgenConrad Centennial SingaporeDou Yee Enterprises (S) Pte LtdDrilmaco Pte LtdEMS Energy LimitedFar East OrganizationFeinmetall Singapore Pte LtdGoh Bee Gah Foundation through\nSymAsia Foundation LimitedGoh FamilyGoh FoundationGoodrich Global Pte LtdHiap Chuan Hardware (Pte) LimitedHome-Fix DIY Pte LtdInstitute of Materials (East Asia)JCS-Echigo Pte LtdKeppel Care Foundation Limited Keppel Corporation Limited Mr Jeffrey KhooMr Kuok Khoon HongKwan Im Thong Hood Cho TempleMr Kevin Liang Choon YeeLions Community Service Foundation (Singapore)  Malayan Daching Co Pte LtdMapletree Investments Pte LtdMun Siong Engineering LimitedNehemiah Foundation through\nSymAsia Foundation LimitedNexia TS Pte LtdPerfect Team Engineering Pte LtdRotary Club of Jurong Town, SingaporeRykadan Hospitality Investments Pte LtdSafety Systems Engineering Pte LtdSamwoh Corporation Pte LtdSembcorp Industries LtdSembcorp Marine LtdSingapore Chemical Industry Council LimitedSingapore Technologies Engineering LtdSintit Realty Pte LtdTAK Products Pte LtdTech Metal Machines Pte LtdMr & Mrs Teo Hock ChuanTexas Instruments Singapore (Pte) LimitedThe Singapore Ireland FundWilmar International LimitedWing Tai Retail Management Pte LtdMr Albert WongMrs Wong Kwok LeongYangzheng FoundationMr Yap Geok LinDONOR LISTING (for the Financial Year ending 31 March 2015)\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201543\nINTRODUCTION\nSIT was incorporated in September 2009 as a Company limited by guarantee\nunder the Companies Act (Cap. 50). It is an Institution of Public Character (“IPC”) under the Charities Act (Cap. 37).\nSIT is governed by the SIT Act 2014. Its key constituent document is the\nMemorandum and Articles of Association which states that the purpose of the\nUniversity is to promote and undertake the advancement of education by providing educational facilities and courses of study in all fields of knowledge, promote and engage in research and scholarships and establish, operate, promote and maintain the University as a going concern.\nGood corporate governance is the cornerstone of a well-managed University\nwhich is, in turn, critical to SIT’s performance and operations. The focus of its\ngovernance framework, on which the University’s vision, mission and core values\nare formulated, promotes accountability and transparency and is manifested in the composition of the Board of Trustees (“Board”) and its Sub-Committees, division of powers and duties between the Board and Management, adoption of checks and balances and sound measures for internal and corporate controls.\nGOVERNANCE EVALUATION CHECKLIST\nThe University adheres to the Code of Governance for Charities and Institutions of Public Character (“Code”). The University has complied in material aspects with the principles and guidelines set out in the Code. Where there are departures from the Code, these are explained under the relevant sections of the Annual Report or the Governance Evaluation Checklist (“GEC”).\nAccording to disclosure requirements imposed by the Charity Council, Ministry\nof Culture, Community and Youth, all IPCs are required to publicly disclose their compliance with the Code. The University’s GEC is made available on the website of the Charity Portal at www.charities.gov.sg.\nBOARD OF TRUSTEES\nThe Board is the highest governing authority of the University and comprises 13 Trustees, chaired by Mr Ng Yat Chung. The Board oversees the business of the University, ensures that it acts in accordance with its objects, that its funds and assets are properly accounted for and safeguarded and provides guidance and stewardship to Senior Management, conferring regularly with them. The Board is accountable to the Minister for Education, Singapore for its acts and decisions.\nThe Trustees are eminent persons of good repute, sound judgment who possess\ncollective competencies in areas such as the public and private sectors, academia, accounting and finance, law, information technology, strategic planning, logistics, healthcare and hospitality management and industry knowledge. New Trustees will continue to be selected and invited to serve on the Board on the basis of the diversity of their experience, skills, knowledge, abilities and insight from time to time to ensure constant refreshing of the Board. The Trustees’ profiles appear on pages 2 to 6 of the Annual Report.\nThere is an objective decision-making process, which allows each Trustee to\nexercise his or her own independent judgment. The Company has established financial authorisation and approval limits for operating and capital expenditure, the\nprocurement of goods and services, the acquisition and disposal of assets and making\ninvestments. The Board approves the annual budget, the use of operating reserves\nand annual audited financial statements of SIT, amongst other responsibilities.\nThe Board is supported by 6 Board Sub-Committees formed in accordance with\nArticle 53 of the Articles of Association (“AAs”), namely the Academic Advisory,\nAudit, Campus Development, Finance, Investments and Partnership Approval\nCommittees. Each Board Sub-Committee has clear Terms of Reference setting out\ntheir role, authority, powers and matters requiring their approval. The list of Board\nSub-Committees is on page 46 of the Annual Report.\nBriefly, the responsibilities of the Board Sub-Committees are described as follows: -\n(a) The Academic Advisory Committee advises the Board on all academic policies\nand issues.\n(b) The Audit Committee oversees and reviews the University’s internal controls,\nintegrity of its financial reporting, legal and regulatory risks, enterprise risk management, internal and external audit functions.(c) The Finance Committee provides oversight of the University’s financial\npolicy management.\n(d) The Campus Development Committee assists the Board in maintaining\noversight of the campus development policies and any other matters related to the acquisition, commissioning and management of significant physical assets\nor facilities.\n(e) The Investments Committee oversees the investment of the University’s\nendowment and surplus funds.\n(f) The Partnership Approval Committee approves collaborations between the\nUniversity and its overseas university partners.\nEach Board Sub-Committee comprises Trustees with appropriate qualifications\nand skills and there is a fair distribution of responsibilities amongst the Trustees. Where required, non-Trustees who have experience in their respective areas of\nexpertise are invited to provide advice to the Board Sub-Committees to enhance\nthe process of decision making. The Board is kept informed of the key matters\ndiscussed at each Board Sub-Committee meeting.\nMANAGEMENT OF THE UNIVERSITY\nThe President of the University, Professor Tan Thiam Soon, is appointed by the Board and is the Chief Executive Officer and the University’s academic and\nadministrative lead. He is responsible to the Board for the conduct, co-ordination\nand quality of the programmes of the University and its future development. He is\nempowered with the authority to perform all acts which are necessary to implement the policies, procedures and actions of the Board. As a liaison between the Board and the University, the President is tasked with the responsibility of informing each party of the views and concerns of the other, relating to the programmes and\nadministration of the University. He also arranges for the annual budget of the\nUniversity to be presented to the Board annually for approval as part of his duties.\nThe profiles of other members of the Senior Management of the University can\nbe found on its corporate web page and at pages 8 and 9 of the Annual Report.\nCONFLICTS OF INTEREST\nThe Trustees and staff are required to act in the best interest of the University at all times. Policies have been developed to prevent or manage situations where conflicts-of-interest could arise, by promoting integrity and ethical business conduct.\nThe AAs contain provisions for the management and avoidance of conflicts of\ninterest by members of its Board of Trustees.\nSuch provisions include:\n(a) permitting a Trustee to be interested in any transaction with the University\nprovided that the Trustee has declared the nature of the interest to the other\nTrustees of the Board as required under the Companies Act of Singapore and\ncomplied with the provisions of AAs to abstain from voting on any matter\nrelated to the transaction,\n(b) permitting a Trustee, or a firm associated with the Trustee, to act in any\nprofessional capacity for the University and to be remunerated for the provision\nof professional services, and\n(c) permitting a Trustee to be reimbursed for out-of-pocket expenses, travelling\nand other expenses properly incurred by the Trustee in attending and\nreturning from meetings of the Board of Trustees, any of its committees,\nor any general meeting of the University or otherwise in connection with the\naffairs of the University.\nThe AAs also state that Trustees shall not receive any remuneration for services rendered by them as Trustees.\nThe University has implemented a Conflicts of Interest Policy which all staff must\ncomply with. In accordance with that Policy, staff must ensure that their private\nactivities and interests do not conflict with their professional obligations to the\nUniversity. Where there is a potential conflict of interest, the staff is required to submit full disclosure and request for an appropriate exemption. The University will grant such exemptions at its discretion. In addition, staff are required to declare their\ncompliance with the University’s prevailing policy on conflicts of interest annually.Corporate Governance\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 44\nINTERNAL AUDIT\nQUALITY ASSURANCE\nFRAMEWORK\nFOR UNIVERSITIESInternal Audit provides independent, objective assurance and\nconsulting services designed to add value and improve the University’s operations.  Internal audit activity is guided by a value-driven philosophy of partnering with other departments to enable SIT to meet its business objectives. Our key role is to assist Management in evaluating their risk management, control and governance processes so that business objectives can be met.\nThe Quality Assurance Framework for Universities (QAFU), developed by the Ministry of Education (MOE), is a developmental tool to help publicly funded universities enhance their quality processes in areas such as governance, management, teaching and learning. As a new university, it is timely that SIT takes a “temperature check” against the QAFU requirements and leverages on the expert opinions to be recommended by the MOE-commissioned external review panel, comprising local corporate leaders and renowned academics, to further strengthen our internal processes. Building on a robust quality assurance system, SIT is committed to providing quality education  to our\nstudents in a nurturing environment and excellent service  to our\nindustry partners and community.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201545\nFINANCE\nCOMMITTEE\nINVESTMENT\nCOMMITTEE\nPARTNERSHIP APPROVAL\nCOMMITTEEACADEMIC ADVISORY\nCOMMITTEE\nAUDIT\nCOMMITTEE\nCAMPUS DEVELOPMENT\nCOMMITTEEDr Lim Khiang Wee\nMs Mary Yeo\nMr TK Udairam\nMr TK Udairam\nMrs Margaret Lui\nMr Steven Wong\nMs Rachel Eng\nMr Alvin TanProf Hang Chang Chieh\nProf Tan Thiam Soon\nMr Pek Hak Bin\nMs Teoh Zsin Woon\nMr Alvin Tan\nDr Richard Charles Helfer\nMr Michael Yap\nMs Teoh Zsin WoonSIT BOARD\nCOMMITTEES\nNOTE: The first Trustee named in each committee is the Chairperson of the committee.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 46\nStatement of Comprehensive Income\nBalance Sheet\nStatement of Changes in Funds and Reserves\nStatement of Cash Flows48\n49\n50\n51FINANCIAL\nSTATEMENTS\nIMPORTANT NOTE:\nThe following Financial Statements are extracted from Singapore Institute of Technology’s Audited Financial Statements\nfor the year ended 31 Mar 2015. It may not contain sufficient information to allow for a full understanding of the results\nand the state of affairs of the Company. For further information, please refer to the complete audited financial statements published on the SIT official website at SingaporeTech.edu.sg .\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 48For the financial year ended 31 March 2015\nGeneral fundsEndowment and\nterm funds Total\n2015 2014 2015 2014 2015 2014\n$ $ $ $ $ $\nRevenue 38,592,658 32,355,018 - - 38,592,658 32,355,018\nOther income 332,110 148,895 1,261,000 405,339 1,593,110 554,234\nOperating expenditure\nStaff and related expenses (32,111,370) (20,595,642) - -(32,111,370) (20,595,642)\nDepreciation and\namortisation expenses (15,696,574) (1,346,944) - -(15,696,574) (1,346,944)\nProgramme and\nstudent-related expenses (58,424,324) (52,283,324) (767,649) (661,172) (59,191,973) (52,944,496)\nRental and other\nfacilities expenses (7,170,560) (3,063,072) - - (7,170,560) (3,063,072)\nOther operating expenses (7,333,064) (3,482,770) (794,142) - (8,127,206) (3,482,770)\nTotal operating\nexpenditure(120,735,892) (80,771,752) (1,561,791) (661,172) (122,297,683) (81,432,924)\nDeficit before\ninvestment income\nand government grants(81,811,124) (48,267,839) (300,791) (255,833) (82,111,915) (48,523,672)\nNet investment income 170,670 147,787 5,251,706 113,818 5,422,376 261,605\n(Deficit)/surplus before\ngovernment grants (81,640,454) (48,120,052) 4,950,915 (142,015) (76,689,539) (48,262,067)\nGovernment grants 89,421,732 54,452,133 - - 89,421,732 54,452,133\nNet surplus/(deficit) and\ntotal comprehensive\nincome/(loss) 7,781,278 6,332,081 4,950,915 (142,015) 12,732,193 6,190,066STATEMENT OF\nCOMPREHENSIVE INCOME\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015492015 2014\n$ $\nASSETS\nCurrent assets\nCash and cash equivalents 55,271,249 401,920,665\nFinancial assets, at fair value through profit or loss 396,738,853 -\nFees and other receivables 50,485,293 71,369,828\nStudent loans 106,270 -\nOther current assets 7,614,071 4,125,853\n510,215,736 477,416,346\nNon-current assets\nProperty, plant and equipment 231,795,991 171,133,115\nIntangible assets 2,649,690 691,709\nStudent loans 250,967 313,280\nOther non-current assets 77,999,488 56,129,695\n312,696,136 228,267,799\nTotal assets 822,911,872 705,684,145\nLIABILITIES\nCurrent liabilities\nTrade and other payables 29,532,719 45,270,297\nDeferred tuition fee income 6,591,879 5,418,158\nGrants received in advance 51,731,854 42,304,459\nDerivative financial instruments 13,819,772 -\n101,676,224 92,992,914\nNon-current liabilities\nDeferred capital grants 234,445,681 171,824,824\nOther deferred grants 84,336,554 56,443,787\n318,782,235 228,268,611\nTotal liabilities 420,458,459 321,261,525\nNET ASSETS  402,453,413 384,422,620\nFUNDS AND RESERVESEndowment 366,336,470\n361,037,870\nAccumulated surplus\n- General funds 30,618,348 22,837,070\n- Endowment and term funds 5,498,595 547,680\n402,453,413 384,422,620\nFunds’ net assets managed on behalf of Ministry of Education (“MOE”) 11,829,639 9,149,496BALANCE SHEET\nAs at 31 March 2015\nAccumulated\nsurplus –\nGeneral fundsEndowment\nand\nterm fundsTotal\n$ $ $\n2015\nBeginning of financial year 22,837,070 361,585,550 384,422,620\nGovernment grants and donations -  5,298,600 5,298,600\nTotal comprehensive income 7,781,278 4,950,915 12,732,193\nEnd of financial year 30,618,348 371,835,065 402,453,413\n2014\nBeginning of financial year 16,504,989 1,973,165 18,478,154\nGovernment grants and donations - 359,754,400 359,754,400\nTotal comprehensive income/(loss) 6,332,081 (142,015) 6,190,066\nEnd of financial year 22,837,070 361,585,550 384,422,620For the financial year ended 31 March 2015STATEMENT OF CHANGES\nIN FUNDS AND RESERVES\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015 50\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2015512015 2014\n$ $\nCash flows from operating activities\nDeficit before government grants (76,689,539) (48,262,067)\nAdjustments for:\n- Depreciation and amortisation 15,696,574 1,346,944\n- Donations (1,261,000) (405,339)\n- Loss on disposal of property, plant and equipment 84 406\n- Net investment income (5,422,376) (261,605)\n(67,676,257) (47,581,661)\nChange in operating assets and liabilities\n- Fees and other receivables (15,911,410) (1,229,563)\n- Student loans and other assets (25,401,968) (43,726,851)\n- Trade and other payables (25,253,763) 7,145,105\nCash used in operations (134,243,398) (85,392,970)\nDonations 1,261,000 405,340\nNet cash used in operating activities (132,982,398) (84,987,630)\nCash flows from investing activities\nPurchase of property, plant and equipment and intangible assets (67,644,047) (115,132,732)\nProceeds from disposal of property, plant and equipment 16,440 -\nPurchase of financial assets, at fair value through profit or loss (352,732,484) -\nSettlement of currency forwards (25,101,049) -\nDividends and interest received 369,354 261,605\nNet cash used in investing activities (445,091,786) (114,871,127)\nCash flows from financing activitiesOperating grants received 65,530,358 65,564,055\nDevelopment grants received 157,194,172 132,846,520\nGrants received from other government agencies 3,401,638 559,277\nEndowment funds received 5,298,600 360,443,982\nNet cash provided by financing activities 231,424,768 559,413,834\nNet (decrease)/increase in cash and cash equivalents (346,649,416) 359,555,077\nCash and cash equivalents at beginning of financial year 401,920,665 42,365,588\nCash and cash equivalents at end of financial year 55,271,249 401,920,665For the financial year ended 31 March 2015STATEMENT OF\nCASH FLOWS\nSingaporeTech.edu.sg\nSingaporeTech.edu.sg\nSingaporeTech.edu.sg10 Dover Drive, Singapore 138683\nRegistration Number: 200917667DSingaporeTech\n@SingaporeTech\n@SingaporeTech\nSingaporeTech"
}