{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-04/20240329_ZB_Taking%20the%20SkillsFuture%20Level-Up%20Programme%20to%20the%20next%20level.pdf",
  "type": "pdf",
  "content": "2024年财政预算案推出的技能创前程进阶计\n划（SkillsFuture Level-Up Programme），值得赞\n赏。计划旨在鼓励和支持新加坡人投入相当的时\n间、精力和资源提升技能和再培训，以充分发挥\n潜力，打造成功、充实的职业生涯。然而，即使\n有政府的慷慨支持，职业中途再培训仍会有不少\n挑战。因此，我们想提供一些可能让计划更有效\n益的建议。\n远离职场：中途转业者面对的难题\n由于劳动力市场紧张，更实际的做法，可能是\n让员工在就业的同时提升技能和再培训，以免加剧\n劳动力供应短缺。此外，想请假进修的员工，也\n可能担心职业前景受影响。但是，不提升技能、\n接受再培训的后果却更严重。随着当局推出每月\n最高3000元、最长24个月的职业生涯中期培训津贴\n（Mid-Career Training Allowance），执行这项计划的\n相关单位必须严加把关，确保申请者是真正想提升\n技能的学习者，而不是想利用纳税人的钱申请“带\n薪休假“的人。\n更新技能的替代途径\n职业生涯中期培训津贴，目前只适用于高达本\n科学位水平的全日制长期培训项目。正如新加坡全\n国雇主联合会（SNEF）针对国会拨款委员会辩论教育部开支预算时的回应中所建议，为个别员工开\n拓另一条途径，在从事兼职工作的同时，报读兼\n职文凭课程，将有助于缓解劳动力紧张的情况。\n这些员工由于从事兼职工作，薪资比全职员工\n低，因此应该得到与薪资差别相等的补贴。这将\n惠及家庭负担较重的员工，让他们从兼职工作赚\n取收入的同时，学习与应用新技能，并获得实际\n工作经验。\n另一方面，雇主也有条件为员工设计并提供\n在职培训。这种培训不仅确保员工掌握适用于整\n个企业的可迁移技能，还有助于提高企业生产\n力，并缩短员工离开工作岗位的时间。雇联会和\n南洋理工学院成立的全国职场学习中心（NACE）\n续签了备忘录，以推广工作场所学习活动。我们\n鼓励雇主提升能力，创建明确的在职培训蓝图，\n甚至申请工艺教育学院颁发的“在职培训中心证\n明”（COJTC）。教育部也可以考虑资助、发展\n和认证在职培训。\n全日制课程应附有工业实习部分\n为了跟上产业需求，全日制文凭课程应辅以实\n习期，确保学生做好就业准备。长达3到24个月的\n转业计划，是帮助中途转业者成功转换到有意义的新职业的关键因素。根据这项计划，员工会先受聘\n于参与计划的雇主，再接受培训，或展开就职前培\n训与实习计划。转业计划还提供职业重设计再培训\n选项，范围在2024年财政预算案扩大到任何就职于\n增长领域的现有员工。作为雇主的全国工会，雇联\n会是计划的合作伙伴之一，负责管理转业计划，并\n为中途职业工人提供跨行业的相邻技能或新技能，\n帮助他们胜任新的工作岗位。\n尽量延长员工生产力寿命\n改进技能创前程的措施，旨在优化新加坡的人\n力资本，深受雇主欢迎。新加坡正面临人口增长率\n下降、人口老龄化等挑战，平均寿命也延长了。我\n们因此须要为数码和绿色经济等增长领域的员工\n提升技能，帮助他们接受再培训，尽量延长他们的\n“生产力寿命”。\n首先，我们须要加强教育与产业之间的联系，\n确保学习者获得产业相关的技能，而不是进行纯粹\n的学术研究。因此，我们支持西海岸集选区议员胡\n美霞在国会拨款委员会辩论教育部开支预算时作出\n的呼吁，培育出与产业紧密联系、能响应行业的发\n展趋势和技能需求的培训机构。雇联会和新加坡理\n工学院还将携手创立新的中心，帮助学生和中途转业者在相关产业，获得工作经验和就业机会。这些\n努力将使个别员工确信，接受技能再培训，能带来\n积极的职业成果。\n其次，雇主可以利用这些改进措施，投资于为\n未来经济重新设计工作，尤其是在自动化和人工智\n能影响工作的当下。雇主可以鼓励员工参加相关课\n程，从而产生积极的业务成果。\n最后，建立一个全国通用的“先前经验认证”\n（RPL）系统，也可能对新加坡有利。这样的系\n统，能对个人在工作岗位等一般学习环境以外的场\n所获得的学习成果，系统化地给予认证。目前，新\n加坡理工大学教育发展学院和义安理工学院持续教\n育与培训学院在处理报读申请时，都认可申请者先\n前获得的技能和知识。先前经验认证程序可衡量在\n正规学习环境以外所习得的技能和知识，以便根据\n一套既定标准、工作能力或学习成果，认证个别人\n士的相关水平。世界各地的监管机构、成人学习中\n心、职业发展从业员、人力资源管理专业人员、雇\n主、培训机构和大学都采用类似程序。\n技能创前程进阶计划将确保新加坡的劳动力具\n备未来所需的技能，加强在本区域乃至全世界的竞\n争力。为了使我们的努力成功，须要优化员工再培\n训的过程，为企业促成良好的结果，同时善用成\n人教学法、科技和资源，并使各个再培训选项更灵\n活，以便让更多员工受惠。\n作者赖德熙是新加坡全国雇主联合会副执行理事长\n林伟杰是教育科技公司副主席让技能创前程进阶计划更上层楼赖德熙 林伟杰This document is intended for internal research purposes only.\nCopyright remains the property of the content creator.\nPublication: Lianhe Zaobao\nDate: 30 March 2024\nHeadline: Taking  the SkillsFut ure Level-Up Programme\nto the next level\nSource: Lianhe Zaobao © SPH Media Limited. Reproduced with permission."
}