{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/It%20Takes%20a%20Club.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  09/16\nIt Takes a Club… to Raise Up Talents\nThe new and permanent Rotary Club of Tanglin & Tong Kok Chiang Scholarship will nurture\nstudent excellence among Nursing and Allied Health undergraduates at SITMs Samantha Tan (middle) says thank you with some chocolate cake to Mr Robert Sabaka (second from left), President (Rotary Year 18-19), Rotary Club of Tanglin,\nSingapore, Mr Tong Kok Chiang (second from right), Member, Rotary Club of Tanglin, Singapore and Mrs Jessie Tong (extreme right) as Prof Alan Wong (extreme left),\nCluster Director, SIT, looks on.\nProf Alan Wong (middle) receives the cheque from Mr Tong Kok Chiang, Member\n(left), Rotary Club of Tanglin, Singapore, and Mr Robert Sabaka, President (Rotary\nYear 18-19) (right), Rotary Club of Tanglin, Singapore.Ms Samantha Tan, a first-year undergraduate from the\nBachelor of Science with Honours in Occupational Therapy degree programme at the Singapore Institute of Technology (SIT), has always aspired to join the healthcare sector as a professional. She said, “As an Occupational Therapist, I will be able to help patients with a wide range of conditions get back on their feet again.”\nNow thanks to an endowed gift from the members of\nRotary Club of Tanglin, Singapore – led by their fellow member Mr Tong Kok Chiang – to make possible a new permanent scholarship, talented undergraduates with demonstrated leadership qualities from SIT’s Allied Health and Nursing programmes like Ms Tan will be nurtured to fulfil their potential as they pursue their dreams of becoming healthcare professionals.\nOne Rotary Club of Tanglin & Tong Kok Chiang Scholarship\nwill be awarded annually and in perpetuity, starting from this Academic Year 2018/19. Ms Tan is the very first recipient of the scholarship and was able to express her appreciation to the Rotary Club of Tanglin, Singapore and Mr Tong Kok Chiang during the cheque presentation ceremony that took place on 28 January 2019.\n“I am grateful for this scholarship as it will give me\nthe opportunity to seek ways to enrich my university experience. I hope to be able to continue helping those in need around me and bring out Rotary’s motto of ‘Service before Self’,” she said.\nProf Alan Wong, Cluster Director, SIT, was also present\nat the ceremony and was heartened to see the growing\nsupport from the community for SIT’s Nursing and Allied\nHealth students. He said, “We are truly grateful to Mr Tong Kok Chiang for his philanthropic leadership, together with the members of the Rotary Club of Tanglin, Singapore to make possible this very special scholarship for talented Health Sciences undergraduates at SIT.”\nSince it was chartered in August 1984, the Rotary Club of\nTanglin, Singapore and its members has involved itself in many areas of service in order to reach out to different groups of people including the sick, the handicapped, the under-privileged and also those who are afflicted by natural disasters."
}