{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Galloping%20to%20a%20Brighter%20Future.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  08/12\nAcademically talented SITizens get much-needed philanthropic support to realise their dreams, thanks\nto Mr Lim Siah Mong who has made possible an endowed Scholarship at SITGalloping to a Brighter Future\nThe three Lim Siah Mong Scholars received their scholarship certificates from Mr Lim Siah Mong: (From\nleft) Ms Koh Li Ting, Mr Lim Siah Mong, Managing Director, Lubritrade Trading Pte Ltd, Prof Tan Thiam Soon,\nPresident, SIT, Mr Kenney Boo and Ms Julaina Bte Jaffar.\nProf Tan Thiam Soon, President, SIT, thanks Mr Lim\nfor his generosity and belief in SIT. After lunch, Mr Lim Siah Mong and guests from Lubritrade Trading Pte Ltd, went on a short tour\nof the SIT@Dover Campus.Ms Koh Li Ting (middle) helps Mr Lim Siah Mong (right) unveil the painting, as Mr Kenny Boo (left)\nlooks on.\nMs Julaina Bte Jaffar (right), one of the Lim Siah Mong\nScholars, talks to Mr Jeffrey Soh, Legal Consultant,\nLubritrade Trading Pte Ltd, about her plans to\nvolunteer at an orphanage in Batam.A special memento presented to Mr Lim Siah Mong.During the lunch, Mr Kenney Boo (left) had the chance\nto thank Mr Lim Siah Mong (right) and speak to him about his plans for the future.\nA personal gift made by Mr Lim Siah Mong in May 2015 has enabled the Singapore\nInstitute of Technology (SIT) to establish one of its first endowed scholarships to nurture academically talented students who are in need of financial support. Thanks to Mr Lim’s generous gift, SIT is able to award the Lim Siah Mong Scholarship to at least three talented and deserving students, annually and in perpetuity.\nOn 9 December 2015, the very first recipients of the Lim Siah Mong Scholarship\nat SIT finally had the opportunity to meet their donor at an appreciation lunch held at the SIT@Dover campus in his honour.\nOver lunch, Mr Kenney Boo, Ms Julaina Bte Jaffar and Ms Koh Li Ting presented\nMr Lim, the Managing Director of Lubritrade Trading Pte Ltd, with a painting of three galloping horses to express their gratitude, after having learnt about his love of horses. Said Mr Boo, a final-year student from the Bachelor of Engineering (Honours) in Marine Engineering degree programme (Newcastle University), “We went to learn from an artist who loves to draw horses and worked with him to prepare a special memento for Mr Lim.”\nFor Ms Julaina, a first-year student from the Bachelor of Hospitality Business\n(Honours) programme (SIT) who had to leave before the appreciation event ended to sit for an examination, the lunch was a great opportunity for her to express her personal thanks to Mr Lim. She said, “As a recipient of the Lim Siah Mong Scholarship, I am grateful for his generosity. The guests from Lubritrade Trading Pte Ltd also shared valuable insights on having goals for the future and I am glad for this opportunity to have met them.”\nThe appreciation lunch hosted by Prof Tan Thiam Soon, President, SIT, was\nattended by guests from Lubritrade Trading Pte Ltd, as well as SIT faculty and\nstaff. In his speech, Prof Tan thanked Mr Lim for trusting SIT and its students\nto make the best and fullest use of his thoughtful gift. He said, “Mr Lim’ s\nimpactful philanthropy will be instrumental in transforming the future of\nthese students who received the Lim Siah Mong Scholarship.”Receiving the Lim Siah Mong\nScholarship has been a source of encouragement for Ms Koh, a first year student from the Bachelor of Arts (Honours) in Criminology & Security (University of Liverpool). “Knowing that someone believes in me and the path which I am passionate about, I am further motivated to excel not only to contribute back to society but also as an appreciation to Mr Lim,” she said."
}