{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20220811lhzb-teachersserveasbridgestohelpuniversitystudentsconnectwithindustry.pdf",
  "type": "pdf",
  "content": "胡洁梅　报道\nohkm@sph.com.sg\n曾在食品业从事科研工作，\n王榕（54岁）过后到理工学院当讲\n师超过10年， 两年前加入新加坡\n理工大学成为专业人员。专业人\n员与讲师的教学工作相辅相成，\n主要指导实践课， 并扮演大学与\n企业的桥梁，促进协作机会。\n新加坡管理大学电脑科学系教授许主洪（43岁）则请假借调到美国软件公司Salesforce在新加坡设立的人工智能研究中心担任董事经理，把学术和研究的专长带入业界，从而也为大学与学生创造更多学习机会。　　随着本地大学转型并加大力度推广持续学习，与时俱进的教学团队日益重要。校方引进更多有业界经验的人员，为教员提供灵活的发展机会，鼓励他们到业界取经，与市场需求接轨。　　国际学术咨询团在今年6月举行的会议上便提出重塑并发展大学团队的重要，建议本地大学以更灵活的职业发展与职务来引进人才。　　提倡应用学习模式的新加坡理工大学几年前设立专业人员（Professional Officers）部门，目前有超过70名人员。新工大发言人答复《联合早报》说，他们绝大多数在业界有超过五年的工作经验，辅助讲师的教学，帮助学生实践技能。他们也与本地企业合作，掌握领域的发展。\n校方不提供教员终身聘约\n灵活切换学术与业界工作\n新工大不提供终身聘约，让\n教员可灵活地在学术和业界工作之间切换。校方今年起也提供教员实习计划，让教员有机会到企业见习。　　新加坡管理大学的教员也有不同发展渠道，除了终身聘约教员、讲师等，也有负责开展应用研究的实践型（Practice Track）教员。500人的教学团队中，33人属于实践型。另约两成从事部分时间的教学，有其他正业。　　教务长柯莫西教授（Timothy Clark）说：“与企业的协作至关重要，新大因此与伙伴设立不同的研究中心并共创课程。我们将继续投入资源，设立部门以及资深职务来协调和领域的合作，确保教学和研究项目继续实用。”　　新加坡国立大学也有实践型教员来辅助教学和研究。近3000人是兼职教员，占教学团队的47％。高级常务副校长兼教务长何德华教授指出，大学鼓励教员往学术和业界“双轨道”发展，教授可以在本地企业展开研究，丰富他们的学术事业。国大和冬海集团有这方面的协作，下来也会扩大到更多本地企业。教员也可利用每周一天的时间参与业界的咨询工作或董事会事务。每年，超过两成的教授参与这类业界工作与项目。\n会定期咨询业界专才\n确保课程选项合时宜\n南洋理工大学也有在业界和\n研究机构任职的兼职教员，占教学团队的15％。常务副校长兼教务长林杉教授指出，南大在2020年设立全球产业联盟，目的就是推动大学与企业的协作，包括联合设立实验室、研究机构等。大王榕踏入教育界前在食品业从事科研工作，曾是淡马锡理工学院食品科技系的高级讲师。她目前在新加坡理工\n大学担任专业人员，着重指导学生的实践技能。 （陈来福摄）提倡应用学习模式的新加\n坡理工大学几年前设立专\n业人员部门，目前有超过\n70名人员。新工大说，他\n们绝大多数在业界有超过五年的工作经验，辅助讲\n师的教学，帮助学生实践技\n能。他们也与本地企业合作，掌握领域的发展。　　为食品科技学生指导实验\n课的王榕（54岁）踏入教育界前有相关的工作经验，常与学生分享实际的技术难题。她认为，教学不能只是纸上谈兵，学生须了解业界的实际运作与问题，应用所学去制定解决方案。她就扮演企业与大学和学生之间的桥梁。　　她受访时说：“企业有时也不懂得如何表述问题，身为新加坡理工大学的专业人员，我得主动联络企业，安排机会让学生与企业有交流的平台。我以前在食品业工作，比较容易通过人脉去寻找合作伙伴。企业知道我们有实战经验，比较有信心，我们就像衔接大学与企业的桥梁。我们须让学生融会贯通，有机会把知识应用在实际的问题上。”　　大学需要和企业展开研究，新工大接下来也会与理工学院的创新中心合作推动这方面的工作。身为专业人员，她也为毕业班学生的专题作业担任导师。\n发挥专长开发实用科技\n同样有超过10年教育经验的新加坡管理大学电脑科学系教授许主洪（43岁）认同业界与学术界双向互动的重要性。　　他三年前选择借调到企业Salesforce在本地设立的亚洲研究中心，协助发展新中心。　　他说：“这是一个好机会，让我发挥研究的专长去开发实用的科技，也扩大自己在学术界以外的事业发展。对企业而言，这也能带动研究和发展项目。”　　调任期间，他协助推动新大和Salesforce的合作项目。双方在经济发展局的支持下推出一项人才培育计划。计划的目的是栽培博士生，支持他们发展人工智能的技能与研究。此外，Salesforce也为新大学生提供实习等学习机会。须了解业界实际运作\n教学不能仅纸上谈兵\n学也定期咨询业界专才以确保课\n程选项合时宜，并共同策划实习与课程。　　新加坡科技设计大学发言人\n说， 一些教员在新加坡科技研究局\n和国防科技研究院等机构也有职\n务， 他们能参与业界活动并利用设\n施， 促进大学与各领域的交流。 新科大也设立协作、 创新与企业部\n门，有专门的业务发展人员来管理并推广协作项目与研究。　　专长在成人教育的新跃社科大学不采用终身聘约制，教学团队以来自业界的兼职教员居多，约1200人。校长张起杰教授指出，大学的在职学员多，他们可以分享在领域遇到的情况，师生的交流相对丰富。大学也鼓励教员参与非盈利机构的董事会或委员会职务。有潜力的非教员也有机会从事一些教学工作，根据专长指导学员。\n游走学府和企业\n教员当桥梁 助大学生与市场接轨\nPublication: Lianhe Zaobao\nDate: 11 Aug 2022\nHeadline: Teachers serve as bridges to help\nuniversity students connect with industry\nSource: Lianhe Zaobao © SPH Media Limited. Reproduced with permission."
}