{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2023-09/AR2023-Corporate-Governance.pdf",
  "type": "pdf",
  "content": "Corporate Governance\nINTRODUCTION\nSIT was incorporated in September 2009 as a company\nlimited by guarantee under the Companies Act 1967.\nIt is an Institution of Public Character (“IPC”) under the\nCharities Act 1994.\nSIT is governed by the Singapore Institute of Technology Act\n2014. Its key constituent document is the Memorandum and\nArticles of Association which states that the purpose of the\nUniversity is to promote and undertake the advancement\nof education by providing educational facilities and courses\nof study in all fields of knowledge, promote and engage in\nresearch and scholarships and establish, operate, promote\nand maintain the University as a going concern. SIT has\nthree subsidiaries — Verbosecurity Pte. Ltd. (Company\nRegistration No. 201902376G), which was incorporated\non 18 January 2019, SIT Microgrid Pte. Ltd. (Company\nRegistration No. 201926986H), which was incorporated\non 19 August 2019, and Foodplant Pte. Ltd. (Company\nRegistration No. 202007139N), which was incorporated on\n2 March 2020. The three subsidiaries were incorporated\nto support SIT’s strategic initiatives.\nGood corporate governance is the cornerstone of a\nwell-managed University which is, in turn, critical to SIT’s\nperformance and operations. The focus of its governance\nframework, on which the University’s vision, mission and\ncore values are formulated, promotes accountability\nand transparency and is manifested in the composition\nof the Board of Trustees (“Board”) and its Committees,\ndivision of powers and duties between the Board and\nManagement, adoption of checks and balances, and\nsound measures for internal and corporate controls.\nGOVERNANCE EVALUATION CHECKLIST\nThe University adheres to the Code of Governance for\nCharities and Institutions of Public Character (“Code”).\nThe University has complied in material aspects with the\nprinciples and guidelines set out in the Code. Where\nthere are departures from the Code, these are explained\nunder the relevant sections of the Governance Evaluation\nChecklist (“GEC”).\nAccording to disclosure requirements imposed by the\nCharity Council, Ministry of Culture, Community and\nYouth, all IPCs are required to publicly disclose their\ncompliance with the Code. The University’s GEC is\nmade available on the website of the Charity Portal at\nwww.charities.gov.sg.\nBOARD OF TRUSTEES\nThe Board is the highest governing authority of the\nUniversity and comprises 20 Trustees, chaired by Mr Bill\nChang, Chief Executive Officer, Digital InfraCo, Singapore\nTelecommunications Ltd. The Board oversees the business\nof the University, ensures that it acts in accordance with its\nobjects, that its funds and assets are properly accounted for\nand safeguarded and provides guidance and stewardship\nto Senior Management, conferring regularly with them. For the financial year ended 31 March 2023\nThe Board is accountable to the Minister for Education,\nSingapore for its acts and decisions.\nThe Trustees are eminent persons of good repute and sound\njudgment who possess collective competencies in areas such\nas the public and private sectors, academia, accounting and\nfinance, law, information technology, strategic planning,\nengineering, defence, investment and asset management,\nhealthcare, real estate, and sustainability. New Trustees\nwill continue to be selected and invited to serve on the\nBoard on the basis of the diversity of their experience,\nskills, knowledge, abilities and insight from time to time\nto ensure constant refreshing of the Board. The Trustees’\nprofiles appear on pages 10 and 11 of the Annual Report.\nThere is an objective decision-making process, which\nallows each Trustee to exercise his or her own independent\njudgment. The University has established financial\nauthorisation and approval limits for operating and\ncapital expenditure, the procurement of goods and\nservices, the acquisition and disposal of assets and making\ninvestments. The Board approves the annual budget and\nannual audited financial statements of SIT, amongst other\nresponsibilities. With regard to the reserves policy, the use\nof the reserves is subject to the approval of the Board.\nThe Board is supported by seven Board Committees\nformed in accordance with Article 53 of the Articles\nof Association (“AAs”), namely the Audit, Campus\nDevelopment, Finance, Industry and Research, Investment,\nRemuneration and Nomination, and Sustainability\nCommittees. Each Board Committee has clear Terms\nof Reference setting out their role, authority, powers\nand matters requiring their approval. The list of Board\nCommittees is on pages 60 and 61 of the Annual Report.\nBriefly, the responsibilities of the Board Committees\nare as follows:\na) The Audit Committee oversees and reviews the\nUniversity’s internal controls, integrity of its financial\nreporting, legal and regulatory risks, enterprise risk\nmanagement, internal and external audit functions.\nb) The Campus Development Committee maintains\noversight of the University’s campus development\npolicies and any other matters related to the acquisition,\ncommissioning and management of significant physical\nassets or facilities.\nc) The Finance Committee provides oversight of the\nUniversity’s financial policy management.\nd) The Industry and Research Committee provides strategic\nguidance on the University industry engagement and\ncollaboration and applied research.\ne) The Investment Committee oversees the investment of\nthe University’s endowment and surplus funds.\nf) The Remuneration and Nomination Committee oversees\nand reviews the University’s overall remuneration\nframework and policies, and also oversees succession\nplanning for the Board and the Board Committees.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202358\ng) The Sustainability Committee provides strategic guidance\non the University’s sustainability strategy, policies and\ninitiatives, as well as the development of the University’s\ntalent and applied research capabilities in sustainability.\nEach Board Committee comprises Trustees with\nappropriate qualifications and skills and there is a fair\ndistribution of responsibilities amongst the Trustees.\nWhere required, non-Trustees with relevant areas of\nexpertise are invited to provide advice to the Board\nCommittees to enhance the process of decision making.\nThe Board is kept informed of the key matters discussed\nat each Board Committee meeting.\nNone of the Trustees have general control and\nmanagement of the University’s subsidiaries.\nBOARD ATTENDANCE\nA total of four Board meetings were held during the\nfinancial year from 1 April 2022 to 31 March 2023. The\nattendance of the Trustees at the Board meetings during\nthe financial year is tabulated below:concerns of the other that relate to the programmes\nand administration of the University. He also arranges\nfor the annual budget of the University to be presented\nto the Board annually for approval as part of his duties.\nThe profiles of other members of the Senior Management\nof the University can be found on its corporate web page\nand at pages 8 and 9 of the Annual Report.\nCONFLICTS OF INTEREST\nThe Trustees and staff are required to act in the best\ninterest of the University at all times. Policies have\nbeen developed to prevent or manage situations where\nconflicts of interest could arise, by promoting integrity\nand ethical business conduct.\nThe AAs contain provisions for the management and\navoidance of conflicts of interest by members of its Board\nof Trustees. Such provisions include:\na) permitting a Trustee to be interested in any transaction\nwith the University provided that the Trustee has declared\nthe nature of the interest to the other Trustees of the\nBoard as required under the Companies Act of Singapore\nand complied with the provisions of AAs to abstain from\nvoting on any matter related to the transaction,\nb) permitting a Trustee, or a firm associated with the Trustee,\nto act in any professional capacity for the University\n(except as auditor) and to be remunerated for the\nprovision of professional services, and\nc) permitting a Trustee to be reimbursed for out-of-pocket\nexpenses, travelling and other expenses properly incurred\nby the Trustee in attending and returning from meetings\nof the Board of Trustees, any of its committees, or\nany general meeting of the University or otherwise in\nconnection with the affairs of the University.\nThe AAs also state that Trustees shall not receive any\nremuneration for services rendered by them as Trustees. In\naddition, the University does not have any staff receiving\nmore than S$50,000 in annual remuneration that is a\nclose relative of any Trustee.\nThe University has implemented a Conflict of Interest Policy\nwhich all staff must comply with. In accordance with that\nPolicy, staff must ensure that their private activities and\ninterests do not conflict with their professional obligations\nto the University. Where there is a potential conflict of\ninterest, the staff is required to submit full disclosure and\nrequest for an appropriate exemption. The University will\ngrant such exemptions at its discretion. In addition, staff are\nrequired to declare their compliance with the University’s\nprevailing policy on conflicts of interest annually.\nWHISTLEBLOWING POLICY\nThe University seeks to uphold the highest standards of\ngovernance, ethics, and conduct. To this end, the University\nhas a Whistleblowing Policy which provides individuals with\na confidential avenue to report, in good faith, any wrongful\npractices in the University, without fear of reprisal against\nthe whistleblower. The policy and reporting channels are\npublished on SIT’s website.NamePercentage (%)\nof Attendance\nMr Bill Chang 100\nMr Chan Hian Lim 100\nDr Chia Tai Tee 100\nProf Chua Kee Chaing 100\nMr Han Kwee Juan 100\nDr Benjamin Koh 50\nMr Kwee Liong Keng 50\nMs Lim Wan Yong 100\nMrs Margaret Lui 75\nMr Abu Bakar bin Mohd Nor 100\nMs Neo Gim Huay 25\nMs Gail Ong 75\nMs Jacqueline Poh 50\nMr Quek Gim Pew 100\nMr Ravinder Singh 75\nMr Nagaraj Sivaram 100\nMs Susah Soh 100\nMr Soon Sze Meng 100\nMs Tammie Tham 100\nMr Wen Khai Meng 75\nMANAGEMENT OF THE UNIVERSITY\nThe President of the University, Professor Chua Kee\nChaing, is appointed by the Board and is the Chief\nExecutive Officer and the University’s academic and\nadministrative lead. He is responsible to the Board for the\nconduct, co-ordination and quality of the programmes\nof the University and its future development. He is\nempowered with the authority to perform all acts which\nare necessary to implement the policies, procedures and\nactions of the Board. As a liaison between the Board\nand the University, the President is tasked with the\nresponsibility of informing each party of the views and 59\nCORPORATE GOVERNANCE\nBoard Committees\nand Internal Audit\nFor the financial year ended 31 March 2023\nBoard Committee Composition\nAUDIT COMMITTEECHAIRMAN\nMr Nagaraj SivaramMEMBERS\nDr Chia Tai Tee\nDr Benjamin Koh\nMs Gail Ong\nMr Han Kwee Juan\nCAMPUS DEVELOPMENT\nCOMMITTEECHAIRMAN\nMr Wen Khai MengMEMBERS\nMs Gail Ong\nMs Tammie Tham\nMs Neo Gim Huay\nFINANCE COMMITTEECHAIRMAN\nMr Ravinder SinghMEMBERS\nMrs Margaret Lui\nMr Wen Khai Meng\nINDUSTRY AND RESEARCH\nCOMMITTEECHAIRMAN\nMr Abu Bakar bin Mohd NorMEMBERS\nMr Chan Hian Lim\nMr Quek Gim Pew\nMs Tammie Tham\nMs Jacqueline PohBOARD COMMITTEES\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202360\nBoard Committee Composition\nINVESTMENT COMMITTEECHAIRMAN\nMrs Margaret LuiMEMBERS\nDr Chia Tai Tee\nMs Susan Soh\nCO-OPTED MEMBER\nMr Oo Wooi Cheng\nREMUNERATION AND\nNOMINATION\nCOMMITTEECHAIRMAN\nMr Bill ChangMEMBERS\nMs Lim Wan Yong\nMr Quek Gim Pew\nMr Ravinder Singh\nSUSTAINABILITY COMMITTEECHAIRMAN\nMr Soon Sze MengMEMBERS\nMr Chan Hian Lim\nMr Bill Chang\nMs Neo Gim Huay\nINTERNAL AUDIT\nInternal Audit provides independent, objective assurance and consulting services designed to add value and improve\nthe University’s operations. Internal Audit activity is guided by a value-driven philosophy of partnering with other\ndepartments to enable SIT to meet its business objectives. Its key role is to assist Management in evaluating their\nrisk management, control, and governance processes so that business objectives can be met.61\nBOARD COMMITTEES AND INTERNAL AUDIT"
}