{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2022-09/SIT%20Annual%20Report%202022.pdf",
  "type": "pdf",
  "content": "As Singapore’s University of Applied Learning, SIT plays\nan integral role in bridging academia and industry. This\nis possible because of our close ties with individuals,\nnamely, students, alumni, and staff; as well as with\nindustry partners with whom we co-create innovations\nand co-develop talent pipelines. These relationships\nmake learning seamless for our students, whether they\nare working professionals or fresh out of school.\nThis year’s Annual Report is centred around the theme\n‘Individuals and Industry at the Heart of SIT’, which\nencapsulates the importance of strengthening our ties\nwith individuals, and our links with the industry and\ncommunity to fulfil the mission of the University.\nThe cover features SIT graduate Yu Pengfei, who\nbenefitted from the University’s applied learning\npedagogy, allowing him to be well-prepared for the\ncybersecurity industry.The Singapore Institute of Technology (SIT) is Singapore’s University of\nApplied Learning. Our mission is to maximise the potential of our learners\nand innovate with industry through an integrated applied learning and\nresearch approach, so as to contribute to society and the economy.\nABOUT THE COVER WE ARE SIT\nABOUT SIT 01 40\n02 46\n04\n06\n08\n10\n14\n22\n26\n32SIT AT A GLANCE\nCHAIRMAN’S MESSAGE\nPRESIDENT’S MESSAGE\nSENIOR MANAGEMENT\nBOARD OF TRUSTEES\nKEY HIGHLIGHTS\nACADEMIC YEAR IN REVIEW\nAPPLIED LEARNING\nAPPLIED RESEARCHINDUSTRY\nCOMMUNITY\n52\n58\n60\n62\n64\n66\n72SUSTAINABILITY EFFORTS\nSUPPORT FOR STUDENTS\nIN APPRECIATION OF SIT’S DONORS\nCORPORATE GOVERNANCE\nBOARD COMMITTEES & INTERNAL AUDIT\nFINANCIAL STATEMENTS\nCONTACT INFOCONTENTS\n50 A DIGITALLY TRANSFORMED UNIVERSITY\nFrom top (L–R): SIT@RP Building, SIT@NP Building, SIT@TP Building, SIT@SP Building, SIT@NYP\nBuilding, SIT@Dover\nSingapore Institute of Technology\nAnnual Report 2022\n01\nSIT@NP BUILDINGSIT@RP BUILDING\nSIT@SP BUILDINGSIT@NYP BUILDING\nSIT@DOVERSIT@TP BUILDING 6 Campuses 8 Overseas University Partners\nENGINEERING\n15\n4\n2undergraduate\nprogrammes1\npostgraduate\nprogrammes by coursework\npostgraduate\nprogrammes by research\nHEALTH AND\nSOCIAL SCIENCES\n6\n2undergraduate\nprogrammes\npostgraduate\nprogrammes by researchINFOCOMM\nTECHNOLOGY\n8undergraduate\nprogrammes1BUSINESS,\nCOMMUNICATION\nAND DESIGN\n6undergraduate\nprogrammes5 Academic\nClusters\nSIT-conferred Undergraduate Programmes\nSIT-OU Joint Undergraduate Programmes\nOverseas University Undergraduate Programmes\nPOSTGRADUATE PROGRAMMES\nby coursework\nby research17\n17\n54\n4\n1 BEng (Hons) Computer Engineering degree programme is included in both Engineering and Infocomm Technology clusters.\nDIGIPEN\nINSTITUTE OF\nTECHNOLOGY\nUNIVERSITY\nOF GLASGOW\nTHE CULINARY\nINSTITUTE\nOF AMERICA\nMASSEY\nUNIVERSITY\nNEWCASTLE\nUNIVERSITY\n95%Overall\nEmployment $3,675Mean\nSalary\nTECHNICAL\nUNIVERSITY\nOF MUNICH\nUNIVERSITY\nOF LIVERPOOL\nTRINITY\nCOLLEGE DUBLIN\nUndergraduate\nand Postgraduate\nProgrammesGraduate Employment Survey 20204\n1FOOD, CHEMICAL\nAND BIOTECHNOLOGY\nundergraduate\nprogrammes\npostgraduate\nprogramme by coursework SIT AT A GLANCE\nSingapore Institute of Technology\nAnnual Report 2022\n02 03SIT at a Glance\nFinancial year (FY) 2021 marked a passing of the baton for the SIT leadership – with the appointment of\nProfessor Chua Kee Chaing as the third President of SIT, succeeding Professor Tan Thiam Soon. The SIT\nBoard of Trustees also saw some changes in its composition, with the appointment of four new trustees\nwho hailed from different sectors and backgrounds. As I take over the reins from Mr Ng Yat Chung, I would like\nto thank him for his sterling leadership as SIT Chairman over the last 12 years, and Prof Tan for his significant\ncontributions during his term as SIT President.\nIt is indeed an opportune time for the new leadership to\nreview and chart SIT’s direction into the next phase of\ngrowth. It is important for the University to continue to\nredefine the higher education landscape by deepening\napplied learning and research, while continuing to forge\nstrategic partnerships focused on ‘win-win-win’ outcomes\nfor our students, industry, and community.\nINDIVIDUALS AT THE HEART OF SIT\nAt the heart of every university are the learners. They have\nchosen SIT to enhance their learning across the University’s\nwide range of pre-employment training (PET) and continuing\neducation and training (CET) programmes. I am pleased to\nnote that SIT’s undergraduate student enrolment has been\ngrowing year-on-year. SIT now has an annual intake of close to 3,000 PET students and an enrolment of over 8,500\nundergraduates – making it the third largest autonomous\nuniversity in Singapore by intake.\nPutting individuals at the heart of everything we do means\nadopting a learner-first approach, and making sure our\ncurriculum is kept up to date with industry demands.\nWith collaboration and connectivity across disciplines driving\nproductivity gains in various sectors, we continue to refine\nour curriculum, and look at harmonising our programmes\nto ensure that they continue to remain relevant amidst\nthe ever-changing needs of industry. The push towards\ninterdisciplinary learning is going to be key as we navigate\nall manner of challenges coming our way. In addition, SIT has\nintroduced transferable skills elements into its curriculum.\nThis is to ensure that our graduates have the agility and\npreparedness that come from the exposure to adjacent\nknowledge, as well as a solid grounding in transferable skills\nto navigate multiple careers in an uncertain future.\nSIT strives to create as many opportunities as possible for\nour students to be immersed in the workplace during their\ncourse of study as it is one of the most authentic learning\nenvironments to train work-ready professionals.\nOther than our signature Integrated Work Study\nProgramme (IWSP), I believe our workplace learning\napproach will greatly benefit the education of our students.\nFor example, for the Term-In/Term-Out (TITO) mode of our\ndegree programmes, the studying and work done during\nTerm-Out is designed in collaboration with our partner\ncompanies and is credit bearing. By working closely with our\nindustry partners, we can better ensure that our students\nare equipped with the skills that are in great demand. This\ndemand-based approach will be a powerful differentiator\nfor us as a university of applied learning. In addition, another important differentiator is to recognise\nthe prior learning and industry experience of our adult\nlearners. Our two pilot programmes for the Competency-\nBased Workplace Learning (CBWL) pathway have\nkickstarted this. The aim is to address industry skills\ngaps and provide an inclusive alternative pathway for\nin-employment learners to upskill and pursue a degree.\nThe new pathway provides adult learners, regardless of\ntheir starting qualifications, a means to enhance their\nskills and pursue a degree while working – the first of its\nkind in Singapore.\nWith our continued emphasis on the work-learn continuum\nand competency-based learning, SIT aims to lead and\nshape the continual education and training programmes\nthat are relevant to the industries’ needs.\nINDUSTRY AT THE HEART OF SIT\nAnother important piece of what makes SIT unique is our\nextensive collaborations with industry, which are weaved\ninto all aspects of our applied learning and research\nactivities. The IWSP , TITO mode, and CBWL pathway\nwould not be possible without the strong backing of our\nindustry partners.\nI am heartened that we continued to grow our network of\nindustry partners in FY2021, with numerous MOUs being\nsigned and research collaborations being forged in many\nareas. The intent is to work hand-in-hand with companies\nand move them up the innovation value chain.\nTo that end, we have established an integrated end-\nto-end innovation infrastructure to help industry with\ntheir innovation journey. This is supported by various\nApplied Research Centres (ARCs), including the Future\nCommunications Translation Lab (FCTLab), Energy\nEfficiency Technology Centre (EETC), Construction\nTechnology Innovation Lab (CTIL), Centre for Infrastructure\nand Tunnel Engineering (CITE), and FoodPlant, as well as\nInnovation Centres such as Design Factory@SIT, Rapid\nProduct Innovation and Development (RaPID) Centre, and\nSIT-Poly Innovation Centre of Excellence (SPICE).\nWith these centres, companies will be able to innovate,\nideate, prototype, and validate products, whilst working\nclosely with SIT faculty and students.\nOn the applied research front, we continued to make\nprogress as well. SIT pursues applied research to help drive\nindustry innovation, and at the same time, provide authentic\nlearning experiences for our students. For example, by\nparticipating in translational research programmes that\nbridge knowledge discovery and application, our students\nwill be able to contribute to solutions in sustainability,\ndigitalisation, food security, and community healthcare.\nTo this end, SIT has set up several translational research\nprogrammes with the intent to grow these into areas of\nexcellence, which will be recognised by industry as SIT’s\nstrengths. In FY2021, Sustainable Maritime Engineering\nwas added to our suite of Strategic Translational Research\nProgrammes to develop and test-bed sustainable maritime\ntechnologies and solutions. During the year, we also received our first two MOE Tier 2 grant wins, as well as our first Industry\nAlignment Fund Pre-Positioning Programme (IAF-PP) grant.\nIn the near future, we look forward to leveraging the living\nlab to propel our applied research efforts. With the additional\ninvestment from SP Group to enhance the capabilities of\nthe Multi-Energy Microgrid (MEMG) at our future Punggol\ncampus, we are moving one step closer to realising a unified\nsmart energy network to support applied learning, research,\nand experimentation in a real-world environment.\nFrom the perspective of an industry partner, we provide an\n‘as-real-as-the-market-gets’ environment to stress-test their\nideas and an opportunity to leapfrog and gain a competitive\nadvantage. For the students, this is authentic learning.\nLessons and experiments can be carried out in a real-world\nenvironment and tested in real-time. This gives students a\nfront-row seat to experience what the future would be like.\nWhile we empower and enable our learners with an industry-\noriented education experience, we would also like to imbue in\nour learners a passion to serve and contribute to the society\nwhile at SIT. As we make preparations for our move to our\nnew home in Punggol, we continue to engage with the wider\nPunggol community and are mindful of how SIT is uniquely\npoised to help shape the destiny of the upcoming Punggol\nDigital District. As restrictions eased over the last half of the\nyear, our students gave out care packs to the workers who\nwere stationed at the building sites, and in March this year,\n10 SIT students and 18 migrant workers at the ASPRI-Westlite\nPapan dormitory engaged in a spirited game of dodgeball.\nThis creative sports engagement was just one of several\nevents that SITintegrates – a student-led group focusing on\ncommunity integration – has organised for migrant workers\nin Singapore since 2021. The aim: to integrate these workers\ninto the community by creating a sense of belonging.\nMoving forward, SIT will endeavour to engage with schools,\ngovernment agencies, and interest groups in Punggol, as\nwell as beyond, to ensure that our SITizens remain grounded\nin the community and serve in our society.\nTHE ROAD AHEAD\nWith individuals and industry firmly at the heart of SIT,\nwe will continue to forge wide-ranging partnerships with\nindustry in areas such as workplace learning, work-study\ndegrees, IWSP , and applied research. Each partnership\nis unique, but they all contribute towards realising SIT’s\neducation and research missions. In terms of community\nbuilding, we will strive to maintain the strong ‘kampung\nspirit’ that is evident in Punggol.\nI am confident that with the support of our strategic\npartners – the Ministry of Education, polytechnics, overseas\nuniversity partners, industry partners, government\nagencies, and community leaders – coupled with a unified\n‘whole of SIT’ approach, we will continue to fly the flag\nhigh as Singapore’s premier University of Applied Learning.\nMR BILL CHANG\nChairmanSIT strives to create as many\nopportunities as possible for\nour students to be immersed\nin the workplace during their\ncourse of study as it is one of\nthe most authentic learning\nenvironments to train work-\nready professionals.““\nCHAIRMAN’S MESSAGE\nSingapore Institute of Technology\nAnnual Report 2022\n04 05Chairman’s Message\nPresident’s Message\nWe celebrated the achievements of our graduating classes\nof 2020 and 2021 with physical graduation ceremonies in\nFebruary and October 2021, respectively, to the delight\nof both SITizens and their families. For the Class of 2021,\nmore than 2,000 graduates from 46 undergraduate\nand postgraduate programmes received their degree\nscrolls, including the pioneer cohorts from the BEng in\nAircraft Systems Engineering and the MSc in Chemical\nEngineering programmes.\nIn the 2020 Graduate Employment Survey, 95% of our\ngraduates secured a job within six months of graduation.\nThis was higher than the 91% overall employment figure\nfrom the previous year.\nBeyond employment outcomes, our SITizens continue to\nmake us proud. For example, one SITizen’s design of a\ncompact recycling container was selected by the National\nEnvironment Agency to be mass produced for distribution\nto all households in Singapore. Another SITizen drew the\nattention of NASA with his space illustrations and was\ncommissioned to work on a year-long project with NASA’s\npublic outreach department.\nIn many ways, FY2021 was also the start of a new phase of\ndevelopment for the University. Through a well-executed\nsuccession planning exercise, I assumed the mantle of\nPresident, taking over from Prof Tan Thiam Soon. During\nhis nine-year term, Thiam Soon was instrumental in getting\napproval and funding for SIT’s integrated campus in Punggol\nthat is currently under development. He also successfully\ngrew a new university into the third largest in terms of\nundergraduate student intake amongst the six autonomous\nuniversities in Singapore, and one that is well recognised\nby industry. SIT owes Thiam Soon a debt of gratitude for\nhis stewardship and sterling service.\nIn March 2022, we welcomed our new Chairman, Mr Bill\nChang, Group Enterprise CEO and Singapore Country Chief\nOfficer of Singapore Telecommunications Limited or Singtel.\nBill took over the reins from Mr Ng Yat Chung, who was\nSIT’s founding Chairman. During his 12 years as Chairman,\nYat Chung oversaw SIT’s establishment as a publicly-funded\ninstitute of higher learning in 2009 and its elevation in 2014\nas Singapore’s fifth autonomous university. We are deeply\ngrateful to Yat Chung for his vision, guidance, and support\nin the development of the University.\nUPDATED MISSION STATEMENT\nTo take SIT into its next phase of growth, we sharpened our\nmission statement to reflect the dual role of the University\nin developing talent for industry and supporting them in\ntheir innovation journeys. Our updated mission statement is:\n“To maximise the potential of our learners and to innovate\nwith industry, through an integrated applied learning and\nresearch approach, so as to contribute to the economy\nand society.” The updated mission statement emphasises SIT’s focus on\nbridging and strengthening the links between the individuals,\nfor which the University aims to nurture, especially our\nstudents, alumni and staff; and the industry that we partner\nwith to co-create innovations and/or co-develop their talent\npipeline. This emphasis forms the theme of this annual\nreport – ‘Individuals and Industry at the Heart of SIT’.\nDEEPENING APPLIED LEARNING\nA major initiative during the year was the implementation\nof the Undergraduate Programme Structure (UPS) as part\nof the university-wide effort to harmonise our programmes.\nUPS formally incorporates interdisciplinary learning and\ntransferable skills components into the curriculum, better\npreparing our students for the workplace. The goal is to\nmeet the demands of the evolving work landscape by\ndeveloping in our students the ability to take on multiple\nperspectives, and synthesise solutions to complex, multi-\nfaceted problems. We piloted five programmes under UPS,\nbenefitting 370 first-year students and more programmes\nwill follow.\nWe expanded our offerings, both for our undergraduate\nprogrammes, as well as Continuing Education and\nTraining (CET) programmes. The new undergraduate\ndegree programmes developed for Academic Year (AY)\n2022 include Applied Artificial Intelligence, Digital Supply\nChain, and Applied Computing (Fintech specialisation).\nIn the CET space, we continued to engage industry and\nimplemented new hybrid and full-synchronous online\ncourses, as well as professional certification examinations.\nOne key initiative was the collaboration with the Professional\nEngineers Board to curate a series of CET and bridging\ncourses aimed at capability development and enabling\ncertifications of Professional Engineers. In 2021, despite\nCOVID-19, SITLEARN Professional Development delivered\n84% more CET training places than the previous year.\nPIONEERING WORKPLACE LEARNING\nWe took a major step to pioneer the work-learn continuum\nthat SIT has been championing in recent times. To support\nour learners in new modalities of education, we have been\npiloting the Competency-Based Workplace Learning (CBWL)\npathway with two programmes since September 2021. Each\nprogramme’s curriculum was designed in collaboration\nwith industry to enable workplace learning for programme\nparticipants. Since its launch, we have garnered positive\nfeedback of the pathway from both workplace learners and\ntheir employers, and we continue to refine the programme\nwith our industry partners.\nAnother work-learn modality we started in the year is the\nTerm-In/Term-Out (TITO) model for our Applied Computing\n(Fintech specialisation) programme. Here, students alternate\nbetween spending one to two trimesters in SIT and at the\nworkplace. At the workplace, they work on projects that\nare jointly curated and supervised by SIT and the company. The intent is that even while working and contributing to\nthe business of the company, the students will be acquiring\nnew competencies and working towards the attainment of\ntheir degrees. Four companies have come on board to work\nwith us on this programme.\nGROWING APPLIED RESEARCH & INDUSTRY\nCOLLABORATIONS\nOn the research front, we have made much progress as\nwell. We embarked on some 40 applied research projects\nwith a total funding of $40 million, involving 66 industry\ncollaborators ranging from MNCs, SMEs, government\nagencies, and start-ups. These include a joint research\nprogramme with Agrocorp International to improve the\nextraction of proteins from plants to maximise protein\nquality, yield, and functionality, as well as to make the\nextraction process greener.\nWe officially opened FoodPlant, a small-batch food\nproduction shared facility, set up jointly with Enterprise\nSingapore and JTC. FoodPlant is a key part of SIT’s\nsustainable food innovation programme that aims to\nhelp local companies grow and innovate through food\ntechnology. It also serves to strengthen SIT’s education\nmission by providing our students an authentic learning\nenvironment that brings them closer to the industry.\nThe year also saw the setting up of the Centre for\nInfrastructure and Tunnel Engineering. A partnership\nwith Land Transport Authority, this new centre aims to\nstrengthen Singapore’s tunnelling and infrastructure\ndevelopment capabilities.\nAnother key development is SP Group’s increased\ninvestment of up to $8 million to enhance the capabilities of\nthe Multi-Energy Microgrid (MEMG) at SIT’s future Punggol\ncampus. The MEMG will be the largest private microgrid in Singapore when it is completed in 2024, and the first to\nbe constructed on a university campus in Southeast Asia.\nSUPPORTING SITIZENS\nAlthough the impact of the pandemic eased in FY2021,\nCOVID-19 continued to affect some SITizens and their\nfamilies financially. The University continued to draw on\nthe Student Relief Fund @ SIT (COVID-19) to help SITizens\nwho faced unexpected financial hardship caused by the\npandemic. As of 31 March 2022, 1,283 SITizens have\nreceived help from the fund with a total disbursement of\nover $2.3 million.\nAs we embark on this next phase, and with the continued\nsupport of our stakeholders, I am confident that we will excel\nand make SIT a premier University of Applied Learning.\nPROFESSOR CHUA KEE CHAING\nPresidentFinancial Y ear (FY) 2021 was a fruitful year for SIT despite the pandemic. We welcomed a record intake of 2,952\nnew SITizens for the academic year from a pool of 13,000 applicants, an 8% growth in applicants from the previous\nyear. The academic quality of admitted polytechnic students improved; and close to 86%, a year-on-year increase\nof 3%, were admitted to their first choice of degree programmes.\nThe updated mission statement\nemphasises SIT’s focus on\nbridging and strengthening the\nlinks between the individuals,\nfor which the University aims to\nnurture, especially our students,\nalumni and staff; and the\nindustry that we partner with\nto co-create innovations and/or\nco-develop their talent pipeline.““\nPRESIDENT’S MESSAGE\nSingapore Institute of Technology\nAnnual Report 2022\n06 07\nFOR THE FINANCIAL YEAR ENDED 31 MARCH 2022\nAssociate\nProfessor\nSusanna Leong\nVice President\n(Applied Research)\nAppointed 1 Jan 2022Vice President\n(Industry & Community)\nAppointed 1 Jan 2022Mr Bernard Nee\nVice President\n(Innovation)\nAppointed 1 Oct 2015Associate\nProfessor\nIvan Lee\nVice President\n(Planning)\nAppointed 1 Apr 2015Mr Tsoi\nMun Heng\nDeputy President\n(Campus Development) &\nChief Investment Officer\nAppointed 1 Jul 2019Mr Chan\nWing LeongDeputy President\n(Academic) & Provost\nAppointed 1 Jan 2022Professor\nJohn ThongPresident\nAppointed 1 Jan 2022Professor Chua\nKee Chaing\nDeputy President\n(Administration) &\nChief Financial Officer\nAppointed 1 Jul 2019Mr Ronnie TaySENIOR MANAGEMENT\nSingapore Institute of Technology\nAnnual Report 2022\n08 09Senior Management\nFOR THE FINANCIAL YEAR ENDED 31 MARCH 2022*\nMember\nMs Neo Gim Huay\nManaging Director, Center\nfor Nature and Climate\nWorld Economic ForumAppointed\n16 Sep 2021\nMember\nMr Abu Bakar Bin Mohd Nor\nGroup Chairman\nForward Vision Pte LtdAppointed\n16 Sep 2015\nMember\nMs Jacqueline Poh\nManaging Director\nSingapore Economic\nDevelopment BoardAppointed\n1 Jun 2022\nMember\nMr Han Kwee Juan\nManaging Director & Group\nHead, Strategy & Planning\nDBS Bank LtdAppointed\n1 Jun 2022BOARD OF TRUSTEES\nMember\nMr Soon Sze Meng\nManaging Director\nTemus Pte LtdAppointed\n16 Sep 2018Member\nMs Tammie Tham\nChief Executive Officer\nEnsign InfoSecurity Pte LtdAppointed\n16 Sep 2018\nMember\nMr Wen Khai Meng\nSenior Advisor,\nGroup Strategy\nCapitaLand LimitedAppointed\n16 Sep 2015\nMember\nAppointed\n4 Oct 2021\nMs Lim Wan Yong\nSecond Permanent\nSecretary (Education)\nMinistry of Education\nMember\nAppointed\n16 Sep 2015\nMrs Margaret Lui\nChief Executive Officer\nAzalea Asset\nManagement Pte Ltd\nMember\nMr Kwee Liong Keng\nManaging Director\nPontiac Land Pte LtdAppointed\n1 Nov 2017\nMember\nProfessor Chua Kee Chaing\nPresident\nSingapore Institute of TechnologyAppointed\n1 Jan 2022\nMember\nAppointed\n16 Sep 2018\nDr Benjamin Koh\nDeputy Secretary (Development)\nMinistry of Health\nMember\nMs Susan Soh\nHead of Asia Pacific\nSchroder Investment\nManagement (Singapore) LtdAppointed\n16 Sep 2021\nMember\nMr Nagaraj SivaramAppointed\n16 Sep 2015\nFormer Partner,\nAssurance Services\nErnst & Young LLP\nMember\nMs Gail Ong\nPartner,\nEquity Capital Markets\nWongPartnership LLPAppointed\n16 Sep 2018\nMember\nMr Quek Gim Pew\nSenior R&D Consultant\nMinistry of DefenceAppointed\n16 Sep 2018\nMember\nMr Ravinder Singh\nGroup Chief Operating\nOfficer, Technology &\nInnovation and President,\nDefence & Public Security\nSingapore Technologies\nEngineering LtdAppointed\n16 Sep 2018\nChairman\nMr Bill Chang\nChief Executive Officer,\nGroup Enterprise/Chief\nExecutive Officer, Regional\nData Centre Business\nSingapore\nTelecommunications LtdAppointed\n16 Mar 2022\nMember\nMr Chan Hian Lim\nDeputy Chief Executive\nOfficer (Corporate,\nIndustry and Technology)\nSingapore Food AgencyAppointed\n16 Sep 2021\nMember\nDr Chia Tai TeeAppointed\n16 Sep 2018\nFormer Chief Risk Officer\nGIC Pte Ltd\n*Includes trustees appointed after 31 March 2022. Information correct as at Aug 2022.\nSingapore Institute of Technology\nAnnual Report 2022\n10 11Board of Trustees\nMR RODRICK YEO\nEngineering Lead\nEnsign InfoSecurity“It is important for me as\na supervisor to support\nJonathan’s journey in\npursuing a degree and\nhis interest in lifelong\nlearning. Through the CBWL\npathway, he has shown much\ndetermination and resilience\nin pursuit of his personal and\nprofessional goals.”\nSingapore Institute of Technology\nAnnual Report 2022\n12 13Mr Jonathan Goh, 41, is pursuing his dream and upgrading himself with a Bachelor of Engineering\nwith Honours in Information and Communications Technology (Information Security) through SIT’s\nCompetency-Based Workplace Learning (CBWL) pathway. This is a result of the collaboration\nbetween SIT and Ensign InfoSecurity, the largest, pure-play end-to-end cybersecurity service\nprovider in Asia.\n(From left) Mr Jonathan Goh, Manager, with mentor Mr Rodrick Yeo, Engineering Lead, both from Ensign InfoSecurity.A PATHWAY FOR\nINDUSTRY-CENTRIC\nLIFELONG LEARNING\nFY2021 was a year filled with a mix of virtual and\nphysical events as Singapore made a transition\ntowards the COVID-19 e ndemic phase.\n09 APRIL MOU WITH CHONGQING YUBEI\nDISTRICT PEOPLE’S GOVERNMENT AND WISENET\nASIA PTE LTD\nSIT signed an MOU with Chongqing Yubei District People’s\nGovernment and Wisenet Asia Pte Ltd, which aims to\nprovide human capital development of executives in\nChongqing through post-graduate programmes and\nexecutive education. In addition, SIT students will have\nthe opportunity to be placed in Overseas Integrated Work\nStudy Programmes (OIWSP) with companies in Chongqing.\nThis MOU builds on the Joint Implementation Committee\nfor the China-Singapore (Chongqing) Demonstration\nInitiative on Strategic Connectivity, a government-to-\ngovernment platform.\n03 MAY PERMANENT SUPPORT FOR FOOD\nTECHNOLOGY APPLIED RESEARCH AND\nSCHOLARSHIPS AT SIT FROM PRIMA GROUP\nSIT received an endowed gift of $3 million from the Prima\nGroup to develop future talents and applied research\nin Food Technology. The gift, which commemorates\nPrima Group’s diamond anniversary, has enabled SIT to\nestablish the Prima Group Scholarship for talented Food\nTechnology undergraduate students, as well as the Prima\nGroup Applied Research Grant to run innovation projects\nthat are focused on closing technological gaps in food\nmanufacturing and processing.21 JUNE PURSUITS BEYOND ACADEMIC\nEXCELLENCE AT SIT VIRTUAL SCHOLARS’ TEA\nAside from pursuing academic excellence, SIT Scholars\nare encouraged to develop themselves holistically beyond\nthe curriculum. A total of 49 SIT Scholars attended the SIT\nVirtual Scholar’s Tea, which promoted greater camaraderie\nand provided support for personal development. A key\nfocus of the event was to train scholars on how to carry\nthemselves and communicate more effectively. Attendees\nnot only learnt more about themselves and others, but\nthey also picked up techniques on how to express their\nopinions and needs with confidence.\n04 AUGUST SKILLSFUTURE@SIT\nSkillsFuture@SIT, organised in partnership with SkillsFuture\nSingapore (SSG) and the 12 institutes of higher learning\n(IHLs), saw over 50 online workshops centered around\nthe theme ‘Supporting Industry Transformation through\nUpskilling Singapore’s Workforce’.\nThe event was organised by SIT with the help of SIT\nstudents and SITizen Ambassadors. It was also part of\nSkillsFuture Month from 8 July to 22 August. Close to\n29,000 participants accessed SkillsFuture@SIT, where\nindustry leaders and IHLs shared insights through keynote\nsessions and online workshops with a key focus to assist\nvarious groups, such as mid-career job seekers and fresh\ngraduates, in enhancing their skills and employability. The\nevent also saw the launch of SIT’s new Competency-Based\nWorkplace Learning pathway.2021APRIL MAYJUNESEPTEMBER\n19–22 OCTOBER SIT GRADUATION 2021\nThe Class of 2021 celebrated their big day across 11\nsessions conducted under Safe Management Measures\nfrom 19 to 22 October 2021. Mr Chan Chun Sing,\nMinister for Education, graced the main session of the\nSIT Graduation, held at The Theatre at Mediacorp.\nClose to 1,600 graduates from 27 undergraduate and\npostgraduate degrees, conferred by SIT and joint overseas\nuniversity partners, received their degree parchments.\nSIT Graduation 2021 marked the graduation of the\npioneer cohort of 46 students from the Aircraft Systems\nEngineering programme – the first degree of its kind by\nan autonomous university in Singapore.\nOCTOBER\nAUGUST\nSIT ALUMNI NETWORKS’ ONLINE EVENTS:\nONE HIT AFTER ANOTHER\nAmid the pandemic, alumni continued to learn and have\nfun with virtual SIT Alumni Network events held throughout\nthe year. The Alumni Leisure Network drew a steady stream\nof SITizens with online craft workshops such as the Floral\nCapsule Workshop, Mini Copper Lamp Workshop, and Resin\nMarbled Coaster Workshop. SITizens also stayed fit with the\nAlumni Sports Network, sweating it out at Pilates, Zumba,\nBodyCombat, Muay Thai, and Boxing sessions. Over at the\nAlumni Career Network, the most popular webinars – such\nas Buying Your First Home, and Understanding Features\nand Risks of Major Financial Products – attracted over a\nhundred alumni attendees who wanted to find out what\nto do about these important matters.\nALL YEAR ROUNDLearning personal skills at SIT Virtual Scholar’s TeaKEY HIGHLIGHTS\nAfter months of planning by over 600 student organisers\nand facilitators, SIT welcomed more than 2,600 freshmen\nto the SIT First Year Experience with a series of physical\nand virtual activities – SIT Helix, Day Zero, Club Fair, and\nVirtual Platform. Helix is an induction programme and a\nplatform for freshmen to connect with the SIT community,\nmeet fellow freshmen from other degree programmes, and\nlearn more about the services provided for students. This\nyear’s SIT Helix was a two-day virtual event that featured\nthree sessions; it was attended by close to 1,000 freshmen\nand 73 student organisers and facilitators.\nDay Zero was held over five days across six campuses,\nwhere the freshmen took the opportunity to understand the\nexpectations for their degree programmes and gained useful\nstudying as well as time management tips from their seniors.\nDay Zero was attended by 2,667 freshmen, 617 student\norganisers and facilitators, as well as 156 academic staff.30 AUGUST–03 SEPTEMBER ORIENTATION 2021: SIT FIRST YEAR EXPERIENCE\nSingapore Institute of Technology\nAnnual Report 2022\n14 15Key Highlights\n22 OCTOBER CO-CREATING THE SIT STORY AT SIT\nSCHOLARS’ VIRTUAL CAMP\nThe SIT Scholars’ Virtual Camp welcomed 16 newly-\nminted scholars to the SIT Scholar Community. Senior\nSIT Scholars facilitated group discussions on how\nscholars could play a part in shaping the SIT story. Lively\nteam bonding activities were followed by a dialogue\nwith graduated SIT Scholars, who shared their personal\njourneys and how being an SIT Scholar motivated them\nto become better service leaders for the community.11 NOVEMBER HEPA FORUM: HIGHER EDUCATION\nADAPTING TO A POST-COVID WORLD\nThe Higher Education Planning in Asia (HEPA) Forum is\nan annual event that provides a platform for university\nplanners and administrators across Asia to come together\nto interact, share best practices and network. This year\nwas its ninth consecutive run and the first time it was\nconducted virtually.\nJointly organised by Ajou University (South Korea) and\nSIT, the 2021 instalment went virtual and gathered\nover 200 participants, and more than 20 speakers from\nAustralia, China, India, Japan, Korea, and Singapore.\nThe Forum covered pertinent topics in the rapidly-\nchanging education landscape around Asia, including\nhow universities coped with disruptions brought about\nby the COVID-19 pandemic in their respective contexts.\n28 DECEMBER LAUNCH OF PORTAL & APP\nFOR ALUMNI\nFor the first time, SIT alumni got their very own Alumni\nPortal and accompanying mobile app. The new portal\nallows SIT alumni to access exclusive benefits and services\nwhile staying connected with their fellow SITizens through a\nsingle mobile app. On the portal and app, alumni can build\ncommunities and keep in touch with their fellow SITizens by\ncreating and joining alumni groups, access valuable career\nopportunities through the Job Portal, as well as register, pay\nfor, and keep track of upcoming Alumni Network events\nand Alumni Mentoring Programme activities. The app also\ncontains their own personal digital Alumni e-Card.25 NOVEMBER CLASIC PROJECT SHARING SEMINAR\nThe inaugural Community Leadership and Social\nInnovation Centre (CLASIC) Project Sharing Seminar\nwas held at SIT@Dover and streamed live to SIT staff\nworking from home. CLASIC curates, tracks, and optimises\ncommunity initiatives and projects by leveraging the\ninterdisciplinary knowledge, expertise, and skills of SIT\nfaculty, students, and staff across different academic\nclusters. Commemorating the Centre’s first year of\nestablishment, the event celebrated the outstanding work\nof four CLASIC project teams:\n• Gamification Design for Nutritional-Healthy Eating\nApplication\n• Digital Literacy and Tools for Seniors’ Socialisation\n• Design of National Environment Agency (NEA)\nRecycling Receptacle\n• Smart Meter to Capture Water Consumption Data in\nLow-income Households\n25 NOVEMBER RECOGNITION OF EXCELLENCE 2021\nThis key university event went online amid the pandemic,\ncelebrating the achievements of SIT students and\nhonouring the donors whose philanthropic support has\nnurtured student excellence at SIT. A total of 62 Book\nPrizes, Performance Awards, and Gold Medals were\npresented along with 44 named scholarships to 189\nrecipients. Most memorably, nine donors expressed their\nwell-wishes for the students through a series of special\nvideo recordings.\n28–30 OCTOBER COMMUNITY CARE INDUSTRY\nNETWORKING DAY 2021\nIn partnership with the Agency for Integrated Care\nand National Council of Social Service, SIT’s Centre for\nCareer Readiness hosted the virtual Community Care\nIndustry Networking Day 2021 in October. The two-\nday event gave first-year students from the Health and\nSocial Sciences cluster an overview of the community\ncare sector in Singapore. About 500 attendees learnt\nfirsthand from industry experts about the importance\nof community care, and how it is integrated into the\nlarger healthcare system in Singapore. They also gained\na better understanding of the roles and career pathways\navailable in this sector.\nNOVEMBER\nDECEMBERStudents who conceived the NEA recycling receptacle project\nexplained their designs and prototypes to SIT staff and\ncommunity partners.\nAttendees at the Community Care Industry Networking Day22 NOVEMBER SIT SCHOLARSHIP AWARDS AND\nAPPRECIATION CEREMONY 2021\nThis event welcomed 35 new SIT Scholars and recognised\nthe contributions and achievements of 26 graduating\nscholars. Ms Devanshi Patidar, graduating scholar from\nthe Diagnostic Radiography programme, shared how\nbeing an SIT Scholar shaped her into a better leader.\nShe encouraged her juniors to actively serve as SIT\nScholars and contribute to causes close to their hearts.\nShe also shared her gratitude to SIT for the opportunities\nprovided to nurture every scholar’s potential.\nMs Patidar shared how being an SIT Scholar enhanced her\nleadership skills.\nSingapore Institute of Technology\nAnnual Report 2022\n16 17Key Highlights\nThe generosity of five individual and corporate\ndonors has made possible the new Sang Nila Utama\nScholarship at SIT. Named after the 13th-century\nPalembang prince who, according to tradition, founded\nthe Kingdom of Singapura, this prestigious scholarship\nwill nurture forerunners and first-movers for industry and community among high-achieving Engineering,\nInfocomm Technology, and Health and Social Sciences\nundergraduates. Thanks to the donors’ endowed gifts\nand the applicable Enhanced Government Matching\nGrant, an endowed fund of more than $1 million has\nbeen set up to support the scholarship in perpetuity.05 JANUARY SANG NILA UTAMA SCHOLARSHIP APPRECIATION LUNCH\n2022\nA key focus of SIT Virtual Open House (VOH) 2022 was\non how we could provide prospective students and their\ninfluencers quality content with the user’s experience in\nmind. As authenticity is key for prospective students, a\nnew Student Ambassadors platform was integrated into\nthe microsite, which allowed prospective students to chat\ndirectly with current undergraduates to get their real views\nof programme offerings and student life. Showcasing our\nstudents’ applied research projects more prominently\nwas also a key feature this year. Programme talks were in\nbite-sized formats with a story-telling angle, allowing for\nmore direct and meaningful insights provided by faculty\nmembers. This was layered with live coffee chat sessions\nwith professors, alumni, and current students. In addition,\nprospective students could chat one-on-one with an admissions officer, which generated more opportunities\nfor two-way conversations. ‘Stories of SITizens’ featured\nnarratives and videos of our current students, scholars, and\nalumni. The VOH microsite attracted 80,781 page views\nand 5,640 unique visitors as of 15 March 2022.15 JANUARY ENGAGING PROSPECTIVE STUDENTS AT SIT VIRTUAL OPEN HOUSE 2022 JANUARY01 JANUARY SIT’S THIRD PRESIDENT\nProf Chua Kee Chaing assumed the role of SIT President,\nsucceeding Prof Tan Thiam Soon who stepped down as\nPresident after nine years in the role. Prof John Thong\nassumed the role of Deputy President (Academic) &\nProvost with effect from 1 January 2022, succeeding Prof\nChua. Prof Chua joined SIT in September 2019 and has\nled the university’s development in academic policies\nand curriculum, applied learning and applied research,\nfaculty development, as well as student administration.\nMs Gan Siow Huang, Minister of State, Ministry of Education was\nthe guest-of-honour at the event.Mr Neo Kian Hong, Group Chief Executive Officer, SMRT\nCorporation Ltd was one of the plenary speakers.16 JANUARY SIT ALUMNI MENTORING PROGRAMME: CYCLE 1 & 2 APPRECIATION CEREMONY\nThe SIT Alumni Mentoring Programme is a six-month long\nprogramme, bringing together SIT alumni and students\nto foster personal and professional growth. After months\nof communicating virtually, Alumni Mentors and Student\nMentees from the first two cycles finally met in person\nat its first physical event since April 2021, where they\ncaught up and enjoyed a movie at Projector X: Riverside.\nParticipants were also presented with certificates of\nappreciation to commemorate their completion of the\nprogramme. Cycle 3 began in September 2021, and\nmarked the programme’s highest participation rate so far,\nhaving successfully matched 63 mentors with 82 mentees.\n17–21 JANUARY CAREER NEXUS 2022\nCareer Nexus is SIT’s largest networking event. The\nplatform was abuzz with activities on 19 January when\nmore than 860 industry representatives from 225\ncompanies enjoyed a fruitful networking session with\nSIT students. More than 1,600 students sought full-time\npositions or opportunities for their Integrated Work Study\nProgramme. The e-networking saw 43,300 unique visits\nin total.\nThe Applied Learning Conference (ALC) is one of SIT’s key\nplatforms for fostering collaboration between academia\nand industry to transform the education and workplace\nlearning landscapes. The third instalment of the event was\nheld virtually for the first time in 2022. The two-day event\nfocused on ‘Embracing Change in an Era of Disruption’ and The ‘Xplore!’ webinars saw alumni and guest speakers\nfrom various companies reveal insights on managing and\ndeploying disruptive technology, and share their views of\nwork in today’s digitalisation age. Industry partners also\nhad access to Project Showcase – a demonstration of 100\ninnovative projects by SITizens. The showcase gave them\nan idea of how a potential hire from SIT would be able to\ncraft solutions for their organisations.\nwelcomed more than 400 local and overseas delegates.\nComprising thought leaders and practitioners from around\nthe world, the event allowed delegates to share and learn\nabout competency-based education, interdisciplinary\nlearning, and related areas such as lessons from COVID-19,\ninnovative technologies, and applied learning pedagogies.20–21 JANUARY THIRD APPLIED LEARNING CONFERENCE\nSingapore Institute of Technology\nAnnual Report 2022\n18 19Key Highlights\n25 FEBRUARY AMBASSADOR AND SCHOLAR\nENGAGEMENT WORKSHOP\nThe fourth edition of SITizen Ambassador and Scholar\nEngagement Workshop was conducted in person at\nSIT@TP Building. The workshop equips our Scholars and\nSITizen Ambassadors with knowledge of SIT’s offerings,\nalongside public speaking skills to engage potential\nstudents and decision-influencers such as parents and\nteachers during outreach events. A public speaking\nworkshop was conducted, where practical tips on pitching\nand presenting to virtual and physical audiences with ease\nand confidence were shared. Participants also engaged\nin an interactive role-play exercise to apply and practise\nthese skills, while forming new friendships.\n21–25 MARCH WELLNESS WEEK BY DIVERSITY &\nINCLUSION ADVOCATES\nWellness Week is a bi-annual affair to promote good\nmental health and a supportive SIT community. This\nyear’s Wellness Week was organised by the Diversity &\nInclusion Advocates. Through various activities online\nand on campus, students learnt about developing coping\nstrategies and explored self-care activities to prevent and\nmanage burnout. A week-long series of activities included\nmindfulness yoga and art therapy, as well as an outreach\nand education campaign.\nThe Diversity & Inclusion Advocates comprise student\nleaders who embody positive community values and\npromote inclusion and student well-being on campus. They\nco-create and drive informative student engagements and\noutreach events, such as Diversity Day and Wellness Week.14 FEBRUARY–02 APRIL SINGAPORE\nUNIVERSITY GAMES\nAfter a two-year hiatus, the Singapore University Games\n(SUniG) finally resumed in 2022. Rising to the challenge, SIT\nathletes showed resilience and determination at the Games as\nthey brought home several medals. The medal tally included\na Gold in cue sports; a Gold and a Silver in tchoukball; and\na Gold in 9-Ball women’s singles. A total of 265 SIT athletes\nparticipated in 13 sports including badminton, basketball,\nvolleyball, and ultimate Frisbee. SIT also had the opportunity\nto host the table tennis games this year.\nA new endowed gift of $2.6 million was made possible\nby Dr Chua Thian Poh to support the development of\nSIT’s future campus in Punggol, and to nurture financially\ndisadvantaged undergraduates through the newly\nestablished Chua Thian Poh Bursary at SIT. In recognition\nof this generous gift, SIT has named the Chua Thian Poh\nDiscovery Hub at its future campus in Punggol. In the\ninterim, before the Punggol campus is operational, the\nStudent Activities Centre at SIT@Dover has been named\nthe Chua Thian Poh Student Activities Centre.\n26 JANUARY THE CHUA THIAN POH DISCOVERY HUB MADE POSSIBLE AT SIT’S FUTURE CAMPUS IN PUNGGOLFEBRUARY04 FEBRUARY SIT GETS BIGGEST GIFT FROM THE\nNGEE ANN KONGSI\nThe Ngee Ann Kongsi formalised its intention to make\nan endowed gift of $25 million ($2.5 million annually for\n10 years) for the development of SIT’s library, as well as\nthe establishment of The Ngee Ann Kongsi Emergence\nFund to nurture emerging talents and ideas at SIT. In\nappreciation of the Kongsi’s donation – the biggest that\nSIT has received thus far – the SIT Library at its future\ncampus in Punggol (as well as its interim campus in Dover)\nhas been named The Ngee Ann Kongsi Library.\n16 MARCH APPOINTMENT OF NEW CHAIRMAN\nSIT welcomed Mr Bill Chang, Chief Executive Officer,\nGroup Enterprise and Country Chief Officer Singapore\nof Singtel, as the new Chairman to its Board of Trustees\nwith effect from 16 March 2022. Mr Chang took over\nfrom Mr Ng Yat Chung, who stepped down on 15 March\n2022 as the Chairman of SIT’s Board after more than 12\nyears at the helm. MARCH\n19–23 FEBRUARY FUTURE-READY LEADERSHIP PROGRAMME 2022\nThe Future-Ready Leadership Programme (FRLP) is a\nnewly-designed leadership development curriculum\nthat aims to equip SIT’s student leaders with relevant,\ntransferable skill sets. FRLP also serves as a platform for\nstudent leaders to connect across degree programmes,\nboost inter-disciplinary collaborations, and grow as future-ready leaders. About 475 student leaders attended\nthe two-day programme and learnt about leadership\nfundamentals, facilitation, and people management\nskills. The programme began with a panel discussion\nwith industry professionals and ended with experiential\nactivities to facilitate applied learning.\nSingapore Institute of Technology\nAnnual Report 2022\n20 21Key Highlights\nACADEMIC YEAR\nIN REVIEW\nSIT is committed to an aptitude-based admissions assessment approach that looks beyond academic\nachievements. Applicants are evaluated holistically; we take into account their passion, relevant work\nexperience, and exceptional achievements related to their programme of choice. This rigorous selection\nprocess ensures that SIT admits students with the best fit – those who can thrive in the University’s distinctive\napplied learning environment.\nIn the AY2021 admissions exercise, 6,583 distinct applicants were interviewed in the new hybrid model. A\ntotal of 1,507 face-to-face assessments were conducted as a complement to video assessments to incorporate\ngreater interactivity, while ensuring a balance of efficiency and effectiveness in our admissions assessments.\nThere was a 7% increase in applications and a 2% increase in intake compared with the year before.\nAPPLICATION VS INTAKETOTAL MATRICULATED BY ACADEMIC CLUSTER IN AY2021/22\nPROFILE OF SITIZENS\nAY2021/22 INTAKE BY QUALIFICATIONSApplication\nWe welcomed 2,952 new SITizens to the SIT family in AY2021/22.\n2,71812,185\nAY 2019/202011,865\nAY 2020/20212,90012,818274\nstudents869\nstudents538\nstudents735\nstudents536\nstudents\n2,724 students\n(92.3%)\n176 students\n(6%)\n52 students\n(1.7%)TOTAL\nstudentsAY 2021/20222,952*\nPolytechnic\nDiplomaBusiness,\nCommunication\nand DesignEngineering Food,\nChemical and\nBiotechnologyHealth and\nSocial SciencesInfocomm\nTechnology\nIntake\nGCE A-Level\nOthers5,000\n010,000 7%\n2%\n2,952*2,952 AS OF 4 OCT 2021\nENTRY\nQUALIFICATIONACADEMIC CLUSTER18.2% 29.4% 9.3% 18.2% 24.9%\nTOTALstudents 2,952*\nor about 49.1% of students were the\nfirst in the family to go to university\n(defined as those whose parents did\nnot pursue a university education).\nwere the top three most popular programmes,\nadmitting the highest number of students.were polytechnic\ngraduates.\nof the students admitted\nwere enrolled into their\nfirst- or second-choice\nprogrammes.More than1 in 2 students\n92.3%\n1st choice\n2nd choice90%Accountancy,\nHospitality Business,\nand Physiotherapyis the largest academic cluster, admitting 29.4%\nof the 2021 intake, followed by Infocomm\nTechnology (24.9%).Engineering\n* The total excludes post-graduate enrolment numbers.\nSingapore Institute of Technology\nAnnual Report 2022\n22 23Academic Year in Review\n“SIT’s focus on applied learning is relatively different from\nother universities and I could see it in Pengfei. His hands-on\ntraining at SIT has equipped him with strong core skills required\nin this industry. Beyond that, he possesses transferable skills\nsuch as problem-solving and project management, which I\nbelieve is the result of the holistic applied learning approach at\nSIT. Even before he joined GovTech as a full-time cybersecurity\nspecialist, Pengfei was already well-prepared for the industry.”\nMR BEN QUEK\nSenior Infrastructure Engineer\nGovTech\nSingapore Institute of Technology\nAnnual Report 2022\n24 25Mr Yu Pengfei graduated with a degree in Information and Communications Technology (Information\nSecurity) from SIT in 2021. He completed his Integrated Work Study Programme (IWSP) with the\nCyber Security Group in GovTech, where he is currently employed.\n(From left) Mr Yu Pengfei, Cybersecurity Specialist and SIT graduate with mentor, Mr Ben Quek, Senior Infrastructure Engineer\nat GovTech.PROTECTING THE\nGOVERNMENT’S\nCYBERSPACE\nCentral to the University’s mission to maximise the potential of its learners and to innovate with industry,\nSIT offers quality higher education through an integrated applied learning and research approach. The\nUniversity’s specialised degree programmes are intentionally designed to deepen the mastery of skills,\nwith interdisciplinary elements and transferable skills infused into the curriculum.\nThe education offered at SIT is built upon a solid foundation of industry collaborations. With an expanding\nline-up of programmes that cater to key economic sectors, students are trained to be agile, work-ready, lifelong\nlearners who are well-prepared to navigate today’s complex, fast-paced, and competitive global environment.\nNURTURING WORK-READY AND AGILE LIFELONG LEARNERSNEW DEGREES FOR THE FUTURE ECONOMY\nAN INDUSTRY-ENGAGED EDUCATIONIn FY2021, SIT made significant strides to deepen applied\nlearning through the harmonisation of programmes with\nthe roll out of the Undergraduate Programme Structure\n(UPS). Complementing the university’s suite of specialised\ndegree programmes that have been designed to prepare\ngraduates to be work-ready professionals in their\nchosen fields of study, the UPS infuses interdisciplinary\nand transferable skills into each degree programme. In\nAcademic Year 2021 (AY2021), SIT selected five degree\nprogrammes to come under the new programme structure,\nnamely Digital Communications and Integrated Media,\nPharmaceutical Engineering, Physiotherapy, Robotics\nSystems, and Speech and Language Therapy.\nSIT’s approach to interdisciplinary learning is to develop\nin its students the ability to take in multiple perspectives\nand to synthesise solutions to complex and multifaceted\nproblems that are characteristic of real-world problems.\nThe University has piloted interdisciplinary learning\nthrough a sequence of modules starting with Critical\nThinking and Communicating, followed by two Design\nInnovation modules that are based on a project-based\nlearning approach. Thereafter, the Social Innovation\nProject allows multidisciplinary student teams to put their\ninterdisciplinary skills into practice while leveraging their\ndisciplinary expertise. Under the UPS, each programme will\nhave at least 15% of total curriculum credits associated with\ninterdisciplinary elements, including programme-specific\nmodules with subject matter from adjacent disciplines.\nIn FY2021, an Industry Ready Skills Framework (IRSF)\nwas formalised to offer structured transferable skills\ntraining embedded into both formal and informal\ncurriculum starting from AY2022. IRSF aims to equip\ngraduates with transferable skills that will shape them\ninto agile lifelong learners who are able to progress,\nadapt, and pivot in their careers. The scaffolded\ntraining embodies the overall skills, competencies, and\nattributes that SIT graduates can acquire to bolster their\neffectiveness as they step into their professional career.\nIRSF comprises five competency areas – Thinking Agility,\nPeople Agility, Digital Agility, Professional Agility, and\nChange Agility – and 18 transferable skills that SIT will focus on, such as Creative Thinking, Digital Data Literacy,\nand Professional Ethics.\nThe financial year also saw changes to the names of two\nacademic clusters. This was an outcome of a review to\nbetter reflect both the capabilities of each academic\ncluster, as well as the slate of programmes offered by\nSIT. The following academic clusters were renamed with\neffect from 1 January 2022:\n• Chemical Engineering and Food Technology (CEFT) has\nbeen renamed as Food, Chemical and Biotechnology\n(FCB) cluster.\n• Design and Specialised Businesses (DSB) has been\nrenamed as Business, Communication and Design\n(BCD) cluster.\nThe IRSF offers a structured transferable skills training that focuses\non five competency areas – Thinking Agility, People Agility, Digital\nAgility, Professional Agility, and Change Agility.\nTHINKING TINKERERS\nGROUNDED IN THE COMMUNITYCATALYSTS FOR TRANSFORMATIONABLE TO LEARN, UNLEARN & RELEARN\nTHINKING AGILITYPEOPLE AGILITYPROFESSIONAL AGILITY\nDIGITAL AGILITYCHANGE AGILITY\nCreative ThinkingSelf-Management\nAdaptability\nProfessionalism\nLearning Agility\nGlobal\nPerspective\nCareer\nManagementDigital FluencyDecision Making\nProblem Solving\nSense Making\nTransdisciplinary Thinking\nBuilding Inclusivity\nCollaboration\nCommunication\nCustomer\nOrientationDeveloping People\nInﬂuenceDISCIPLINARY\nKNOWLEDGE,\nSKILLS & ABILITIESThree new degree programmes aimed at nurturing\nspecialised talents proficient in leading industry\ntransformation will commence in AY2022. The new three-\nyear direct honours programmes are:\n• Bachelor of Science with Honours in Applied\nArtificial Intelligence. Through core training in software\nengineering, machine learning, and professional skills,\nthe programme aims to nurture a strong talent pipeline\nof artificial intelligence (AI) engineers proficient in\ndeveloping, deploying, and maintaining AI systems\nacross multiple industry sectors.\n• Bachelor of Science with Honours in Digital\nSupply Chain.  The programme focuses on\nemerging technologies in the digital transformation\nof the logistics and supply chain sector. SIT has\nestablished partnerships with the Singapore\nLogistics Association (SLA), YCH Group, and Y3\nTechnologies to co-develop and co-deliver the\ncontent of the curriculum.\n• Bachelor of Science with Honours in Applied\nComputing with a specialisation in Fintech.\nDeveloped in partnership with Infocomm Media\nDevelopment Authority (IMDA) and Monetary\nAuthority of Singapore (MAS), the SkillsFuture Work-\nStudy Degree programme aims to equip graduates\nwith both technical skills and financial domain knowledge that will position them for careers in the\nfintech sector.\nAdditionally, three programmes jointly offered by SIT\nand Newcastle University – Marine Engineering, Naval\nArchitecture, and Offshore Engineering – have been re-\ndesigned to Bachelor of Engineering with Honours\nin Naval Architecture and Marine Engineering. The\nthree-year programme focuses on maritime digitalisation,\ndecarbonisation, offshore renewables, and sustainable\ndesign and engineering of the global marine and offshore\nindustry. Specialisations in marine engineering, naval\narchitecture, and offshore engineering will be offered in\nthe upper years of the degree programme.\nIn collaboration with Singapore Rail Academy (SGRA),\nSBS Transit and SMRT Corporation, SIT launched the\nPostgraduate Certificate in Urban Railway Technology .\nDesigned for engineering professionals in the local rail\nindustry, the programme draws on SGRA’s industry-\nstandard expertise and experience, as well as SIT’s applied\nlearning approach to equip them with specialised technical\nand practical skills to further provide a safe, efficient, and\nreliable mass rapid transit system in Singapore. Twenty-\none participants joined the inaugural run in December\n2021 and will receive a Postgraduate Certificate in Urban\nRailway Technology upon completion of the programme’s\nfour modules.\nAs part of the University’s strategic focus in pioneering\nworkplace learning, SIT is piloting a new Competency-\nBased Workplace Learning (CBWL) pathway that\nprovides in-employment learners, regardless of their\nstarting qualifications, a means to enhance their skills and\npursue a degree while in employment. This first-of-its-\nkind pathway in Singapore is developed in partnership\nwith Ensign InfoSecurity, the Land Transport Authority\n(LTA), SBS Transit and SMRT Corporation. Programmes\nunder CBWL aim to upskill the workforce to meet\nevolving industry needs and achieve greater alignment\nbetween academic achievement and work performance.\nThe following CBWL degree programmes were piloted\nin AY2021:\n• Bachelor of Engineering in Information and\nCommunications Technology (Information Security) ,\nin collaboration with Ensign InfoSecurity.\n• Bachelor of Engineering and Master of Engineering\nTechnology in Sustainable Infrastructure\nEngineering (Land), in collaboration with LTA, SBS\nTransit and SMRT Corporation.The university is also looking to introduce other workplace\nlearning programmes based on a revamped Term-In/Term-\nOut (TITO) work-study modality, where students spend\nat least a trimester every year in the workplace, working\non a project or activity with clear learning objectives for\ncredit. The model allows students to effectively start on\nhis or her career while reading a degree. At the same\ntime, sponsoring companies will be able to green harvest\ntalents in an area of high demand.\nMr Chan Chun Sing, Minister for Education with representatives\nfrom Ensign InfoSecurity, LTA, SkillsFuture Singapore, SBS\nTransit, SMRT Corporation, and the Singapore Railway Academy.APPLIED LEARNING\nSingapore Institute of Technology\nAnnual Report 2022\n26 27Applied Learning\nBUILDING CAREER SKILLS AND COMPETENCIES ENHANCING AUTHENTIC LEARNING EXPERIENCES\nSIT’s Integrated Work Study Programme (IWSP), a salient\nfeature of the University’s educational experience, provides\nstudents with 8 to 12-month-long work attachments to\nintegrate knowledge with real-world practice. It is an excellent\nplatform for students to gain work experience, while industry\npartners get access to a pool of work-ready employees.\nTo better equip students with essential skills in the lead up\nto their work attachments and future careers, the University’s\nCentre for Career Readiness introduced micromodules in\nthe form of IWSP (Career Skills) as a pre-requisite to their\nIWSP . Comprising five topics curated based on feedback\nfrom both students and industry partners, the micromodules\naim to prepare students to adopt the right mindset and\nwork attitude, both of which are pivotal to students’ career\nsuccesses and complement their skill sets.\nUnder the Industry Ready Skills Framework (IRSF), SIT’s\nCentre for Digital Enablement (CoDE) piloted Digital\nCompetency Essentials (DiCE) in AY2021, which will be fully\nrolled out in AY2022. The credit bearing e-module comprises\n14 stackable micromodules, covering a range of essential\ntopics such as Digital Safety (including cybersecurity,\nphishing, and spam), Digital Information, and Data Literacy.\nStudents are required to complete all 14 micromodules at\ntheir own pace within their first two years at SIT.\nThe IRSF also includes a suite of micromodules under the\nInformation and Digital Literacy (IDL) category, managed by\nthe SIT Library. IDL offers skills training in the areas of critical\nthinking, professionalism and ethics, communication, as\nwell as digital fluency. In AY2022, all undergraduates will be\nrequired to complete a micromodule in Essential Research\nSkills before Year 2.\nSIT Library has also explored subscriptions to micro-learning\ncontent such as Linkedin Learning and Films on Demand.\nSuch micro-learning content allows students to acquire skills-\nbased learning to fulfil their learning gaps on demand. The\nsame content could also be used by faculty as part of the\ne-learning for flipped classroom learning and to normalise\nstudents with differing learning gaps. This resonates well\nwith the University’s direction in empowering students to\nbe more self-directed independent learners.The University’s programme harmonisation efforts also saw\nSIT’s Centre for Communication Skills (CCS) launching the\nUCS1001 Critical Thinking and Communicating (CTC)\nmodule. The aim is to develop students’ transferable skills\nthat cover critical thinking skills as well as foundational\nknowledge in writing and speaking in academic contexts. It\nis also made discipline-specific through the use of content-\nspecific reading texts, case studies, and problems and\ncontexts to teach critical reading, literature reviews, report\nwriting, and presentation skills.\nThe CTC module has been successfully launched in four\ndegree programmes, namely: Robotics Systems, Digital\nCommunication and Integrated Media, Pharmaceutical\nEngineering, and Speech and Language Therapy. The\nmodule will be rolled out to other degree programmes\nby AY2022.\nThe Communicating Across Curriculum (CAC) instruction\nis a major initiative led by CCS to develop students’\nacademic and professional communication skills across\nall SIT degree programmes. CAC involves embedding\nassignment-specific writing and speaking instruction within\nstudents’ content modules. This will help students to apply\nthe communication skills learned in their standalone module\nand improve their communicative competence. In FY2021,\nthe CAC instruction was embedded in 38 content modules.\nSome examples of the CAC instruction are workshops\non writing an effective IWSP final report, delivering an\neffective video presentation, capstone report writing,\nrequirements engineering and elicitation, managing\nworkplace relationships, and critical reflection. The CAC\ninstruction also includes one-to-one consultations on\nstudents’ draft reports and assessments of students’\noral presentations.\nIn addition, CCS developed and rolled out a series of\nself-directed learning micromodules on Workplace\nCommunication throughout the year. Available to all\nstudents via the learning management system, these\nmicromodules are a unique offering among language\nand communication centres in Singapore’s institutes of\nhigher learning.\nJoel Chan (left), together with Prof Tan Thiam Soon, Institute Professor, SIT, at the\n‘PDD: Connecting Smartness’ event on 28 July 2021. Joel won the speed round of the\nPDD Bug Bounty, where he uncovered the first vulnerability in less than 10 minutes.\nThe SIT Library facilitates learning opportunities for students to acquire transferable skills through hands-on activities\ncoupled with microlearning or talks. These sessions, aimed at holistic development through transferable skills training\noutside of the formal curriculum, include tinkering with robots, media equipment, and hydroponics farming:\nBorrowing Robots at SIT Library\nRobots are available for loan to aid\nstudents in their learning in robotic\nautomation and artificial intelligence.\nThree robots are available for loan,\neach bearing different sensors and\nfunctions, such as facial recognition,\nemotion recognition, simple navigation,\nobstacle sensor, and colour sensor.Hands-on Media Production\nStudents have access to the Gener8\nstudio at the Library where they can\nproduce various multimedia projects\nsuch as podcasts and vodcasts.Edibles: Urban Farming Initiatives\n30 students who signed up for\nhydroponics farming will receive hands-\non training at the hydroponics system\nto grow their chosen list of vegetables.SIT organised the inaugural Punggol\nDigital District (PDD) Bug Bounty\ncompetition in May 2021, where\nabout 50 students were given four\nhours to identify vulnerabilities –\nalso known as ‘bugs’ – that could\ncompromise building management\nsystems hosted on an isolated\nnetwork managed by the University.\nThe contest was held in partnership\nwith Singapore-based cybersecurity\nfirm Group-IB, the Cyber Security\nAgency of Singapore, and cyber\nsecurity community, Division Zero.\nBuilding on the success of the inaugural Local Immersion Programme (LIP) in 2020, 56 students from The Culinary Institute\nof America (CIA) participated in the second edition of the LIP from 26 July to 13 August 2021. They learnt about local\nfood production, consumption, and culinary traditions through visits to various local farms, including Hay Dairies and Kok\nFah. Students analysed the complexities of the food systems in Singapore and created a research project based on their\ncritical observations and experiential learning, all while observing Safe Management Measures.\nThe immersion\nactivity allowed\nCIA students to\nlearn about local\nfood production,\nconsumption,\nculinary traditions,\nand how to apply\nthe knowledge\nto their culinary\ncreations.\nSingapore Institute of Technology\nAnnual Report 2022\n28 29Applied Learning\nled remotely by UofG faculty with support from the\nSingapore campus and SIT teaching staff. Students from\nthe Mechanical Engineering and Computing Science\nprogrammes also had the opportunity to work on a\ncross-disciplinary design project.\nCONTINUED PARTNERSHIPS WITH\nREPUTABLE OVERSEAS UNIVERSITIES\nSince 2016, SIT and New Zealand’s Massey University\n(MU) have partnered to jointly deliver the Bachelor of\nFood Technology degree programme. The partnership\nhas been mutually beneficial, leveraging MU’s expertise\nin food technology and SIT’s expertise in engineering to\ndeliver a programme with good graduate employment\noutcome in a key growth sector. The partnership has\nbeen renewed for another five academic years. Beyond\nthe delivery of the degree programme, the continued\npartnership will also allow both universities to explore\nnew collaborations in applied research.SIT has also renewed its partnership with Newcastle\nUniversity (NU) to continue to jointly deliver several\ndegree programmes that have been established since\nAY2017. As a member of the Russell Group, NU brings\nto the partnership valuable engineering expertise in\nthe delivery of the joint programmes. The Russell\nGroup represents 24 leading universities in the UK.\nThe partnership has been renewed for another five\nyears, and includes opportunities for both universities\nin applied research.STRENGTHENING TEACHING AND LEARNING\nACCREDITATION MILESTONESThe Applied Learning and Innovation Grant (ALIGN)\nwas launched in May 2021 to meet the increased focus on\nthe use of technology to enhance teaching and learning.\nALIGN replaces the SIT Advancement of Learning and\nTeaching (SALT) grant, and is open to all academic staff,\nwith funding of up to $40,000. A total of nine teams were\nawarded the ALIGN with a combined funded amount of\n$150,000 in the first grant call.\nIn November 2021, Coach Academy, a digital coaching\nand mentoring knowledge repository, was launched to\nequip academic staff with reference materials by leading\nacademic researchers and industry practitioners.\nThe repository is broadly categorised into General\nCoaching Resources, Coaching Knowledge & Practices,\nCoaching Science, and Coaching in Education.\nIn line with the launch of CBWL, the Centre for\nLearning Environment and Assessment Development\n(CoLEAD) organised several training sessions in 2021\nfor all academic staff to attend. The key focus was on\ncurriculum design based on the ‘backward design’\napproach, and development of authentic assessments\nin alignment with course competencies.\nTo support social innovation projects, the internal\nCLASIC Project Grant Scheme was established\nin 2021 by the University’s Community Leadership\nand Social Innovation Centre (CLASIC) to evaluate\nand fund projects proposed by academic staff that\nharnessed their expertise, as well as students’ skills\nand knowledge. The projects must aim to develop\npractical and innovative solutions that address national or common social challenges in Singapore. In its first\nyear of establishment, CLASIC has awarded a total of\nS$53,232 to four projects:\nBoth SIT academic staff and Professional Officers were\ninvolved in the extensive preparations of accreditation\nreports as well as facilitations of visits and reviews, in\naccordance to the Washington Accord.\nThe following degree programmes achieved\naccreditations in FY2021:\n• Bachelor of Engineering with Honours and Master\nof Engineering in Sustainable Infrastructure\nEngineering (Land) programmes successfully\nacquired full Engineering Accreditation Board\n(EAB) accreditations.\n• EAB Accreditation: Bachelor of Engineering with\nHonours in Pharmaceutical Engineering, Bachelor\nof Engineering with Honours in Information\nand Communications Technology (Information\nSecurity), and Bachelor of Engineering with\nHonours in Information and Communications\nTechnology (Software Engineering).\n• The SIT-NU Bachelor of Engineering with Honours\nin Mechanical Design and Manufacturing\nEngineering (MDME) joint degree programme was awarded accreditation by the IMechE Academic\nStandards Committee on 16 June 2021.\nAccreditation evaluations are in progress for the\nfollowing programmes:\n• Institution of Chemical Engineers (IChemE)\nAccreditation: The SIT-NU Bachelor of Engineering\nwith Honours in Chemical Engineering.\n• Marine Engineering, Naval Architecture, and\nOffshore Engineering degree programmes are\naccredited by the Royal Institution of Naval Architects\n(RINA) and Institute of Marine Engineering, Science\n& Technology (IMarEST). Re-accreditation approval\nfor the newly-merged Bachelor of Engineering\nin Naval Architecture and Marine Engineering\nprogramme is being sought by SIT and NU.\n• A re-accreditation exercise for the Bachelor of\nAccountancy with Honours has been facilitated\nfor Certified Practising Accountant (CPA) Australia\nand the Chartered Accountants Australia & New\nZealand (CAANZ) in February 2022.Project\nPartner(s)Project\nTitleProject\nLead\nNational\nEnvironment\nAgency (NEA) Design a Recycling\nReceptacle for\ndistribution to\nall households in\nSingapore   Mr Kwong\nKwok Kuen\nSenior Professional\nOfficer\nECOSOFTT\nPte Ltd   Development and\ninstallation of a\nSmart Meter to\nbetter manage\nwater usage\nand cost for\nthe low-income\nhouseholds  A/Prof Steven Tay\nEngineering\nRainbow Centre\nand HOPE\nTechnik   Design solutions\nfor special needs\nclassroom chairs\nin SingaporeAsst Prof\nKarina Dancza\nHealth and Social\nSciences\nSingapore\nMuslim Women’s\nAssociation (PPIS)   Design learning\nactivities for PPIS\nstudent care centre   Dr Muhamed\nFauzi Bin Abbas\nInfocomm\nTechnology   SIT was the first institute of higher learning to conduct\na specialised course on ‘High Moisture Extrusion\nTechnology (HMET) for Meat Analogues’ for the public\nfrom 24 to 25 June 2021. A second run took place from\n23 to 24 September to cater to the demand from industry.\nFoodPlant, a $13 million shared facility for small-batch\nfood production was jointly launched by SIT, Enterprise\nSingapore, and JTC Corporation after much planning and preparation throughout FY2021. Food companies will\nhave access to high-tech food equipment at the 1,107\nsqm facility in Senoko Drive.  More than 20 members,\nmade up of multinational corporations and SMEs,\nhave signed up to date. Firms will be able to utilise\nthe equipment on site, tap research and development\nconsultancy services, as well as attend training and\nupskilling courses in food innovation.\nAttendees from the High Moisture Extrusion Technology (HMET) for Meat Analogues course pictured here with FoodPlant CEO,\nDr Lim Bee Gim.An alternative Overseas Immersion Programme (OIP)\nfrom 16 August to 3 September 2021 was also organised\nfor students of University of Glasgow (UofG) due to\ntravel restrictions. The academic portion of the OIP was\ndelivered through a hybrid arrangement, with modules\nSingapore Institute of Technology\nAnnual Report 2022\n30 31Applied Learning\nOVERVIEW OF\nSIT’S APPLIED RESEARCH\nTRANSLATIONAL RESEARCH & INNOVATION FOCUS\nSIT’s translational research aims to bring low technology\nreadiness levels (TRLs) research a step closer to application,\nworking collaboratively with other Autonomous Universities\n(AUs) and A*STAR. Currently, SIT’s translational research\nprogrammes are centred on five domains and supported\nby five technology enablers.\nIn FY2021, Sustainable Maritime Engineering was added to\nSIT’s suite of Strategic Translational Research Programmes to\nadvance Singapore’s capabilities in Future Ship and System\nDesign, Offshore Renewable, and new growth areas.\nArtificial\nIntelligenceFIVE ENABLERSPOWERING FIVE DOMAINS5G Cybersecurity\nRobotics and\nAutonomous\nSystemsAugmented /\nVirtual Reality\nSIT’s strategic translational research programmes and\ntechnology enablers.\nCommunity Health\nTransformation\nEnergy Resilience\nSustainable Infrastructure\nEngineering & Maintenance\nSustainable Food\nInnovation\nSustainable Maritime\nEngineeringSIT’s applied research, w hich prioritises translational research and innovation, aims to strengthen applied\nlearning and drive industry innovation and transformation.\nFUTURE\nCOMMUNICATIONS\nTRANSLATION LAB\n(FCTLAB) FCTLab  aims to drive applied research\nand innovation in 5G and future\ncommunications technologies. Through\nmeaningful collaborations with industries\nand public agencies, the FCTLab seeks\nto co-create intellectual properties for\ncommercialisation with our partners, grow\ndemand-led research and innovation,\nas well as strengthen the transfer of\ncapabilities to locally-based companies.\nFOODPLANT\nFoodPlant is Singapore’s first\nshared facility for small-batch food\nproduction to support innovation in the\nfood manufacturing industry. Jointly\nlaunched by SIT, Enterprise Singapore,\nand JTC Corporation, FoodPlant is a\n1,107 sqm shared facility that provides\nfood companies access to industry\nexpertise, specialised equipment, as\nwell as a suite of training courses to\nenhance the capabilities of food tech\nprofessionals. The objective is to facilitate\ntransformation in the food technology\nspace, bringing it closer to a more resilient\nand sustainable local food supply, in\nsupport of Singapore’s ‘30 by 30’ goal.\nINNOHUB\nInnoHub provides an integrated end-to-end innovation infrastructure to help industry with\ntheir innovation journey. InnoHub encompasses the following four synergistic Innovation Centres:\nRapid Product Innovation and Development\n(RaPID) Centre\nRaPID Centre is a specialised product development\nfacility that supports companies, including SMEs and\nstart-ups, in the design and development of new\nproducts through iterative rapid prototyping and small-\nbatch production before scaling up for manufacturing. Design Factory@SIT (DF@SIT)\nDF@SIT is a component of SIT’s innovation platform\nthat aims to guide businesses to find their unique value\nproposition via a multi-disciplinary co-creation approach for\ndesign innovations. DF@SIT has collaborated with various\norganisations on diverse projects, offering deeper insights\ninto how people live, work and play. In the past year, DF@SIT\nhas facilitated five innovation projects and six engagements\nthat enabled more than 200 students and industry personnel\nto better understand design innovation approaches. SIT-Poly Innovation Centre of Excellence (SPICE)\nSupported by Enterprise Singapore, SPICE  is a first-of-\nits-kind university-polytechnic centre. It aims to promote\ncollaboration among the various Centres of Innovation\n(COIs) at the polytechnics and ARCs at SIT to support\nlocal SMEs in their technology-driven transformation,\ninnovation and talent development initiatives. SIT staff\nand students can collaborate on innovation projects\nthrough SPICE, developing capabilities and a talent\npipeline of innovators.\nNational Additive Manufacturing Innovation Cluster\n(NAMIC) Hub@SIT\nNAMIC focuses on additive manufacturing solutions\nand technologies, as well as sustainable additive\nmanufacturing that can be applied across sectors\nsuch as Rail Transport, Offshore and Marine, and\nFood Technology.\nDSO-SIT JOINT\nRESEARCH\nLABORATORY The DSO-SIT Joint Research\nLaboratory was operationalised to\nspearhead applied research efforts for\npotential defence and commercial use.\nThe collaboration commenced with\nstrategic translational projects in the\nfields of robotics/unmanned systems and\ncybersecurity, involving SIT faculty staff\nand students from the Engineering and\nInfocomm Technology clusters.\nCONSTRUCTION\nTECHNOLOGY\nINNOVATION\nLABORATORY\n(CTIL)CTIL is a collaboration between\nSIT and Woh Hup Pte Ltd. It provides\na platform for Singapore-based\nconstruction companies to carry out\napplied research, develop innovative\ntechnologies for building structures and\nsub-structures with societal and economic\nimpact, together with SIT researchers.\nCENTRE FOR\nINFRASTRUCTURE\nAND TUNNEL\nENGINEERING\n(CITE)CITE is established in\npartnership with Land Transport\nAuthority (LTA). It will serve as a\nplatform for the civil engineering\ncommunity to exchange and\ndeepen their knowledge and skill\nsets. The Centre will also conduct\nand facilitate applied research to\naugment safety standards in the\ndesign, construction, operation and\nmaintenance of tunnels, as well as\nother civil engineering infrastructure.\nENERGY\nEFFICIENCY\nTECHNOLOGY\nCENTRE\n(EETC)EETC is a collaboration with\nthe National Environment\nAgency (NEA) to build the energy\nefficiency capabilities of the local\necosystem. EETC achieves this by\nproviding expertise and capabilities\nto companies to assist them in\nbecoming more energy efficient.APPLIED RESEARCH\nAPPLIED RESEARCH\nCENTRES (ARCs)\nSIT’s innovation activities are\nfocused on TRLs 5–7 with the aim\nto help companies move up the\ninnovation value chain. Over the last\ntwo years, SIT has set up several\nARCs in areas associated with\nour Strategic Translational\nResearch Programmes.\nSingapore Institute of Technology\nAnnual Report 2022\n32 33Applied Research\n0M4M8M16M\n12M20M24M28M32M\nFY18Amount (S$)\n4.1 M\n2.4 M3.1 M1.3 M16.1 M22.4 M32.2 M\nFY21 FY20 FY196.3 M\nExternal Internal\nFigure 1A. Total Grant Amount AwardedRESEARCH GRANTS FOR FY2021\nINTERNAL GRANTS\nIn FY2021, SIT extended its internal grant platform to\nsupport non-Science, Technology, Engineering and\nMathematics (STEM) projects in addition to STEM projects.\nThe aim of the Ignition Grant is to develop academic\nstaff’s capability to work with companies in early stage\ntranslational research.\nEXTERNAL GRANTS\nThe total external grants awarded to SIT have shown an\nupward trajectory from $4.1 million in FY2018 to $32.2\nmillion in FY2021 (Figure 1A). Industry cash and in-kind\ncontributions pegged to grants saw an increase from\nFY2018 to FY2020 but a dip in FY2021, largely due to the\nimpact of COVID-19 (Figure 1B). The number of externally-\nfunded projects grew from FY2019 to FY2021, with a total\nof 29 external grant projects awarded in FY2021 (Figure\n1C). There was also a good mix of industry collaborators\nin SIT’s applied research projects, ranging from MNCs,\nSMEs to start-ups (Figure 1D).\nNEW GRANTS\nIn FY2021, SIT received its first MOE Academic Research\nFund (AcRF) Tier 2 as well as A*STAR Industry Alignment\nFund (Pre-Positioning) (IAF-PP) grants.\nMOE AcRF Tier 2 Grant\nRethinking HVAC System Design in Post-Pandemic World\nPrincipal Investigator: Asst Prof An Hui\nAs COVID-19 is airborne, improving indoor ventilation\nis critical. This project will study the infection probability\nmodel under various conditions. Quantitative\nrecommendations for the ventilation strategies and\npassive engineering control will then be applied to reduce\nthe transmission risks. This project is done in collaboration\nwith Changi General Hospital.\nControl Algorithm for Spacecraft Formation Flying\nPrincipal Investigator: A/Prof Gianmarco Radice\nThe research team, in collaboration with NuSpace,\naims to develop novel control algorithms to allow small\nspacecraft (CubeSat) to perform formation manoeuvres\nwith safety features such as collision avoidance. Large\nCubeSat constellations with this algorithm would provide\nan autonomous orbit maintenance solution to ground\noperators, offloading the once laborious manual task of\norbit maintenance.\nA*STAR IAF-PP\nAutomated Protein Profiling and Characterisation Platform\nPrincipal Investigator: Asst Prof Du Juan\nThe aim of this programme is to build an automated\nprotein profiling and functional characterisation platform\nto accelerate the development of safe and tasty plant-\nbased foods and contribute to Singapore’s ‘30 by 30’\nfood security target. This programme has work packages,\nwhich are co-led by A*STAR and the National University\nof Singapore, with Massey University as a collaborator. At\nleast five industry partners will join the research team in\nthe co-development and test-bedding of the solutions.INITIATIVES IN FY2021\nGRANTSMANSHIP WORKSHOPS\nIn FY2021, a series of grantsmanship workshops were\norganised to strengthen internal grantsmanship skills\nand improve the quality of proposal submissions. Internal\nspeakers from SIT, who were successful in landing external\ngrants, shared tips on writing successful grant proposals\nwith fellow colleagues. Invited speakers included Dr Roger Chuah from the National Health Innovation Centre (NHIC)\nwho shared about the different grant platforms offered\nby NHIC and expected project deliverables from these\nplatforms. Dr Julian Tang from Wildtype Media Group\nPte Ltd also conducted a half-day workshop on writing\nconcise, coherent, and compelling grant proposals.\nResearch Integrity and Ethics Joint Awareness Day programme.In partnership with Research Governance Committees,\nSIT’s Applied Research Office (ARO) organised activities\nto raise awareness on the importance of upholding the\nhighest standards of research integrity and ethics amongst\nacademic staff, research staff and students. A key event was\nthe ‘Research Integrity and Ethics Joint Awareness Day’ to\npromote good research practices. The webinar focused on\ndata governance, navigating research ethics in the pandemic\nand biosafety. The chairpersons and representatives from the RAISING AWARENESS OF RESEARCH INTEGRITY AND ETHICS\nINSTITUTIONAL RESEARCH REPOSITORY\nIn partnership with SIT Library, ARO developed and\nimplemented an ‘Open Access Policy’ and set up an Institutional\nResearch Repository (IRR) to facilitate the sharing of SIT’s research outputs. The IRR aims to promote collaboration in\nresearch, raise the visibility of SIT’s research activities, and\nadhere to grantor’s requirements for open access.\nGROWING POSTGRADUATE BY RESEARCH INTAKE\nOur Postgraduate by Research (PGR) Programmes\nmatriculated nine students in FY2021, achieving a total\nenrolment number of 15. Partner organisations in our\nProgrammes Enrolment Partnering Companies/Organisations\nIndustrial\nMastersMaster of Engineering 5ams Sensors Singapore Pte Ltd, Building System and\nDiagnostics Pte Ltd, Jurong Town Corporation, SATS Catering\nPte Ltd, Sembcorp Marine Integrated Yard Pte Ltd\nIndustrial\nDoctorateDoctor of Engineering 8Advanced Remanufacturing and Technology Centre (A*STAR),\nC&W Services (S) Pte Ltd, HP PPS Asia Pacific Pte. Ltd., Land\nTransport Authority Singapore, NVIDIA Corporation, Singapore\nInstitute of Manufacturing Technology (A*STAR), TÜV SÜV\nDoctor of Clinical Research\nin Health Sciences2 Alexandra Health Pte Ltd, NTUC Health Co-Operative LimitedIndustrial Doctorate and Masters programmes include\nA*STAR, JTC Corporation, Khoo Teck Puat Hospital, and\nSembcorp Marine.0M4M\n2M6M8M10M12M\nFY18Amount (S$)12.4 M\n1.7 M3.4 M\n0.9 M10.1 M\n0.7 M2.7 M\n0.3 M\nFY21 FY20 FY19\nCash Contribution In-kind Contribution\nFigure 1B. Industry Contributions to Applied Research Grants\nInternal Grant External Grant020\n1030405060\nFY18 FY21 FY20 FY1936\n304032\n16\n11\n19 2029\n112658\nFigure 1C. Number of Applied Research Projects\nMNC LLE SME Others020\n1030405070\n60\nFY18 FY21 FY20 FY1966\n23\n23\n6\n1451\n16\n18\n11\n636\n8\n16\n2\n1029\n5\n515\n4\nFigure 1D. Number and Profile of Industry Partnersrespective research governance committees led a discussion\non the impact of integrity and ethics  on SIT researchers’ work.\nThe Research Integrity Committee has also organised\na series of lunchtime talks on the responsible conduct of\nresearch. Given today’s pervasive use of technology such as\nAI and digitilisation tools, discussions centred around ethical\nconsiderations in using such technology. Other topics covered\ninclude responsible publication and research communication\nin open research.\nSingapore Institute of Technology\nAnnual Report 2022\n34 35Applied Research at SIT\nAPPLIED RESEARCH PROJECT HIGHLIGHTS\nNON-CHARGING HOUSING TO IMPROVE\nPOWDER PROCESSING\nIn powder processing, the static charge generated\nby contact electrification can cause undesirable\nconsequences. The electrostatic charge causes adhesion\nof particles, which is a common cause of fouling. In this\nproject, funded by A*STAR Advanced Manufacturing\nand Engineering Young Individual Research Grant (AME\nYIRG), A/Prof Wong Shin Yee developed a non-charging\nhousing that prevents the adhesion of powder onto\nthe probe. The implementation of the non-charging\nhousing enables the probe to perform continuous\nand accurate monitoring of the powder. The team is\nlooking at validating proof-of-concept achieved in an\ninnovation project.\nUPSCALING KALE WASTE\nKale has become popular as a superfood. Together\nwith Sustenir Agriculture, A/Prof Cheow Wean Sin,\nPrincipal Investigator, was able to optimise the use of\nall kale parts while preserving the nutrient content.\nImportant findings from this project include: (1) kale\nstalks are equally as nutritious as kale leaves, (2)\nkale powder remains nutritionally attractive, and (3)\ninnovative kale powder-based food products such as\npasta, cookies, and baby food are easily made.\nBESPOKE HIP PROTECTOR EXO+ FOR FALL-\nPRONE SENIORS IN REN CI HOSPITAL\nA/Prof Soh Chew Beng and G4 Pte Ltd devised EXO+,\nwhich is a hip protector that can reduce the impact force\nby up to 20% on the femur. It is made of a stretchable\nmaterial that can return to its original structure after the\nimpact is released. EXO+ is also easy to put on and more\nbreathable. Ren Ci Hospital will be deploying EXO+ at\nits nursing homes to an initial group of 100 residents\nwith fall-risk potential.HANDYREHABTM – WEARABLE\nREHABILITATION ROBOT\nA/Prof Wee Seng Kwee examined the feasibility and\nuser experience of a wearable rehabilitation robotic\ndevice known as HandyRehabTM for chronic stroke\npatients. They worked with clinical partners from Kwong\nWai Shiu Hospital, Ang Mo Kio-Thye Hua Kwan Hospital,\nand Fourier Intelligence to recruit 10 chronic stroke\npatients. Together they co-developed an inventory of\nhand activities that enables task-specific training with\nreal objects used in activities of daily living, for example,\ncups, cutlery, and utensils.SMART AI MONITORING SYSTEM\nAsst Prof Donny Soh and Hitachi Asia developed an\nintegrated solution comprising deep learning techniques\nin video analytics and 3D scans to detect crowds during\nthe COVID-19 pandemic. The system is also capable\nof detecting illicit actions such as indoor smoking. The\nsystem is currently deployed at SIT@NYP Building, and\nHitachi Asia is planning to incorporate the applied\nresearch work into their solutions.NEW PILING TECHNOLOGY FOR\nCONSTRUCTION PRODUCTIVITY\nIn Singapore, non-displacement piles are commonly\nused to comply with vibration and noise requirements.\nHowever, the construction process of these piles is\ntime-consuming and hence expensive. Asst Prof Ho\nJiahui collaborated with Zhao Yang Geotechnic (ZYG)\nto introduce drilled displacement steel pile (DDSP)\ntechnology through a research project funded by the\nSIT Ignition Grant.\nNew cost-saving piling technology.Smart AI indoor smoking detection.\nDonning the EXO+ hip protector has given Mr Mohamed\nHafidz bin Samat, 59, greater confidence to walk more and\nrely less on his wheelchair. (Photo courtesy of Ren Ci Hospital)Non-charging housing for reactor probe.\nTraining the weak upper limb to perform activities of daily living\nwith a wearable hand robot.\nIMPROVING THE ENERGY EFFICIENCY OF\nAIR-CONDITIONING\nA research team led by A/Prof Steve Kardinal Jusuf, Asst\nProf Aung Myat, Asst Prof An Hui, and A/Prof Victor\nWang evaluated the performance of the Dual Passive\nDisplacement Cooling (PDC) coil system through a\nresearch project funded by BCA Green Building Innovation\nCluster. The design parameters of PDC were analysed\nvia Computational Fluid Dynamics (CFD) simulation.\nThe experimental results showed that the Dual PDC\ncoil system has up to 40% latent load removal. Thermal\ncomfort survey results showed the cooling system to be\ngenerally comfortable, with acceptable air humidity and\nthermal sensations. Kale pasta from kale powder and juice.Optimised indoor air-conditioning system.\nBLOCKCHAIN IN THE LEGAL INDUSTRY\nAsst Prof Purnima Murali Mohan and her team\nsuccessfully implemented a proof-of-existence (PoE)\nblockchain framework system based on Ethereum\nsmart contracts at a prominent Singapore legal firm. The system ensures reliable evidence in courts of\nlaw regarding plagiarism cases, intellectual property\ndisputes, infringements of copyrights of artefacts, trade\nsecrets, etc.4.9% Kale Powder\nControl\n100% Kale JuiceDual Passive Displacement\nCooling (PDC) coil system\nClean\nprobe\nFouling (after\n1 batch)\nNon-charging\nhousingProbe with housing\n(3 batches)\nSingapore Institute of Technology\nAnnual Report 2022\n36 37Applied Research at SITApplied Research at SIT\nSP Group, a leading utilities group in the Asia Pacific, is building a Multi-Energy Microgrid (MEMG)\nto support SIT’s energy demands at its upcoming campus in Punggol. It will supply more than 2,000\nMWh of electricity annually from photovoltaic solar panels, equating to 4% of the total energy needs\nof the campus. The microgrid will be able to integrate electricity, thermal and renewable sources\nof energy into a unified smart energy network, to support applied learning and research, as well as\nexperimentation in a real-world environment.\n(From left) Professor Tseng King Jet, Director of Programmes, Engineering, SIT and Dr Michael Lim Tian, Head, Energy Services,\nSustainable Energy Solutions, SP Group at the building-level islanded microgrid at SIT@NYP Building.“At SP , we focus on low-carbon, smart\nenergy solutions. Our partnership with SIT\nwill provide a sandbox environment to test-\nbed Singapore’s future energy system while\nminimising risks of disruptions to operations.\nWe are excited at the prospects that this\ncollaboration will bring, especially in areas\nthat will help Singapore address its energy\nresilience and energy management issues.”“The faculty and staff at SIT have been\nworking tirelessly over the last few years on\nthe microgrid project. We are appreciative of\nthe strong support from SP Group and look\nforward to many more collaborations to build\na sustainable future in the energy landscape.”\nDR MICHAEL LIM TIAN\nHead, Energy Services, Sustainable Energy Solutions\nSP GroupPROFESSOR TSENG KING JET\nDirector of Programmes, Engineering\nSIT\nTOWARDS A ZERO\nEMISSIONS FUTURE\nSingapore Institute of Technology\nAnnual Report 2022\n38 39\nSIT is a university that lives and breathes industry. Placing individuals and industry at the heart of SIT, our\nfocus is on supporting industry’s growth and transformation through meaningful collaborations and a\npipeline of work-ready graduates. We also provide competency-based education to enhance the resilience\nof the workforce.\nThrough collaborations with small and medium-sized enterprises (SMEs), multinational companies, and government\nagencies, SIT plugs into a diverse ecosystem to ensure that its academic curriculum remains robust to meet the\nevolving needs of the industry. Companies have a ready partner in SIT to help transform processes, move up\nthe innovation value chain, and develop manpower capabilities.\nFRONTING WORKPLACE LEARNINGCOLLABORATION WITH SOCIAL SERVICE INSTITUTE\nNACE@SIT has collaborated with the Social Service\nInstitute (SSI), a Continuing Education and Training (CET)\nunit under the National Council of Social Service (NCSS),\nto build workplace learning capabilities of social service\nagencies (SSAs). This initiative, termed as the Enterprise\nTransformation Initiative on Workplace Learning, aims to improve employee productivity and performance, and\nenhance work processes for operational efficiency within\nthe SSAs. To date, six SSAs are on board this initiative,\nnamely PERTAPIS Education and Welfare Centre, Apex\nHarmony Lodge, CampusImpact, Silver Ribbon Singapore,\nLion Befrienders Service Association, and RSVP Singapore.\nAs Singapore’s University of Applied Learning, SIT strives\nto champion workplace learning as an integral component\nof the work-learn continuum. The National Centre of\nExcellence for Workplace Learning at SIT (NACE@SIT)\nis the first workplace learning centre in an autonomous\nuniversity. Supported by SkillsFuture Singapore (SSG),\nNACE@SIT aims to help organisations, especially SMEs,\nbuild workplace competencies through various workplace\nlearning initiatives and projects.A major initiative during FY2021 was the pioneering of\nthe Competency-Based Workplace Learning (CBWL)\npathway for adult learners in August 2021, which saw\nemployees from Ensign InfoSecurity, SBS Transit, and\nSMRT Corporation enrolling into two SIT undergraduate\ndegree programmes. The success of the pilot scheme will\nestablish a foundation and enable SIT to introduce this\npathway to workplace learners in more sectors, through\nclose collaborations with like-minded industry partners.\nAs part of the SIT-SMRT SkillsFuture Queen Bee\nInitiative, SIT has jointly developed and delivered several\nworkplace learning programmes with SMRT, namely the\n‘Corporate Coaching and Mentoring programme’ to\ntrain SMRT’s supervisors with coaching skills and ‘The\nKaizen Project’ to train SMRT’s value-chain partners. As\nof January 2022, 80 employees from 25 SMRT’s value-\nchain partners were trained. They included companies\nsuch as Aras Holdings, Stamford Tyres International Pte\nLtd, NSL Oilchem, and Peak Engineering Pte Ltd.To further entrench workplace learning, the Kaizen\nLearning Centres were launched in January 2022 in\ncollaboration with SMRT and SSG. The Centres will\nsupport the building of a strong skills ecosystem and\nworkplace learning culture to drive innovation and\nproductivity within the land transport industry. The\ncentres offer facilities to provide hands-on practice\nand training in Kaizen concepts and tools, not just for\nSMRT staff but also employees of partner companies\nin SMRT’s ecosystem.\nThe launch event of Kaizen Learning Centres was attended by Minister for Education Mr Chan Chun Sing and key senior management\nrepresentatives from SkillsFuture Singapore, SMRT Corporation Ltd, and SIT. (Photo courtesy of SMRT)Attending the Industry Mentorship Programme via Zoom.CORPORATE COACHING AND MENTORING\nNACE@SIT has partnered SIT’s Centre for Communication\nSkills (CCS) to develop and conduct a corporate coaching\nand mentoring programme, a key workplace learning\ninitiative targeted at companies to strengthen staff\ndevelopment. Company supervisors acquire mentoring and coaching skills that will improve their supervision and\nmentoring of co-workers and SIT students on Integrated\nWork Study Programme (IWSP). This leads to enhanced\nmotivation and performance among workers as well as\nfruitful learning experiences for SIT students.\nWORK-READY TALENT POOL\nTo develop career-ready and employable students,\nSIT’s Centre for Career Readiness (CCR) actively seeks\ncollaborations with industry partners to offer applied\nlearning opportunities for its students. These include the\nIWSP , career events, and mentorship programme.\nINDUSTRY MENTORSHIP PROGRAMME\nInto its fifth run, the Industry Mentorship Programme\n2022 saw participation from 106 mentees and 76 mentors\nfrom 17 engineering-related degree programmes.\nIn partnership with Young NTUC, the four-month\nprogramme pairs students with an industry mentor from\na relevant industry to enable students to gain industry-\nspecific career advice and guidance in developing their\ncareer path.EXPANDING IWSP OPPORTUNITIES WITH SMES\nThe IWSP is a trademark of an SIT education, which\nallows students to integrate theory and practice, and\ndevelop deep specialist skills in a real-world workplace\nsetting. Within the companies, students are assigned\nmeaningful projects, learn from experienced colleagues,\nand bring back learnings to the classroom.\nFY2021 saw SIT partnering with A*STAR and Enterprise\nSingapore (ESG) to engage SMEs to provide IWSP\nopportunities for its students.\nA notable initiative was the A*STAR-SIT Technology\nfor Enterprise Capability Upgrading (T-Up)/IWSP\ncollaboration, where Industry R&D IWSP opportunities\nwith SMEs were created for SIT students. This tripartite\npartnership enabled the SMEs to take up T-Up projects\nwith A*STAR, while researchers seconded from A*STAR\nto the SMEs will mentor and work with the IWSP\nstudents on the project. To date, a total of 8 T-Up/\nIWSP with SMEs have been successfully completed,\nwith more slated for completion in 2022.\nTogether with ESG, SIT also engaged progressive SMEs\nin the Advanced Manufacturing, Engineering Services,\nand Med-Tech sectors for IWSP . Through two jointly\norganised webinars and targeted engagements, 38\nIWSP positions from 12 companies were garnered.\nFORGING STRATEGIC COLLABORATIONS WITH INDUSTRY\nRobust engagement with industry through collaborative tie-ups is pivotal in paving the\nway for the exchange of knowledge and catalysing innovations. In AY2021, SIT forged\nseveral MOUs and partnerships with the industry in various areas.\nPDD CONNECTING SMARTNESS EVENT\nPunggol Digital District (PDD), the future home of SIT, is Singapore’s first smart business\ndistrict. SIT participated in JTC’s ‘PDD: Connecting Smartness’ event on 28 July 2021\nto showcase areas of collaboration with key PDD tenants in creating a living lab for\nnew concepts and solutions.\nPDDINDUSTRY\nQUEEN BEE PARTNERSHIP WITH SMRT CORPORATION LTD (SMRT)\nSingapore Institute of Technology\nAnnual Report 2022\n40 41Industry\nAn MOU was inked between SIT and Land Transport\nAuthority (LTA) on 20 December 2021 to establish the\nCentre for Infrastructure and Tunnel Engineering\n(CITE). The partnership seeks to strengthen Singapore’s\nFrom left: Er Chua Chong Kheng, Deputy Chief Executive, Infrastructure & Development, LTA; Mr Ng Lang, Chief Executive,\nLTA; Prof Chua Kee Chaing, SIT President; and Prof Tan Thiam Soon, Institute Professor, SIT. (Photo courtesy of LTA)\nstandards in the design, construction, operation and\nmaintenance of tunnels, as well as other civil engineering\ninfrastructure.Representatives from Dell Technologies and Institutes of Higher Learning signing the MOU (seated, from left): Prof Chua Kee Chaing,\nSIT President; Mr Ng Tian Beng, Senior Vice President & General Manager, Channel, Asia Pacific & Japan, Dell Technologies; and Prof\nTimothy Clark, Provost, Singapore Management University. The signing ceremony was witnessed by (standing, from left): Mr Tan Kiat\nHow, Senior Minister of State, Ministry of Communications & Information and Ministry of National Development; and Mr Amit Midha,\nPresident, Asia Pacific & Japan, and Global Digital Cities, Dell Technologies. (Photo courtesy of Dell Technologies)\ntunneling and underground infrastructure development\ncapabilities, and build a steady pool of tunnel engineers\nwith specialised domain knowledge in civil and\ngeotechnical engineering.\nCITE will develop and offer customised training courses\nto reskill and upskill local professionals. It will also\nconduct and facilitate applied research to augment safety KASPERSKY AND SIT RENEW PARTNERSHIP\nAn MOU signed with Kaspersky in December 2021\nsaw the global cybersecurity company partnering\nSIT in several areas to support Singapore’s proactive\ncybersecurity strategy. These include curriculum development, consultancy in the areas of digital forensics,\nmalware analysis, threat intelligence, threat hunting and\nincident response, as well as student and staff training\nopportunities along with student internship programmes.\nSIT students’ DIYAR goggles are showcased at the X-Lab,\nlocated in the Permanent Exhibits Gallery – Sandbox, where\nSDC collaborates with IHLs to co-create and showcase\ninnovative projects in immersive technologies.DRIVING IMMERSIVE TECHNOLOGIES FOR THE\nLOCAL LEARNING COMMUNITY\nSIT and the Singapore Discovery Centre (SDC) signed an\nMOU on 26 January 2022 to collaborate on advancing\ncapabilities in virtual reality, augmented reality, as well\nas interactive and digital media, with the aim to enhance\nthe educational and experiential learning of students.\nThis partnership also showcased the Do-it-Yourself\nAugmented Reality (DIYAR) goggles, a creation of SIT\nfaculty and students, at SDC’s X-Lab. The X-Lab is a\nplatform to highlight the parties’ joint applied research\nprojects, profile the research outcomes to a wider\ncommunity, and to enthuse the younger generation on\nscience and technology.\nProf Chua Kee Chaing, SIT President (left), and Prof Chan Eng\nSoon, CEO of TCOMS, at the MOU signing.\nSTRENGTHENING R&D EFFORTS IN SUSTAINABLE\nMARITIME ENGINEERING\nSIT and the Technology Centre for Offshore and Marine,\nSingapore (TCOMS) signed an MOU on 24 March 2022\nto strengthen R&D collaboration and grow the talent\npool for Singapore’s maritime, marine and offshore\nengineering, and other ocean sectors. This partnership\nwill involve staff exchanges between the two partners to\nleverage the talent and expertise in both organisations,\nin areas such as naval architecture, fluid-structure\ninteraction, as well as maritime autonomy and control.\nTCOMS will host SIT students on their internships. SIT\nwill also be able to access TCOMS’ R&D facilities, such\nas its ocean basin facility, for applied research and\neducational purposes.\nSIT and the ISACA Singapore Chapter signed an\nagreement on 28 March 2022 to collaborate on\nactivities spanning areas such as academic awards,\nstudent development, as well as talks and workshops.\nThis paves the way for SIT students to expand their\nopportunities for real-world experience, whether\nthrough ideas for capstone collaborations or assisting in seminars and conferences organised by ISACA. As\na professional association focused on IT governance,\nrisk, audit, and cybersecurity, ISACA’s network of\nprofessionals can share their knowledge and insights on\ninformation technology, cybersecurity, and innovation,\nto support SIT’s efforts in preparing graduates for an\nincreasingly digital world.ADVANCING STUDENT DEVELOPMENT IN TECHNOLOGYAn MOU to enhance the pre-employment training\ncurriculum was signed between Dell Technologies,\nSIT, Singapore Management University, Ngee Ann\nPolytechnic, and Singapore Polytechnic on 3 December\n2021. Under the partnership, new content will be co-\ndeveloped to equip students from the four institutes of higher learning with critical core skills in new and\nemerging technologies such as cloud computing, data\nanalytics, the Internet of Things (IoT), and digital cities\nmanagement. Students will also have access to a suite\nof self-guided e-learning courses via Dell Technologies’\ndigital learning platform.SHAPING THE NEXT GENERATION OF TECH TALENT WITH DELL TECHNOLOGIES\nESTABLISHING THE CENTRE FOR INFRASTRUCTURE AND TUNNEL ENGINEERING (CITE)\nSingapore Institute of Technology\nAnnual Report 2022\n42 43Industry\nMs Jana Chan graduated from SIT with a degree in Occupational Therapy in 2021 and completed\nher Integrated Work Study Programme (IWSP) with MOH Holdings. Her mentor, Ms Evelyn Kong has\nguided her since she joined Tan Tock Seng Hospital (TTSH).\nAs a teaching hospital, TTSH provides students with first-hand experience in the patient’s care team,\nallowing them to work closely within the healthcare team for improved patient outcomes. This\ncollaborative effort prepares students for multi-disciplinary healthcare work environments.\nSIT’s specialised degree programmes are built on such industry collaborations. The University’s applied\nlearning and research approach aims to maximise the potential of students and help them navigate\nan ever-changing work environment.\n(From left) Ms Jana Chan, Occupational Therapist and SIT graduate with mentor, Ms Evelyn Kong, Senior Occupational Therapist at\nTan Tock Seng Hospital.“It was a pleasure to mentor Jana when\nshe joined us as an Occupational Therapist.\nHer strong foundation in clinical concepts\ncoupled with the ample hands-on experience\nshe gained from the practical lab sessions\nand clinical practice at SIT allowed her to\nassume her work responsibilities easily.”\nMS EVELYN KONG\nSenior Occupational Therapist\nTan Tock Seng HospitalFROM WORK-\nREADY STUDENT\nTO HEALTHCARE\nPROFESSIONAL\nSingapore Institute of Technology\nAnnual Report 2022\n44 45\nPursuing a degree is just one aspect of every SITizen’s journey at SIT. Another part of the University’s mission\nis also to equip our students with the right knowledge, skills, and ethos to serve the community around them.\nThroughout the year, students, faculty, and staff at SIT were actively involved in meaningful collaborations\nto benefit the social, economic, or environmental aspects of the community.\nSIT COMMUNITY CHALLENGE 2021\nThe annual SIT Community Challenge ‘A Graceful\nAgeing Community for the Elderly’ was organised\nby SIT together with James Dyson Foundation (JDF)\nand Greendale Secondary School. The Challenge\ninvolved five faculty members and seven student\nmentors who used their design thinking skills to\nTeam SIT UP’s Independence Empowerment project booth on Gather.Town.TECH FOR GOOD 2021\nSIT partnered Engineering Good to co-produce Tech\nfor Good 2021, an innovation challenge where youths\nproduced technical or digital solutions that can create a\npositive social impact on persons with disabilities. Three\nteams – SIT UP , CAAN, and AHMLX – made up of 14 students from the SIT ICT (Software Engineering) and\nComputer Engineering programmes were among the 40\nfinalists. SITizen Ambassadors and faculty also participated\nin the event as team mentors, workshop speakers, emcees,\nand judges.\nThe Centre for Communication Skills at SIT is leading\na collaboration with faculty from the Infocomm\nTechnlogy and Health and Social Sciences clusters\nto develop an intelligent reading app. The app is\nspecially designed for children with special needs\nwho are under the care of the Asian Women’s Welfare\nAssociation (AWWA). The personalised learning app\noffers children’s stories pegged at three ability levels\nand contextualised in familiar local settings such as SIT faculty and student mentors guiding Greendale Secondary School students to come up with creative solutions.\n(Photo courtesy of Dyson Foundation)\nHDB void decks and hawker centres, so children can\neasily relate to them.\nThe app provides individualised diagnostic assessments of\nchildren’s receptive vocabulary development and reading\ncomprehension. It can also record children’s dictations\nof the stories, allowing speech therapists to monitor\nthe development of the children’s grasp of articulatory\nphonetics. At present, the project team is developing a\nproof-of-concept for a major research grant application.INTELLIGENT READING APP FOR AWWA CHILDREN WITH SPECIAL NEEDSguide 320 Greendale Secondary 2 students to ideate\nand propose creative solutions. JDF also conducted an\nexclusive prototyping workshop for SIT student mentors,\nwho were able to apply design thinking and prototyping\nskills to help Greendale students refine their ideas\nand prototypes.Announced in March 2021 at the Ministry of Health (MOH)\nCommittee of Supply Debate, the One-Rehab Framework\naims to ensure patients have timely access to the right\nlevel of rehabilitation care in the community. Led by\nSIT’s Health and Social Sciences faculty, A/Prof Kwah Li\nKhim, A/Prof Ong Peck Hoon, and A/Prof Valerie Lim, the\nOne-Rehab Framework workshops were administered by SITLEARN Professional Development. In FY2021, more\nthan 1,200 healthcare professionals were trained. This\ncollaboration puts SIT at the forefront of addressing the\nnation’s needs. It ensures that healthcare professionals\nhave a common avenue for collaboration to learn best\npractices to provide improved rehabilitation treatments\nfor patients.LAUNCH OF ONE-REHAB FRAMEWORK WORKSHOPSCOMMUNITY\nTeam CAAN’s presentation of their walking aid project.\nSingapore Institute of Technology\nAnnual Report 2022\n46 47Community\nNEA representatives joined CLASIC and the project team to\ncheck out the receptacle designs.\nBUILDING EMPLOYEE ENGAGEMENT AND\nADVOCATING WELLNESS\nOur staff and faculty form the bedrock of the university. Providing avenues for our staff to renew their links\nto industry and keep their pulse on the latest trends is important to SIT as a university of applied learning.DESIGN OF NEA RECYCLING RECEPTACLE\nHouseholds in Singapore may soon have a recycling\nreceptacle designed by SIT students. In 2021, the\nNational Environment Agency (NEA) approached\nthe Community Leadership and Social Innovation\nCentre (CLASIC) at SIT, inviting students to propose\ndesigns for a low cost, foldable, expandable, sturdy,\nand waterproof recycling receptacle that can hold\nNEA, CLASIC, and project team representatives at the CLASIC Project Sharing Seminar held on 25 November 2021 at SIT@Dover.common recyclable items. CLASIC subsequently\nformed a project team and awarded a grant to a\nSenior Professional Officer who mentored SIT students\nto develop six designs in accordance with NEA’s\nspecifications. The team presented their prototypes\nto NEA in September 2021 and NEA decided to adopt\none of the designs.\nProject team members worked on the prototypes in RaPID\nlaboratory at SIT@Dover.\nSTUDENT RELIEF FUND@SIT (COVID-19)\nSIT strives to provide opportunities for all its students.\nTo support SIT undergraduates who faced financial\nhardships during the COVID-19 pandemic, the Student\nRelief Fund@SIT (COVID-19) was established with the\nhelp of generous contributions from the University’s\nphilanthropic partners. The Fund was made available\nthroughout the year to provide financial support to\ncurrent and graduating students. As at 31 March, 1,354\ngrants of up to $2,000 were awarded to eligible SITizens\nsince the Fund was established.The External Work Engagement System was improved,\nso that faculty and staff could spend less time on\nadministrative matters and devote more time to value-\nadding and co-creating innovative projects. The system\nwas developed to encourage faculty to participate in\nexternal engagements with industry and stay abreast of\nthe latest developments in their professional fields.Enhances the\norganisation’s\nlinkages with\nindustrySupport staff’s\nunique expertise\nand standing as\nindustry experts\nThe Ask HR! Helpdesk was launched to provide SIT\nstaff with a centralised channel for all HR queries and\nrequests. Since its launch in October 2021, more than\n2,000 requests have been received and more than\n80% of them were resolved within the targeted three\nworking days.Quick\nresolution of\nqueries while\nensuring good\ndata governance\nand complianceMore than\n2,000 requests\nreceived since\nOct 2021 launch\nOn the staff wellness front, the Employee Wellness\nCommittee (EWC) organised a series of activities to keep\nour staff’s mental and physical states in optimal condition.\nThe Health Promotion Board’s National Steps Challenge\nand Yellow Ribbon Virtual Run were two initiatives to\npromote physical activity and bonding amidst the remote working arrangements. SIT staff came together as ONE\nSIT during the Virtual Staff Party 2021 and had a fun\ntime as bounty hunters. A highlight of the staff party was\na special video montage put together by the organising\ncommittee that took Prof Tan Thiam Soon, Institute\nProfessor, on a pleasant trip down memory lane.\nSingapore Institute of Technology\nAnnual Report 2022\n48 49Community\nA DIGITALLY TRANSFORMED\nUNIVERSITY\nThe University periodically invests in new and emerging technologies to enhance its digitalisation efforts. The\npast two years have seen an accelerated adoption of digital trends as we adjusted to new modes of work\nand safe management measures.\nEXPANDING FACIAL RECOGNITION CAPABILITIES\nFollowing the successful implementation of Facial\nRecognition (FR) Technologies for the authenticated\nlibrary loan service, SIT expanded FR capabilities to\novercome COVID-19 safeguards. FR was trialled for use in attendance-taking during examinations (physical and\nvirtual) as well as in support of contact tracing. The FR\ntechnologies proved to be an overwhelming success with\nan accuracy of 80% under mask-on conditions.\nSIT DATA CLASSIFICATION AND PROTECTION\nAs part of our data governance safeguards, SIT\nlaunched the Microsoft Azure Information protection\n(AIP) software tool with the Microsoft Azure Information\nProtection (AIP) software tool, alongside the revised\nData Classification Policy, to automate the tasks of data labelling, classification, and protection of SIT\nemails and documents. This reduces the organisation’s\nrisk of accidental disclosure of sensitive data, thereby\nincreasing the level of security and protection of SIT\nemails and documents.E-SYSTEMS FOR FINANCE MATTERS\nSIT launched the Finance e-Invoicing System and e-Goods\nReceipt (eGR) System. This system leverages the latest\nOptical Character Recognition (OCR) and machine learning\ntechnologies to improve efficiency and accuracy in processing\nthe voluminous invoices at SIT. It also supports the nationwide\ne-Invoicing initiative ‘Invoice Now’ spearheaded by IMDA,\nusing the PEPPOL (Pan European Public Procurement Online)\nelectronic data interchange standards. The eGR System\nhelps to digitise, streamline, and improve the GR submission\nprocess and users’ experience. Overall, these have enhanced\nthe efficiency of the procure-to-pay process in SIT.\nDIGITAL VIDEOCONFERENCING SOLUTIONS FOR\nHYBRID MEETINGS\nSIT’s Communications and Information Technology (CIT)\nteam has implemented digital videoconferencing solutions\nto 20 meeting rooms in SIT campuses in 2021 to enable\nhybrid meetings, where participants may choose to attend\nthe meeting in person or remotely. The solution is effective\nand easy to use due to smart features such as a camera that is\nable to track the speaker while capturing his/her voice clearly.\nDIGITAL INITIATIVE AWARD\nOur staff and students have been quick to embrace digital\nadoption. This is evident in the increased number of entries\nfor the Digital Initiative Award (DIA) 2022. Established in\nFY2019, the DIA showcases digital innovations by staff that\nwill benefit the university and kickstart positive process changes. A total of 23 submissions were received this\nyear in both team and individual categories. Teams that\ndemonstrated effective cost savings in overall operational\nexpenditures through their projects were lauded under the\nEconomy Drive Award. UNMANNED CONVENIENCE STORE\nTo enhance campus services to staff and students,\nconvenience store operator, Cheers, set up an unmanned\nconvenience store employing Artificial Intelligence (AI)\ntechnology. The store, located in SIT@Dover, commenced\noperations in March 2022. With this technology, customers\nnow enjoy the convenience of not having to  queue\nand  pay at the counter for their purchases. Upon\ninstalling the Cheers application on their mobile devices\nwith a registered credit or debit card, customers can just\npick up what they want and walk out of the store.\nHigh\ncompletion rate\nof almost 100%\nby applicantsTime savings\nas compared to\ndoing in-person\ninterviewsNovel and\npositive experience\nfor prospective\nstudentsAI CHATBOT FOR ADMISSIONS INTERVIEWS\nSIT piloted an Artificial Intelligence (AI) chatbot during\nthe AY2021 Admissions Exercise for two Infocomm\nTechnology programmes. The AI chatbot supported\nchat-based interviews that can be customised to different\nneeds and provided a structured assessment for the\napplicants. More than 600 applicants undertook the\nnew chatbot assessment in parallel with an online video\nassessment for the Software Engineering and Information Security degree programmes. To authenticate the\nidentity of the applicant taking the assessment, the\ncross-divisional team (comprising ICT faculty, staff\nfrom Admissions and CoDE divisions) incorporated a\nproctoring tool for authentication, as well as weaved in\na video component for a comprehensive and seamless\nassessment approach in the Admissions Exercise in\nAY2022.SECURITY ROBOT PATROL WITHIN THE CAMPUS\nThe SIT Estates team explored the possibility of using\ntechnology to support security operations within the\ncampus. This would not only reduce the demand for tight\nsecurity personnel resources in industry but also reduce\nthe need for security officers to carry out routine tasks.\nInstead, they would be allowed to focus on duties that\nrequire a higher level of attention, such as monitoring\nthe surveillance and alarm systems, as well as responding\nto emergencies.\nA proof-of-concept (POC) study was conducted on the\nuse of robots to carry out autonomous security patrol\nduties within the campus. The surveillance camera\nsystem installed in the robot transmitted images of\nits surroundings back to the control room, where they\nwere monitored by the security supervisor. The POC\nenabled the team to assess how technology could be\nCruzr MPE Oscar Xavierbetter integrated into its security operations for future\ndeployment at the upcoming Punggol Campus.\nSecurity robots on patrol on campus.\nDIGITAL BUILDING TWIN\nImagine being able to create digital twins of entire buildings\nat the click of a button. The d.ASH Autonomous Robot Digital\nScanning solution makes this possible, opening doors to\nleverage the SIT campus as a living lab for applied research,\ninnovation, and more. This is part of an ongoing applied research\ncollaboration between SIT and local start-up dConstruct\nTechnologies. The outcome is a coloured 3D point cloud that\nhas been scanned, stitched, merged, and aligned automatically,\nready to use in any construction or digital twin application.\nPhoto courtesy of dConstruct Technologies\nSingapore Institute of Technology\nAnnual Report 2022\n50 51A Digitally Transformed University\nSIT’S SUSTAINABILITY STRATEGYSUSTAINABILITY EFFORTS IN FY2021\nWORKSHOP ON GROWING YOUR OWN FOOD\nDuring this workshop led by SIT’s sustainability-related\nstudent club, Action for Environment Conservation (AEC),\n81 students and staff learnt how to build a self-watering\nplanter with household materials and seeds.\nR.I.S.E. TO THE CHALLENGE\nTo kickstart the new year, the Sustainability Workgroup co-\norganised ‘R.I.S.E. to the Challenge’ from 10 to 18 January\n2022 in collaboration with Terra SG and ALBA. The series WORLD ENVIRONMENT DAY\nSIT organised a set of activities to mark World Environment\nDay, which aimed to raise awareness among its staff and\nstudents on the importance of environmental sustainability.\nThemed ‘Sustainability Starts With You’, staff and\nstudents attended virtual talks and upcycling workshops\nto learn actions and habits they could adopt to be more\nenvironmentally-friendly.APR 2021\nJAN 2022JUN 2021\nTalk: How to be a Conscious Consumer, where\nJo Tang, Founder of The Sustainability Project,\nexplained the 5Rs under the zero waste hierarchy.\nWorkshops: Upcycled Beverage Carton Mask Holder, Upcycled Fabric Yarn\nCoaster Mat, Upcycled T-shirt Tote Bag.Keesha Tan, a representative of SIT’s AEC student club, briefed on\nthe materials required to build a self-watering planter.\nAttendees at the ALBA E-Waste Talk at SIT@Dover.SIT aims to develop sustainability talent, ensure a sustainable future for SIT, and contribute to Singapore’s\nsustainability goals.\n3 SUSTAINABILITY THRUSTS\nOur sustainability efforts are driven through\n3 Sustainability Thrusts: Sustainable Campus,\nSustainability Research & Innovation, and Development\nof Sustainability Talent.\nEach thrust is under the purview of workgroups\neach chaired by Senior Management members to\ndrive SIT’s Sustainability Strategy.Sustainability WorkgroupsSUSTAINABLE CAMPUS\nDeputy President (Administration) &\nChief Financial Officer and Vice President\n(Planning)\n• Ensuring sustainability in SIT’s\npolicies, practices and operations\n• Inculcating strong sustainability\nvalues and practices among our\nstaff and students\nSUSTAINABLE RESEARCH &\nINNOVATION\nVice President (Industry & Community)\n• Developing innovative capabilities\nand solutions for industry and\ncommunity that support Singapore’s\nsustainability goalsDEVELOPMENT OF\nSUSTAINABILITY TALENT\nDeputy President (Academic) & Provost\n• Producing graduates who can\nsecure new jobs in sustainability as\nwell as contribute to strengthening\nsustainability in industry sectorsSUSTAINABILITY EFFORTS\nof events culminated in the ALBA E-Waste talk as well as\nthe ‘R.I.S.E. to the Challenge’ exhibition, which made its\nrounds at all SIT campuses.\nSingapore Institute of Technology\nAnnual Report 2022\n52 53Sustainability Efforts\n• Rooftop solar\nphotovoltaic system\n• DC grid with energy\nstorage systemPhotovoltaic thermal system\nBuilding-integrated\nphotovoltaicsPico grid including energy\nstorage system\nElectric vehicle\ncharging station\nBUILDING A SUSTAINABLE CAMPUS\nThe SIT campus in Punggol is currently undergoing\nconstruction. However, the groundwork for sustainability\nis already being laid.AWARDS FOR DEVELOPMENT\nSIT received the highest accolade – ABC Waters\nCertified (Gold) Award – at the Active Beautiful Clean\n(ABC) Waters Seminar 2022 for its planned design\nfeatures in its upcoming Punggol Campus East and West\nZones. These features, including detention eco-ponds,\nrain gardens, and cleansing biotopes, are part of the\nUniversity’s rain harvesting and sustainable stormwater\nmanagement efforts, and will be seamlessly integrated\ninto the campus to provide a scenic backdrop for the\nSIT community.\nIn addition, SIT also attained the BCA Universal Design\n(UD) Mark GoldPLUS (Design) Award in recognition of\nits adoption of a user-centric philosophy in its design,\noperations, and maintenance.\nMr Chan Wing Leong (8th from left), Deputy President (Campus\nDevelopment) and Chief Investment Officer and Mr Gerry Wee\n(9th from left), Director, Estates, at the ABC Waters award\nceremony with Dr Amy Khor (7th from left), Senior Minister of\nState for Sustainability and the Environment and other awards\nrecipients. (Photo courtesy of Public Utilities Board)A feature pond with lush landscaping greets visitors at the main entrance to SIT\nPunggol Campus (East Zone).All SIT buildings in our Punggol Campus will meet BCA\nGreen Mark Platinum standards, with two in particular\nslated to achieve Super Low Energy status. One prominent\ngreen feature of the campus will be the Multi-Energy\nMicrogrid (MEMG). The MEMG will be equipped with\nlow carbon technology of various photovoltaics (PV)\nsystems such as Roof-top PV, Building-Integrated PV and PV Thermal, which can convert sunlight to electricity.\nThe MEMG design also allows for different building\nmanagement systems to be tested and deployed for\nislanding of buildings (nanogrid) and certain floors\n(picogrid) from the national grid, as well as a hybrid\nalternating current/direct current (AC/DC) grid at the ICT\nPrimary and Secondary Server Rooms within the building.REDUCING CARBON FOOTPRINT WITH RENEWABLE ENERGYFEB 2022\nMAR 2022NEA’S ‘READY, SET, RECYCLE!’ COMPETITION\nFrom 18 February to 11 March 2022, SIT participated in\na competition for institutes of higher learning as part of\nthe National Environment Agency (NEA)’s ‘Recycle Right’\ncampaign, encouraging students to compete in online\nactivities and learn to recycle right.\nSINGAPORE WORLD WATER DAY\nSIT joined in #GoBlue4SG2022  by lighting up its\nfaçade in blue and promoting water conservation\nthrough emails and digital displays. In addition, to\nraise awareness among our students and colleagues of\nthe importance of water conservation, the Sustainability\nWorkgroup organised a visit to NEWater Visitor\nCentre, where participants learnt more about the\nwater recycling and treatment cycle in Singapore and\nthe impact of water sustainability in Singapore due to\nclimate change.\nSIT@Dover was lit up in blue on 22 March. SIT students and staff visited the Deep Tunnel Sewerage System\n(DTSS) at NEWater Visitor Centre.\nAIR-PURIFICATION SYSTEM\nThe health of our students, staff, and visitors is important\nto SIT. Our Punggol Campus will be equipped with an\nair-purification system (APS) to provide clean indoor\nair campus-wide in the event of haze and pandemic outbreaks. The APS can effectively screen out viruses\nand bacteria in the air to significantly reduce the risk\nof disease transmission, as well as improve indoor\nair quality.\nIn facilities management operations, the Estates team\nis building an Integrated Building Management System\n(IBMS) and Integrated Security Management System\n(ISMS) to manage operations in the future 9-ha Punggol\nCampus. The IBMS allows all building systems to be connected seamlessly through the Internet of Things\n(IoT) technology to optimise the physical environment,\nenhance campus experience, and workspace efficiency.\nThe ISMS centralises security operations and aims to\noptimise manpower resources on-site.INTEGRATED BUILDING AND SECURITY MANAGEMENT SYSTEMS\nSingapore Institute of Technology\nAnnual Report 2022\n54 55Sustainability Efforts\nHome-grown company Metro Farm Pte Ltd specialises in aquaponics IOT farming systems and aims to\nincrease domestic food production to enhance Singapore’s food security. It provides a wide range of\naquaponics solutions for satellite commercial farming systems that can be deployed in any size and location.\n(From left) A/Prof Andrew Ng and Mr Chris Toh, Co-founder and Director of Metro Farm Pte Ltd at one of Metro Farm’s satellite\ncommercial aquaponics rooftop IOT farms in Bendemeer.“We’re excited to partner SIT to contribute\ntowards one of the key targets of the\nSingapore 2030 Green Plan, which is to meet\n30% of Singapore’s nutritional needs through\nlocally-produced food. The collaboration has\nbeen fruitful and we have benefitted from\nthe expertise of SIT’s faculty.”“Our team worked with Metro Farm Pte Ltd\non an intelligent and sustainable aquaponics\nfarming system that leverages emerging\ntechnologies. The high-tech and high-yield\naquaponics is located at NTUC Downtown\nEast, Singapore. Through this collaboration,\nwe can contribute to Singapore’s food\nsecurity and sustainability.”\nMR CHRIS TOH\nCo-founder and Director\nMetro Farm Pte LtdASSOCIATE PROFESSOR ANDREW NG\nProgramme Leader, Master of Engineering Technology\nin Sustainable Infrastructure Engineering (Land),\nSIT\nGROWING BEYOND\nTHE LAB TO THE\nMARKETPLACE\nSingapore Institute of Technology\nAnnual Report 2022\n56 57\nSIT strives to ensure that deserving students will never be deprived of a quality education because of\nfinancial difficulties. We offer an extensive range of financial assistance to help students with their\ntuition fees and expenses.\nThanks to the generous contributions of industry partners, government agencies, and organisations, our students\ncan benefit from various forms of sponsorships and bonded scholarships.\nACKNOWLEDGEMENTS\nAlexandra Health\nAng Mo Kio Thye Hua Kwan Hospital\nAssociation of Singapore Marine Industries\nAWWA Ltd\nChangi General Hospital\nCentre for Strategic Infocomm Technologies\nEnsign Infosecurity\nInfocomm Media Development Authority\nJUMBO Group\nKwong Wai Shiu Hospital\nLand Transport AuthoritySUPPORT FOR STUDENTS\nMinistry of Defence\nMinistry of Education\nMinistry of Home Affairs\nNational Kidney Foundation\nNTUC Health\nOCBC Bank\nOverseas Union Enterprise\nParkway Pantai\nPublic Utilities Board\nRainbow Centre\nRen Ci HospitalSATS Ltd\nSBS Transit\nSengkang General Hospital\nSingapore General Hospital\nSMRT Corporation Ltd\nSociety for the Physically Disabled\nSt Andrew’s Community Hospital\nST EngineeringSt Luke’s Eldercare\nSt Luke’s Hospital\nSystemEngineer360 Pte Ltd\nTan Tock Seng Hospital\nThe Salvation Army\nThye Hua Kwan Moral Charities Limited\nWoodlands Health CampusSPONSORSHIPS AND BONDED SCHOLARSHIPS\nSingapore Institute of Technology\nAnnual Report 2022\n58 59Support for Students\nTheir impactful giving nurtures our students through non-bonded bursaries, grants, scholarships and\nexcellence awards, while enabling us to strengthen applied learning and drive industry innovation and\ntransformation through applied research.\nAbbVie Operations Singapore\nPte Ltd\nMr John Abraham\nAbwin Pte Ltd\nAegis Building & Engineering\nPte Ltd\nAeris Dynamics Pte Ltd\nAero Inspection Asia Pte Ltd\nAerospace Consultancy Pte Ltd\nAlfa Tech Vestasia Pte Ltd\nAllgrace Investment\nManagement Pte Ltd\nAmazon Automation Pte Ltd\nAmazon Web Services\nSingapore Private Limited\nDr Ang Poon Liat\nApplied Materials South East\nAsia Pte Ltd\nARIS Integrated Medical Pte Ltd\nAscendas Funds Management\n(S) Limited\nAshland Singapore Pte Ltd\nAsiaCloud Solutions Pte Ltd\nAssociation of Consulting\nEngineers Singapore\nAthena Dynamics Pte Ltd\nAzalea Investment\nManagement Pte. Ltd.\nBaker Tilly\nBlu5 Group\nMr Boey Jun Hoe, Martin\n(Mei Junhao)\nBR Metals Pte Ltd\nBushiroad International Pte Ltd\nBusiness Engineers Asia Pte Ltd\nCanary Intelligence Pte Ltd\nCanon Medical Systems Asia\nPte. Ltd.\nCASY Engineering\nConsultancy Pte Ltd\nCBJ Foundation through\nThe Community Foundation\nof Singapore\nCEI Limited\nCentre for Strategic Infocomm\nTechnologies (CSIT)Changi Airport Group\nMr Chau Shing Chi\nMs Chen Teck Shing\nChop Wah On\nMr Choo Chiau Beng\nMr Choo Chong Ngen\nChua Foundation\nConrac Asia Display Products\nPte Ltd\nContinental Automotive\nSingapore Pte Ltd\nCore Concepts Pte Ltd\nCPA Australia Ltd\nCybersprout Pte Ltd\nCyclect Electrical Engineering\nPte Ltd\nMr Vaibhavkumar\nSudhir Dabhade\nDBS Bank Ltd\nDecision Science Agency Pte Ltd\nDell Global B.V. Singapore Branch\nDeloitte & Touche LLP\nDiana Koh Foundation through\nThe Community Foundation of\nSingapore\nDou Yee Enterprises (S) Pte Ltd\nENGIE Services\nSingapore Pte Ltd\nEnGro Corporation Limited\nEPS Computer Systems Pte Ltd\nEstate of Irene Tan Liang Kheng\nEY\nFamily of Loo Shaw Chang\n& Tan Hooi Hong\nFamily of Mr Ng Sheng Poh\nand Mdm Quek Siew Keow\nFar East Organization\nfinexis advisory Pte Ltd\nMs Rosalind Fok\nFoo Kon Tan LLP\nFurama Pte Ltd\nGarena Online Private Limited\nGeneral Filter Pte Ltd\nGeo Energy GroupGIC Private Limited\nGlaxoSmithKline –\nEDB HRD Fund\nMr Jeff Goh\nGoh Bee Gah Foundation\nthrough SymAsia Foundation\nLimited\nGoh Foundation Limited\nGoldbell Financial Services\nPte Ltd\nGrow-Tech Properties Pte Ltd\nHarrier Technology Pte Ltd\nHiap Chuan Hardware (Pte) Ltd\nHo Bee Land\nMr Ho Yee Yang Edmond\nHock Seng Hoe Metal Co.\nPte Ltd\nHummingbird Health Pte Ltd\nIES-IStructE Joint Committee,\nThe Institution of Engineers,\nSingapore\nIGG Singapore Pte Ltd\nInfo-Communications Media\nDevelopment Authority of\nSingapore (IMDA)\nIngredion Singapore Pte Ltd\nInstitute of Chemical and\nEngineering Sciences (ICES)\nInstitute of Materials (East Asia)\nInstitute of Singapore\nChartered Accountants (ISCA)\nInterlocal Exim Pte Ltd\nITSEC Services Asia Pte Ltd\nJCS-Echigo Pte Ltd\nMr Surya Jhunjhnuwala and\nMr Gaurang Jhunjhnuwala\nJM Vistec System Pte Ltd\nKaspersky Lab\nSingapore Pte Ltd\nKat Cat Pte Ltd\nKCTex International Ltd\nMr Kee Sek Huat\nKeppel Care Foundation\nLimited\nKeppel Corporation Limited\nKhoo Chwee Neo\nFoundation LtdMr Lim Sze Wee\nLions Community Service\nFoundation (Singapore)\nLo Hock Ling & Co\nMs Loh Lin\nMr Loo Tze Kian\nMs Low Geok Cheng\nMr Low Ming Wah\nLoyang Tua Pek Kong\nMr LU Kee Hong and Ms Chan\nHaw Ngee\nMr Lum Kok Keong Richard\nL-QuBE Pte Ltd\nLSK Engineering (S) Pte Ltd\nLTC (RET) Chan Chik Weng\nand Mdm Chong Chow Hah\nM.Tech Products Pte Ltd\nMr Malaichamy Mani\nMapletree Investments Pte Ltd\nMarina Bay Sands Pte Ltd\nMdm Julie Teo Lee Meng\nMdm Thng Poh Choo\nMHC Medical Network Pte Ltd\nMighty Jaxx International Pte Ltd\nMitsubishi Electric Asia Pte Ltd\nMount Alvernia Hospital\nNaterra Resources\nInternational Pte Ltd\nNational Council of Social Service\nNational Healthcare Group\nPte Ltd\nNebulas Tree Pte Ltd\nNehemiah Foundation\nthrough SymAsia Foundation\nLimited\nNetLink Management Pte Ltd\n(as trustee of NetLink Trust)\nNet-Source Group Pte Ltd\nNexia TS Pte Ltd\nNING Research Pte Ltd\nNippon Express (Singapore)\nPte Ltd\nOcean Tankers Pte Ltd\nOctava Foundation Limited\nOhm Energy Pte Ltd\nMs Sabrina Ong Geok Khim\nDr Ong Kiem Kiok\nOUE Limited\nPan Pacific Hotels and\nResorts Pte Ltd\nPan Pacific Hotels Group Ltd\noperating as PARKROYAL on\nBeach RoadParkroyal Kitchener Hotel Pte Ltd\nParsing Pte Ltd\nPaul Wong AICM Pte Ltd\nPei Hwa Foundation Limited\nPetrochemical Corporation of\nSingapore (Private) Limited\nPKF-CAP LLP\nMr Ajit Aravind Prabhu\nPrima Limited\nPrudential Assurance\nCompany Singapore (Pte)\nLimited\nQ’son Kitchen Equipment Pte Ltd\nQuantum Inventions Pte Ltd\nDr Stanley Quek through The\nIreland Funds (Singapore)\nRacks Central Pte Ltd\nRaffles Hotel Singapore\nRohde & Schwarz Asia Pte Ltd\nRotary Club of Bugis Junction,\nSingapore\nRotary Club of Jurong Town,\nSingapore\nRotary Club of Tanglin,\nSingapore\nRSM Chio Lim LLP\nS M Jaleel Foundation\nS.S. Jhunjhnuwala Charity Fund\nSamwoh Corporation Pte Ltd\nSBF Foundation\nSBS Transit Ltd\nSCAL Resources Pte Ltd and\nmembers of The Singapore\nContractors Association Ltd\nSeagift Food Pte Ltd\nSelect Group Pte Ltd\nSheng Siong Group\nSiemens Pte Ltd\nSingapore Accountancy\nCommission\nSingapore Buddhist\nYouth Mission\nSingapore Chemical Industry\nCouncil Limited (SCIC)\nSingapore Chinese Chamber Of\nCommerce Foundation (SCCCF)\nSingapore Computer Society\nSingapore Concrete Institute\nSingapore Food Manufacturers’\nAssociation (SFMA)\nSingapore Green Building\nCouncil\nSingapore Heart Foundation\nSingapore Leong Khay\nHuay KuanSingapore Nurses Association\nSingapore Society of\nRadiographers\nSingapore Sports Council\nSingapore Teochew Foundation\nDr Siti Noorbaiyah\nBinti Abdul Malek\nSIT Health and Social Sciences\n(HSS) Cluster Faculty and\nDr Alex Wirianski\nSMRT Corporation Ltd\nMr Soon Sze Meng\nSP Group\nSprinkler Fire Systems Pte Ltd\nST Engineering IHQ Pte Ltd\nSt Luke’s ElderCare Ltd.\nSteelaris Pte Ltd\nStraits Bunkering Pte Ltd\nStraits Construction Singapore\nPte Ltd\nSuper Bean International Pte Ltd\nSYNthesize Pte Ltd\nSystemEngineer360 Pte Ltd\nT T J Design And Engineering\nPte Ltd\nT.E Engineering & Trading\nTai Tak Estates Sdn Bhd\nMr Ta Yoke Kat\nTAK Products & Services Pte Ltd\nTalentsis Pte Ltd\nTan and Neo Family\nMs Angela Tan Guat Hoon\nTan Si Rong\nMrs Yi-Lin Tan and Mr Foong\nSheng-Wei\nMr Gabriel Tan Yong Kai\nMr Tan Yong Hui James\nTaylor & Francis Asia Pacific\nTemasek Foundation\nTemasek Holdings Pte Ltd\nMr and Mrs Teo Hock Chuan\nTerra Systems Pte Ltd\nTES-AMM (Singapore) Pte Ltd\nTexas Instruments Singapore\n(Pte) Limited\nMs Tammie Tham\nThe Copyright Licensing and\nAdministration Society of\nSingapore Ltd\nMs Ti Sui Tsu Memorial Fund\nMr Edy Hardijana Tjugito\nThe Estate of Chong Yook YinKimly Construction Pte Ltd\nKitchen Haus Group Pte Ltd\nKleen-Pak Products Pte Ltd\nMr Ko Oen Tjiang\nMs Shirley Koh\nKoufu Group Limited\nKreston Ardent CAtrust PAC\nKRISfam Fund through The\nCommunity Foundation of\nSingapore\nKSF Beverage Holding\nFoundation through The\nCommunity Foundation\nof Singapore\nKuang Yong Auto\nMr Kuok Khoon Hong\nKwai Fong & Raymond Goh\nLand Transport Authority of\nSingapore (LTA)\nMr Lam Yi Young & Family\nMs Amanda Lau\nLearning Access Foundation\nLee Foundation\nMr Lee Kok Keong and\nMs Goh Ling Ling Serene\nMs Karen Lee Yun Fun\nMr Patrick Lee\nLeo Infocomm Pte Ltd\nEr. Leong Kwok Kee Stephen\nLew Foundation\nMr Eddie Li Hung\nMr Kevin Liang\nMr Lien Ber Luen\nLih Ming Construction Pte Ltd\nMr Peter Lim\nDr Lim Sok Mui\nMr Lim Daoyi, Moses and\nMrs Lee Wen Wen Sandra Jean\nMr Lim Joo Boon\nMr Lim Peng Hun and\nMs Vanisa Lee\nMr Lim Siah MongThe Estate of Eng Liat Kiang\n(Deceased)\nThe Estate of Lim Doa Hin\n(Deceased)\nThe Hokkien Foundation\nThe Ireland Funds (Singapore)\nThe Masonic Charitable Fund\nThe Mohan Family\nThe Ngee Ann Kongsi\nThe Polyolefin Company\n(Singapore) Pte Ltd\nThe Silent Foundation Ltd\nThe Tan Chin Tuan Foundation\nThomson Shin Min Foundation\nTiong Seng Contractors\n(Private) Ltd\nTL Whang Foundation Limited\nTME Systems Pte Ltd\nMr Toe Teow Heng\nDr Toh See Kiat\nMr Benjamin Toh Tsui Chuan\nMr Tong Kok Chiang and\nMdm Thng Poh Choo\nTong Seng Produce Pte Ltd\nTote Board\nTractors Singapore Limited\nDr Paul Tseng\nTseng Family Foundation\nthrough The Community\nFoundation of Singapore\nTunnelling and Underground\nConstruction Society\n(Singapore) (TUCSS)\nTyco Electronics Singapore\nPte Ltd\nUnited Overseas Bank Limited\nUtoc (Singapore) Pte Ltd\nMr Mohan K Vaswani\nMr Wee Siew Kim\nWilmar International Limited\nWoh Hup Pte Ltd\nMr Albert Wong\nMrs Wong Kwok Leong\nDr Steven Wong Kai Juan\nMs Wong Kai Yun\nMs Angela Wu Peihui\nX-Inc\nYangzheng Foundation\nDr Alvin Yeo\nYP Academy Pte Ltd\nMr Yusof Bin Amir Wahid\nZ L Construction Pte Ltd and\nMr Jake YeohIN APPRECIATION OF\nFOR THE FINANCIAL YEAR ENDED 31 MARCH 2022SIT’S DONORS\nSingapore Institute of Technology\nAnnual Report 2022\n60 61In Appreciation of our Donors\nSIT was incorporated in September 2009 as\na company limited by guarantee under the\nCompanies Act 1967. It is an Institution of Public\nCharacter (“IPC”) under the Charities Act 1994.INTRODUCTION\nSIT is governed by the Singapore Institute of Technology\nAct 2014. Its key constituent document is the\nMemorandum and Articles of Association which states\nthat the purpose of the University is to promote and\nundertake the advancement of education by providing\neducational facilities and courses of study in all fields\nof knowledge, promote and engage in research and\nscholarships and establish, operate, promote and\nmaintain the University as a going concern. SIT has\nthree subsidiaries – Verbosecurity Pte. Ltd. (Company\nRegistration No. 201902376G), which was incorporated\non 18 January 2019; SIT Microgrid Pte. Ltd. (Company\nRegistration No. 201926986H), which was incorporated\non 19 August 2019; and Foodplant Pte. Ltd. (Company\nRegistration No. 202007139N), which was incorporated\non 2 March 2020. The three subsidiaries were incorporated\nto support SIT’s strategic initiatives.\nGood corporate governance is the cornerstone of a\nwell-managed University which is, in turn, critical to SIT’s\nperformance and operations. The focus of its governance\nframework, on which the University’s vision, mission and\ncore values are formulated, promotes accountability and\ntransparency and is manifested in the composition of\nthe Board of Trustees (“Board”) and its Committees,\ndivision of powers and duties between the Board and\nManagement, adoption of checks and balances, and\nsound measures for internal and corporate controls.\nGOVERNANCE EVALUATION CHECKLIST\nThe University adheres to the Code of Governance for\nCharities and Institutions of Public Character (“Code”).\nThe University has complied in material aspects with the\nprinciples and guidelines set out in the Code. Where\nthere are departures from the Code, these are explained\nunder the relevant sections of the Governance Evaluation\nChecklist (“GEC”).\nAccording to disclosure requirements imposed by the\nCharity Council, Ministry of Culture, Community and Youth,\nall IPCs are required to publicly disclose their compliance\nwith the Code. The University’s GEC is made available on\nthe website of the Charity Portal at www.charities.gov.sg.\nBOARD OF TRUSTEES\nThe Board is the highest governing authority of the\nUniversity and comprises 20 Trustees, chaired by Mr Bill\nChang, Chief Executive Officer, Group Enterprise / Chief\nExecutive Officer, Regional Data Centre Business, Singapore\nTelecommunications Ltd. The Board oversees the business\nof the University, ensures that it acts in accordance with its\nobjects, that its funds and assets are properly accounted for\nand safeguarded and provides guidance and stewardship\nto Senior Management, conferring regularly with them. The Board is accountable to the Minister for Education,\nSingapore for its acts and decisions.\nThe Trustees are eminent persons of good repute and\nsound judgment who possess collective competencies in\nareas such as the public and private sectors, academia,\naccounting and finance, law, information technology,\nstrategic planning, engineering, defence, investment\nand asset management, healthcare, real estate, and\nsustainability. New Trustees will continue to be selected and\ninvited to serve on the Board on the basis of the diversity\nof their experience, skills, knowledge, abilities and insight\nfrom time to time to ensure constant refreshing of the\nBoard. The Trustees’ profiles appear on pages 10 and 11\nof the Annual Report.\nThere is an objective decision-making process, which\nallows each Trustee to exercise his or her own independent\njudgment. The University has established financial\nauthorisation and approval limits for operating and capital\nexpenditure, the procurement of goods and services, the\nacquisition and disposal of assets and making investments.\nThe Board approves the annual budget and annual audited\nfinancial statements of SIT, amongst other responsibilities.\nWith regard to the reserves policy, the use of the reserves is\nsubject to the approval of the Board. The Board is supported\nby seven Board Committees formed in accordance with\nArticle 53 of the Articles of Association (“AAs”), namely\nthe Audit, Campus Development, Finance, Industry and\nResearch, Investment, Remuneration and Nomination, and\nSustainability Committees. Each Board Committee has clear\nTerms of Reference setting out their role, authority, powers\nand matters requiring their approval. The list of Board\nCommittees is on pages 64 and 65 of the Annual Report.\nBriefly, the responsibilities of the Board Committees are\nas follows:\n(a) The Audit Committee oversees and reviews the\nUniversity’s internal controls, integrity of its financial\nreporting, legal and regulatory risks, enterprise risk\nmanagement, internal and external audit functions.\n(b) The Campus Development Committee maintains\noversight of the University’s campus development\npolicies and any other matters related to the\nacquisition, commissioning and management of\nsignificant physical assets or facilities.\n(c) The Finance Committee provides oversight of the\nUniversity’s financial policy management.\n(d) The Industry and Research Committee provides\nstrategic guidance on the University industry\nengagement and collaboration and applied research.\n(e) The Investment Committee oversees the investment\nof the University’s endowment and surplus funds.\n(f) The Remuneration and Nomination Committee\noversees and reviews the University’s overall\nremuneration framework and policies, and also\noversees succession planning for the Board and the\nBoard Committees.MANAGEMENT OF THE UNIVERSITY\nThe President of the University, Prof Chua Kee Chaing, is\nappointed by the Board and is the Chief Executive Officer\nand the University’s academic and administrative lead. He\nis responsible to the Board for the conduct, co-ordination\nand quality of the programmes of the University and its\nfuture development. He is empowered with the authority\nto perform all acts which are necessary to implement the\npolicies, procedures and actions of the Board. As a liaison\nbetween the Board and the University, the President is tasked\nwith the responsibility of informing each party of the views\nand concerns of the other that relate to the programmes\nand administration of the University. He also arranges for\nthe annual budget of the University to be presented to the\nBoard annually for approval as part of his duties.\nThe profiles of other members of the Senior Management\nof the University can be found on its corporate web page\nand on pages 8 and 9 of the Annual Report.\nCONFLICTS OF INTEREST\nThe Trustees and staff are required to act in the best interest\nof the University at all times. Policies have been developed to\nprevent or manage situations where conflicts of interest could\narise, by promoting integrity and ethical business conduct.\nThe AAs contain provisions for the management and\navoidance of conflicts of interest by members of its Board\nof Trustees. Such provisions include:\n(a) permitting a Trustee to be interested in any transaction\nwith the University provided that the Trustee has declared\nthe nature of the interest to the other Trustees of the\nBoard as required under the Companies Act of Singapore\nand complied with the provisions of AAs to abstain from\nvoting on any matter related to the transaction,\n(b) permitting a Trustee, or a firm associated with the\nTrustee, to act in any professional capacity for the\nUniversity and to be remunerated for the provision of\nprofessional services, and\n(c) permitting a Trustee to be reimbursed for out-of-pocket\nexpenses, travelling and other expenses properly\nincurred by the Trustee in attending and returning from\nmeetings of the Board of Trustees, any of its committees,\nor any general meeting of the University or otherwise in\nconnection with the affairs of the University.\nThe AAs also state that Trustees shall not receive any\nremuneration for services rendered by them as Trustees.\nIn addition, the University does not have any staff receiving\nmore than S$50,000 in annual remuneration that is a close\nrelative of any Trustee.\nThe University has implemented a Conflicts of Interest\nPolicy which all staff must comply with. In accordance with\nthat Policy, staff must ensure that their private activities\nand interests do not conflict with their professional\nobligations to the University. Where there is a potential\nconflict of interest, the staff is required to submit full\ndisclosure and request for an appropriate exemption. The\nUniversity will grant such exemptions at its discretion. In\naddition, staff are required to declare their compliance\nwith the University’s prevailing policy on conflicts of\ninterest annually.(g) The Sustainability Committee provides strategic\nguidance on the University’s sustainability strategy,\npolicies and initiatives, as well as the development of\nthe University’s talent and applied research capabilities\nin sustainability.\nEach Board Committee comprises Trustees with appropriate\nqualifications and skills and there is a fair distribution of\nresponsibilities amongst the Trustees. Where required,\nnon-Trustees with relevant areas of expertise are invited to\nprovide advice to the Board Committees to enhance the\nprocess of decision making. The Board is kept informed of\nthe key matters discussed at each Board Committee meeting.\nNone of the Trustees have general control and management\nof the University’s subsidiaries.\nBOARD ATTENDANCE\nA total of four Board meetings were held during the\nfinancial year from 1 April 2021 to 31 March 2022. The\nattendance of the Trustees at the Board meetings during\nthe financial year is tabulated below:\nNamePercentage (%)\nof Attendance\nMr Ng Yat Chung1100\nMr Bill Chang 75\nMr Chan Hian Lim2100\nDr Chia Tai Tee 100\nProf Chua Kee Chaing3100\nProf Heng Chye Kiang4100\nMs Melissa Khoo4100\nDr Benjamin Koh 50\nMr Kwee Liong Keng 25\nMs Lim Wan Yong567\nMrs Margaret Lui 100\nMr Abu Bakar Bin Mohd Nor 75\nMs Neo Gim Huay267\nMs Gail Ong 100\nMr Quek Gim Pew 100\nMr Ravinder Singh 50\nMr Nagaraj Sivaram 100\nMs Susan Soh2100\nMr Soon Sze Meng 75\nProf Tan Thiam Soon6100\nMs Tammie Tham 100\nMr T K Udairam4100\nMr Wen Khai Meng 100\n1  Mr Ng Yat Chung who served for more than 10 years has broad experience\nand is an eminent leader who contributed significantly to SIT’s growth\nand strategic direction. His appointment was endorsed by the Ministry of\nEducation. Mr Ng ceased to be Chairman of the Board on 16 March 2022,\nbefore the financial year-end.\n2  Mr Chan Hian Lim, Ms Neo Gim Huay and Ms Susan Soh were appointed\nas Trustees of the Board on 16 September 2021.\n3  Prof Chua Kee Chaing was appointed as a Trustee of the Board on\n1 January 2022.\n4  Prof Heng Chye Kiang, Ms Melissa Khoo and Mr T K Udairam ceased to be\nTrustees of the Board on 16 September 2021.\n5  Ms Lim Wan Yong was appointed as Trustee of the Board on 4 October 2021.\n6  Prof Tan Thiam Soon ceased to be a Trustee of the Board on 1 January 2022.\n7  Mr Han Kwee Juan and Ms Jacqueline Poh were appointed to the Board\non 1 June 2022, after the financial year-end.NOTESFOR THE FINANCIAL YEAR ENDED 31 MARCH 2022*CORPORATE GOVERNANCE\n*Includes trustees appointed after 31 March 2022. Information correct as at Aug 2022.\nSingapore Institute of Technology\nAnnual Report 2022\n62 63Corporate Governance\nBOARD COMMITTEES\nBoard Committee Composition\nAUDIT\nCOMMITTEECHAIRMAN\nMr Nagaraj SivaramMEMBERS\nDr Chia Tai Tee\nDr Benjamin Koh\nMs Gail Ong\nMr Han Kwee Juan\nCAMPUS\nDEVELOPMENT\nCOMMITTEECHAIRMAN\nMr Wen Khai MengMEMBERS\nMs Neo Gim Huay\nMs Gail Ong\nMs Tammie Tham\nFINANCE\nCOMMITTEECHAIRMAN\nMr Ravinder SinghMEMBERS\nMrs Margaret Lui\nMr Wen Khai Meng\nINDUSTRY AND\nRESEARCH\nCOMMITTEECHAIRMAN\nMr Abu Bakar Bin Mohd NorMEMBERS\nMr Chan Hian Lim\nMr Quek Gim Pew\nMs Tammie Tham\nMs Jacqueline PohFOR THE FINANCIAL YEAR ENDED 31 MARCH 2022*BOARD COMMITTEES\nAND INTERNAL AUDIT\nINTERNAL AUDIT\nInternal Audit provides independent, objective assurance\nand consulting services designed to add value and improve\nthe University’s operations. Internal audit activity is guided\nby a value-driven philosophy of partnering with other Board Committee Composition\nINVESTMENT\nCOMMITTEECHAIRMAN\nMrs Margaret LuiMEMBERS\nDr Chia Tai Tee\nMs Susan Soh\nCO-OPTED MEMBER\nMr Oo Wooi Cheng\nREMUNERATION\nAND NOMINATION\nCOMMITTEECHAIRMAN\nMr Bill ChangMEMBERS\nMs Lim Wan Yong\nMr Quek Gim Pew\nMr Ravinder Singh\nSUSTAINABILITY\nCOMMITTEECHAIRMAN\nMr Soon Sze MengMEMBERS\nMr Chan Hian Lim\nMr Bill Chang\nMs Neo Gim Huay\ndepartments to enable SIT to meet its business objectives.\nOur key role is to assist Management in evaluating their\nrisk management, control and governance processes so\nthat business objectives can be met.\n*Includes trustees appointed after 31 March 2022. Information correct as at Aug 2022.\nSingapore Institute of Technology\nAnnual Report 2022\n64 65Board Committees and Internal Audit\nFINANCIAL STATEMENTS\nCONSOLIDATED STATEMENT OF COMPREHENSIVE INCOME (For the Financial Year ended 31 March 2022)\nGeneral FundsEndowment\nand Term Funds Total\n2022\n$’000 2021\n$’000 2022\n$’000 2021\n$’000 2022\n$’000 2021\n$’000\nRevenue 96,234 90,379  —  — 96,234 90,379\nOther income 2,553 2,876 4,185 6,957 6,738 9,833\nOperating Expenditure\nStaff and Related Expenses (128,373) (119,958)  (521)  (374) (128,894) (120,332)\nProgramme and\nStudent-Related Expenses (70,048) (65,668) (3,761) (3,779) (73,809) (69,447)\nDepreciation and\nAmortisation Expenses (44,406) (45,072)  (3)  — (44,409) (45,072)\nRental and Other\nFacility Expenses (15,664) (14,223)  —  — (15,664) (14,223)\nInterest Expense (1,250) (1,396)  —  — (1,250) (1,396)\nOther Operating Expenses (24,394) (22,207) (1,612) (1,071) (26,006) (23,278)\nTotal Operating Expenditure (284,135) (268,524) (5,897) (5,224) (290,032) (273,748)\nDeficit before\nInvestment Income and\nGovernment Grants (185,348) (175,269) (1,712) 1,733 (187,060) (173,536)\nNet Investment Income  542  638 39,866 129,047 40,408 129,685\n(Deficit)/Surplus before\nGovernment Grants (184,806) (174,631) 38,154 130,780 (146,652) (43,851)\nGovernment Grants 218,947 217,082 — — 218,947 217,082\nNet Surplus, representing\nTotal Comprehensive Income 34,141 42,451 38,154 130,780 72,295 173,231\nThe Consolidated Financial Statements, as set out on pages 67 to 71, are extracted from Singapore Institute of Technology and its subsidiaries (“the\nGroup”) Audited Financial Statements for the year ended 31 March 2022. It may not contain sufficient information to allow for a full understanding\nof the results and the state of affairs of the Group. For further information, please refer to the full set of the audited financial statements published\non SIT official website at SingaporeTech.edu.sg. IMPORTANT NOTEFINANCIAL\nSTATEMENTS\n67\nSingapore Institute of Technology\nAnnual Report 2022 66Financial Statements\nCONSOLIDATED STATEMENT OF CHANGES IN FUNDS AND RESERVES (For the Financial Year ended 31 March 2022)\nGeneral FundsEndowment\nand Term Funds Total\n$’000 $’000 $’000\n2022\nBalance at 1 April 2021 211,501 783,370 994,871\nNet Surplus, representing Total\nComprehensive Income 34,141 38,154 72,295\nGovernment Grants\nand Donations  — 45,620 45,620\nBalance at 31 March 2022 245,642 867,144 1,112,786\n2021\nBalance at 1 April 2020 169,050 612,415 781,465\nNet Surplus, representing Total\nComprehensive Income 42,451 130,780 173,231\nGovernment Grants\nand Donations  — 40,175 40,175\nBalance at 31 March 2022 211,501 783,370 994,871STATEMENT OF FINANCIAL POSITION (As at 31 March 2022)\nGroup SIT\n2022\n$’000 2021\n$’000 2022\n$’000 2021\n$’000\nASSETS\nNon-Current Assets\nInvestments in Subsidiaries  — —  —(a) —(a)\nProperty, Plant and Equipment 777,031 667,676 776,520 667,676\nIntangible Assets 2,627 4,558 2,627 4,530\nStudent Loans  309  508  309  508\nOther Non-Current Assets 63,974 67,155 63,940 67,155\nTotal Non-Current Assets 843,941 739,897 843,396 739,869\nCurrent Assets\nCash and Cash Equivalents 270,109 292,344 270,098 292,244\nFinancial Assets at Fair Value\nthrough Profit or Loss 811,608 707,400 811,608 707,400\nDeposits for Investments 2,584 20,154 2,584 20,154\nFees and Other Receivables 123,523 84,115 124,652 84,418\nStudent Loans  81  127  81  127\nOther Current Assets 10,505 20,404 10,505 20,401\nDerivative Financial Instruments  20  —  20  —\nTotal Current Assets 1,218,430 1,124,544 1,219,548 1,124,744\nTOTAL ASSETS 2,062,371 1,864,441 2,062,944 1,864,613\nLIABILITIES\nCurrent Liabilities\nTrade and Other Payables 77,383 73,363 77,414 73,283\nDeferred Tuition Fee Income 9,207 9,400 9,207 9,400\nGrants Received In Advance 132,673 159,981 132,673 159,981\nLease Liabilities 4,888 5,598 4,884 5,598\nBorrowings  43  —  43  —\nDerivative Financial Instruments  — 18  — 18\nTotal Current Liabilities 224,194 248,360 224,221 248,280\nNET CURRENT ASSETS 994,236 876,184 995,327 876,464\nNon-Current Liabilities\nDeferred Capital Grants 591,652 513,922 591,652 513,908\nOther Deferred Grants 66,847 70,174 66,847 70,174\nLease Liabilities 32,892 37,114 32,371 37,114\nBorrowings 34,000  — 34,000 —\nTotal Non-Current Liabilities 725,391 621,210 724,870 621,196\nTOTAL LIABILITIES 949,585 869,570 949,091 869,476\nNET ASSETS 1,112,786 994,871 1,113,853 995,137\nFUNDS AND RESERVES\nGeneral Funds\n- Accumulated Surplus 245,642 211,501 246,709 211,767\nEndowment and Term Funds\n- Capital 631,131 585,511 631,131 585,511\n- Accumulated Surplus 236,013 197,859 236,013 197,859\n867,144 783,370 867,144 783,370\nTOTAL FUNDS AND RESERVES 1,112,786 994,871 1,113,853 995,137\n(a)  Less than $1,000\nSingapore Institute of Technology\nAnnual Report 2022\n68 69Financial Statements\nCONSOLIDATED STATEMENT OF CASH FLOWS (For the Financial Year ended 31 March 2022)\n2022\n$’000 2021\n$’000\nCash Flows From Operating Activities\nDeficit before Government Grants (146,652) (43,851)\nAdjustments for:\nDepreciation and Amortisation 44,409 45,072\nDonations (4,185) (6,957)\nNet Loss/(Gain) on Disposal of Property, Plant and Equipment  (12)  9\nInterest Income (1,230) (1,599)\nDividend Income (4,138) (2,405)\nCurrency Exchange Loss/(Gain)  (201)  171\nFair Value (Gain)/Loss on Financial Assets at Fair Value\nthrough Profit or Loss (27,650) (95,159)\nFair Value (Gain)/Loss on Derivative Financial Instruments  52  (177)\nGain on Disposal of Financial Assets at Fair Value through Profit or Loss (7,241) (30,516)\nInterest Expense 1,250 1,396\nLoss Allowance  4 (12)\nOperating Cash Flows before Changes in Working Capital (145,594) (134,028)\nChange in Operating Assets and Liabilities\nFees and Other Receivables (28,428) 10,296\nStudent Loans and Other Assets 13,325 (8,541)\nTrade and Other Payables 1,624  (670)\nNet Cash Used in Operating Activities (159,073) (132,943)\nCash Flows From Investing Activities\nPurchase of Property, Plant and Equipment and Intangible Assets (148,407) (119,963)\nProceeds from Disposal of Property, Plant and Equipment  17  1\nPurchase of Financial Assets at Fair Value through Profit or Loss (157,338) (259,339)\nProceeds from Disposal of Financial Assets at Fair Value\nthrough Profit or Loss 108,175 166,772\nDeposits for Investments (2,584) (20,154)\nPrepayment of Right-of-Use Assets  — (17,562)\nSettlement of Currency Forwards  (90)  283\nInterest Received 1,487 1,852\nDividend Received 4,138 2,405\nNet Cash Used in Investing Activities (194,602) (245,705)\nCash Flows From Financing Activities\nOperating Grants Received 146,063 135,518\nDevelopment Grants Received 72,784 230,100\nOther Government Grants Received 27,969 28,062\nMatching Endowment Grants Received 41,103 101,911\nDonations Received 16,687 17,040\nPrincipal Payment of Lease Liabilities # (5,916) (5,598)\nInterest Paid on Lease Liabilities # (1,250) (1,396)\nProceeds from Borrowings # 34,000  —\nNet Cash Flows Generated From Financing Activities 331,440 505,637\nNet (Decrease)/Increase in Cash and Cash Equivalents (22,235) 126,989\nCash and Cash Equivalents at Beginning of Financial Year 292,344 165,355\nCash and Cash Equivalents at End of Financial Year 270,109 292,344\n#  See NOTE ACONSOLIDATED STATEMENT OF CASH FLOWS (cont’d) (For the Financial Year ended 31 March 2022)\nNOTE A: Reconciliation of Liabilities Arising From Financing Activities\n1 April\n2021Principal\nand Interest\nPaymentsProceeds\nfrom\nBorrowingsNon-Cash Changes31 March\n2022Additions Interest Expense\n$’000 $’000 $’000 $’000 $’000 $’000\n2022\nLease\nLiabilities42,712 (7,166)  —  984 1,250 37,780\nBorrowings  —  — 34,000  —  43 34,043\n1 April\n2020Principal\nand Interest\nPaymentsProceeds\nfrom\nBorrowingsNon-Cash Changes31 March\n2021Additions Interest Expense\n$’000 $’000 $’000 $’000 $’000 $’000\n2021\nLease\nLiabilities47,463 (24,606)  — 18,459 1,396 42,712\nSingapore Institute of Technology\nAnnual Report 2022\n70 71Financial Statements\nSIT graduate Jana Chan credits her smooth transition into her career as a full-fledged occupational\ntherapist to SIT’s applied learning approach. The University’s close ties with industry gave\nher the hands-on exposure she needed to become truly ready for the healthcare industry.CONTACT US\nSIT@DOVER, 10 DOVER DRIVE,\nSINGAPORE 138683\nTEL  6592 1189\nFAX  6592 1190\nADMISSIONS\nTEL  6592 1136\nEMAIL  Adm@SingaporeTech.edu.sg\nALUMNI\nTEL  6592 2129 /  6592 2114\nEMAIL  Alumni@SingaporeTech.edu.sg\nCENTRE FOR CAREER READINESS\nTEL  6592 8150\nEMAIL  CareerReadiness@SingaporeTech.edu.sg\nGIVING TO SIT\nTEL  6592 1138 /  6592 1094\nEMAIL  Advancement@SingaporeTech.edu.sg\nREGISTRAR’S OFFICE\nTEL  6592 2091\nEMAIL  Registrar@SingaporeTech.edu.sg\nSTUDENT EVENTS ACTIVITIES AND CLUBS\nTEL  6592 1191\nEMAIL  SLD@SingaporeTech.edu.sgCOMMUNITY LEADERSHIP AND SOCIAL\nINNOVATION (CLASIC)\nEMAIL  SIT.CLASIC@SingaporeTech.edu.sg\nINNOVATION AND TECHNOLOGY TRANSFER\nTEL  6592 2723\nEMAIL  Innovate@SingaporeTech.edu.sg\nNACE@SIT\nTEL  6592 8971\nEMAIL  SIT.NACE@SingaporeTech.edu.sg\nSITLEARN PROFESSIONAL DEVELOPMENT\nEMAIL  SITLEARN@SingaporeTech.edu.sgSINGAPORE INSTITUTE\nOF TECHNOLOGY\nSingapore Institute of Technology\nAnnual Report 2022\n72\nSINGAPORE INSTITUTE OF TECHNOLOGY\n10 Dover Drive\nSingapore 138683\nRegistration No: 200917667D\nSingaporeTech.edu.sgREAD ONLINE\n@SingaporeTech @SingaporeTech @SingaporeTechSingaporeTech.edu.sg/\nannual_report_2022/"
}