{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-10/4%20-%20Artificial%20Intelligence%20for%20Integrated%20Sensing%20and%20Communications%20%28ISAC%29%20for%206G.pdf",
  "type": "pdf",
  "content": "SIT Internal\nArtificial Intelligence for Integrated Sensing and Communications (ISAC) for 6G\nIntegrated Sensing and Communications (ISAC) plays a pivotal role in future 6G\ncommunications. As an emerging paradigm, ISAC unifies wireless communication and radar\nsensing functionalities within a single system, offering significant benefits such as impr oved\nspectrum efficiency, reduced power consumption, and enhanced cost -effectiveness. The\napplications of ISAC are diverse, ranging from environment sensing, human and health\nmonitoring, to automotive and drone navigation. Despite its potential, ISAC face significant\nchallenges such as managing interference between communication and sensing signals,\nparticularly in full -duplex systems where both functions operate simultaneously and ensuring\nadaptability in diverse and dynamic environments. Artificial intell igence has the potential to\nenhance the processing capabilities of ISAC systems, significantly enhancing their performance\nin detection, classification, and estimation. This project aims to develop AI -based algorithms\ntailored for ISAC, with prototypes of these algorithms to be implemented on software -defined\nradio platforms to demonstrate ISAC's practical capabilities.\nThe candidate will be part of the Future Communications Translation Lab (FCTLab)  in SIT, a\nnational lab funded by the Infocomm Media Development Authority (IMDA) Singapore. Equipped\nwith private 5G testbeds and advanced communications and network test and measurement\ninstruments, the lab facilitates the practical validation and refine ment of new wireless\ntechnologies. The strong partnership between FCTLab and industry collaborators will also\nsupport real -world trials, bridging the gap between theoretical research and practical\nsolutions."
}