{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/sitsfuturepunggolcampusfirstgift.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  08/16 SiTIZEN  |  09/16\nSIT’s Future Punggol Campus Gets its First GiftGenerous giving from Ho Bee\nLand also supports a scholarship\nHo Bee Land has made endowed gifts of\n$3.25 million to the Singapore Institute of\nTechnology (SIT), marking the very first time\nthe University has received philanthropic\nsupport for its future campus in Punggol.\nIn recognition of this commitment, SIT has\nnamed the auditorium at its future campus\nin Punggol, as well as its interim campus in\nSIT@Dover, the Ho Bee Auditorium.\nThe Ho Bee Auditorium at SIT@Dover was\nunveiled at a naming ceremony for the\nauditorium and appreciation lunch for\nHo Bee Land. Held on 1 July 2019, it was\nattended by Dr Chua Thian Poh, Chairman\nand Chief Executive Officer of Ho Bee Land,\nand Guest-of-Honour, Mr Ong Ye Kung,\nMinister for Education.\nExpressing his appreciation, Prof Tan Thiam\nSoon, President, SIT, said, “SIT is honoured\nby the firm support from Ho Bee Land – a\nSingaporean company with a global outlook,\nand a name that is associated with both\nquality and sustainability – the very same\noutcomes that we are also keen to achieve.\nThank you for taking the lead to support SIT\nand our students at this point of our journey,\nas our young university leaps forward into its\nsecond decade.”\nHeadquartered in Singapore, Ho Bee\nLand is a real estate development and\ninvestment company with a portfolio that\ncovers many quality residential, commercial\nand high-tech industrial projects since its\nestablishment in 1987.\nIn his remarks, Dr Chua said that the approach\ntaken by SIT as Singapore’s university of\napplied learning resonates with Ho Bee Land.\nHe added, “We believe a good education\nhelps open doors to many opportunities. It\nhelps nurture the next generation of leaders\nand professionals. We also hope that it will\nhelp impart to them the good values of\ngiving back to the community.”\nHo Bee Land’s philanthropy has also made\npossible the Ho Bee Scholarship to nurture\nacademically promising undergraduates\nfrom nine degree programmes at SIT\n(ranging from Engineering to Information\nand Communications Technology to Interior\nDesign).\nMr Tan Kah Wei is one of the first to receive\nthe Ho Bee Scholarship at SIT. The second-\nyear student from the Information and\nCommunications Technology (Information\nSecurity) programme said the Ho Bee\nScholarship has allowed him to better\nenvision his future. He added, “I hope to be\nable to use my professional IT knowledge\nto mentor the young as well as help the\nelderly who are less tech-savvy, so that they\nknow how to protect themselves from data\nbreaches and security threats.”\nLocated in a standalone building by the\nwaterfront, the Ho Bee Auditorium will be Dr Chua Thian Poh, Chairman & CEO, Ho Bee Land, (third from right) mingles with guests before\nthe ceremony begins.\nThe event took place at the foyer of the auditorium at SIT@Dover.\nHo Bee Scholarship recipients, Mr Tan Kah Wei (left) and Ms Lau En Bei, who was on her compulsory\nOverseas Immersion Programme in Glasgow, expressed their thanks to Ho Bee Land in their own\nspecial way. Ms Lau sketched and built a model of the future auditorium whereas Mr Tan designed an\ninteractive platform which can be displayed at the future auditorium. Mr Ng Yat Chung, Chairman, Board of Trustees, SIT, (left) presents a token of\nappreciation from SIT to Dr Chua Thian Poh, Chairman & CEO, Ho Bee Land. Speaking off the cuff, Mr Ong Ye Kung, Minister for Education, thanked Dr Chua Thian Poh and Ho\nBee Land for this leadership gift that supports SIT’s future campus in Punggol and its students. He\nmade a light-hearted appeal to guests at the appreciation lunch to also support SIT.\nHo Bee Land’s Board of Directors together with (second from left) Senior Parliamentary Secretary\nLow Yen Ling, Prof Tan Thiam Soon, Mrs Doris Chua, Dr Chua Thian Poh, Minister Ong Ye Kung,\nMr Ng Yat Chung and Minister of State Sam Tan.(From left) Ms Low Yen Ling, Senior Parliamentary Secretary, Ministry of Education & Ministry\nof Manpower; Dr Chua Thian Poh, Chairman & CEO, Ho Bee Land; Prof Tan Thiam Soon,\nPresident, SIT; Mr Sam Tan, Minister of State, Ministry of Foreign Affairs & Ministry of Social and\nFamily Development; Mr Nicholas Chua, Deputy CEO, Ho Bee Land; Mr Seow Choke Meng,\nIndependent Director, Ho Bee Land; and Mr Ng Yat Chung, Chairman, Board of Trustees, SIT.\nAn energetic performance from SIT’s Wushu Club greeted\nguests at the start of the ceremony.\npart of the teaching facilities in the Punggol campus, with function\nareas that enjoy unobstructed views of Serangoon Reservoir and\nConey Island. It will also have the capacity to host key national and\nuniversity events. SIT’s Punggol campus will be part of the nation’s\nnew Punggol Digital District."
}