{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2025-01/CLASIC%20eBook%20v8%20%28final%29.pdf",
  "type": "pdf",
  "content": "Com munity\nLeadership and\nSocial Innovation\nCentre (CLA SIC)\nSustainable Practices\nA Smart Meter to Enhance Control of Water\nUsage and Cost\nRecycle More and Do It Right: Designing Recycling\nReceptacle for All Households\nCAAN – Smart walker with sensors for\nenhanced safety\nUrban Farming Program – Collaboration\nbetween Singapore Institute of\nTechnology and Yusof Ishak Secondary\nSchool\nProject Inspire - Collaboration\nbetween SIT, CLASIC (Community\nLeadership and Social Innovation\nCentre), YES! Program and Victoria\nJunior College (VJC)\nUSI2001 Social Innovation Project\nModuleSIT Community Challenge 2023  Contents\nOur Journey through Collaboration and Prototyping\nTeam MECIT – IoT Device to Assist with\nPhoto-taking05\n07\n09\n10\n11\n12\n14\n17Advisor’s Message 03\nDirector’s Message 04\nAdvisor’s Message\nThe Community Leadership and Social Innovation Centre (CLASIC) grew out of the need to\ncreate a non-academic platform for staff and students to engage in social innovation\nprojects. The Singapore Institute of Technology (SIT) was still in its formative stage when the\nidea of this centre was mooted. SIT senior leadership saw the need to enrich their student’s\nuniversity experience beyond the classroom. This is leadership par excellence where the focus\nof any university education is the overall development of their students.\nBut what is social innovation? According to the Stanford Graduate School of Business (GSB):\n“Social innovation is the process of developing and deploying effective solutions to challenging and\noften systemic social and environmental issues in support of social progress. Social innovation is not\nthe prerogative or privilege of any organizational form or legal structure. Solutions often require the\nactive collaboration of constituents across government, business, and the nonprofit world. ”\nTwo very important points emerge from the above definition: anyone or any organization can\nundertake social innovation and it’s about making social progress. It is the latter takeaway\nthat CLASIC aims to achieve in all of their projects.\nHow do we measure social progress? As a requirement of being involved in CLASIC projects,\nstudents are expected to interact with the beneficiaries. Through these interactions and\nengagements, it is hoped that students first understand the challenges faced by the\nbeneficiaries and secondly, what sort of outcomes the beneficiaries would prefer. Hence, the\nidea of social progress emerges from the beneficiaries as they are the ones who will be using\nthe solutions developed by the students.\nThe process of engaging and developing solutions for the beneficiaries should help our\nstudents to develop empathy. Empathy is not sympathy. Understanding the challenges faced\nby the beneficiaries of the projects, will help out students to deepen their sense of\nunderstanding and drive them towards finding a solution. This is empathy where students\ngrasp the challenges and proceed to assist in overcoming those challenges. Hence, there is\nunderstanding and action. This is how social progress is achieved.\nThis e-book serves as both an account of CLASIC’s journey since inception and a repository of\nideas and insights arising from the various projects. It is hoped that these examples will\ninspire students and staff to step forward into the world of social innovation. And invariably\nadd further to SIT’s contribution to building a better society.\nCLASIC has grown together with SIT to continually find new and interesting projects for our\nstaff and students. As SIT relocates to the Punggol Digital District (PDD), CLASIC has a\ntremendous opportunity to bring social innovation to residents and businesses in the PDD.\nThis next development will put CLASIC in a position to nurture social innovators within PDD.\nI wish CLASIC all the best as they transit into being a key component of public life in PDD.\n[1] https://www.gsb.stanford.edu/experience/about/centers-institutes/csi/defining-social-innovationProfessor Yaacob Ibrahim\nFounding Director and Advisor, CLASIC\nAdvisor to the President, SIT\nSince its establishment in October 2020, the Community Leadership and Social Innovation\nCentre (CLASIC) has grown from strength to strength. Despite our lean team and operating\nresources, we have expanded our suite of initiatives and opportunities to nurture SITizens as\nsocial innovators and community leaders who initiate change and create positive social\nimpact. We do this through both the undergraduate curriculum and initiatives beyond the\nuniversity.\nOur USI2001 Social Innovation Project module, launched in academic year (AY) 2022, now sees\nat least 3,000 students enrolled annually. Students doing the module work in interdisciplinary\nteams on problem statements that are either proposed by community or industry partners or\ncurated by students themselves. As a student-led, independent learning module, students\nplan their own project milestones and timeline; reach out to the relevant stakeholders or\nmodule Resource Persons for inputs and feedback; and draw from their own experience,\nknowledge, skills and resourcefulness to co-create solutions with end-users or beneficiaries.\nSince AY2022, we have collaborated with both industry and community partners such as\nAccenture, Club HEAL, Ministry of Social and Family Development (MSF), National Council of\nSocial Service (NCSS), Punggol Regional Library and Spark!Lab (under the National Library\nBoard), DBS Bank, OCBC Bank, SalesForce, Suncare SG, Waterways Watch Society, People's\nAssociation (PA), Mainly I Love Kids (MILK), MCS Hub for Ex-Offenders, and St Gabriel's\nFoundation, among others.\nOther than the USI2001 module, SITizens are also involved in projects and initiatives outside of\nthe undergraduate curriculum, such as through academic staff-led projects that are funded\nby CLASIC Project Grants, where SITizens are recruited as student assistants. In addition,\nCLASIC’s Young Explorers in STEM (YES!) Program and the SIT Community Challenge provide\ninvaluable opportunities for students to hone their interpersonal and communication skills as\nthey assume the role of SITizen mentors to secondary school students on projects related to\nScience, Technology, Engineering and Mathematics (STEM).\nOther than applied learning for our SITizens, CLASIC has also created ample prospects for our\nacademic staff to lead applied learning projects funded by the CLASIC Project Grant, through\ncollaboration with partners such as Mandai Wildlife Group, St Luke’s Eldercare, Kwong Wai Shiu\nHospital, Singhealth Community Hospitals, and Singapore International Foundation, among\nothers. Academic staff who have completed their projects under CLASIC have been invited to\nshare their project findings and experience through the CLASIC Brown Bag Seminars, held\ntwice a year.\nAll in all, it has been a truly thrilling, fulfilling and enriching four years since CLASIC was first set\nup. Our work has just started and there is still much that we plan to do. We look ahead with\nmuch excitement!Director’s Message\nAssoc Professor Intan Azura Mokhtar\nDirector, CLASIC\nA Smart Meter to Enhance Control of Water Usage and Cost\nHouseholds in Singapore account for about 45-50% of the total water\nconsumption in Singapore. This proportion is relatively high compared to\ndomestic waste generated (25%) or carbon emissions (6%). In addition, with\nincreasing water tariffs, households may see more of their household expenses\ngo towards water bills.\nCurrently, households in Singapore are not able to identify the specific water-\nrelated activities that cause excessive water usage should there be a surge in\nwater usage. The Public Utilities Board (PUB) has installed water meters outside\neach dwelling unit in Singapore, including smart water meters, to monitor water\nusage readings for each household. However, these are aggregated water\nmeters that provide the overall water usage for the entire household and are\nnot able to monitor the water usage for specific water points within the\nhousehold. Sustainable\nPractices\n5\nUnder the guidance of Engineering faculty, Assoc Prof Steven Tay, a group of\nMechanical Engineering Year 2 students worked on the proposal as a\nSpecialised Engineering Project in Trimester 3, AY2021. The journey began with\nresearch including visits to rental units to understand the size and layout of the\nflats and the families’ water consumption.\nHoping to help households better manage their water usage and bills, a social\nenterprise, ECOSOFTT Pte Ltd and CLASIC exchanged ideas and eventually\nproposed a project to develop and install smart meters that can monitor water\nusage at different outlets, beginning with low-income households. The smart\ndevice is capable of storing data for a period of at least two weeks and data\nshould be retrievable so that they can be analysed to determine the water\nusage at the different water points of the household. This will help users to\nbetter understand and adjust their usage behaviour to manage their water bill.\nTo bring the project to the next phase, CLASIC has\nawarded a project grant to fund the production of\nmore meters for the students to conduct a 2-week\ntrial in 20 low-income households between July\nand August 2022. The project has received warm\nsupport of the Public Utilities Board (PUB) and the\nSingapore Plumbing Society has generously agreed\nto sponsor the installation of the devices in the\nidentified flats. The findings would be shared with\nthe participating families to encourage them to\nmanage their water usage and the data collected\nwill be presented to PUB to enhance their\nunderstanding of water consumption patterns in\nlow-income households.\n6\nRecycl e More and Do It Right:\nDesigning Recycl ing Receptacle for All Households\nTo promote recycling right and encourage higher\nrecycling rates among Singaporeans, the National\nEnvironment Agency (NEA) planned to produce a\nrecycling receptacle for distribution to households in\nSingapore. The objective is to encourage correct\nrecycling practices and good habits within the family\nand from home.\nNEA invited SIT students to contribute designs of\na household recycling receptacle for NEA’s\nconsideration. The receptacle would allow for\ndifferent types of common recyclable items\nincluding bottles, egg cartons, and small boxes\nto be placed inside. It was expected to be\ncompact, foldable, and attractive and at the\nsame time, expandable, sturdy, waterproof, and\nwashable.\nSenior Professional Officer,\nMr Kwong Kwok Kuen took up the\nchallenge to lead a team of\nProfessional Officers Division staff\nand students in creating\nreceptacle designs that would\nmeet NEA’s stringent requirements.\nThe project team successfully\npresented a range of prototypes\nand design concepts to an\nappreciative NEA audience on 22\nSep 2021.\n7\nThis project is timely not just for NEA but for SIT too – sustainability is a national\nissue that the university strongly advocates, and as we prepare to move to our\nnew Punggol campus, you may spot one or two of our favourite student-\ndesigned recycling receptacles in households in the Punggol Digital District or\nat our new SIT Punggol campus soon. .\n8\nCAAN – Smart walker with sensors for enhanced safety\nTeam CAAN is made up of Year 2 SITizens, Chan Wei Han, Mohammed Ibrahim\nAdam, Nicholas Goh Jie Wen, and Astor Tran Kei Chuen from the Telematics\n(ITS) programme. The team designed a smart walker for elderly persons with\nwalking difficulties and higher risks of falling, to get through their rehabilitation\nphase safely.\nThrough their consultations with AWWA, the SITizens created an enhanced\nversion of the walker that comes with sensors and components for added\nsafety features. The enhanced walker could detect obstacles, provide step\nguidance, night light activation, and infrared sensors to check if the user is\nwithin the walker's frame.\nTeam CAAN with their industry mentor\nand community partner.\nPrototype assembly made up of\nvarious pressure and infrared\nsensors and microcontrollers.From left: Mr Tan Hock Kwang, Senior\nManager, Durapower Technology\n(Singapore) Pte Ltd; Astor Tran; Nicholas\nGoh; Ms Pan Myint Wai Wai, Physiotherapist,\nAWWA; Chan Wei Han and Mohammed\nIbrahim.\n9\nYu Yucan from BEng (Hons) in Information and Communications Technology\n(Software Engineering), Yeo Yi Xuan, and Muhammad Abdul Aliimul Hakiim bin\nMohammed, who are reading BEng (Hons) in Information and Communications\nTechnology (Information Security), teamed up with Alencia Tan from BEng\n(Hons) in Mechanical Design and Manufacturing Engineering to frame a\nsolution. Learning that persons with MD typically rely on their caregivers to take\nphotographs and videos, the team focused on developing a hands-free,\nportable, and easy-to-use Internet-of-Things (IoT) device.Anyone can be creative, but not everyone has the chance to exercise their\ncreativity. Recognising this, SIT’s Team MECIT took a shot at making\nphotography as accessible as possible for people with muscular dystrophy\n(MD).Team MECIT – IoT Device to Assist with Photo-taking\nTeam MECIT, comprising (from left,\nclockwise) Alencia, Yi Xuan, Yucan\nand Hakiim, constructed an IoT\ndevice (right) with an app that\nhelps users to conveniently\ncapture photos.\n(Photos: Muhammad Abdul Aliimul\nHakiim bin Mohammed)\nTeam MECIT’s prototype allows\nusers to position a mobile phone\nattached to a motorised arm on\na wheelchair, snap pictures and\nreview them straight away. As\nusers navigate the various\noptions on the app by winking,\nthey can enjoy a more\nindependent form of recreation\nand expression.\nThe team not only produced a practical and promising prototype, but also\nsupplemented their innovation with a public outreach plan that made them\nclinch T4G’s Best Advocate mini-challenge. In August 2022, MECIT members\nparticipated in Muscular Dystrophy Association (Singapore)’s 22nd anniversary\nby running 22km in 22 days. They posted their journey on their Instagram\naccount to spread awareness of the condition and encouraged others to\nparticipate in the challenge. The team recounts that it was a meaningful activity\nto be part of.10\nYusof Ishak Secondary School (YISS), in collaboration with SIT’s Young Explorers\nin STEM (YES!) Program, has launched an innovative Urban Farming initiative for\nits students. This initiative aims to spark student interest and impart knowledge\nin cutting-edge technologies such as 3D printing and block programming.\nInitially, students were introduced to the fundamentals of Tinkercad. They\nengaged in mini-tasks designed to reinforce their understanding. This approach\nnot only provided exposure to 3D modeling but also encouraged students to\ndesign cases for sensors used in urban farming. This practical application of\ntheir skills made the learning process both meaningful and immediately useful.\nFollowing this, the program included a tutorial on Microbit. This allowed students\nto experiment with their built sensors and learn about radio communication\nbetween different Microbits. Subsequently, they explored the use of M5Core kits\nwith integrated sensors. The culmination of the program involved teaching\nstudents how to integrate the knowledge and skills acquired from both the\ninitial and latter stages, facilitating communication between the Microbit and\nM5 Core using UART. Throughout these stages, YES mentors provided step-by-\nstep guidance.\nHowever, certain planned aspects of the program were not completed. This\nincludes the integration of all sensor data and its transmission to the cloud for\ncontinuous monitoring. The intended platform for this was Losant, a proprietary\nsoftware solution.\nThis initiative is more than just a learning experience; it's a steppingstone into\nthe future of technology. It's about inspiring our students to think creatively,\nsolve problems, and see the tangible impacts of their work in urban farming.\nUrban Farming Program – Collaboration between Singapore Institute\nof Technology and Yusof Ishak Secondary School\n11\nProject Inspire - Collaboration between SIT, CLASIC\n(Community Leadership and Social Innovation Centre),\nYES! Program and Victoria Junior College (VJC)\nIn May 2023, the second run for Project Inspire, a\ntransformative design thinking bootcamp for\nsecondary school students, concluded recently,\nleaving a trail of inspiration and innovation in its\nwake. This collaborative effort by the CLASIC\n(Community Leadership and Social Innovation\nCentre) in SIT with the commitment of student\nmentors in YES!Program and Victoria Junior College\n(VJC), empowered young minds to identify and\naddress social issues through creativity and\nproblem-solving.\nOver three intensive days, students delved into the world of design thinking,\nwhere they learned to empathize with community members, identify key\nchallenges related to plastic waste, and develop innovative solutions. The boot\ncamp featured workshops on design thinking principles, and prototyping\ntechniques, and even included community immersion experiences where\nstudents interacted directly with residents to gather valuable insights and\nunderstand their perspectives on the issue.\nArmed with newfound knowledge and fueled by a passion for making a\ndifference, the students tackled diverse community issues. From tackling\nenvironmental concerns to promoting social inclusivity, their proposed solutions\nshowcased remarkable ingenuity. Prototypes constructed through cardboard\nbrought their ideas to life, demonstrating their potential to create positive\nchange.\n12\nThe culmination of the boot camp saw\nstudents presenting their solutions to a\npanel of judges and community\nmembers. The presentations were a\ntestament to the learning and growth\nexperienced throughout the program.\nStudents confidently articulated their\nideas, demonstrating their\nunderstanding of design thinking\nprinciples and their commitment to\naddressing real-world challenges.\nThe success of Project Inspire extends beyond the individual participants. The\nprogram serves as a beacon, inspiring future generations to embrace innovation,\ncollaboration, and social responsibility. By fostering a love for design thinking and\nempowering young minds to tackle community issues, the program paves the\nway for a brighter and more sustainable future.\nThe unwavering commitment of SIT YES!Program mentors who dedicated their\ntime and expertise to guide and inspire the students also played a crucial role in\nmaking the program a success.\nAs Project Inspire continues to evolve\nand inspire, its impact on young minds\nand the communities they serve will\nundoubtedly continue to resonate for\nyears to come. Together, we can\nempower the next generation of thinkers\nand change-makers to build a better\ntomorrow. 13\nSIT Community Challenge 2023\nSIT Community Challenge (SIT CC) 2023 was a journey that started with\n\"Enhancing sustainable development efforts and education in the Punggol\ncommunity\" as a challenge statement to all four secondary schools in the\nPunggol district. As SIT is moving to our new campus in Punggol in 2024, we\nwanted to use this opportunity to:\n• Interact with our new Punggol neighbours through partnership and\ncollaborative initiatives;\n• Increase secondary school students’ awareness of the importance of\nenvironmental sustainability through education and action\n• Encourage SITizens to ideate and co-create socially innovative solutions to\naddress the challenge statement together with the secondary school students\nThe seven-month SITCC 2023 journey\nincludes an opening talk to all four\nsecondary schools (Yusof Ishak, Punggol,\nEdgefield and Greendale) to garner interest\nand team participation in May 2023,\ntargeting secondary 2 and 3 students in\neach school. This is followed by a design\nthinking training session from SIT faculty to\nall four schools in June. Thereafter, the\nteachers at each secondary school\nshortlisted 4 to 5 teams to attend the boot\ncamp on 26 Aug 2023 with a total of 19\nteams.\nDuring the boot camp, James Dyson\nengineers guided the 19 finalist\nteams in design prototyping through\na hands-on approach, equipping\nthem with real-life experience.\nStudents were further assisted by\nboth SIT student mentors and\nstudent ambassadors during the\nprocess. After the boot camp, SIT\nstudent mentors continued to mentor\nthe students in building and refining\ntheir prototypes.\n14\nExamples of SIT Community Challenge Projects by Students\nProject Name: Project Jardinière by\n5 Potatoes from Punggol Secondary School\nThe problem:\nAlthough sustainable food usage is a hot topic\ntoday, there is still no sure-fire way to help\nindividuals handle their food waste (besides\nmaking it a habit which might be difficult for\nsome)\nTheir proposed solution:\nThe team’s app aims to help people manage\nfood waste sustainably in their own households. It\nalso helps them to better connect with their\ncommunities and spread awareness of food\nsustainability. This multi-purpose app allows\nusers to reduce their food waste as it provides a\nmyriad of ways to recycle and reduce their food\nwaste and turn leftovers into something delicious\nand sustainable!\nThe Zero Waste Kitchen by YISS-2 won the Most\nInnovative Award during the SIT Community\nChallenge 2023. The problem:\n- High demand of water\n- Water insecurity\n-Plants are either overwatered or underwatered,\nwhich is detrimental to their growth\nTheir proposed solution:\n5 Potatoes proposed Jardinière, an automatic\nwatering system which waters plants just enough;\nnot too much, not too little. They also filter input\nwater to ensure cleaner water for plants.\nProject Jardinière by 5 Potatoes won the Most\nImpactful Award during the SIT Community\nChallenge 2023.\nProject Name: The Zero Waste Kitchen by team\nYISS-2 from Yusof Ishak Secondary School\n15\nThe SITCC 2023 finale event was held at\nPunggol National Library on 4 Nov 2023 and\nwas open to the public, where the secondary\nschool students’ prototypes and posters were\npresented. A panel of judges evaluated the\nprototypes and presentations by all 19 teams.\nEventually, the judges identified nine winners\nwho were awarded prizes for their time, effort,\nand ideas.\nSITCC 2023 has inspired SIT and secondary\nschool students to better understand the\nimportance of environmental sustainability\nthrough the innovation process while\nobtaining support from the community and\nthrough partnerships.\nThe support and inputs rendered by SIT\nstaff, teachers, and parents of secondary\nschool students during the finals\ncemented the importance of\nenvironmental sustainability to the\ngeneral public and secondary school\nstudents involved, beyond their typical\nschool curriculum. Through this event, SIT\nstudents learned the importance of\nenvironmental sustainability and the role\nof community mentorship.\nIn addition, SITizens had the opportunity to apply the skills and knowledge they\nhave learned in their respective degree programmes in a real-world setting, as\nwell as exercise community leadership through organising SITCC 2023.\n16\nUSI2001 Social Innovation Project Module\nThere are many current issues and challenges faced in our pluralistic society,\nsuch as diversity and inclusivity, changing demographics, environmental\nconcerns, and sustainable practices, among others. The inclusion of the Social\nInnovation Project module as a graduation requirement will create opportunities\nfor SIT students to address some of these multi-faceted issues and challenges in\na multi-pronged, problem-solving approach, and through inter-disciplinary\ncollaboration.\n17In this module, students apply the principles and mindset of being socially\nattuned and human-centred to understand the interdisciplinary and diverse\nfactors, concerns, needs, and expectations that different stakeholders in society\nhave when addressing these issues and challenges.\nThis experience will nurture students’ ability to see the broader connection of\nissues and challenges and bring about an awareness of the multiple\nconsiderations that need to be weighed in, including social, environmental, and\nsustainability factors, in the planning and decision-making process involved in\nthe course of their work – such as being cognisant of the circular economy, how\ncompanies operate, and corresponding investments made in the sectors\ninvolved. This experience will also prepare students for the interdisciplinary nature\nof work teams and demands of stakeholders, regardless of the industry they\nventure into after graduation from SIT.\nExamples of USI2001 Projects by Students\nProject Name: Re:Connect\nProblem statement: How can we develop empathy among youths towards\nthe elderly?\nIdeation: The team chose to target young people who were still in the\nschooling phase of their lives and teach them through a three-part\nworkshop that would take place during their schooling time. They wanted to\nraise understanding and empathy for the difficulties that the elderly\nencounter so that youths can treat them with more care and respect. With\nthis understanding, they would be able to educate and pass on their morals\nand values to the next generation. As a result, regardless of age, a more\ninclusive society is fostered, and so are sustainable development and\nlifestyles within the community.\nSolution: A card game that will be played constantly amongst different\ngenerations to teach young people how to be more empathetic towards\nand reconnect with the elderly in their lives.\n18\nProblem statement: How can caregivers be better equipped with relevant and\ntimely caregiving knowledge?\nIdeation: Singapore faces a rapidly ageing society and this proportion of\ncitizens aged 65 and above is expected to increase even further, to make up\napproximately 1/4 of Singapore's population. There are more citizens who are\nsuffering from chronic diseases than a decade ago (Choo, 2019).\nFor both domestic and family caregivers, caregiving duties can bring about\nmany different challenges. To tackle these challenges, support for them can be\nbroadly classified into 4 categories:\n- Emotional Support\n- Physical Resources\n- Medical Information\n- Financial Assistance\nSolution: CAREPACT: Mobile Application - Provide caregivers with relevant\ncaregiving -knowledge and services at their convenience - Perform as a\ncompact outlet that delivers timely and relevant information to help caregivers\nto better manage their caregiving responsibilities - The resources aim to\nalleviate feelings of burnt-out and improve the caregivers' overall well-beingProject Name: CAREPACT\n19\nMs Lim Xin Yi\nCentre Manager, CLASIC\nMs Claudya Hombing\nAsst Manager, CLASIC\nClaudya.Clara@singaporetech.edu.sg\nMs Lim Sock Hwee\n20External Mailbox:\nSIT.CLASIC@singaporetech.edu.sg\nAsst Manager, CLASIC\nsockhwee.lim@singaporetech.edu.sgMs Raudhah Binte Razali\nSnr Asst Manager, CLASIC\nraudhah.razali@singaporetech.edu.sgAssoc Professor Intan Azura Mokhtar\nDirector, CLASIC\nIntan.Mokhtar@singaporetech.edu.sg\nMr Dan Chia\nDeputy Director, CLASIC\nDan.Chia@singaporetech.edu.sg\nXinyi.Lim @singaporetech.edu.sgSIT Community Leadership and Social Innovation Centre (CLASIC)\nProfessor Yaacob Ibrahim\nAdvisor, CLASIC\nYaacob.Ibrahim@singaporetech.edu.sg\nSIT Email Distribution:\nCLASIC@singaporetech.edu.sg"
}