{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20110705today-scholarshipsforsit039shospitalitystudents.pdf",
  "type": "pdf",
  "content": "Email Print\nby Ng Jing Yng\n06:05 AM Jul 05, 2011\nSINGAPORE - The Singapore Institute of Technology ( SIT) has received S$2 million for scholarships for its\nhospitality students.\nPartnering the Overseas Union Enterprise Limited, S IT will be given S$200,000 annually over a period o f\n10 years. Students will also get training and emplo yment opportunities at Meritus Hotels & Resorts -\nhospitality division of Overseas Union Enterprise L imited - which could take them to places including\nEurope and China.\nSpeaking at the signing ceremony yesterday to mark the collaboration, Minister of State (Defence and\nEducation) Lawrence Wong said having such a scholar ship proves to be \"very timely\" as Singapore\nraises its international profile and will attract m ore tourists in time to come.\n\"To sustain the growth in the hospitality sector, w e must continue to uplift the manpower capabilities  in\nthis sector through education,\" said Mr Wong.\nThe SIT-Overseas Union Enterprise Limited Scholarsh ip is open to all of SIT's current and future\nhospitality degree programmes. To date, SIT offers two hospitality degree programmes: the University\nof Nevada, Las Vegas' (UNLV) Bachelor of Science in  Hotel Administration, and The Culinary Institute o f\nAmerica's (CIA) Bachelor of Professional Studies in  Culinary Arts Management.\nFuture hospitality degrees are in the pipeline as S IT continues discussions with potential overseas\nuniversity partners.\nSaid Overseas Union Enterprise Limited executive ch airman Stephen Riady: \"Travel and tourism continue\nto be an integral part of Singapore's economy, and we at OUE are committed to nurturing this exciting\ngrowth by equipping deserving hospitality students with the educational development they need to\nbecome tomorrow's industry leaders.\"\nSIT President Professor Tan Chin Tiong said: \"We ha ve consistently said that being with SIT promises a n\nindustry-relevant education and we reinforce this b y actively seeking industry support for our student s.\nThe SIT-Overseas Union Enterprise Limited Scholarsh ip is testament to the belief that our industry\npartners have in the quality of our students.\"\nSIT currently offers about 1,000 university places,  largely for polytechnic graduates who aspire to ge t a\ndegree. They are aiming to double this intake to 2, 000 places a year by 2015. Scholarships for SIT's hospitality students\n8\nTALKBACK\nNo responses currently.\nName\nEmail Address\nComments Required\nRequired\nNo more than 1,500 characters.\n0 character LEAVE A COMMENT\nIrrelevant or inappropriate comments might be edite d or removed.\nPlease note that your comments might be used in the  print edition of T ODAY . Home  Singapore  Scholarships for SIT's hospitality students\nOTHER SINGAPORE HEADLINES\nFun time for Lady Gaga fans\nRWS Credit de-registers itself\nDBSS under the microscope\nMCYS clears the air after foster\nparents gain support from netizens\nThe Graciousness Index\nSingaporeans 'could be more\ngracious'\nGPs now have guidelines to manage\ngambling disorders\nLearning hub and much more under\nnew NTU leadership\n'Workplace bonds make it\nworthwhile'\nA President who bows to populist\npressure is a 'great danger': Nathan\nMCYS picks up more homeless\nindividuals\n'Still a place for rote learning of\nMandarin'\nRelatives of late tycoon tussle over\nestate\nInstructor gets jail, caning for\nstatutory rape\nCourt of Three judges reserves\njudgment on lawyer's case\nToday's PDF Print Edition\nTuesday, July 05, 2011 Weather  33 / 26 °C\nToday Singapore Commentary Voices World Science Business Sports Gallery Sunday Columns New York Times - TODAY\nTEntertainment Design Health Tech & Digital Travel Wine & Dine Cars Style Things To Do Blogs\nSearch Stories\nLike Share\nFind us on Facebook\nTODAY\nLike\nEnter The Code\nOn The Right\nIf the code is unclear, click on it to\nget a new one. The code is case-\nsensitive. Don't leave spaces\nbetween the characters.\nSubmit\nCopyright ©2011 MediaCorp Press Ltd. All Rights Res erved 1. | Terms Of Use | Privacy Statement About T ODAY  | Contact T ODAY  | Sitemap\nKimberly\nLisa\nZhiy ing\nMcKay\nJacqueline\nXiuling\nMark\nStephanie\nC hia\nMelv in 9,228 people like TODAY .\nFacebook social plugin\nRecent Activity\nStef Tam  and 3 other friends shared A love\nmeasured in memories . · about 3 weeks ago\nWong Stephanie  shared Singling out singles . ·\nabout a month ago\nMCYS picks up more homeless\nindividuals\n100 people recommend this.\nThe perils of human trafficking hysteria\n108 people recommend this.\nBersih 2.0 is Najib's biggest challenge\n55 people recommend this.\nFacebook social plugin"
}