{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Student%20User%20Guide%20-%20Tuition%20Fee%20Loan%20Application%202017.pdf",
  "type": "pdf",
  "content": "Student Guide - Tuition Fee Loan Application 2017  Page 1 of 15\nStudent Guide for\nTuition Fee Loan Application\nStudent Guide - Tuition Fee Loan Application 2017  Page 2 of 15\nTable of Contents\n1 Apply for Tuition Fee Loan ......................................................................... 3\n1.1 Signing in.................................................................................................................. 3\n1.2 Navigating to the Page ............................................................................................. 4\n1.3 Starting New Application .......................................................................................... 5\n1.4 Dealing with Submitted Application ........................................................................ 10\n1.4.1 View Summary of Application ......................................................................................... 11\n1.4.2 Print Application Form .................................................................................................... 12\n1.4.3 Print Letter of Late Endorsement.................................................................................... 13\n1.4.4 Update Bank Submission Details ................................................................................... 14\nStudent Guide - Tuition Fee Loan Application 2017  Page 3 of 15\n1 Apply for Tuition Fee Loan\nPrerequisite : Only matriculated students will be able to apply for the Tuition Fee Loan. For international\nstudents, only those who apply for Tuition Grant are eligible to apply for the loan.\nBasic flow of the Tuition Fee Loan Application:\n1. Apply for Tuition Fee Loan through IN4SIT.\n2. Print the application form upon submission of application in IN4SIT.\n3. For late application, print and submit the letter of late endorsement along with the application form (to\nany DBS branch only).\n4. Submit the application form, letter of late endorsement (for late application), and all necessary\ndocumentation to the bank along with the guarantor for the loan.\n5. Upon successful application at the bank, update the bank submission details in IN4SIT to update that\nthe application has been completed.\n1.1 Signing in\nThe steps below are required to apply for Tuition Fee Loan:\n1. Open the browser (i.e. Internet Explorer)\n2. Type the URL of IN4SIT in the browser address box.\n3. Enter your login credentials, then click on Sign In button or press Enter key.\nNB: User ID and Password are case sensitive\n4. Successful sign in will redirect user to the homepage of IN4SIT.\nStudent Guide - Tuition Fee Loan Application 2017  Page 4 of 15\n1.2 Navigating to the Page\n1. Click on Financial Aid and Scholarships tile in the homepage of SIS.\n2. Financial Aid Application page will be displayed by default. This page is to apply for Financial Aid\nin SIS. To apply for Tuition Fee Loan, click on Loans Application on the sidebar menu of the page.\nStudent Guide - Tuition Fee Loan Application 2017  Page 5 of 15\n3. System will redirect user to the Loan Application page. By default, Tuition Fee Loan Application\npage will be displayed.\n1.3 Starting New Application\n1. Click on New Application  button on the bottom of the page.\n2. Students will see their personal particulars in the page. For Singapore Citizen and Singapore\nPermanent Resident, all values will be read only as it is coming from the system. However, for\nInternational Student, some fields are editable and require students to enter the necessary\ninformation, e.g.: Passport Information (as the identity number in applying for loan), Singapore\nAddress (Block/House No, Street Name, Floor No, Unit No), and Overseas Address (Overseas\nAddress 1, 2, 3, 4).\nField Name  Required?\n(Yes/No) Comments\nPassport Number  Yes Field to capture the passport number of the international student.\nPassport Expiry Date Yes Field to capture the expiry date of the passport.\nCountry Issuing Passport  Yes Field to capture the country issuing passport.\nStudent Guide - Tuition Fee Loan Application 2017  Page 6 of 15\nField Name Required?\n(Yes/No) Comments\nBlock/House No Yes Field to capture the block/house number of the Singapore Address\nwhere the international student stays.\nStreet Name No Field to capture the street name of the Singapore Address where the\ninternational student stays.\nFloor No Field to capture the floor number of the Singapore Address where the\ninternational student stays.\nUnit No No Field to capture the unit number of the Singapore Address where the\ninternational student stays.\nOverseas Address 1 Yes Field to capture the overseas home address of the international student.\nOverseas Address 2  No Field to capture the overseas home address  of the international\nstudent.\nOverseas Address 3 No Field to capture the overseas home address of the international\nstudent.\nOverseas Address 4  No Field to capture the overseas home address of the international\nstudent.\nSingapore Citizen and Permanent Resident page display\nStudent Guide - Tuition Fee Loan Application 2017  Page 7 of 15\nInternational Student page display\nVerify that all information displayed or entered are correct before continuing the application.\nIMPORTANT! If there are any discrepancies found in the student particulars, do not proceed with\nthe application. Instead, contact the Registrar Office to update your particulars prior to completing\nthe application.\nAfter verification is done, click on Next button to continue to the next step. A message box will be\ndisplayed to notify student about the particulars update to be made in Registrar Office.\nClick on OK button and system will redirect to the next step of the application.\n3. In this step, student will be required to choose the financing required needed under the Tuition Fee\nLoan. There are 4 options available in this page. Select the loan option you are intending to apply\nfor. For option ‘ Other Percentage ’, student is required to enter the percentage required which is\nnot in the other 3 options. The maximum limit is 90%.\nStudent Guide - Tuition Fee Loan Application 2017  Page 8 of 15\nUpon selection, click on Next button to continue to the third step.\n4. In this step, students will input the particulars of guarantor who will guarantee the tuition fee loan\nas below. Required fields are indicated with (*) symbol.\nField Name Required?\n(Yes/No) Comments\nName as in\nNRIC/Passport Yes Field to capture the Guarantor’s name.\nDate of Birth  Yes Field to capture the Guarantor’s Date of Birth\nMarital Status  Yes Field to capture the Guarantor’s Marital Status.\nResidency  Yes Field to capture the Guarantor’s residency.\nNRIC No. Yes Field to capture the Guarantor’s NRIC No. if the residency is Singapore Citizen or\nSingapore Permanent Resident.\nPassport No.  Yes Field to capture the Guarantor’s Passport No. if the residency  of the guarantor  is\nForeigner.\nPassport Expiry Date  Yes Field to capture the Guarantor’s Passport Expiry Date if the residency of the\nguarantor is Foreigner.\nCountry Issuing\nPassport Yes Field to capture the country Issuing  Passport if the residency  of the guarantor  is\nForeigner.\nCitizenship  Yes Field to capture the Guarantor’s citizenship.\nHome Tel No.  Yes Field to capture the Guarantor’s Home Tel No.  Student should provide either home\ntelephone or mobile phone number.\nMobile No.  Yes Field to capture the Guarantor’s Mobile No.  Student should provide either home\ntelephone or mobile phone number.\nAddress 1 Yes Field to capture the Guarantor’s Permanent Home Address\nAddress 2 No Field to capture the Guarantor’s Permanent Home Address\nAddress 3 No Field to capture the Guarantor’s Permanent Home Address\nAddress 4 No Field to capture the Guarantor’s Permanent Home Address\nEmail Address  No Field to capture the Guarantor’s Email Address\nRelationship to\nApplicant Yes Field to capture the Guarantor’s Relationship to Applicant\nOccupation  No Field to capture the Guarantor’s occupation\nStudent Guide - Tuition Fee Loan Application 2017  Page 9 of 15\nField Name  Required?\n(Yes/No) Comments\nOffice Tel No.  No Field to capture the Guarantor’s office telephone no.\nName of Employer  No Field to capture the Guarantor’s employer name\nAddress of Employer  No Field to capture the Guarantor’s employer address\nAre you an\nundischarged\nbankrupt? Yes Field to capture if the guarantor is an undischarged bankrupt.\nNbr of Student Loan\nGuaranteed Yes Field to capture if the number of student loan guaranteed by the guarantor\nName of Borrower Yes Field to capture name of other student that he/she is a guarantor to.\nName of Lender  Yes Field to capture name of lender that he/she is a guarantor to.\nType of Facility  Yes Field to capture the type of facility that he/she is a guarantor to\nAmount Guaranteed  Yes Field to capture amount guaranteed for the student stated in Name of Borrower\nUpon entering all the required information, click on Next button to continue.\n5. Students will need to verify the information from Step 1 to 3 in this page before submission. Please\nensure that all information are accurate because students are not allowed to update any information\nonce the application is submitted.\nStudent Guide - Tuition Fee Loan Application 2017  Page 10 of 15\nOnce the verification is done, click on Submit button. Click on Yes button when a confirmation\nprompt box appears in the page as below. This is the final step of applying Tuition Fee Loan through\nIN4SIT.\n1.4 Dealing with Submitted Application\nIf a student continues from section 2.3 above, by default, system will redirect to the Application\nSummary  page as below.\nFor students who have submitted the application but then sign out or move to any other page in the\nsystem, they can still access the Application Summary  page above by redoing the steps in section\n2.1 (if students have signed out from system) and section 2.2. For students who have submitted the\napplication in SIS, the display of page in section 2.2 step 3 will be different. It will be displayed as below.\nStudent Guide - Tuition Fee Loan Application 2017  Page 11 of 15\nClick on the row of existing application and it will redirect to the Application Summary  page again.\nUpon submission in the system, the initial application status will be ‘ Not Submitted to Bank’ . There\nare at least 4 statuses used for the Tuition Fee Loan application as below:\nStatus Description\nDraft Loan application is not submitted in IN4SIT yet. Student initiated the\napplication and only saved the application in SIS.\nNot Submitted to Bank  Loan application is submitted in IN4SIT, but not submitted to the bank\nyet.\nSubmitted to Bank Loan application has been successfully submitted to the bank and the\nbank submission details have been updated in IN4SIT.\nApproved by bank Loan application has been approved by bank.\nRejected Loan application has been rejected by SIT/bank.\nIn Application Summary  page, student can do the below items:\n View Summary for the Tuition Fee Loan Application\n Print the application form for submission to bank.\n Print the letter of late endorsement for submission to bank in case of late application.\n Update the bank submission details after successful submission to bank.\n1.4.1 View Summary of Application\nFor viewing the summary of the application, click on the ‘ View Summary ’ button in Application Details\nsection.\nStudent Guide - Tuition Fee Loan Application 2017  Page 12 of 15\nSystem will display all of information submitted during the application in the page. Basically it resembles\nthe Application Confirmation page (Step 4) or the last step before submission. User can click on ‘ Back’\nbutton to return to Application Summary  page.\n1.4.2 Print Application Form\nFor printing the application form, click on the ‘ Application Form ’ button in Print Forms section.\nStudent Guide - Tuition Fee Loan Application 2017  Page 13 of 15\nA PDF report will be generated to a new tab. Students can save it to their local computer or print it\ndirectly. This document will be submitted as hardcopy form to bank staff as part of the application itself.\n1.4.3 Print Letter of Late Endorsement\nFor printing of the Letter of Late Endorsement, click on the ‘ Letter of Late Endorsement ’ button in\nPrint Forms section.\nStudent Guide - Tuition Fee Loan Application 2017  Page 14 of 15\nA PDF report will be generated to a new tab. Students can save it to their local computer or print it\ndirectly. This document will be submitted as hardcopy form to bank staff as part of the application itself.\nThis form is only available for printing during the late application period.\n1.4.4 Update Bank Submission Details\nFor updating bank submission details, click on the ‘ Update Details’  button in Update Bank\nSubmission Details  section.\nStudent Guide - Tuition Fee Loan Application 2017  Page 15 of 15\nA subpage will be displayed, and students need to enter the bank branch information and the\nsubmission date. By default the bank displayed is only DBS Bank. System will also validate that the\nsubmission date should not be greater than the current date.\nUpon entering the required information, click on Save button. The Loan Application status will be\nupdated to ‘ Submitted to Bank ’. The Application Form, Letter of Late Endorsement, and Update\nDetails button will be disabled upon the status change.\nImportant! Once the bank submission detail is updated by student, the application form and letter of\nlate endorsement are no longer available for printing. Please be very careful NOT to update this\ninformation before you confirm that the submission to DBS has been completed."
}