{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/lianhe-zaobao-healthyandnutritiousmeals.pdf",
  "type": "pdf",
  "content": "气炸锅不加油，炸出来更健\n康？\n新型“脱糖”电饭锅让白饭的升糖指数（GI）变低？　　压力锅可以缩短烹调时间，煮出来的食物更容易消化？　　你或许听过上述说法，也可能留意到许多厨房家电最近都以“健康烹调”为号召。但要吃得健康，绝对不能单靠任何一种电器；无论哪一种厨房家电，在使用时也有各自须注意的地方，才不会给食物的营养价值扣分。　　食品科技讲师和营养师分享四种常见厨房家电（气炸锅、压力锅、电饭锅和微波炉）的优缺点，以及如何利用它们煮出健康美食。\n气炸锅：\n避免加工食品 注意烹调时间\n＋\n脂肪和热量较油炸食物低。\n＋比烘烤省时。\n－\u0007容易烧焦， 或产生致癌物质。\n相较于油炸，以气炸锅准备\n的菜肴无论脂肪或热量都较低，但并非所有气炸料理都对健康有益，关键在于食材选择和烹调时长。　　顾名思义，气炸锅是以“空气”取代热油，更准确地说，是锅内的空气加热后，食材在密闭的锅子里被急速循环的热空气煮熟。空气热流会脱除食材表层的水分，所以无需热油也有类似油炸的香脆口感。　　共和理工学院健康管理与推广学营养学讲师谢佩芬指出，气炸锅不是能把任何食物变得健康的“神奇锅”，气炸食物是否健康要视食材而定。“如果选择加工食物如鸡肉块和薯条，其脂肪和盐分都偏高。无论用哪一种方法烹煮，过度食用还是会提高患上慢性疾病的风险。”想用气炸锅做出健康料理，应该选择富含营养的食材如蔬菜、鲜鱼和脂肪含量低的肉类。　　　　此外，要避免过度烹煮。气炸锅的温度会在极短时间内升高，所以食物能更快地煮熟（烹调时间比烘烤短），但如果不够小心，便很容易烧焦，因而产生丙烯酰胺（acrylamide），这种致癌物质一般在超过120摄氏度的长时间高温烹调中产生。　　谢佩芬说：“无论是哪一种烹调方法，只要时间长，温度高，就会有增加有害物质的风险。”她建议先预热再气炸，偶尔取出炸篮轻轻摇晃，让食材煮得更均匀，亦可缩短烹调时间。\n电饭锅：\n减醣功能非必要 选对食材就能降GI\n＋\u0007\n容易使用又便利，可同时蒸\n煮配菜。\n－减醣功能未必显著。\n有些电饭锅标榜“减醣”，\n即蒸煮出来的米饭的碳水化合物含量，较传统电饭锅低。“醣”是所有产糖食物的通称，也就是“碳水化合物”，按照分子结构可分为纤维、多糖、寡糖、双糖、单糖，尝起来不一定具有甜味，例如饭、面。　　新加坡心脏基金营养师姚莲栗说，这类电饭锅的原理是以较多水煮饭，我们平时煮饭的米水重量比例是1 : 1.2，减醣饭锅用水的重量，往往是米的两三倍。水多了，淀粉溶于其中，饭的碳水化合物就少了。她说最近有一项研究报告显示，选择1 : 4的米水比例，并以减醣电饭锅煮饭，热量和碳水化合物会比以1 : 1.2的米水比例煮出来的饭少20%。此外，研究对象试吃两种饭后，饱足感大同小异。　　不过，根据香港消委会去年公布的测试报告，电饭锅的减醣效果并不明显。他们测试了香港11款减醣电饭锅，其中两款只有减醣模式，其余九款兼具正常及减醣模式。测试方法是用饭锅的正常和减醣模式各煮100克米饭，再做碳水化合物测试，结果发现减醣米饭的碳水化合物含量，只比“正常”米饭低4%左右；其中一款减醣米饭的碳水化合物含量，竟比“正常”米饭高。姚莲栗认为，我们必须了解减醣电饭锅没有统一标准，减醣功能按型号而异。　　 共和理工学院健康管理与推广学营养学讲师曾蕙莹认为，使用减醣电饭锅并非不可，但选购前应细读个别型号的顾客评论；要减醣可从其他方面着手，例如选择印度香米（basmati）或花椰菜“饭”（花椰菜打碎后煮熟，口感类似米饭）。“最重要是注意米饭分量，以及同一餐吃的其他食物的营养成分，例如脂肪会增加那一餐的热量。”\n米饭种类与配菜比饭锅重要\n必须注意的是，煮出来的饭即便减少碳水化合物，却未必给健康加分。姚莲栗指出，减醣米饭会如何影响身体的血糖反应，至今仍无临床研究。她认为低碳（low-carb）饮食开始引起兴趣，是因为人们相信可以借此预防慢性疾病如糖尿病。但她说：“身体的葡萄糖反应，不单取决于吃了多少碳水化合物和食物的升糖指数，也要看餐食中蛋白质、脂肪和膳食纤维的分量。”　　想减少每天摄取的碳水化合物，或降低餐食的升糖指数，可参考保健促进局和新加坡心脏基金的健康餐盘，即每餐有半盘分量的膳食纤维，全谷类和低脂类蛋白质则各占餐盘的四分之一，例如每餐可吃一碗（200克）的糙米或红米。姚莲栗说，除了控制分量，也要慎选米饭类，因为升糖指数会按加工程度而异，加工程度较低的糙米饭，升糖指数会比白饭低，而且营养较丰富。除了糙米和红米，小米（millet）也是不错选择，亦可考虑在白饭中掺入全谷类，可增加膳食纤维含量。　　此外，以低脂肉、鱼、豆腐、豆类和蔬菜搭配米饭，有助降低餐食的升糖指数，因为蛋白质、膳食纤维及健康脂肪（单元和多元不饱和脂肪）有助减缓血糖反应。\n用电饭锅做出均衡一餐\n电饭锅不只能煮米饭，姚莲栗建议在米饭中加入原型食材，例如菇类、豆类、蔬菜如红萝卜、西兰花、花椰菜和玉米，以及低脂蛋白质来源（例如去皮鸡肉），如此一来，单靠一个锅子便能轻松做出营养均衡的一餐。新加坡心脏基金官网上其中一个健康食谱，就是以电饭锅烹煮海鲜饭（myheart.org.sg/recipes/seafood-baked-rice/）。米饭亦可拌入其他全谷类，例如燕麦、藜麦（quinoa）、大麦和小米。　　不喜欢把所有材料混在一起？姚莲栗说：“一些电饭锅附有蒸盘，煮饭的同时可蒸煮蔬菜、鱼肉和木豆（dhal），可省去另外使用蒸炉的麻烦。”\n压力锅：\n保留食材水分和原味 应避免烹煮太久\n＋\n少调味亦美味。\n＋豆类和谷类更易消化。－\u0007高温烹煮或流失较多营养成\n分。\n液体的沸点会受气压影响，\n气压较高时，沸点随之提升，压力锅（又名高压锅）以这个物理现象为原理，把含水的密闭锅加热，让水变成蒸气，“无处可逃”的蒸气使锅内压力升高，水的沸点上升，水温即使超过100摄氏度也不会沸腾，如此便可缩短炖煮时间，提高烹调效率。　　姚莲栗说，压力锅有助保留食材水分和风味，因此不必另外加盐。此外，用压力锅煮熟的豆子和谷类更易消化，营养成分也较容易被人体吸收。　　高温烹煮会否流失更多营养成分？姚莲栗解释，只要温度有所上升，任何烹调过程中都会流失一些“不耐热”（heat-sensitive）的成分，例如蔬果富含的维生素C和叶酸（folate，又称维生素B9）。要保留更多维生素和矿物质，就要尽量缩短烹煮时间。　　新加坡理工大学食品科技课程领导王美云副教授指出，烹调过程中流失多少营养成分，要看温度和烹煮时间；高压烹调的温\n度虽较高但时间较短，因此未必会流失更多维生素C。此外，要看煮熟后是否迅速食用，等待时间越长，流失的营养成分越多。　　比起水煮（把食材放入沸腾的水），压力锅还有一个\n好处：更好地保留某些水溶性矿物质如钾（potassium）和磷（phosphorus）。共和理工学院健康管理与推广学营养学讲师陈彦霖解释，水煮过程一般较耗时，水溶性的营养成分也会流失到水中，除非喝下烹煮用的水，否则无法吸收这些营养。　　想避免流失营养成分，或保留食材的口感，可考虑蒸煮。陈彦霖说，蒸煮比水煮更能保留食材营养，例如水溶性维生素和矿物质，食材（特别是蔬菜）的颜色也比较不受影响，吃起来口感更好，不会太软烂。　　　　 陈彦霖强调：“说到营养成分的保留，每种烹调方式都有优缺点，最重要是避免煮得太久，因为烹煮时间越长流失的营养越多。比起水煮，高压烹煮可以相当快速且有效地把食物煮熟，同时不会流失太多养分。如果重视料理的卖相，蒸煮则是不错的选择。”\n微波炉：\n功能不限于加热 也能烹煮原型食材\n＋\n方便且容易使用。\n＋\u0007食材可迅速煮熟，比水煮更\n能保留营养成分。\n－\u0007只能用玻璃或适用于微波炉的塑料。\n微波炉常被误解，有人把微\n波炉和加工食品画上等号，也有人认为微波炉会让食物变得有放射性。其实，只要运用得当，微波炉可以用来烹煮原型食材，而且省时省力。市面上有不少微波料理的食谱，高纤维高蛋白的菜肴都能利用微波炉准备。　　王美云副教授认为，微波炉让人联想起辐射（radiation）和放射性，主要是“辐射”一词太广泛了。其实，辐射即任何通过电磁波的形式，从一个地方移动到另一个地方的能量，其中包括红外线（例如阳光）、X光、无线电、微波（microwaves，即波长介于红外线和无线电波之间的电磁波）和伽玛射线（gamma rays）。　　如果长期接触放射性物质如铀（uranium）所释放的伽玛射线，确实会影响健康，但微波炉所运用的微波只是让水分子振动产热，因此放入微波炉加热或煮熟的食物不会变得有放射性。　　不过，无论是加热或烹调，都要选择适用于微波炉的容器，材质必须是玻璃或指定可放入微波炉的塑料。王美云副教授建议，微波烹调所需时间比纯粹加热来得长，塑料变形或渗漏的风险较高，因此首选材质是玻璃。　　 微波料理一般不必耗费太多时间，以姚莲栗的建议为例，鸡胸肉大约5分钟就能煮熟（根据肉类重量和厚度调整时长），绿叶蔬菜如菠菜则只需3分钟；做法也不难，例如鸡蛋打散后加点牛奶和胡椒粉，就能用微波炉煮成一顿早餐。除了新鲜食材，亦可考虑冰冻蔬菜和豆类。　　 市面上也有适合放入微波炉的即食糙米包和红米包。姚莲栗举例，罐头水渍或橄榄油渍吞拿鱼加入冰冻毛豆或其他蔬菜放入微波炉煮熟，搭配加热后的糙米餐包或红米餐包，就是包含蛋白质、复合碳水化合物和纤维，营养均衡的一餐。\n气炸锅、压力锅、电饭锅、微波炉等，现代不少厨房家电都以“健康烹调”为号召。这些家电真的能让餐食更健康、有营养吗？营养师和食品科技讲师\n分析个别家电的利弊并提供实用建议，让大家学会善用厨房电器，以更轻松、省时的方式煮出营养美味的家庭料理。yingzhen@sph.com.sg 陈映蓁／报道\n要吃得营养健康，不能单靠任何一种标榜“健康烹调”的家电，\n关键是食材的选择和搭配。（iStock图片）\n巧用厨房家电\n在米饭中加入原型食材，例如菇类、豆类、蔬菜和低脂蛋白质来源，\n就能以一个锅子轻松做出营养均衡的一餐。（iStock图片）新加坡心脏基金营养师姚莲栗：以低脂肉、鱼、豆腐、豆类和蔬菜搭配米饭，有助降低餐食的升糖指数。（受访者提供）共和理工学院营养学讲师谢佩芬 ：气 炸 食 物 是否健康要看食材本身。 （ 档案图 ）不用开火，用微波炉也能煮熟原型食材。（iStock图片）\n压力锅有助保留食材风味，但要尽量缩短烹煮时间，以免流失“不耐热”的维生素和矿物质。（iStock图片）营养美味在 间按钮按钮\nPublication: Lianhe Zaobao\nDate: 12 April 2023\nHeadline: Using kitchen appliances to\nproduce healthy and nutritious meals\nSource: Lianhe Zaobao © SPH Media Limited. Reproduced with permission."
}