{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2025-04/FAQ_Matriculation%20Exercise_2025_1.pdf",
  "type": "pdf",
  "content": "SINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667\nPage 1 of 14\nSIT Restricted\nBy Registrar’s Office\nSingapore Institute of Technology\nFREQUENTLY\nASKED\nQUESTIONS\nAY202 5/202 6\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667\nPage 2 of 14\nSIT Restricted\nDear Learner ,\nA warm welcome to SIT !\nTo help all learners  kick start the matriculation process, Registrar’s Office has\ncollated some Frequently Asked Questions (FAQ s). For queries not in the FAQs,\nplease write to matriculation@singaporetech.edu.sg .\nThank you.\nThe FAQ is broadly divided into the following sections :\n(Click on the links below to access)\nA. Important Dates & Deadlines        3-4\nB. Matriculation Exercise        4\nC. Online Declaration & Document Submission     5\nD. Online Photo Submission        5-6\nE. SIT Medical Examination        6-7\nF. Tuition Grant /Subsidy  Related Matters      8-10\nG. IT Related Matters         11\nH. Payment & Fee Related Matters       12\nI. SIT Student Card  & Concession Card      12\nJ. Transfer of Credits & Module Registration     13-14\nOVERVIEW\nWelcome Message\nPage  Sections\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667\nPage 3 of 14\nSIT Restricted\nQuestion 1: What are the important dates for SIT’s A cademic Year (AY) 202 5\nMatriculation Exercise?\nSubmission Deadline\nEarly Admissions Exercise (EAE)  23 April  2025\nCulinary Institute of America (CIA)  30 May 2025\nHSS and all other Programmes  30 June 2025\nCSM Pathway Degree  31 March 2025\nFor Financial Assistance application/deadlines by other sections, please refer to the\n“Matriculation Guide ”.\nQuestion 2: I will not be in Singapore during the matriculation period . How\ncan I complete the matriculation process?\nOther than the Medical Examination , the rest of the matriculation process can be done\nonline as you do not have to be physically present in Singapore. If you are not able to\ncomplete the Medical Examination  within the stipulated deadline, please write to\nmatriculation@singaporetech.edu.sg  to request for an extension of deadline  and approval\nfrom your Programme Leader is required.\nQuestion 3: I overlooked the deadlines. Can I get an extension?\nPlease write to matriculation@singaporetech.edu.sg  to request for an extension of\ndeadline.  Be aware that any delay in the matriculation process may result in a delay in the\nprocessing of your documents and matriculation, which could impact your ability to start\nthe new programme on time.\nA. IMPORTANT DATES & DEADLINES\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667\nPage 4 of 14\nSIT Restricted\nQuestion 4: I am waiting for my appeal to be processed. Do I still proceed to\nsubmit  the documents and complete  the medical check -up within the\nstipulated deadline?\nIf you wish to proceed with the programme that has already been offered to you, we\nrecommend that you continue with the matriculation process, including submitting the\nrequired documents and completing the medical examination  within the stipulated\ndeadline. This will ensure that you do not miss the important deadlines for matriculation.\nHowever, if you are still waiting for the results of your appeal and intend to switch to the\nnew programme once the appeal outcome is received , please note that you will nee d to\nwait for a formal notification from the Admissions office. Be aware that any delay in the\nmatriculation process may result in a delay in the processing of your documents and\nmatriculation, which could impact your ability to start the new programme on time.\nQuestion 1: Now that I have received the e -Matriculation Package, what do I\ndo next ?\nOnce you have received th e e-Matriculation Package you can proceed to complete the\nadministrative procedures to matriculate as an SIT student. For further information on the\nmatriculation exercise please refer to the Matriculation Guide .\nQuestion 2: I tried to lo g in to the Learner Portal using the credentials\nprovided in the matriculation email , but was not able to do so.  What should I\ndo?\nRemember to re set the password before accessing the Learner Portal to complete\nMatriculation . Log in to the SIT Self -Service Portal  using the username and password\nprovided in the matriculation email.\nQuestion 3: I would like to withdraw from the University  before the start of the\nprogramme . What should I do?\nFor all withdrawal requests, please write to matriculation@singaporetech.edu.sg .\nNote to CSM Pathway Degree Learners:\nPlease indicate <CSM Enquiries>  in your email subject the reason for which you are\nwriting in.\nB. MATRICULATION EXERCISE\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667\nPage 5 of 14\nSIT Restricted\nQuestion 1: I have made an error in my declaration , can I change my online\ndeclaration  after I have submitted ?\nYou will not be able to amend the content after submission.  The matriculation officer will\nhave to assist you with this . Please write to matriculation@singaporetech.edu.sg .\nQuestion 2: I am below 18 years old , do I need to complete the  declaration\nlike Undertaking Form , Code of Conduct and Indemnity Form ?\nIf you are below 18 years old, you will need  to download and  complete the  declaration\nform , attach a copy of your birth certificate and a copy of your parent/ guardian’s NRIC (front\nand back) during submission  in the Learner Portal ).\nIf you are above 18  years old  and above, you are only required to complete the online\ndeclaration as reflected in the online matriculation form.\nQuestion 3: The personal particulars shown on the online matriculation form\nis wrong, how do I change it?\nPlease write  to Matriculation@SingaporeTech.edu.sg  with the change (s) required along\nwith the supporting documents , if available .\nQuestion 1: What are the photo requirements?\nThe photo requirements  for the online photo submission  are listed on the photo submission\npage .\nQuestion 2: Will I be notified of the status of my photo submission?\nPlease check the status by logging into Learner Portal one week after  your  photo\nsubmission. You will be required to re -submit the photo if it does not meet the requirements\nfor printing of your SIT Student  Card , an email notification will be sent to your SIT Student\nEmail .\nD. ONLINE PHOTO SUBMISSION  C. ONLINE DECLARATION & DOCUMENT SUBMISSION\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667\nPage 6 of 14\nSIT Restricted\nQuestion 3: Can I change my photo after it has been approved?\nOnce the photo has been approved, it cannot be changed.  Do take note to  submit a re cent\nphoto taken within the last three months adhering  to the photo requirements .\nQuestion 1: Which are the appointed medical providers by SIT, and what are\nthe packages for the SIT Medical Examination?\nDetails on the SIT appointed healthcare provider can be found on:\nMatriculation homepage > Programme -Specific Documents > Clinic Information Kit\nQuestion 2: Is it compulsory to go to the appointed medical provider(s)  for my\nSIT Medical Examination?\nStudents are strongly advised to go to our designated medical provider(s) for their SIT\nMedical Examination  as we have worked out special preferential  rates with the clinic (s) for\nSIT students . Our designated medical provider(s)  will also ensure that the screening is\ncompleted according to the programme requirements and that  the softcopies of the\nmedical reports are sent to SIT  directly .\nQuestion 3: What should I bring for the Medical Examination?\nPlease  bring the following documents:\n1. SIT Medical Examination Form downloaded from Learner Portal  (To be printed on\nsingle side).\n2. NRIC/Passport or Student Pass\n3. Immunisation records/Vaccination history (Applicable to Allied Health programmes,\nrefer the Matriculation Guide  for details)\n4. ICA Medical Examination Form (Applicable to International Student s Only)\n5. Any other document (s) that may be specific to your programme ( Please refer to the\nMatriculation Guide )\nQuestion  4: Where should I submit the completed SIT Examination Form?\nIf you go to our designated medical provider(s) for the SIT Medical Examination , softcopy\nof your medical report will be sent to us through the appointed provider, hence you will not\nneed to make any submission. Howe ver, learners who opted for their own preferred clinic\nwill be required to upload the completed medical form in the Learner Portal (Please refer\nto the Matriculation Guide ). E. SIT MEDICAL EXAMINATION\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667\nPage 7 of 14\nSIT Restricted\nQuestion 5: May I have a copy of my medical examination form?\nYes, all hardcopy medical forms and reports can be collected back from the clinic directly\nby you.\nQuestion 6: I have had a Hepatitis B  (Hep B) / Varicella (Chickenpox )\nvaccination. Do I still need to do a screening?\nHep B  (even if you had the vaccination for Hep B)  and Tuberculosis (TB)  screening s are\ncompulsory . If you have been vaccinated for Measles, Mumps, Rubella  (MMR)  and\nChickenpox, you are required to provide a proof of vaccination . If you are unable to show\na valid document to prove  your vaccination, you are required to do the screening  for\nimmunity .\nQuestion 7: Can International Students undergo just one medical\nexamination?\nThe SIT Medical Examination is mandatory for all successful applicants admitted to SIT,\nregardless of whether they are Local or International students.\nInternational students may choose to undergo a single Medical Examination that fulfils\nthe requirements for both SIT and Student Pass. For this, the medical practitioner will\nhave to complete two forms, i.e., the SIT Matriculation Medical Examination form and the\nICA medical report form. This service is available at the appointed medical provider(s).\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667\nPage 8 of 14\nSIT Restricted\nQuestion 1: Am I eligible to apply for the Tuition Grant /Subsidy  Scheme ?\nThe Ministry of Education (MOE ) Tuition Grant  (TG)  is a grant provided by the Government\nof Singapore to help students manage the costs of Full-Time tertiary education in\nSingapore. Eligible Singapore Citizens, Permanent Residents and International students\nenrolled in Full-Time undergraduate courses at SIT may be eligible .\nYou are eligible to apply for the TG if you have not previously taken a TG or received\nsponsorship/scholarship from the Government of Singapore to attain another qualification\nat an equal or higher level.\nFor eligible Singapore Citizens:\nSingapore Citizens will automatically be awarded a Tier A TG, which is the highest level of\ntuition fee subsidy, upon commencement of their studies. As a result, Singapore Citizens\npay the lowest tuition fees. There is no bond obligation for Singapore Citizens who receive\nthe TG.\nFor eligible Singapore Permanent Residents  (PR):\nPermanent Residents may choose to apply for a Tier B TG only, as part of their online\nuniversity admission application. Successful applicants are required to work for a Singapore\nentity for 3 years upon graduation.\nFor eligible International Students  (IS):\nInternational students m ay choose to apply for a Tier C TG only, as part of their online\nuniversity admission application. There is a limited number of Tuition Grants available for\ninternational students, and selection is competitive and based on merit. Successful\napplicants are required to work for a Singapore e ntity for 3 years upon graduation.\nTo find out more about the MOE Tuition Grant Scheme, please refer to:  Tuition Grant\nScheme | MOE .\nF.   TUITION GRANT /SUBSIDY  RELATED MATTERS\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667\nPage 9 of 14\nSIT Restricted\nMOE Subsidy (Applicable for CSM Pathway Degree Learners) :\nCSM Pathway  Degree  learners kindly note that to be eligible for MOE tuition fee subsidy,\n• You must be Singapore Citizen or Singapore Permanent Resident;\n• You must not have previously received a government subsidy/sponsorship for an\nundergraduate degree or higher qualification (local or overseas), i.e. from\nSIT/NTU/NUS/SUSS/SUTD/SMU or from overseas universities funded by\ngovernment scholarship/bursary;\n• You must be at least 21 years of age;\n• You must have either 2 years of full -time work experience or are currently employed\non a full -time basis;\n• If you are a Singapore Citizen or Singapore Permanent Resident who have fully\ndischarged your full -time NS liability, you may  be considered to have fulfilled the 2 -\nyear work experience requirement, even if the duration of your full -time NS is less\nthan 2 years.\nYou can be exempted from the age and work experience eligibility criteria if you are:\n• Sponsored by your company for the Part -Time undergraduate programme; or\n• Currently employed in a job role/sector related to the Part -Time undergraduate\nprogramme\nNotwithstanding the above exemptions, you must fully discharge your full -time NS liability\nbefore you are eligible for admission and tuition fee subsidy.\nAs CSM Pathway Degree  learners, if you are eligible for the MOE subsidy, no further\napplication is required.\nYou may click here  to check if you are eligible to receive the MOE subsidy.\nQuestion 2: I am an undergraduate student from another Autonomous\nUniversity, will I still be eligible for TG/Subsidy  if I transfer to another full -time\nundergraduate degree programme in SIT?\nSingapore Citizen s, Permanent Residents and International students who have received\nTG/Subsidy  for studies in degree programmes at NUS, NTU, SIT, SMU, SUTD, SUSS,\nLASALLE or NAFA will be eligible for TG/Subsidy  up to total credits required for graduation\nat SIT minus  the percentage of semesters or trimesters of TG/Subsidy received at your\neducational institution(s) .\nFor example, if you have studied and received TG/Subsidy for 4 out of 8 semesters before\ntransferring to SIT, upon transfer to an SIT programme of 180 credits, you will be eligible to\n50% (4/8 semesters) of the total credits required for graduation. Hence, you will receive\nTG/Subsidy for 90 credits out of 180 credits taken in SIT.\nFor CSM Pathway Degree learners,  you may click here  to check if you are eligible to receive\nthe MOE subsidy.\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667\nPage 10 of 14\nSIT Restricted\nQuestion 3: How do PR and IS students apply for TG/subsidy  and what are the\nobligations of PR and IS students who have been offered and accepted Tuition\nGrant /Subsidy  for their studies ?\nTo receive the TG, PR and IS students are required to complete  the following:\na) Login to MOE’s Tuition Grant portal at the stipulated period .\nb) Sign the Tuition Grant Agreement with the Government of Singapore after\nmatriculation. You are required to have two sureties to sign the Tuition Grant\nAgreement and they must be above 21 and below 65 years of age and must not be\nundischarged bankrupt .\nc) Secure employment and serve in a Singapore entity for 3 years upon graduation.\nd) You and your sur ety will be liable for liquidated damages if you withdr aw from your\ndegree programme.\nFor CSM Pathway Degree learners,  you may click here  to check if you are eligible to receive\nthe MOE subsidy.\nQuestion 4: What will happen if I am not eligible for TG/Subsidy , did not apply\nfor Tuition Grant /Subsidy  or did not accept Tuition Grant / Subsidy  for my\nstudies?\nYou will pay non -subsidised fees for your studies.\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667\nPage 11 of 14\nSIT Restricted\nQuestion 1: I received an SMS mentioning that the Matriculation e -package\nhas been sent to my email, however, I have not received the email yet.\nPlease allow some time for the email to reach you. You may wish to check your junk mail\nfolder, as the email may have gone there.  If you still do receive the email within an hour,\nplease write to matriculation@singaporetech.edu.sg  with your Full Name and Application\nID for us to rectify the issue.\nQuestion 2: I am not able to login to the  SIT Self-Service Portal , login username\nand/or password is incorrect .\nYou may write to ITHelpdesk at IThelpdesk@singaporetech.edu.sg  to assist you.\nAlternatively, you may call them directly at their hotline 6592 8511 followed by Option 3.\nQuestion 3: How can I connect to SIT VPN?\nPlease refer to the VPN User Guide downloaded from Student Intranet > Guides & Policies\n> Global Protect VPN Software & Guide\nAlternatively, you may call ITHelpdesk directly at their hotline 6592 8511 followed by\nOption 3, or write to IThelpdesk@singaporetech.edu.sg .\nIf you still encounter the login issue, please write to matriculation@singaporetech.edu.sg .\nG.   IT RELATED MATTERS\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667\nPage 12 of 14\nSIT Restricted\nQuestion 1: I have completed my Matriculation exercise and made the\npayment of S$54.50, I am now withdrawing from SIT due to some\nunforeseen circumstances would the S$54.50 be refunded to me?\nNo, the matriculation fee of S$54.50 (inclusive of 9% GST)  is non -refundabl e.\nQuestion 2: Will I be charged the trimester/ semester fees if I withdraw during\nthe matriculation period?\nNo, you will not  during this period . However, kindly note that you will be billed the  1st\ntrimester/ semester tuition fee if you withdraw after Week 2 of the  trimester/ semester.\nQuestion 1: I have missed the collection for my SIT Student  card was  not able\nto come to collect the SIT student  card on the stipulated date.\nYou will receive an email on the collection details for uncollected Student Card 3 -4 weeks\nafter the main exercise  via your SIT Student Email .\nQuestion 2:  I cannot go down in person to collect my SIT S tudent  card. Can I\nsend a representative?\nYes, a representative can collect your student card on your behalf. The representative will\nneed to bring his/ her identification card, a copy of your identification card, and an\nauthorisation letter signed by you.\nQuestion 3: Is the concession card by default applied for all SIT students?\nNo, students need to initiate the application by applying online  SimplyGo website .\nFor CSM Pathway Degree learners, are working adults and not eligible to apply for the travel\nconcession card.\nH.   PAYMENT & FEE RELATED MATTERS\nI.   SIT STUDENT  CARD & CONCESSION CARD\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667\nPage 13 of 14\nSIT Restricted\nQuestion 1: When can I start applying for the Transfer of Credits? How can I\napply?\nTransfer of Credits application period for newly matriculated students will be in early to\nmid-July (as indicated in the Matriculation Guide ) and it is open only once  to students in\ntheir studies at SIT.\nPlease check the Important Announcements on the Student Intranet and email notification\nfrom the Registrar’s Office for the exact dates of the Transfer of Credits schedule.\nIf you are eligible to apply, please refer to the IN4SIT Transfer of Credits Guide  on how to\nsubmit the application in IN4SIT. To access IN4SIT Transfer of Credits Guide, please l ogin to\nStudent Intranet  > Policies and Guides > IT & System Guides > IN4SIT Transfer of Credits\nGuide .\nQuestion 2: I missed the Transfer of Credits application period. Can I still\napply?\nYou will not be able to apply after the Transfer of Credits application period  is over .\nQuestion 3: When can I start registering for modules? How can I apply?\nThe Module Registration period is normally open in early to mid-August  for newly\nmatriculated students . However, for most of SIT programmes, SIT will pre -allocate or\nregister the modules on your behalf.  For other programmes that require students to\nregister for modules, you will receive a notification email to log into IN4SIT to check your\nscheduled module registrat ion date and time.  For more information, please look out under\nthe Important Announcements o n the Student Intranet to find if your programme r equires\nyou to enrol your modules.\nFor students who are registering you r modules , please refer to the IN4SIT Module\nRegistration User Guide for the step -by-step instructions.  To access IN4SIT Module\nRegistration User Guide , please l ogin to Student Intranet  > Policies and Guides > IT &\nSystem Guides > IN4SIT Module Registration  Guide .\nCSM Pathway Degree learners  will receive information through email on the application of\nRecognition of Prior Learning & Micro -Credential enrolment.  J.   TRANSFER OF CREDITS & MODULE REGISTRATION\nSINGAPORE INSTITUTE OF TECHNOLOGY                      1 PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667\nPage 14 of 14\nSIT Restricted\nQuestion 4: I missed the module registration during the Module Registration\nperiod. Can I still register?\nYes, the next available period for enrolment is during the Add/Drop period, which starts on\nthe first Tuesday  (in Week 1)  till the second Sunday  (Week 2)  of the new trimester. Students\ncan make final changes to their personalised class timetable during the Add/Drop period.\nFor students whose modules are pre -registered by the University, they will need to seek\nadvice from their Programme Leaders or Academic Programme Admin istration , if they want\nto Add/Drop modules during the Add/Drop period.  The billing of tuition fees will be\nfinalised based on the modules registered at the end of Add/Drop period.\nPlease note that the Add/Drop period is not applicable to new students in their first\ntrimester at SIT.\nQuestion 5: My programme doesn’t require me to do self -service module\nregistration. Do I still need to check my registered modules?\nYes, every student is responsible for his/her registered modules. Please log into IN4SIT and\nnavigate to Course Management > View My Classes to view your scheduled classes. You\nmay refer to the Module Registration User Guide  for the step -by-step instructions.  The billing\nof tuition fees will be finalised based on the modules registered at the end of Add/Drop\nperiod.\nQuestion 6: Can I withdraw from individual modules /micro -credentials  after\nthe Add/Drop period has ended?\nYes, you may submit a Module/ Course Withdrawal Request between Week 3 and Week 7.\nAfter Week 7, applications will not be accepted. Log into IN4SIT and navigate to  Course\nManagement > Enrolment > Course Withdrawal Request. You may refer to the Module\nRegistration User Guide  for the step -by-step instructions.\nDo note that a pproved Course Withdrawal Request applications will receive a “Withdrawn”\n(W) grade  and student will still be liable for the tuition fee charg ed as they are withdrawn\nafter the end of the Add/Drop period . In addition, you will be billed for these registered\nmodules when you register for the withdrawn modules again in the future.\nNotwithstanding this, during self -service module registration and Add/Drop period, you\nare free to add or drop classes without any financial penalty or W grade records. Please\nnote that the Add/Drop period is not applicable to new students in their first t rimester at\nSIT."
}