{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Nurturing%20Women%20Leaders.pdf",
  "type": "pdf",
  "content": "Thanks to an endowed gift of $1 million from the Kewalram\nChanrai Group, three undergraduates at the Singapore Institute of Technology (SIT) are being supported by the Kewalram Chanrai Group Scholarship in the current Academic Year of 2016/17. From AY 2017/18 onwards, this transformative scholarship (which is valued at $15,000 each) will support up to five undergraduates each academic year.\nThe Kewalram Chanrai Group Scholarship is also special in that it was created to nurture talented women undergraduates who\nhave demonstrated both academic and leadership excellence.\nIn recognition of the substantive support, Prof Tan Thiam\nSoon, President, SIT – along with Prof Loh Han Tong, Deputy President (Academic) & Provost, SIT; as well as SIT faculty, staff, and students – hosted Kewalram Chanrai Group Chairman Mr Narain Girdhar Chanrai to an appreciation lunch at the SIT@Dover campus on 22 Sept 2016.\nOn this special occasion, Mr Chanrai urged the students to\nrise to the challenges of a very volatile age, especially those moments in life when confronted with a change that was not anticipated. He said, “Yet, you take advantage of these opportunities; these are the moments that define you and your character.”\nAmong the scholarship recipients was Ms Tee Xin Ying, who\nis doing her Bachelor of Arts (Hons) in Criminology and Security. She thanked Mr Chanrai for helping her to relieve the financial burden on her family and bringing her one step closer to her dream of becoming an educator.\nThe Kewalram Chanrai Group is committed to making the\nworld a better place by enhancing and improving the lives of communities through healthcare and education for the underprivileged.SiTIZEN  |  09/12\nKewalram Chanrai Group Scholarship recipients (from left) Ms Lim Pei Shan,\nMs Elaine Yeow Yee Ling, and Ms Tee Xin Ying, bidding thanks and farewell to\nMr Narain Girdhar Chanrai.\nThe Khoo Chwee Neo Foundation has a mission that is\nbeautifully but simply expressed: It aims to “put God’s love into action by creating lasting solutions to poverty and social injustice”. It was set up in 2014 by Ms Peggy Goh in honour of her late mother, Madam Khoo Chwee Neo.\nOn 16 Sept 2016, Ms Goh and Mr William Chua, the\nFoundation’s Executive Director, were treated to an appreciation lunch by the Singapore Institute of Technology (SIT) at the SIT@Dover campus. In his welcoming address, Prof Tan Thiam Soon, President, SIT, thanked the Foundation for its endowed gift of $1 million to SIT to offer greater promise and more possibilities for SIT students.\nThis gift from the Foundation made possible the Khoo\nChwee Neo Foundation Bursary, which has been awarded to six undergraduates this Academic Year (AY 2016/17). From AY 2017/18 onwards, the Bursary will be able to support up to 15 undergraduates each academic year. Valued at $5,000 or $10,000 each depending on student need, this is one of the more generous bursaries for financially disadvantaged students at SIT.\nThat afternoon, Ms Goh and Mr Chua also got to see an\nexample of student volunteerism at SIT. Ms Suhaila binte Zainal Shah, a second-year undergraduate and President of SIT’s Project Cambodia, gave a short presentation on how she and her fellow SITizens had built a new function room cum library and renovated the kitchen at the Project Khmer (H.O.P .E.) Trang centre. The centre provides education and meals to more than 300 poor Cambodian children every year. Ms Goh told SITizen, “My mother was always reminding me that I should give to the poor and needy and take care of them. This Foundation in her name has programmes to provide care for the physical and emotional needs of the elderly poor, and to provide access to education for underprivileged children and those with special needs.”\n“We hope the Khoo Chwee Neo Foundation Bursary at SIT\nwill level the playing field for undergraduates who need the financial support to complete their education, and make it possible for them to build a better future for themselves and their families,” she also said.\nThe Khoo Chwee Neo Foundation, founded on a daughter’s\nlove for her mother, now nurtures SIT students with an endowed bursary fund Putting Love into\nPhilanthropy Nurturing Women Leaders for the Future\nMr Narain Girdhar Chanrai, who made possible the Kewalram Chanrai Group Scholarship at SIT to nurture talented\nwomen undergraduates, urges them to take advantage of unanticipated changes in a volatile age\n(From left) Ms Peggy Goh, Chairman, Khoo Chwee Neo Foundation, and Prof Tan\nThiam Soon, President, SIT sharing a lighthearted moment."
}