{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Inspiring%20SITizens%20the%20Kongsi%20Way_0.pdf",
  "type": "pdf",
  "content": "Inspiring SITizens the ‘Kongsi’ Way\nOn the afternoon of 8 November 2017, 40 SIT undergraduates\ngathered at the Auditorium Foyer at SIT@Dover campus\nto welcome some special guests for an appreciation lunch\nhosted by Prof Tan Thiam Soon, President, SIT. These were representatives from the 44th Committee of Management of\nThe Ngee Ann Kongsi including its President, Mr Richard Lee.\nThe 40 SIT students were those who had been selected to be\nthe first of The Ngee Ann Kongsi scholars.\nAlso attending the lunch that day were Prof Loh Han Tong,\nDeputy President (Academic) & Provost, SIT, faculty and staff of\nSIT, as well as staff from The Ngee Ann Kongsi.\nThe Ngee Ann Kongsi’s generous philanthropic commitment\nto SIT amounting to more than $800,000 annually makes\npossible The Ngee Ann Kongsi Scholarship as well as The\nNgee Ann Kongsi Gold Medal (For The Most Outstanding Graduating Student). As many as 40 Scholarships will be\nawarded annually to academically promising students from\nthis Academic Year 2017/18 onwards, whereas one Gold\nMedal will be awarded annually to the most outstanding\ngraduating student from each cohort.\nAt the lunch, the Ngee Ann Kongsi scholars had a chance\nto get to know more about The Ngee Ann Kongsi and its members. One of the scholarship recipients, Mr Lou Hong\nYeow who is a first-year Physiotherapy student, was very\ninspired by the conversation he had during lunch with one of the members of the 44th Committee of Management of The\nNgee Ann Kongsi. He said, “Mr Chua Huan Theng shared a\nlot about his experiences as a young man in Japan to further his studies and gave his advice to find something that you\nlove to do.”\nCertificates were also presented to the 40 scholarship\nrecipients by representatives from The Ngee Ann Kongsi’s\nEducation/Scholarships & Bursaries Sub-Committee.\nMs Ng Xin Rong, a first-year Occupational Therapy student\nwho spoke at the lunch, said, “Being one of The Ngee Ann\nKongsi Scholars has motivated me to work even harder\ntowards my goals and aspirations as it makes me push myself beyond my own expectations to find out what my limits are.”\nShe added, “It also gives me a chance to explore and try out\nnew things to develop myself fully.”\nFormed in 1845, The Ngee Ann Kongsi is a non-profit body\nwhich funds educational and other charitable projects with revenue generated from its ventures such as the landmark\nNgee Ann City shopping and office complex on Orchard\nRoad.\nMr Tan Ter Lun, Vice-Chairman, Education/Scholarships & Bursaries Sub-Committee\n(left) speaking to Prof Loh Han Tong, Deputy President (Academic) & Provost, SIT.Prof Tan Thiam Soon, President, SIT (left), with Mr Jamie Teo, Vice-President, 44th Committee of Management, The Ngee Ann Kongsi. SiTIZEN  |  06/16\nGuests from The Ngee Ann Kongsi were especially intrigued by the Anatomage Table, an advanced anatomy visualization system for anatomy education. The Ngee Ann Kongsi Scholarship recipient, Mr Lou Hong Yeow (with hand on table) was one of the students who helped to demonstrate how this tool enhanced their learning.Generous annual philanthropic gifts from The Ngee\nAnn Kongsi will allow SIT to award 40 Scholarships\nand one Gold Medal each academic year\nSome of the scholars with members of the 44th Committee of Management of The Ngee Ann Kongsi and SIT Senior\nManagement.One of The Ngee Ann Kongsi\nscholars, Ms Tan Yan Ni, showing off\nher award-winning wushu skills to the\naudience.\nThe Ngee Ann Kongsi Scholars introducing themselves to Mr\nRichard Lee, President, 44th Committee of Management, The Ngee Ann Kongsi (right) before the lunch.\nProf Tan Thiam Soon, President, SIT (left), receiving the cheque from Mr Richard Lee,\nPresident, 44th Committee of Management, The Ngee Ann Kongsi.Mr Goh Kim Hock, Chairman, Education/Scholarships & Bursaries Sub-Committee, The Ngee Ann Kongsi, reminding the students to study hard as they say\ngoodbye.\nProf Tan Thiam Soon (middle) bidding farewell to (from left) Mr Jamie Teo,\nMr Suntianto,  Mr Tan Kien Lip, Mr Tan Ter Lun, Mr Chua Huan Theng and Mr Lie Kee Pong after the tour of SIT@Dover campus.Mr Tan Shui Yuan (right) receiving his scholarship\ncertificate from Mr Yeo Boon Hon, Vice-\nChairman, Education/Scholarships & Bursaries\nSub-Committee, The Ngee Ann Kongsi.\nMr Lie Kee Pong, Member of the 44th Committee of Management of The Ngee Ann Kongsi (middle) speaking to scholarship recipient Ms Cheryl Lim (right) and Assoc\nProf Jeanette Ng, Cluster Director, SIT.SiTIZEN  |  07/16\nMr Chua Huan Theng (right) of The Ngee Ann Kongsi speaking with Mr Lou Hong\nYeow during lunch."
}