{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-06/20240624_ZB_Developing%20safer%20and%20more%20environmentally%20friendly%20electric%20vehicle%20batteries.pdf",
  "type": "pdf",
  "content": "你可能已经注意到，有越来越多电\n动车（electric vehicles，简称EV）在新加\n坡公路上行驶。单是去年，电动车就占\n本地新车注册量近两成，几乎是2022年\n12%的一倍，由此可见，电动车在全球日\n益受欢迎。\n根据新加坡绿色发展蓝图，我国\n将从2030年起停止为内燃式引擎车辆注\n册，并在2040年之前，逐步汰换本地各\n类内燃式引擎车辆，以便在2050年前实现净零碳排放的目\n标。政府估计，如果本地所有轻型车辆都使用电力驱动，\n新加坡的排放量可减少约4%。\n然而，人们对电动车的安全性和可持续性仍存有顾\n虑，这可能会对这项转型造成阻碍。人们的顾虑主要集中\n在电动车最重要的部件——电池。为了鼓励更多人使用电\n动车，我们应该把重点放在研发更安全、更环保的电动车\n电池上，比如在材料和设计上进行创新，并利用科技来加\n强电动车电池的测试和回收工作。\n加强电动车电池的安全性\n虽然电动车电池起火事件偶尔会登上媒体头条，但统\n计数据显示，这种风险被夸大了。事实上，内燃式引擎车\n更容易起火。一份根据全球数据统计的报告显示，内燃式\n引擎车起火的风险比电动车要高出80倍。\n尽管如此，必须指出的是，大多数电动车所使用的锂\n离子电池起火后，要灭火恐怕会比汽油起火难得多。起火\n的锂离子电池须要用更多的水来扑灭，会释放出更多有毒\n气体，而且有可能在扑灭后复燃。\n提高电动车电池安全性的方法之一，是探讨如何研发\n出更安全的替代品，以取代使用易燃有机液体电解质的传\n统锂离子电池。新加坡国立大学的科学家已经开发出一种\n钠离子电池，与锂离子电池相比较不易起火，却同样持久\n可靠。\n与此同时，在电池组设计中加入被动和主动保护措施\n也很重要。电动车电池组可以采用电池管理系统，来追踪\n和控制电池的电压、电流和温度等参数，使充电和放电更\n加安全，从而降低起火的可能性。\n新加坡科技研究局（A*STAR，简称新科研）与多\n所高等院校合作开发解决方案，以提高电动车电池的安\n全性和性能。新加坡电池组计划（Singapore Battery Pack\nProgramme）是南洋理工大学、新科研、国大和新加坡科技\n设计大学（SUTD）的合作项目，旨在推进电池组设计，提\n高性能和安全性。为防止电池过热，新科研也在开发浸入\n式冷却系统，以加强电动车电池热度的管理。\n新科研还与南大和新加坡理工大学（SIT）合作，创建\n电池组的认知数码孪生系统。系统可利用数码科技，为用\n户提供电池性能统计数据的实时概览，更好地估算电池寿\n命。全新的新科研电池测试设施，是\n东南亚最大的同类设施之一，可提供\n范围广泛的电池测试设备，以支持公\n共和私人领域开发更安全可靠又更可\n持续的电池。它可以进行性能和滥用\n测试，以确保电池能在常规和压力条\n件下安全运行。这些测试对于电池是\n否符合标准和法规非常重要，对产品\n制造商采取保障措施以减少故障情况\n至关重要。\n如何降低电动车电池隐性成本\n电动车通常被认为比内燃式引擎车“更环保”，因为\n它使用电力而不是化石燃料，但实际情况却更为复杂。虽\n然电动车不会产生尾气排放（即燃料产生的废气），但制\n造电动车所产生的碳足迹，却高于内燃式引擎车。一项研\n究发现，一般电动车须要行驶约2万2000公里，才能达到\n与内燃式引擎车的碳排放量持平，或在车辆使用寿命内实\n现碳排放收支平衡。\n其中一个主要原因，是电动车使用的锂离子电池的生\n产过程，需要大量能源。开采和提炼关键矿物（如锂、\n钴和镍）、制造电极材料和制造电池芯的过程需要大量能\n源，造成大量温室气体排放。\n有一些方法可以减少电池的碳足迹，包括使用可再生\n能源和先进的制造解决方案，如新兴的干电池制造。电\n池回收和再利用对于减少整体碳足迹，和使电池生产更具\n可持续性也很重要。新科研的电动车电池测试和拆卸线，\n通过实现电池拆卸过程的自动化，将电池回收和再利用的\n效率提高约50%。此外，新科研还在开发一种报废电池健\n康状况评估系统，以更好地确定电池是否适合在寿命结束\n时，进行回收和再利用。\n新加坡拥有强大的人才库和知识产权保护，以及关系\n紧密的科研和产业生态系统，能够在先进电池技术的发展\n中发挥关键作用，尤其可在东南亚朝着成为电池技术创新\n枢纽的方向迈进。\n电池研发具有巨大的潜在经济效益：预计在2024年至\n2028年期间，亚洲的电动车销售量平均每年将增长22%。\n东南亚已宣布电池芯生产能力超过 50 吉瓦时（GWh），\n这将有助于满足全球日益增长的电池需求。\n新加坡电池联盟正积极与生态系统中的伙伴通力合\n作，推动电池科技的发展，为本区域创造价值。通过协力\n开发创新电池科技，我们可以加速电动车的未来发展，使\n整个交通系统更安全、更环保。\n作者是新科研材料研究与工程研究院 (IMRE) 副院长\n兼新加坡电池科研企业联合平台（SBC）技术总监\n林慧慧译\n“科学星语”栏目由《联合早报》与\n新加坡科技研究局合作，每月推出新加坡拥有强大的人才库和知\n识产权保护，以及关系紧密的\n科研和产业生态系统，能够在\n先进电池技术的发展中发挥关\n键作用，尤其可在东南亚朝着\n成为电池技术创新枢纽的方向\n迈进。科 学 星 语 詹兴扬\n研发更安全环保的电动车电池Publication: Lianhe Zaobao\nDate: 24 June 2024\nHeadline: Developing safer and more environment ally friendly\nelectric vehicle batteries\nSource: Lianhe Zaobao © SPH Media Limited. Reproduced with permission."
}