{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2025-01/MANDATORY%20MEDICAL%20CLEARANCE.pdf",
  "type": "pdf",
  "content": "Page 1 of 5\nMANDATORY MEDICAL CLEAR ANCE FOR HEALTH SCIENCES STUDENTS  & SPECIAL MEDICAL SCREENING REQUIREMENTS FOR SELECTED\nPROGRAMMES\n1. Students successfully admitted to Singapore Institute of Technology  (SIT)  are required to clear the MANDATORY medical examination before they can\nbe successfully matriculated into SIT.\n2. Students admitting into the various SIT programmes are required to complete the medical screening and  have the required vaccinations according to\nthe respective programme s’ requirement s.\n3. Students are required to satisfy the said medical assessment/ conditions . Failing to do so would result in the need to complete the prescribed treatment\nand be certified fit by a qualified physician as “Fit to enrol into the programme” . When no treatment/alternative  is available , students are to note that\ntheir admission into the respective programmes  may be revoked.\n4. Students are required to bear their own expense s and pay direct to the clinics for the services  required . There will be no reimbursement by SIT .\n5. Students are required to bring their past medical records when visiting any medical providers, eg. health booklet, documented evidence of immunity,\nvaccination proof or existing medications. Singaporean students who do not have their childhood medical records can view thei r immunisation records\nfrom the National Immunisation Registry:  https://www.nir.hpb.gov.sg . Immunisation  records are available  for children born from 1 January 1996.\n6. All students of all programmes are required to have their medical screening done for the items reflected in Part 1. In additi on, certain programmes\nrequire additional screening(s) or vaccination(s) listed in Part 2.\nPART 1: Mandatory  screening required for ALL programmes:\n•          Visual Acuity  •          Musculoskeletal\n•          Urinalysis  •          Neurological\n•          Cardiovascular  •          Psychiatric\n•          Eyes  (other than myopia)  •          Respiratory\n•          Gastro -intestinal\nPage 2 of 5\nPART 2: Additional Mandatory Screening /Immunisation Records/ Additional Form s for SELECTED programmes  in the below table  only:\nHepatitis A^ Hepatitis B^ Hepatitis C^Mumps,\nMeasles &\nRubella\n(MMR)@Pertussis\n+Poliomye\nlitis+Tuberculosis^Varicella\n(Chicken\nPox)@HIV^Full\nBlood\nCount\ntests^Hearing\nTestApplication For\nRegistration as a\nRadiation\nWorkerHepatitis B^ Hepatitis C^\nBachelor of Engineering in Pharmaceutical Engineering Yes Yes\nBachelor of Science in Occupational Therapy Yes Yes Yes Yes Yes Yes Yes\nBachelor of Science in Diagnostic Radiography Yes Yes Yes Yes Yes Yes Yes Yes Yes\nBachelor of Science in Radiation Therapy Yes Yes Yes Yes Yes Yes Yes Yes Yes\nBachelor of Science in Physiotherapy Yes Yes Yes Yes Yes Yes Yes\nBachelor of Science in Dietetics and Nutrition Yes Yes Yes Yes Yes Yes Yes\nBachelor of Science in Speech and Language Therapy Yes Yes Yes Yes Yes Yes Yes Yes\nBachelor of Science in Nursing (Pre-registration and Specialty Training) Yes Yes Yes Yes Yes Yes Yes Yes\nMaster of Health Sciences (specialisation tracks):\nAdult and Geriatric Rehabilitation Yes Yes Yes Yes Yes Yes Yes\nMusculoskeletal Physiotherapy Yes Yes Yes Yes Yes Yes Yes\nMedical Sonography Yes Yes Yes Yes Yes Yes Yes\nOrgan Transplant Nursing Yes Yes Yes Yes Yes Yes Yes Yes\nRehabilitation Nursing Yes Yes Yes Yes Yes Yes Yes Yes\nBachelor of Engineering in Aircraft Systems Engineering Yes\nSIT-UofG Joint Degree\nBachelor of Science in Nursing Yes Yes Yes Yes Yes Yes Yes Yes\nCIA Degree\nBachelor of Business Administration in Food Business Management\n(Baking and Pastry Arts)Yes Yes\nBachelor of Business Administration in Food Business Management\n(Culinary Arts)Yes YesAdditional Recommended Additional Mandatory Screening                          Screening/Immunisation/special tests required\nProgrammes\n^Students to proceed with the screening for immunity.\n+Students to produce the immunisation records for immunity, else to proceed with the vaccination.\n@Student to produce the immunisation records of previous vaccinations (min 2 doses) as proof of immunity OR to proceed with the screening for immunity.\nNote for Health Sciences programmes\nMinistry of Health (MOH) has mandated all healthcare students should be fully vaccinated against COVID -19 or certified to be medically ineligible for all COVID -19\nvaccines under the National Vaccination Programme (NVP) or have recovered from COVID -19 within 180 days.\nPage 3 of 5\nHepatitis B:\nHepatitis B screening should be carried out before final admission into the course, as results may affect students’/ schools’  decision in continuing with the\ncourse.\nAll students should be screened for hepatitis B carriage or should show documented serological evidence of immunity against h epatitis B (i.e. anti -HBs ≥10\nmIU/mL). Students enrolled in courses that might require them to perform or assist in EPPs must be screened for Hepatitis B.\nStudents who do not have evidence of immunity: Hepatitis B negative students who do not have documented serological evidence of immunity against\nhepatitis B (i.e. anti -HBs ≥10 mIU/mL) should be vaccinated with the primary course series (i.e. 3 doses of hepatitis B vaccine). A post -vaccination serology\ntest should be conducted to determine the concentration of protective antibodies i.e. anti -HBs of at least 10mIU/mL .\nStudents with anti -HBs concentrations ≥10 mIU/mL post -vaccination: For students with documented serology response (i.e. anti -HBs ≥ 10 mIU/mL) obtained\nprior to admission into the course, there is no need to repeat the hepatitis B screening. Schools and healthcare institutions  can rely on students’ previous\nhepatitis B screening results for PECT placements.\nStudents with anti -HBs <10 mIU/mL post -vaccination: For those who are unable to acquire immunity after vaccinations (i.e. anti -HBs < 10 mIU/mL)),\nthese students should be revaccinated with either of the recommended options:\n• Option 1:  Students can be vaccinated with a single booster dose followed by serology testing within 1 -2 months. If an immune response is not\nmounted after the first booster dose, a second and third booster dose should be given to complete a second 3 -dose vaccination series.\n• Option 2: Alternatively, students with anti -HBs concentrations less than 10mIU/mL can be revaccinated with a second 3 -dose vaccination series,\nfollowed by re -testing within 1 -2 months.\nIf an immune response is not mounted after receiving two 3 -dose vaccination series, the vaccine non -responder should be referred to an\nOccupational Health Physician for further counselling on the risk and susceptibility to acquiring HBV infection during the co urse of their training.\nPage 4 of 5\nHepatitis C:\nStudents enrolled in courses that might require them to perform or assist in EPPs must be screened for Hepatitis C and HIV. S creening must be carried out\nbefore final admission into the course, as results may affect students’/ schools’ decision in continuing with the course.\nSimilar to Hepatitis B, students need not repeat Hepatitis C and HIV screening just before embarking on PECT. PSEIs and HCIs can rely on students’ Hepatitis\nC and HIV screening results from enrolment screening, for PECT placements.\nStudents who engage in high risk  activities are encouraged to go for regular testing and must inform their respective PSEIs of their BBD positive status\nimmediately a fter they become aware of this\nMumps, Measles and Rubella Viruses (MMR):\nAll students should be immune or vaccinated.\n• Documented proof of vaccination (2 -dose series); or\n• Serological evidence of immunity against all three diseases; or\n• Laboratory confirmation of all three diseases\nSelf-declaration of past infection or vaccination is not considered as evidence of immunity.\nPoliomyelitis:\nThe complete childhood vaccination records for Polio is required. If students are unable to provide the records, they must ha ve taken at least 1 dose of\nvaccination at the point of matriculation and attach a copy of vaccination proof before submission.\nTuberculosis:\nStudents must perform either Mantoux 2TU or 5TU test OR Quantiferon -Gold Assay. Please submit updated laboratory report which must be dated after 1\nFebruary of their admission year.\nPage 5 of 5\nVaricella (Chicken Pox):\nAll students should be immune or vaccinated.\n• Documented proof of vaccination with 2 doses of varicella vaccine given at least 4 weeks apart; or\n• Serological evidence of immunity; or\n• Diagnosis or verification of history of varicella disease by a physician or laboratory\nWhen past history of varicella is uncertain, serology testing should be carried out to confirm immunity against varicella.\nTetanus, Diphtheria and Pertussis\nStudents who have not received Tdap before:  All students should receive tetanus toxoid, reduced diphtheria toxoid and acellular pertussis (Tdap) vaccination,\nif they have not previously received the Tdap vaccination. These students should be vaccinated with a single dose of Tdap, fo llowed by a booster dose of\ntetanus and diphtheria toxoids (Td) every 10 years. If Td is unavailable, it may be replaced with Tdap.\nStudents who have previously received Tdap:  Students who have previously received Tdap vaccination should receive a booster dose of Td every 10 years. If\nTd is unavailable, it may be replaced with Tdap.\nDocumented proof of vaccination with Tdap or Td in the last 10 years would be acceptable as evidence of immunity. Self -declaration is not considered as proof\nof immunity.\nFull blood count:\nStudents are to do the Full Blood Count test or provide a valid lab report for Full Blood Count test done within the last 3 m onths\nHearing Test :\nStudents are to do a hearing (Audiometry) test  or provide a valid lab report for Audiometry test done within the last 3 months .\nHIV Test :\nStudents are to do a HIV test or provide a valid lab report for HIV test done within the last 3 months.\nStudents enrolling into the Diagnostic Radiography or Radiation Therapy programme (s) must also complete the Application Form for registration as a\nRadiation Worker . Please click here  to download the instructions and form ."
}