{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2020-10/Annual_Report_2016.pdf",
  "type": "pdf",
  "content": "2016 has been a year of progress and innovation.\nFrom our students’ progress and achievements, t o  n e w  r e l a t i o n s h i p s  w i t h  i n d u s t r y  a n d  o u r  community, SIT’s applied learning approach is reaping rewards in all areas of our operation. As we look back over the year, we reﬂ  ect on\nthe ﬁ  rst steps that are taking us ever higher\nwith a sense of pride, with the outlook that our journey has only just begun.\nThe staircase represents SIT’s upward trajectory.\nThe lightbulb signiﬁ  es the new thinking, learning\nand ideas that are our objectives with every step.\n01\n0203040910121426293234414243454850535760616263About SIT/Vision & Mission\nSIT At a GlanceChairman’s MessageBoard of TrusteesPresident’s MessageSenior ManagementOrganisation ChartHighlightsLearningSIT-conferred Degree ProgrammesPolytechnic Partners Overseas University PartnersCentre for Learning Environment and Assessment DevelopmentProfessional Ofﬁ  cers Division\nIndustryEnterprise & Innovation HubIndustry-Programme PartnershipIntegrated Work Study Programme/Career ServicesCommunitySupport for Our StudentsCorporate GovernanceInternal Audit and Quality AssuranceSIT Board CommitteesFinancial Statements\nSingapore Institute of Technology (SIT) is Singapore’s\nuniversity of applied learning. SIT offers applied learning programmes targeted at growth sectors of the economy with a unique pedagogy that integrates work and study. It also offers degree programmes in partnership with world-class universities.\nSIT aims to cultivate in its students four distinctive traits,\nor the SIT-DNA, which will prepare them to be ‘thinkingtinkerers’, who are ‘able to learn, unlearn and relearn’,be ‘catalysts for transformation’ and ﬁ  nally, remain ‘grounded\nin the community’.\nA leader in innovative university education by integrating\nlearning, industry and community.\nTo develop individuals who build on their interests  and talents\nto impact society by providing a nurturing environment that is uniquely enriched by world-class partners.\n02SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nOVER 4,000 STUDENTS\n43 DEGREE PROGRAMMES11 OVERSEAS UNIVERSITY\nPARTNERS\nGRADUATE EMPLOYMENT\nSURVEY 20145 PROGRAMME CLUSTERSAPPLICATIONS VS INTAKE• 98% Singapore Citizens and PRs\n• 97% from Polytechnics• 80% in Science & Technology programmes\nAY2015/2016 AY2016/2017\n• 11 SIT degree programmes\n• 5 SIT-OU joint degree programmes• 27 overseas university (OU) programmes• DigiPen Institute of Technology\n• Massey University• Newcastle University• Technical University of Munich• The Culinary Institute of America• The Glasgow School of Art• The University of Manchester• Trinity College Dublin• University of Glasgow• University of Liverpool• Wheelock College\n• 91.7% overall employment rate\n• 86.0% full-time permanent employment\nsix months after graduation\n• 85.9% work in jobs related to ﬁ  eld of study\n• Median gross salary of $3,000 across all\ndegree programmes57% Male 43% Female\nEngineering\nDesign &\nSpecialised\nBusinessesChemical\nEngineering\n& Food\nTechnology\nInfocomm\nTechnologyHealth &\nSocial\nSciences9,600\napplications13,000\napplications2,080\nplaces2,400\nplaces\n2015 was certainly another eventful year for SIT – a\nyear brimming with exciting changes and signiﬁ  cant\ndevelopments.\nBuoyed by the momentum from the previous year, we\ncontinued our rapid growth and launched seven new degree programmes. These have been extremely well-received, as borne out by our record application numbers – nearly 13,000 – which meant that our p r o g r a m m e s  w e r e  o v e r s u b s c r i b e d  b y  n e a r l y  5 . 5  times. This certainly testiﬁ  es to the growing popularity\nof SIT as we continue to offer niche, applied degree programmes which are industry-relevant.\nWith a steadily increasing student intake, it reafﬁ  rms\nour deep-rooted belief that SIT is moving on the right track, in tandem with Singapore’s industry and manpower needs. This bodes well for the future, as we continue to produce graduates who are imbued with the SIT-DNA and who are more than prepared to contribute to the ‘future-prooﬁ  ng’ of Singapore.\nTo that end, SIT continues to make signiﬁ  cant inroads\nwithin industry. In the area of collaborations, we are constantly engaging with key industry players, government agencies, trade associations and in particular, our local SMEs, to ensure that learning is closely integrated with industry and community. The various MOUs signed during the course of the year are a clear indication of how industry is more than willing to collaborate with SIT in many areas, ranging from co-sharing of facilities to the exchange o f  k n o w l e d g e ,  e v e n  i n  a r e a s  s u c h  a s  s h a r i n g  o f  manpower and resources, with the aim of ensuring that our students receive a holistic and industry-focussed learning experience.\nThis learning experience is the result of many\nhours spent deliberating and strategising how the University can differentiate itself from the other autonomous universities (AUs). Apart from our p e d a g o g y ,  w e  h a v e  m a d e  a  c o n c e rt e d  e ff o rt  t o  structure ourselves in a manner that not only allows us to manage our limited resources centrally, it encourages innovation in the way we leverage on our various overseas university partners, as well as our valued industry partners.\nAnother signiﬁ  cant development last year was when\nPrime Minister Lee Hsien Loong announced our new centralised campus in Punggol during his SG50 National Day Rally speech. For SIT, the announcement is a ringing endorsement from the government that not only are we fulﬁ  lling the educational needs of our\nnation, SIT is going to be an integral part of a new and vibrant community in the north-east.\nOur future Punggol campus is going to alter the\nhigher education landscape in more ways than one. Not only will it be borderless and integrated with the surrounding community and creative industry cluster, the new campus design will dovetail beautifully with its distinctive education model wh i ch  in t egra t es  work  with  study .  W e  hope  th a t  the campus will become a beacon in the landscape of Punggol and make its mark, not just in terms of providing world-class education, but also as a place for industry professionals as well as nearby residents to visit and to feel at home in. I am conﬁ  dent that as\nwe engage with key industry players and community leaders over the course of the next few years, the Punggol campus will eventually become a hotbed of innovation and creativity.\nWe are indeed faced with challenging times. Our\nageing population, coupled with a declining active workforce, translates into acute talent shortages over the coming decades. To be a key player in Singapore’s higher education landscape, we must continue to train students who are torch-bearers, imbued with the SIT-DNA in their core. This effort must be a collective one, involving faculty, professional ofﬁ  cers\nand administrative staff. As our graduates begin to make their mark out in the world, we must remain steadfast in our conviction to provide a nurturing environment that is enlightening and empowering, yet grounded in the realities of the world we now live in. As the world continues to change and evolve around us, I am conﬁ  dent that SIT is well on its way\ntowards becoming a university of applied learning – one that will transform Singapore’s educational landscape in the years to come.\nMR NG YAT CHUNG\n04SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nMr Ng Yat Chung is the Chairman of Si ngapore Institute of Technology (SIT).\nHe is an Executive Director of Neptune Orient Lines Limited (NOL). He was formerly Group President and Chief Executive Ofﬁ  cer of NOL.\nPrior to his appointments at NOL, Mr Ng was Senior Managing Director and the\nHead of Energy & Resources, Co-Head of Australia & New Zealand as well as Co-Head of Strategy at Temasek Holdings (Private) Limited. Mr Ng is also a former Chief of Defence Force of the Singapore Armed Forces.\nMs Rachel Eng is the Deputy Chairman of WongPartnership LLP. As a corporate\nlawyer, she is involved in listings, corporate advisory, corporate governance and compliance work.\nMs Eng is an independent non-executive director of Olam International Limited,\nStarHub Ltd and SPH REIT Management Pte Ltd, manager of SPH REIT. She is a board member of Certis CISCO Security Pte Ltd, the Public Utilities Board and the Singapore Accountancy Commission. She is also a council member of the Singapore Business Federation.\nMs Eng is a member of the Committee on the Future Economy, which was formed by\nthe Singapore government in January 2016 to develop economic strategies to position Singapore well for the future. She is also a member of the Appeals Panel of Abu Dhabi Global Market and a Supervisory Committee member of ABF Singapore Bond Index Fund established by the Monetary Authority of Singapore. She also sits on the board of the Singapore Chapter of the Asia Paciﬁ  c Real Estate Association, the Capital Markets and Financial Advisory Services Exams Board of the Institute\nof Banking & Finance, the Reuters Editorial Advisory Board and Best Lawyers Advisory Board.\nMs Eng is an Honorary Legal Adviser to the Real Estate Developers Association of Singapore. She is also a Fellow of the\nSingapore Institute of Directors. She was invited to be and is one of the SG50 Champions of Changes for BoardAgender, a not-for-proﬁ  t organisation that promotes gender diversity in the boardroom. She is also a mentor for the Young Women’s\nLeadership Connection.MR NG YAT CHUNG\nChairman\nAppointed on 23 Sep 2009\nMS RACHEL ENGTrustee\nAppointed on 21 Mar 2011\nInformation correct at time of printing.\n05SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nProf Heng Chye Kiang is the Lum Chang Chair Professor at the School of Design and\nEnvironment, National University of Singapore. He teaches architecture and urban design at the Department of Architecture and has lectured widely in universities in Europe and Asia.\nProf Heng is a member of several editorial boards of international journals and has\nbeen invited to serve as jury member of many international design competitions in Asia. His research covers the areas of urban design, heritage and history of Chinese cities.\nProf Heng is a Board Member of the Housing & Development Board. He also sits on the\nAdvisory Board of the Centre for Liveable Cities and National Museum of Singapore. PROFESSOR HENG CHYE KIANG\nTrustee\nAppointed on 16 Sep 2015 Dr Richard Charles Helfer is the Chairman of RCH International Pte Ltd and Creo\nLifestyle International Pte Ltd. He is the founding Chairman/Chief Executive Ofﬁ  cer\n(CEO) of Rafﬂ  es International. He also served as the President and CEO of Rafﬂ  es\nHoldings and a Member of the Senior Management Committee of DBS Land Limited and later its successor CapitaLand Limited, with regard to property development in the hospitality and tourism sectors.\nDr Helfer currently serves as the Chairman and Director of Alpen Wald Pte Ltd,\nCelestica International Ltd, Celestica Ltd, Food Journeys (Singapore) Pte Ltd, Yanua International Pte Ltd, One Farrer Pte Ltd and Sculpture Square Limited. He is also a Director of Little India Arcade Pte Ltd, Wharton Scott Pte Ltd, The Farrer\nPark Company Pte Ltd, Farrer Park Hospital Pte Ltd, Farrer Park Medical Centre Pte Ltd, Farrer Park Hotel Pte Ltd and Cambodian Living Arts.\nDr Helfer is the Chairman, Advisory Committee of School of Hospitality, Republic Polytechnic. He is also a member of the\nURA Conservation Advisory Panel.\nIn addition to sitting on several public listed/private boards of directors and being advisor to a select group of government/\nprivate organisations and companies, Dr Helfer has, and continues to be professionally involved in sustainable social enterprises and community developments and at board level in the education sector. DR RICHARD CHARLES HELFER\nTrustee\nAppointed on 23 Sep 2009\nInformation correct at time of printing.\n06SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nDr Lim Khiang Wee is the Executive Director of CREATE (Campus for Research\nExcellence and Technological Enterprise) of Singapore’s National Research Foundation. The campus is an international, multidisciplinary research campus where 9 international universities work with Singapore universities on 15 research programmes.\nDr Lim was the Executive Director of the A*STAR Graduate Academy and concurrently\nthe founding Executive Director of Intellectual Property Intermediary, Singapore. At A*STAR, he has held a variety of leadership roles at the Singapore Institute of Manufacturing Technology and the Institute for Materials Research and Engineering. He was also a member of the founding leadership team at the Science and Engineering Research Council.\nDr Lim is a Director of Singapore-HUJ Alliance for Research and Enterprise Ltd. He is also a Member on the Engineering\nAccreditation Board of The Institute of Engineers Singapore, NUS High School Mathematics & Science Board of Governors, Mechanobiology Institute of Singapore Governing Board, Singapore Synchrotron Light Source Governing Board and an Adjunct Professor in the Division of Engineering and Technology Management at National University of Singapore. DR LIM KHIANG WEE Trustee\nAppointed on 23 Sep 2009\nMr Lam Yi Young is the Deputy Secretary (Policy) of the Ministry of Education, Singapore.\nPrior to his appointment, Mr Lam was the Chief Executive of the Maritime and Port\nAuthority of Singapore. Since joining the Singapore Civil Service in 1996, Mr Lam has also served as an Engineer in the Ministry of Defence, an Assistant Director in charge of the Budget Policy in the Ministry of Finance, a Deputy Director of the Personnel Division in the Ministry of Education and a Director of Manpower in the Ministry of Defence.\nMr Lam also sits on the Boards of the Agency for Science, Technology and Research\n(A*STAR), CapitaLand Commercial Trust Management Limited, Education Fund Board of Trustees, Lee Kong Chian School of Medicine, Lifelong Learning Endowment Fund Advisory Council, SIM University, Singapore University of Technology and Design, Singapore Workforce Development Agency, and Yale-NUS College.MR LAM YI YOUNG Trustee\nAppointed on 24 Jan 2014\nMrs Margaret Lui is the Chief Executive Officer and Director of Azalea Asset\nManagement Pte Ltd.\nMrs Lui was with Temasek Holdings for more than 25 years in senior management\nroles in investments and portfolio management. Prior to joining Azalea in 2015, Mrs Lui was consecutively, over 5 years, the Chief Operating Officer of two\nTemasek wholly-owned investment entities, Seatown Holdings International and Pavilion Capital International. Mrs Lui is a Director of Azalea Asset Management and its subsidiaries, including Astrea III Pte Ltd. She also sits on the boards of SembCorp Industries Ltd and TJ Holdings (III) Pte Ltd. She chairs the Marine Services Supervisory Committee of PSA International Pte Ltd and is a member of the Listings Advisory Committee of Singapore Exchange Limited. MRS MARGARET LUI Trustee\nAppointed on 16 Sep 2015\nInformation correct at time of printing.\nMr Nagaraj Sivaram is a Partner of Ernst & Young LLP and Ernst & Young Solutions LLP.\nMr Sivaram is a Director of Urban Redevelopment Authority and is also a Deputy\nChairman of the Accounting Standards Council, Singapore and the Financial Reporting Committee of the Institute of Singapore Chartered Accountants.07SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nMr Abu Bakar Bin Mohd Nor is the Managing Director and Board Director of Keppel\nSingmarine Pte Ltd. He was the Chief Executive Ofﬁ  cer of Nakilat-Keppel Offshore &\nMarine. He began his career at Keppel Shipyard Limited and rose through the ranks through training, acquisition of new skills and holding of various appointments in the operations and commercial departments.\nMr Abu Bakar sits on various Boards in the Keppel Group companies and associates,\nincluding Keppel Shipyard Limited, Keppel Sea Scan Pte Ltd, Keppel FELS Limited, Keppel Offshore & Marine Technology Centre Pte Ltd, Marine Technology Development Pte Ltd, Maju Maritime Pte Ltd, Keppel Smit Towage Pte Ltd, Green Scan Pte Ltd, Arab Heavy Industries PJSC, Nakilat-Keppel Offshore & Marine Ltd, Keppel Nantong Shipyard Co Ltd, Keppel Nantong Heavy Industry Co Ltd, Keppel Singmarine Brasil Ltda, Keppel Singmarine Philippines, Keppel Philippines Marine, Inc and Keppel Subic Shipyard, Inc. MR ABU BAKAR BIN MOHD NOR\nTrustee\nAppointed on 16 Sep 2015\nMR NAGARAJ SIVARAM Trustee\nAppointed on 16 Sep 2015\nProf Tan Thiam Soon is the President and Trustee of Singapore Institute of Technology\n(SIT). Prior to joining SIT, Prof Tan was with National University of Singapore (NUS) for more than 26 years and was a Professor of Civil Engineering. While in NUS, he held various positions, including Vice-Provost (Education) and Dean of Admissions. Prof T an is a registered Specialist Professional Engineer (Geotechnical) in Singapore and has been involved in numerous consul ting jobs in Singapore concerning land\nreclamation and other geotechnical problems. He is a member of the Council for Skills, Innovation and Productivity, a Board member of Singapore Workforce Development Agency and the Action Community for Entrepreneurship, and a member of the Advisory Council on Community Relations in Defence, Ministry of Defence. PROFESSOR TAN THIAM SOON\nTrustee & President\nAppointed on 1 Feb 2013\nInformation correct at time of printing.\n08SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nMs Teoh Zsin Woon was appointed as a Deputy Secretary (Development) at the\nMinistry of Health, Singapore in 2013. Prior to her appointment at MOH, she served in various Civil Service roles including the National Environment Agency, Ministry of Defence, Ministry of Manpower, Workforce Development Agency, Ministry of National Development and the Ageing Planning Ofﬁ  ce.\nMs Teoh is also a Director of Alexandra Health System Pte Ltd, Agency for Integrated\nCare Pte Ltd, Housing & Development Board, Duke-NUS Centre for Ageing Research and Education Advisory Board and Eastern Health Alliance. MS TEOH ZSIN WOON\nTrustee\nAppointed on 1 Apr 2013\nMr Wen Khai Meng is Chief Executive Ofﬁ  cer of CapitaLand Singapore Limited.\nPrior to this, he was the Chief Executive Ofﬁ  cer of CapitaLand Financial Limited.\nHe has held several senior appointments within the CapitaLand Group.\nBefore joining CapitaLand, Mr Wen was with the Ministry of National Development.\nHe also sits on various Boards of the CapitaLand Group of local and foreign companies. MR WEN KHAI MENG\nTrustee\nAppointed on 16 Sep 2015\nMr TK Udairam is the Chief Operating Ofﬁ  cer of Sheares Healthcare Management\nPte Ltd. Prior to this, he was the Group Chief Executive Ofﬁ  cer of Eastern Health\nAlliance and the Chief Executive Ofﬁ  cer of Changi General Hospital.\nMr Udairam is a Director of Singapore Medical Association Charity Fund and Singapore\nT o t a l i s a t o r  B o a r d .  H e  s e r v e s  a s  C h a i r m a n  o f  S r e e  N a r a y a n a  M i s s i o n  ( S i n g a p o r e )  Medifund Committee and Changi Simei Inter-Racial and Religious Conﬁ  dence Circle.\nMr Udairam is also a Member of Nanyang Polytechnic Health Sciences Advisory\nCommittee, School of Information Systems Advisory Board of Singapore Management University, Medifund Advisory Council and Tote Board Community Heathcare Fund Evaluation Committee of Ministry of Health. MR TK UDAIRAM\nTrustee\nAppointed on 16 Sep 2012\nInformation correct at time of printing.\nOver the past year, SIT has continued its evolution\nf r o m  a  s t a r t - u p  u n i v e r s i t y  t o  o n e  t h a t  i s  g r o w i n g  rapidly into a medium-sized university. Since being granted autonomous university status two years ago , we have continued to generate more interest from those wishing to upgrade to a degree, as reflected in our 2016 Admissions exercise. In all, some 13,000 polytechnic graduates and A-Level students applied for the 2,400 places on offer, a 35% increase compared to the year before.\nOn the academic front, we kicked off 2016 with\nseven new degree programmes, comprising a mix of SIT-conferred degree programmes and joint degree programmes with overseas university (OU) partners. Our Health and Social Sciences cluster expanded signiﬁ  cantly with the introduction of joint degrees in\nPhysiotherapy and Nursing, and degrees of our own, in Occupational Therapy, Diagnostic Radiography and Radiation Therapy. The year also saw us inking three joint collaborative agreements with existing and new OU partners – Trinity College Dublin, University of Glasgow and Massey University.\nWe continued to make inroads with industry\nd u r i n g  t h e  y e a r  a s  w e  e s t a b l i s h e d  v a r i o u s  landmark partnerships, further reinforcing our growing reputation as Singapore’s university of applied learning. For example, we became the ﬁ rst Singapore university to sign MOUs with two\nleading international hotel groups – InterContinental Hotels Group (IHG\n®) and Millennium & Copthorne\nHotels plc (M&C) to establish education and industry partnerships. Other key MOUs involved collaborations in the ﬁ  eld of research and innovation\nwith the Workforce Development Agency (WDA), to establish a Lean Transformation Innovation Centre (LTIC) to promote manpower-lean solutions and practices, as well as drive the adoption of lean thinking and culture. We also signed an agreement with A*STAR’s Institute for Infocomm Research (I\n2R)\nto work on applied research and innovation. I am conﬁ dent that these multi-faceted collaborations will\ntranslate into great beneﬁ  ts for our students and will\nalso go a long way towards SIT contributing to the ‘future-prooﬁ  ng of Singapore’.\nSIT’s rapid growth has seen various challenges\narising from greater responsibilities and more complex demands on staff. A concerted effort was mounted to further define our ‘SIT Culture’ – one that is conducive for SIT to become an innovative, dynamic and enterprising people organisation. From our core values, ‘United in Purpose’ was chosen as the theme in 2016 to galvanise the SIT community. It was the result of fruitful Culture Building sessions in 2015, where we engaged all SIT employees to build an inclusive and collegial culture.\nAs we pioneer a new applied learning pathway for\nautonomous universities in Singapore , SIT is making p r o g r e s s  i n  o u r  a p p r o a c h  t o  b e i n g  r e l e v a n t  t o  industry. Our pioneer cohort of students from the Accountancy programme completed their Integrated Work Study Programme (IWSP), with more than 80% of the cohort receiving priority offers. The hard work of our faculty and staff to create a seamless transition for our students from integrated classroom to the professional workplace is indeed paying off. It serves as an encouragement to all of us that we are making signiﬁ  cant headway with our industry partners. This\nwas reﬂ  ected in the SIT Graduate Employment Survey\n(GES) 2014, which revealed that our graduates secured a  h i g h  o v e r a l l  e m p l o y m e n t  r a t e  o f  9 1 . 7 % ,  w i t h  8 6 %  of economically-active graduates securing full-time permanent employment six months after graduation.\nWe hold ﬁ  rm that the SIT-DNA has become a potent\nenabler for both students and staff to be nimble and responsive to the needs of industry. SIT’s continuing efforts to build on our existing partnerships with our OU partners by establishing joint degrees can only serve to strengthen the unique ecosystem that we have built up over the years.\nOn this note, we remain grateful to our partners,\nwhose contributions are vital to our efforts in redesigning an education system that works hand-in-hand with industry. The support of all stakeholders is crucial to our success so that together, we continue to deliver graduates who are truly work-ready and ever-willing to take on new challenges in order to stay relevant and ahead in an ever-changing environment.\nPROFESSOR TAN THIAM SOON\n10SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nProfessor Tan Thiam Soon was appointed President, Singapore Institute of Technology\n(SIT) on 1 February 2013. He was a Professor of Civil Engineering and held various positions including Vice-Provost (Education) and Dean of Admissions at the National University of Singapore. He is a registered Specialist Professional Engineer and expert on land reclamation and other geotechnical problems. A Colombo Plan scholar, he graduated from University of Canterbury (New Zealand)  and obtained his\nMaster’s degree and PhD from California Institute of Technology. Professor Tan sits on the boards of Singapore Workforce Development Agency, Action Community for Entrepreneurship (ACE), and is a member of the Council for Skills, Innovation and Productivity (CSIP).PROFESSOR TAN THIAM SOON\nPresidentSIT\nPROFESSOR LOH HAN TONGDeputy President (Academic) & ProvostSIT\nProfessor Loh Han Tong joined Singapore Institute of Technology (SIT) as Vice-\nProvost on 2 September 2013, and was appointed Deputy President (Academic) & Provost on 1 October 2015. Prior to joining SIT, he was Vice Dean of the Faculty of Engineering, Deputy Head of the Department of Mechanical Engineering, Director of Education in the Design Technology Institute Limited, and Director of Bachelor of Technology Programme in the Faculty of Engineering at the National University of Singapore. He was also a Visiting Scholar at Stanford University and a Fellow of the Singapore MIT Alliance. A Colombo Plan scholar, Professor Loh graduated with First Class (Honours) in Engineering from University of Adelaide, Australia. He obtained his Masters of Engineering from National University of Singapore and his PhD in Mechanical Engineering from University of Michigan under the NUS Overseas Postgraduate Scholarship.\nMr Chan Wing Leong was appointed Chief Financial Ofﬁ  cer (CFO) of Singapore\nInstitute of Technology (SIT) on 1 July 2009. He assumed appointment as Deputy President (Administration) & CFO on 1 January 2013, covering the additional functions of estates, information technology, human resources and administration. Prior to joining SIT, he was Executive Chairman of Easycall Ltd, Chief Financial Ofﬁ  cer\nand President of New Businesses at Sembcorp Ltd, and was Chairman of Paciﬁ  c\nInternet and Delifrance. Mr Chan graduated with First Class Honours in Economics from the National University of Singapore and joined the Administrative Service. He also worked at MINDEF companies and the Economic Development Board, before becoming an investment banker in Schroders and Bankers Trust in Singapore and Hong Kong. He currently sits on private and public-listed company boards, as well as boards of charities and institutions of public character.MR CHAN WING LEONG\nDeputy President (Administration) & Chief Financial Ofﬁ  cer\nSIT\n11SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nMR TSOI MUN HENG\nVice President (Planning)SIT\nMr Tsoi Mun Heng was appointed Vice President (Planning), Singapore Institute of\nTechnology (SIT) on 1 April 2015. Before joining SIT, he was Director, Energy and Environment Research Directorate at National Research Foundation (NRF), and Director, Defence Industry and Systems ofﬁ  ce at MINDEF. Mr Tsoi is a Chartered\nEngineer in aerospace engineering and was also a Brigadier General with the Republic of Singapore Air Force. He graduated from National University of Singapore with a Bachelor of Engineering (Mechanical) in 1986, and obtained his Masters of Science in Aeronautics and Astronautics from Stanford University in 1993. Associate Professor Ivan B.H. Lee was appointed Vice President (Industry &\nCommunity), Singapore Institute of Technology (SIT) on 1 October 2015. He joined SIT in 2013 and has taught manufacturing operations, engineering design and entrepreneurship courses. Prior to joining SIT, he has over 27 years of experience in high-tech manufacturing, R&D, management and consulting. He also founded two start-up companies, BLC Solutions Pte Ltd in 2004 and TrueZ Pte Ltd in 2013. Associate Professor Lee graduated with a silver medal award from Singapore Polytechnic and obtained a First Class (Honours) in Engineering and PhD from National University of Singapore. ASSOCIATE PROFESSOR IVAN LEE BOON HONG\nVice President (Industry & Community) SIT\nPRESIDENT\nADVANCEMENT\n& ALUMNIINTERNAL\nAUDIT\nCORPORATE\nCOMMUNICATIONS\nVICE PRESIDENT\n(INDUSTRY &\nCOMMUNITY)\nENTERPRISE &\nINNOVATION HUB\nINDUSTRY-\nPROGRAMME\nPARTNERSHIPDEPUTY PRESIDENT\n(ACADEMIC) & PROVOST\nASSOCIATE\nPROVOST\n(ACADEMIC\nPROGRAMMES)ASSISTANT\nPROVOST\n(APPLIED\nLEARNING)\nACADEMIC\nCLUSTERS\nACADEMIC\nPROGRAMMES\nADMINISTRATIONCENTRE\nFOR\nCOMMUNICATION\nSKILLS\nCENTRE FOR\nLEARNING\nENVIRONMENT\n& ASSESSMENT\nDEVELOPMENTINTERNATIONAL\nCOLLABORATIONS\nOFFICE\nPROFESSIONAL\nOFFICERS\nDIVISION\nADMISSIONS\nREGISTRAR’S\nOFFICE\nSTUDENT LIFECAREER SERVICESVICE PRESIDENT\n(PLANNING)\nSTRATEGIC\nPLANNING &\nCOORDINATIONSAFETY & HEALTHDEPUTY PRESIDENT\n(ADMINISTRATION) &\nCHIEF FINANCIAL\nOFFICER\nCOMMUNICATIONS\n& INFORMATION\nTECHNOLOGY\nFINANCEESTATES\nLEGAL\nLIBRARYHUMAN RESOURCES\n12SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nFrom celebrating the achievements of students reading\nvarious SIT-conferred degree programmes to commemorating partnerships with industry players, SIT has had an exciting, eventful year. We look forward to marking our calendars with more highlights in the years to come.\n15SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nSIT Alumni Movie Night\nAfter catching up with their peers and faculty over dinner, these happy\nalumni were all ready for the screening of Avengers: Age of Ultron at the SIT Alumni Movie Night. A signature event of the SIT Alumni Leisure Network, it attracted a record 210 ﬁ  lmgoers, comprising alumni,\ngraduating students as well as SIT Senior Management, faculty and staff.\nWheelock College\nCommencement Ceremony\nWheelock College (WLC) Singapore\ncelebrated its 7th Commencement Ceremony for the Class of 2015,  which\nalso marked the second Commencement Ceremony under its collaboration with SIT. Approximately 220 guests attended the ceremony where the achievementsof 36 WLC graduands were celebrated.CIA Charity Event: ‘Grandfather’s\nParadox’\n‘Grandfather’s Paradox’ is a charity event\no r g a n i s e d  b y  s t u d e n t s  o f  t h e  C u l i n a r y\nInstitute of America (CIA) Class of 2015, as part of their capstone module. In light of SG50, this event was organised by SIT and supported by Community Chest, with the beneﬁ  ciary being the Singapore\nAssociation for the Deaf. The event also provided a platform for graduating students to showcase their skills to potential employers.MAY 2015\nJUNE\n20157 May\n17 June\n13 May\nSIT-SMRTi MOU  Signing Ceremony\nCommitted to sustaining a core of trained rail professionals, SIT signed an\nMOU with SMRTi to deliver the SMRT Train Engineer Professionalisation (STEP) Programme, which includes 6 courses that will equip our engineers with the relevant exposure and necessary skills to ensure the continual improvement of our rail systems.29 May\n16SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nSweet Creations\nSweet Creations, a cosy baking workshop organised by the SIT Alumni\nLeisure Network, warmed the hearts of 16 alumni who had a delicious time learning to bake two sweet treats – Apple & Banana Crumble and Chocolate Lava Cake. They were guided by graduating student, Ms Ong Wen Hui from the BSc (Hons) in Food & Human Nutrition degree programme (Newcastle University), who is also the Vice-President of the SIT Gourmet Club.\nSAF Day Combined Rededication\nCeremony\nSIT and Singapore Technologies Marine\njointly organised the SAF Day Combined Rededication Ceremony 2015, which was attended by over 450 guests from 47 organisations to reafﬁ  rm their commitment\nto the defence of the nation. The event w a s  g r a c e d  b y  M r  L u i  T u c k  Y e w ,  f o r m e r  Minister for Transport and Second Minister for Defence.International Academic\nAdvisory Panel Meeting\nThe 10th meeting of the Ministry of\nEducation’s International Academic Advisory Panel (IAAP) was held in Singapore from 24 to 26 June 2015. The panel discussed the role of universities in lifelong learning and how SIT’s applied degree programmes contributed to the transformation of Singapore’s university sector.\nJULY\n201520 June\n1 July24-26\nJune\nSIT Industry Night\nCareer Services hosted the SIT Industry Night on 25 June 2015 during\nThe Glasgow School of Art Degree Show. The purpose of the SIT Industry Night is to provide a platform for graduating students to showcase their work to employers and for employers to meet and hire graduating students. Held at the National Design Centre, the event was attended by 108 students and 136 company representatives from 88 companies. 25 June\n17SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nSIT Alumni Ultimate Frisbee\nFriendly Game\nA friendly game was organised\nfor alumni and students of the SIT Ultimate Frisbee club by the SIT Alumni Sports Network in preparation for the Singapore University Games (SUniG) 2015. Held at West Coast Park, it was attended by 20 alumni and 46 students.30 Aug\nSIT Carnival\nThe inaugural SIT Carnival saw more than 1,500 freshmen and their families\nmingle with faculty , seniors and staff . Aside from booths manned by student clubs and staff, performances and talks were also held to showcase the diversity and vibrancy of student life at SIT.22 AugChange Management Talk\nA group of SIT’s Accountancy\nstudents had the opportunity to get some great professional advice from industry pioneer Mr Lo Hock Ling at a talk on change management at SIT@Dover organised specially for them. Mr Lo, Founder of Lo Hock Ling & Co, delivered the talk with his daughter Mrs Pearlyn Chong, the company’s Managing Director. Mr Lo is also the donor who made possible the Lo Hock Ling Bursary at SIT for our Accountancy students. The students were so inspired by the talk that they engaged both speakers well beyond the planned 90-minute session. 16 July\nNational Day Observance Ceremony\nSIT held an inaugural National Day\nObservance Ceremony on 5 August 2015. Staff, students, community and industry partners joined in the celebration of Singapore’s Golden Jubilee and 50 years of independence. Ms Low Yen Ling, Mayor, South-West District, attended the ceremony as Guest-of-Honour.5 AugAUGUST\n2015\nSIT Student Orientation\n2015 marked the ﬁ  rst year that\nthe SIT Student Orientation (SSO) was held at SIT@Dover. The 3-day, 2-night camp welcomed 1,000 freshmen and allowed them to bond with their peers and seniors from various degree programmes. Students were also introduced to the SIT-DNA – Thinking Tinkerers ;\nAble to Learn , Unlearn and Relearn ;\nCatalysts for Transformation ; and,\nGrounded in the Community .20-22\nAug\n18SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nSIT Lecture Series by  Tom Kelley\nMr Tom Kelley, Partner, IDEO delivered the inaugural public lecture in the SIT\nLecture Series ‘Unlocking your Creative Conﬁ  dence’. The talk was given at the\nAuditorium, SIT@Dover, and was attended by close to 500 guests.\nBasic Personality Workshop\nAlumni participants went through\nvarious activities that would reveal different aspects of their personalities at a foundational workshop organised by the SIT Alumni Career Network. Held at Hotel Jen (Orchard Gateway), the Basic Personality Workshop was led by Mr Charles Sng, a certiﬁ  ed\npractitioner of the Myers-Briggs Type Indicator\n® (MBTI). Singapore University Games 2015\n(SUniG)\nA highlight in the university sporting\ncalendar, Singapore University Games (SUniG) 2015 saw a total of 207 SIT athletes competing in 14 sports. History was made as the Ultimate Frisbee team overcame great odds to claim SIT’s ﬁ  rst SUniG\nmedal, a respectable Bronze.\nSEPTEMBER 201526 Aug\n5 Sep31 Aug-\n25 Sep\nRecord-breaking Applications\nA record-breaking 9,697 applications were received in 2015, a year that also\nsaw the launch of ﬁ  ve new degree programmes in the areas of Hospitality\nBusiness, Information and Communications Technology (Information Security), Pharmaceutical Engineering, Sustainable Infrastructure Engineering (Building Services), and Systems Engineering (ElectroMechanical Systems). With a holistic and rigorous selection process that includes a myriad of aptitude-based methods such as written tests and multiple-step interviews that involve industry partners, SIT welcomed 2,076 new SITizens in September 2015.\n19SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nOCTOBER\n2015\nSIT Graduation Ceremony\nSIT celebrated its first locally-\norganised graduation for 122 Trinity College Dublin (TCD) graduands, a s  w e l l  a s  1 4 3  U n i v e rs i ty  o f  N e v a d a ,  Las Vegas (UNLV) graduands. The two ceremonies were attended by approximately 900 guests, including Guests-of-Honour Mr Ng Yat Chung, Chairman, Board of Trustees, SIT and H.E. Geoffrey Keating, Ambassador of Ireland to Singapore. 15 Oct\nVisit by OECD Delegates\nSIT hosted a visit to SIT@SP Building\nfor delegates from the Organisation for Economic Co-operation and Development (OECD). The delegates were given a tour of the facilities as well as demonstrations showcasing SIT’s project-based learning, blended learning and peer learning. The visit was organised in conjunction with the OECD-Singapore Conference on Higher Education Futures 2015, held from 14 to 15 October.Recognition of Excellence\nSIT’s inaugural Recognition of\nExcellence award ceremony showcased the excellence of our students and honoured the donors whose generosity had made possible Book Prizes, Outstanding Student Awards and Gold Medals at SIT.A total of 23 awards were presented b y  M r  N g  Y a t  C h u n g ,  C h a i r m a n ,  Board of Trustees, SIT. The special occasion drew more than 120 guests, including members of SIT’s Board of Trustees, SIT Senior Management, and senior representatives from overseas university partners. 16 Oct 16 OctSCS Student Chapter MOU Signing\nCeremony\nWith the MOU signed between\nSIT and the Singapore Computer Society (SCS), SIT became an afﬁ  liate\nmember of the SCS Student Chapter. As an affiliate member, students reading SIT’s ICT programmes will enjoy SCS member beneﬁ  ts,\nincluding complimentary invitations to professional seminars, networking events, and various SCS certiﬁ  cations\nand courses.9 Sep\nSIT-CIA Graduation Ceremony\nThirty-six students graduated from\nthe Culinary Institute of America (CIA) in 2015 after going through 1,300 hours of hands-on training. Many have begun their culinary careers at established restaurants locally and overseas, such as Luke’s Oyster Bar and Chop House in Singapore and Bar Tartine in San Francisco.16 Sep\nSIT Welcome Bash 2015\nMore than 900 students partied at\nZouk during the SIT Welcome Bash 2015, themed “A Journey Through Time” . Held in conjunction with SIT’s annual pageant, the event showcased the creativity, poise and talent of pageant contestants, culminating in the crowning of Mr and Ms SIT. 25 Sep\n20SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nDual Studies Industry Sponsorship Pioneer Programme\nSIT signed an MOU with Singapore Economic Development Board and\nnine German companies on the Dual Studies Industry Sponsorship Pioneer Programme. In line with the SkillsFuture movement, this programme will empower students to integrate knowledge and skills gained in SIT with real-world practice by working in the sponsoring companies. The nine pioneering German companies on board are Bosch, Feinmetall, Festo, Heraeus, Inﬁ  neon,\nPepperl & Fuchs, Rohde & Schwarz, SICK and Uhlmann.\nHospitality Business MOU Signing\nSIT signed an MOU with\nInterContinental Hotel Group (IHG\n®)\nand Millennium & Copthorne Hotels plc (M&C), signaling collaborative efforts in providing multiple opportunities for Hospitality Business students to fulﬁ  l their coursework,\nincluding IWSP, industry attachments, and hotel visits. Singapore Prestige Brand Award –\nSpecial Merit\nSIT received the Singapore Prestige\nBrand Award (SPBA) – Special Merit for its branding efforts. Inaugurated in 2002, SPBA is a branding accolade that recognises and honours Singapore brands that have been developed and managed efﬁ ciently through effective branding\ninitiatives. The Special Merit is for government agencies and not-for-proﬁ t organisations established for at\nleast 3 years.29 Oct\nScholarship Award and Appreciation Ceremony\nSIT’s Scholarship Awards and\nAppreciation Ceremony celebrated the recipients’ achievements, determination and successes to come. Held at SIT@Dover, 15 new SIT scholars, as well as 10 recipients of the SIT Final Year Scholarship, received their awards f r o m  M r  N g  Y a t  C h u n g ,  C h a i r m a n ,  Board of Trustees, SIT. Ten graduating SIT scholars were also presented their scholarship certificates. The occasion also marked the introduction o f  t h e  M i d - Y e a r  S c h o l a r s h i p ,  w h e r e  three undergraduates with outstanding academic results and stellar co-curricular activity records received the partial scholarship from SIT. 28 Oct\nMartial Arts Day (M.A.D.)\nStudents were introduced to SIT’s four\nMartial Arts Clubs – Aikido, Capoeira, Silat and Wushu. Martial Arts Day was a platform to strengthen bonds between the four clubs as they shared the origins and ﬁ  ghting styles of their\nmartial arts.17 Oct 26 Oct\n30 Oct\n01\n21SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nFaculty & Staff Giving Roadshow\n(in support of SIT Bursary)\nFaculty and staff at SIT gave the SIT\nBursary their warm support at the soft launch of the Faculty & Staff Giving initiative at University Tower, SIT@Dover. Coffee (provided with c o m p l i m e n t s  b y  M s  S h a r l e n e  S o u ,  an SIT alumnus) and ‘you tiao’ were served at the inaugural roadshow. Support from faculty and staff has enabled 18 SIT Bursaries to be awarded in AY2015/16. A second roadshow at Academic Plaza was held on 24 November 2015.\nMOU Signing with LTA\nSIT signed an MOU with the Land\nTransport Authority (LTA), marking a collaboration that includes research and technical trials on innovative policies, technological applications, as well as sustainable practices in the transport industry. LTA will fund projects to enhance knowledge and drive innovation into speciﬁ  c focus\nareas, and set up three Transport Research Centres at SIT, NUS and NTU. 3 Nov\n18 NovNew Alumni Welcome Party 2015\nMarking the undergraduate’s rite of\npassage into becoming an alumnus, the annual New Alumni Welcome Party was held for the second time at Hard Rock Cafe (Orchard R o a d ) .  I t  a t t r a c t e d  m o r e  t h a n  2 0 0  attendees, and highlights from the night included a lip-sync battle and a performance from Muzeka, SIT’s student band, which featured a line-up of students and alumni performing together for the ﬁ  rst time.\nMOU Signing with Kwong Wai Shiu\nHospital\nMore than 1,000 people celebrated\nthe 105th anniversary celebration of Kwong Wai Shiu Hospital (KWSH) on 21 November 2015, including Guest-of-Honour Mr Gan Kim Yong, Minister for Health. KWSH spent considerable effort designing its new facility to provide an ideal environment for the elderly to recuperate, and has plans to engage in innovative projects with SIT to help improve productivity and patient care outcomes. 6 Nov\n21 NovNOVEMBER\n2015\nChillOut@SIT\nChillOut@SIT marks a season of fun\nand enjoyment on the SIT calendar. Close to 3,500 students and faculty were offered a reprieve from their academic work with Chillout sessions held at various campuses, featuring interactive games, live music and sumptuous food during lunch hour.\nLeaders Development Programme\nOne hundred newly-appointed\nstudent leaders attended this 2-day, 1-night camp at Camp Challenge Campsite in Sembawang. The programme aimed to develop their leadership skills and provided an opportunity for student leaders to interact and share ideas. Nov-\nMar\n21-22\nNov\n22SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nDECEMBER\n2015\nBasic Personality Workshop II\nBack by popular demand, a second\nsession of the Basic Personality Workshop was conducted and a t t e n d e d  b y  2 1  p a r t i c i p a n t s .  T h i s  foundational workshop was the ﬁ rst in a series of self-development\npersonality workshops organised by the SIT Alumni Career Network.\nProject Cambodia\nFifteen SIT students spent 10 days in\nTrang Village, Phnom Penh, Cambodia as part of their Service Learning Trip in partnership with Project Khmer Hope, Trang. They painted wall murals and conducted English language lessons for Cambodian children. Activities were held at a multi-purpose hall which the team had raised funds to build, prior to their visit.Acting Minister Ong Ye Kung’s\nVisit to SIT\nSIT welcomed Mr Ong Ye Kung,\nActing Minister for Education (Higher Education and Skills), as well as other representatives from the Ministry of Education to SIT@Dover, where they toured the campus, learned about the institution’s applied learning and industry collaboration projects, and conversed with students about life at SIT. Appreciation Lunch for\nMr Lim Siah Mong\nThe first three recipients of the\nLim Siah Mong Scholarship at SIT were delighted to meet and personally thank their donor Mr Lim at an appreciation lunch held at SIT@Dover. Mr Lim’s gift, made in 2015, enabled SIT to establish one of its ﬁ  rst endowed\nscholarships to nurture academically talented students in need of ﬁ  nancial\nsupport. The recipients received their scholarship certiﬁ  cates from Mr Lim\nand presented him with a painting of three galloping horses that they had worked on with an artist, after having learnt of his love for horses. 5 Dec 9 Dec 30 Nov\nProject Vietnam\nSixteen SIT students visited Tay Xuan Daycare Centre as part of their Service\nLearning Trip to Hue City, Vietnam, in partnership with ‘Hearts for Hue’. These S I T  s t u d e n t s  w e r e  i m m e r s e d  i n  l o c a l  c u l t u r e  a s  t h e y  i n t e r a ct e d  w i t h  c o l l e g e  students and served the community, building a fence for the kindergarten and teaching English to children in a primary school.19-30\nDec20 Dec –\n1 Jan\n23SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nFEBRUARY 2016\nSIT Open House 2016\nThe SIT Open House is the University’s annual ﬂ  agship student recruitment\nevent. Held at the Suntec Convention and Exhibition Centre, the two-day event was the perfect opportunity for prospective students to discover more about three key elements – SIT’s degree offerings, the ethos of an SIT education, and the future of SIT. The event witnessed the launch of seven degree programmes for AY2016/17 including Telematics (Intelligent Transportation Systems Engineering), Diagnostic Radiography, Occupational Therapy, Radiation Therapy, and three joint-degree programmes: Food Technology with Massey University, Nursing with University of Glasgow and Physiotherapy with Trinity College Dublin. The Open House yielded the largest turnout thus far, attracting more than 5,400 visitors. Origami Workshop\nA n  O r i g a m i  W o r k s h o p  b y  t h e\nSIT Alumni Leisure Network was facilitated by a graduating student, Ms Kelly Han from the BSc in Electrical Engineering & Information Technology degree programme (Technical University of Munich), who wanted to share her love of the craft with fellow SITizens. Participants learned how to make gifts for their Valentines such as gift boxes, roses and pop-up cards.16-17\nJan23 Jan\nProject Shine\nAs part of Project Shine, supported\nby the National Youth Council’s Young ChangeMakers programme, SIT students visited 20 low-income elderly residents at Jalan Kukoh. T h e y  p r o v i d e d  h o m e  s p r i n g  cleaning services for these elderly, in preparation for Chinese New Year celebrations. 30 JanJANUARY 2016\nAppreciation Lunch for Dou Yee Enterprises\nAn appreciation lunch was held ahead of the Lunar New Year at SIT@Dover to\nthank Mr Soo Ye Wah, Executive Chairman, Dou Yee International, for having made possible the Dou Yee Enterprises Bursary at SIT since 2013. It was Mr Soo’s ﬁ rst visit to SIT, and was a valuable opportunity for bursary recipients to meet\nMr Soo and representatives from the company. The guests were treated to a song performance over lunch and the bursary recipients presented Mr Soo with a token of appreciation on behalf of SIT.3 Feb\n24SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nMARCH\n2016\n28 Aug,\n5 & 26\nFeb\nExpressSIT 2016\nThe ﬁ  rst concert jointly organised by\nSIT’s Performing Arts clubs – Muzeka, Just Singers and Soul Extreme – was a resounding success. Various music and dance groups delighted the audience, treating them to a diverse repertoire of songs and dance numbers. Deputy President (Administration) and Chief Financial Ofﬁ cer, Mr Chan Wing Leong, made a\nspecial guest appearance, performing a song item together with students.\nSIT Beach Fiesta\nThe sun, sand and sea provided\nthe perfect backdrop as more than 200 students engaged in friendly competition. The SIT Beach Fiesta featured four sports – Futsal, Touch Rugby, Ultimate Frisbee and Captain’s Ball – encouraging participants to try their hand at different games.Student Appreciation Dinners for\nStudent Athletes and Leaders\nSIT held three appreciation dinners\nin recognition of the contributions m a d e  b y  t h e  U n i v e r s i t y ’ s  s t u d e n t  athletes and leaders. More than 400 students attended these events.\nVolunteers’ Appreciation Dinner\nThe Volunteers’ Appreciation Dinner\nat Black Tongue Bistro & Bar saw 34 alumni and students enjoying a great night together. The annual dinner was held to thank the student hosts as well as alumni who continued to volunteer their time at various Advancement & Alumni events after their graduation.WDA-MOH Professional Conversion\nProgramme (PCP) Career Preview\nThe Workforce Development\nAgency (WDA) organised the annual Professional Conversion Programme (PCP) Career Preview at SIT@Dover to encourage m i d - c a r e e r  p r o f e s s i o n a l s  t o  t a k e  u p  Allied Health degrees offered by SIT. The event was attended by 180 guests and graced by Dr Amy Khor, Senior Minister of State for Health and Environment & Water Resources.\nCareer Nexus 2016\nAbout 100 companies and 500\ngraduating students attended Career Nexus 2016, SIT’s annual career fair. A new segment introduced was ‘Recruiters in Residence’, where students took part in mock interviews to receive feedback on interview techniques from recruiters. Another feature was ‘Voices of Experience’, a dialogue session where industry partners and alumni from GE Aviation, Gemalto, Google, PSA International and STATS ChipPAC shared their wealth of knowledge and what it takes for millennials to achieve career success. 6 Feb\n25 Feb13 Feb\n2 Mar\n28 Feb\n25SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nPersonality Application Workshop\nAt the Personality Application\nW orkshop held at OneFarrer Hotel  & Spa, 23 alumni and graduating students learnt how to use the Myers-Briggs Type Indicator\n® (MBTI) to\novercome challenges in relationships and develop a better decision-making process. This was the second in the series of Personality Application Workshops organised by the SIT Alumni Career Network.\nCXO Lean Summit\nSIT, Lean Enterprise Institute (LEI)\nand the Singapore Workforce Development Agency (WDA) inked an MOU to set up the Lean Transformation Innovation Centre ( L T I C )  i n  S I T ,  w h i c h  a i m s  t o  f u n ct i o n  as a one-stop resource and solutions centre for local companies and SMEs to learn and adopt manpower-lean practices and thinking.\nSIT Information Sessions\nRiding on the success of the SIT Open\nHouse, the SIT Information Sessions were held on 1 2 March 201 6 at SIT@Dover. The event took the format of a mini-exhibition coupled with a series of talks aimed at promoting interest in SIT-conferred and joint-degree programmes. Held a week after the release of the GCE A-Level results, the information sessions w e r e  a t t e n d e d  b y  m o r e  t h a n  7 0 0  prospective students and parents.5 Mar 10 Mar 12 Mar\nDPM Teo Chee Hean’s Visit to SIT\nDeputy Prime Minister & Coordinating\nM i n i s t e r  f o r  N a t i o n a l  S e c u r i t y  T e o  Chee Hean and his delegation visited SIT in March, where they toured the campus, learned about the institution’s applied learning and industry projects, and conversed with students about life at SIT. In addition, they also joined in the cake-cutting ceremony to commemorate SIT’s second anniversary as an Autonomous University.Reach for the Stars\nMore than 400 guests were hosted at Rafﬂ  es City Convention Centre for SIT’s\nﬂ agship scholarship event. The annual ‘Reach for the Stars’ saw interaction\nbetween SIT Senior Management, senior polytechnic and Overseas University (OU) partner representatives, industry representatives, and more than 300 scholars. The event also featured a video showcasing how industry partners have beneﬁ  ted from their partnership with SIT. This, in turn, garnered\ngreater interest from industry partners to offer scholarships to our students.14 Mar\n28 Mar\n24SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\n27SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nTo provide students with an integrated and holistic education experience, SIT’s\napplied learning pedagogy seeks to connect academic knowledge and skills with real-world applications in industry, while developing skills in collaboration, creativity, critical thinking and communications. SIT aims to prepare our graduates to navigate the 21st century world by imbuing them with the SIT-DNA.\nOur modes of applied learning range from passive learning in conventional\nclassroom settings (e.g. lecture/tutorial, lab demo and practice) to active hands-on learning in real work situations (e.g. Integrated Work Study Programme, clinical placement, capstone projects), with the aim of engaging students and enhancing the link between classroom and real work practice.\n• Student-centered, faculty-guided and complemented by a\ngroup of Professional Ofﬁ  cers as ﬁ  rst-line mentors\n• Reinforcing understanding through doing• Scaffolding of applied learning from within the classroom to\naspects of the real world\n• Authentic assessments whenever possible• Close collaboration with industry and community partners\n(via industry/capstone projects, IWSP)\n• Learning environment to support skills mastery\nThe concept of applied\nlearning at SIT includes the following features:\n28SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nELEMENTS\nOF APPLIED LEARNING AT SITSIT also facilitates the building of networks among our\nOverseas University (OU) partners to establish a unique, inter-varsity educational experience that is holistic and rewarding. By leveraging on our OU partners’ expertise to offer new educational opportunities for our students, this extended eco-system will be a gateway to greater opportunities for students in Pre-Employment Training (PET) and Continuing Education Training (CET). The partnership with OUs will also allow SIT to extend our network beyond Singapore and enable students to build global networks.\nCurriculum\nthat scaffolds\ntowards\nspecialisation\nLearning\nEnvironment\nto support\nskills\nmastery\nCollaboration\nwith industry\npartners: IWSP\n& projectsAuthentic\nAssessmentPedagogy\nApplied\nLearning\n01\nSIT’s applied degree programmes place a strong emphasis on skills mastery\nthrough enhanced collaboration with industry partners. All SIT degree programmes feature the IWSP, ranging from 8 to 12 months as a core component of its curriculum.\nDeveloped in consultation with the Building and Construction Authority\n(BCA) Singapore, the four-year programme aims to produce graduates trained in the areas of Efﬁ  cient Energy Management, Heating Ventilation and\nAir Conditioning (HVAC) and Building Information Modelling (BIM).\nThe four-year SIE (Land) programme is multidisciplinary as it encompasses\nvarious fundamental engineering disciplines. Students will undergo rigorous academic training while immersing themselves in the land transport industry through work stints with organisations such as LTA, SMRT, SBS, Keppel Group and Singapore Technologies.\nThis multidisciplinary four-year degree programme brings together the\nﬁ elds of mechanical, electrical, electronic, and computer engineering with\na holistic approach to system development. SEEMS focuses on the engineering of complex mechanical systems that are controlled by microprocessorsand microcontrollers.Master of Engineering Technology\n& Bachelor of Engineering with Honours in Sustainable Infrastructure Engineering (Building Services)\nMaster of Engineering\nTechnology & Bachelor of Engineering with Honours in Sustainable Infrastructure Engineering (Land)\nBachelor of Engineering with\nHonours in Systems Engineering(ElectroMechanical Systems)– Joint degree offered with DigiPenInstitute of TechnologyENGINEERING\n29SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\n30SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nINFOCOMM TECHNOLOGY\nA four-year degree programme that aims to provide holistic coverage of\nthe entire information security process from the securing of software to the defence, monitoring and recovery of information systems, as well as the governance and management of information security in an organisation.\nThis highly-specialised degree programme covers the design, development,\noperation, analysis, maintenance and management of software in a holistic and systematic manner. Graduates will be equipped with professional skillsets for general ICT job opportunities as well as specialist software engineering jobs.\nThe ﬁ  rst of its kind in Singapore, the degree consists of two interdisciplinary ﬁ  elds\n– Vehicular Telematics and Intelligent Transportation Systems (ITS) Engineering. Developed with support from organisations such as LTA, ST Electronics, NCS and Continental Automotive, this course will equip graduates with electrical engineering skills, computer science core skills, as well as ITS knowledge.Bachelor of Engineering with\nHonours in Information and Communications Technology (Information Security)\nBachelor of Engineering with\nHonours in Information and Communications Technology (Software Engineering)\nBachelor of Engineering\nwith Honours in Telematics (Intelligent Transportation Systems Engineering)The first of its kind in Singapore, the four-year programme will equip undergraduates with knowledge and skills pertaining to drug manufacturing, including drug development and production, process development, operations, validation, regulations and compliance.\nThis four-year joint degree programme combines food science, food\nengineering and food business. It equips students with the fundamentals of food science and applied food technology skills, all of which are required for a global career in the food industry. Bachelor of Engineering with\nHonours in Pharmaceutical Engineering\nBachelor of Food Technology\nwith Honours– Joint degree offered with Massey UniversityCHEMICAL ENGINEERING AND\nFOOD TECHNOLOGY\n31SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nDESIGN AND SPECIALISED BUSINESSES\nA three-year honours degree, the SIT Accountancy programme will hone\nstudents’ critical and analytical skills, as well as immerse them in the accounting and ﬁ  nance industry through work stints with established accountancy ﬁ  rms\nincluding Deloitte, Ernst & Young, KPMG and PricewaterhouseCoopers.\nThe ﬁ  rst and only hospitality programme among the autonomous universities in\nSingapore, this three-year programme aims to nurture hospitality professionals with strong operational skills and knowledge in a myriad of hospitality organisations, including hotels, integrated resorts and MICE companies. Bachelor of Accountancy\nwith Honours\nBachelor of Hospitality\nBusiness with HonoursHEALTH AND SOCIAL SCIENCES\nThis four-year degree programme – the only diagnostic radiography programme among autonomous universities in Singapore – prepares graduates for the role of a professional radiographer. The curriculum focuses on applied learning in the areas of health and behavioural sciences, radiological science and technology and radiography practice.\nThis four-year degree programme is designed to provide an excellent\neducational experience in the theory and practice of occupational therapy. Graduates can be employed in a variety of settings, including hospitals, rehabilitation centres and nursing homes.\nThe only radiation therapy programme among the autonomous universities\nin Singapore, this four-year degree programme prepares graduates for the role of a professional radiation therapist. The programme focuses on applied learning, integration of knowledge and practice and patient-centred care.\nThis four-year programme aims to graduate professional physiotherapists who\nare theoretically-grounded and clinically-oriented to practise autonomously in different specialities of physiotherapy. Students will have opportunities to gain clinical experience working in various hospitals and healthcare facilities in Singapore.\nThis one-year honours degree programme aims to extend the knowledge\na n d  s k i l l s  o f  r a d i o g r a p h e r s  t o  b e  a b l e  t o  u n d e r t a k e  m o r e  a d v a n c e d  a n d  evidence-based practice in radiography . Students will also participate in a  six-week clinical placement in Dublin.\nThis two-year post-registration programme builds on the foundation which\nstudents have established through their nursing diploma studies. Students will go through a six-week Clinical Practice Education in Singapore, as well as a four-week Overseas Immersion Programme in Glasgow. Bachelor of Science with\nHonours in Diagnostic Radiography\nBachelor of Science with\nHonours in Occupational Therapy\nBachelor of Science with\nHonours in Radiation Therapy\nHonours Degree in Bachelor\nof Science in Physiotherapy– Joint degree offered with Trinity College Dublin\nBachelor in Science\n(Diagnostic Radiography)– Joint degree offered with Trinity College Dublin\nBachelor of Science\nwith Honours in Nursing– Joint degree offered with University of Glasgow\n32SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nSIT works closely with the ﬁ  ve local polytechnics to prepare students as they progress from polytechnic to university.\nNANYANG POLYTECHNIC\nPrincipal & CEO, Ms Jeanne Liew\n“The year marks a signiﬁ  cant milestone\nin our journey with SIT. NYP’s four allied health diploma courses were transferred to SIT and upgraded to degree programmes. We have every conﬁ  dence\nt h a t  S I T  w i l l  c o n t i n u e  t o  n u r t u r e  b r i g h t  graduates for the allied health sector. For NYP graduates who want to further their studies, we are glad that they have new options to choose from with the launch of new degree programmes by SIT. NYP graduates will further beneﬁ  t from the deeper ties that SIT is\ndeveloping with the industry to provide more practical training which will build on their enriching NYP journey.”\nNGEE ANN POLYTECHNIC\nPrincipal, Mr Clarence Ti\n“The positive response to SIT’s degree\nofferings is a ringing endorsement of the quality of its programmes. It is commendable that SIT has so quickly established itself as a unique university with a strong applied learning approach that integrates learning, industry and community. Such an approach dovetails with Ngee Ann Polytechnic’s learning model, making SIT a good ﬁ  t for our graduates to\ndeepen their industry-relevant skills and knowledge. We hope to build on our partnership with SIT to develop the next generation of best-in-class specialists and professionals.”\n33SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nREPUBLIC POLYTECHNIC\nPrincipal & CEO, Mr Yeo Li Pheow\n“Republic Polytechnic and SIT have been ﬁ  rm partners in\neducation. We share a common goal of helping both young and adult learners gain a deeper understanding and appreciation for lifelong learning. Since the completion of the new SIT building in February 2015, SIT’s overseas university partner, the University of Glasgow, has been conducting classes for the Bachelor of Science with Honours in Computing Science undergraduate programme on RP’s campus. We look forward to building even greater partnerships going forward.”\nSINGAPORE POLYTECHNIC\nActing Principal & CEO, Mr Lim Peng Hun\n“The establishment of SIT has opened up ample\nopportunities to groom polytechnic graduates into masters of their chosen professions. As the SIT-DNA is well aligned with SP’s mission to prepare learners to be life-ready, work-ready and world-ready, we are proud to be a continuous partner of SIT and will provide our support as it scales greater heights.”\nTEMASEK POLYTECHNIC\nPrincipal & CEO, Mr Boo Kheng Hua\n“Temasek Polytechnic looks forward to continuing its strong\nties with SIT. We are proud that courses offered by SIT’s overseas university partners at TP, including The Glasgow School of Art and The Culinary Institute of America, will continue to build on the industry-relevant training that TP has provided its students. We are conﬁ  dent the courses offered at\nSIT will ensure the success of our graduates in today’s global economy and contribute to the growth and development of Singapore.”\nSIT continues to value its strong ties with overseas universities and provides\na world-class education for students to achieve their highest aspirations. With overseas university partners from Europe and the US providing world-renowned degree programmes, students are grounded in industry-focussed degrees and ensured professional relevance upon graduation.\nDigiPen Institute of Technology (DigiPen) is a dedicated, world-renowned leader in education and research in computer interactive technologies. As a leading institute of higher education, DigiPen is committed to fostering academic growth and inspiring creativity in all its students. As the first school in the world to offer a bachelor’s degree in game development, DigiPen has advanced the game industry for more  th an  2 5  y e ars  b y  empowering  studen ts  t o  become skilled software developers, computer scientists, engineers, designers and digital artists. Located in Redmond, Washington, U.S.A., with branch campuses in Singapore and Bilbao, Spain, DigiPen offers undergraduate and graduate degrees in disciplines related to video game design and development, hardware and software engineering applied to simulation, computer science, fine arts and digital art production, as well as sound design, and youth programmes.DigiPen (Singapore) students have won 16 major awards from\nthe Independent Games Festival, Tokyo Game Show and other international competitions. Graduates of DigiPen (Singapore) have gone on to work on ground-breaking game franchises such as Bungie’s Destiny, and have joined some of the top game and animation studios in Singapore – including Ubisoft, Lucasﬁ  lm, Koei\nTecmo and more.\nProgrammes offered in partnership with SIT:\n• Bachelor of Science in Computer Science  in Real-Time\nInteractive Simulation\n• Bachelor of Science in Computer Science\nand Game Design\n• Bachelor of Fine Arts in Digital Art  and Animation\n• Bachelor of Arts in Game Design\nProgrammes offered jointly with SIT:\n• Bachelor of Engineering with Honours  in Systems\nEngineering  (ElectroMechanical Systems)\nWe are delighted with our ongoing working relationship\nwith SIT. I have full conﬁ  dence that the collaboration will be\ninstrumental in providing the innovation and manpower needs for building a world-class interactive digital media and visual effects industry in Singapore. I believe that in the years ahead, our graduates will form a core group of professionals who will create world-renowned ‘Made-in-Singapore’ products for the global market.\n– Mr Claude Comair, President and FounderDIGIPEN INSTITUTE\nOF TECHNOLOGY\ndelig\nI ha\nental\nor buiWe a\nwith\ninstru\nneed s\nup of\nde-in-core g\ned ‘M\nder\n34SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\n35SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nN e w c a s t l e  U n i v e r s i t y  ( N U )  i s  a  m e m b e r  o f  t h e\nRussell Group comprising the United Kingdom’s 24 leading research-intensive universities, and is acclaimed for its multidisciplinary research, focusing on three societal challenges – ageing and health, sustainability, and social renewal. It is also noted for its teaching excellence and for the preparedness of its graduates for their professional careers, with an award of 5 Stars Plus (the highest possible rating) by QS, the respected publisher of world rankings. Besides its home base in the city of Newcastle upon Tyne, NU now has a strong and growing presence in London, Malaysia, and here in Singapore, with a total student population of around 25,000.\nNewcastle University can trace its origins back to\n1834 but it was the founding of Armstrong College in 1871 that introduced fundamental subjects such as chemistry, mathematics and physics to the University. Each of NU’s seven undergraduate programmes delivered in Singapore offers a modern and\nindustry-relevant interpretation of the subject, helping our students develop skills, knowledge and understanding, which prepare them for successful and satisfying professional careers.Programmes offered in partnership with SIT:\n• Bachelor of Engineering with Honours in\nElectrical Power Engineering\n• Bachelor of Engineering with Honours in\nMarine Engineering\n• Bachelor of Engineering with Honours in\nNaval Architecture\n• Bachelor of Engineering with Honours in\nOffshore Engineering\n• Bachelor of Engineering with Honours in\nMechanical Design and Manufacturing Engineering\n• Bachelor of Engineering with Honours in\nChemical Engineering\n• Bachelor of Science with Honours in\nFood and Human NutritionNEWCASTLE UNIVERSITY\nNewcastle University is proud of its successful teaching\npartnership with SIT. We are also proud of our strong research reputation which gives our staff the knowledge and expertise to deliver courses that produce graduates ready to contribute to industry and their professions in a fast-changing, modern world. We are delighted to be working in Singapore and contributing to the country’s ambitions for continued economic growth and technological innovation.\n– Professor Ian Postlethwaite, FREng, CEO and Dean\n(Singapore)le Un\nship\nh repu\npertiseNewc\npar\nresea\nand e\nc growth and\nO and Dean\nF o u n d e d  i n  1 8 6 8  b y  K i n g  L u d w i g  I I ,  T e c h n i c a l\nUniversity of Munich (TUM) has long established itself as a premier institute of higher learning in Germany, producing a total of 13 Nobel Laureates to date. Besides being ranked as Germany’s #1 University for 3 consecutive years – 2011, 2012 and 2013 Shanghai Ranking (Academic Ranking of World Universities, ARWU), TUM is also in the world’s top 50 for engineering and biological sciences, including placing 20th for Chemistry in the QS World University Rankings by Subject 2015. In 2002, TUM Asia, the branch campus of TUM, was set up in Singapore to bring German academic excellence to Asia. TUM Asia strives to continuously provide industry-focussed education offerings in tune with the\nneeds of the global economy.Programmes offered in partnership with SIT:\n• Bachelor of Science in Electrical Engineering &\nInformation Technology\n• Bachelor of Science in Chemical EngineeringTECHNICAL UNIVERSITY\nOF MUNICH ASIA 36SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nOver the years, the partnership between SIT and\nTUM Asia placed emphasis on a practical education, combining German Engineering with Asian relevance. Having witnessed positive results, we look forward to new collaborations to further equip the talent pipeline in Singapore.\n– Ms Monica Markovits, Assistant Head of Faculty\n(Chemistry)\nThe Singapore Institute of Technology, through its partnership with world-\nclass universities and its own degree programmes, prepares students to not only be critical thinkers with the uncanny ability to problem solve and innovate, but also provides the best talent of Singapore with the requisite skills to lead in ﬁ  elds that are drivers of the economy. Students and faculty\nare able to have access to alumni of both SIT and the overseas partners through the collaborative process. These relationships provide platforms of support which broaden the SIT network of committed and educated professionals who are world-class leaders in their ﬁ  elds of expertise and\nresearch. The Culinary Institute of America is delighted to be on the cutting edge, with SIT, of developing the leaders of the hospitality and food and beverage industries now and for the future.\n– Chef Eve Felder, Managing Director, CIA Singaporee ye\nsia\ning G\nwitneOver\nTUM\ncomb\nHavin\napore\niver\ny be cr\ne, but The S\nclas\nnot o n\ninnov aine in\ny nt pip\nFac\nn the\ny and to be\nospitaSince its establishment in 1946, The\nCulinary Institute of America (CIA) has set the global gold standard for culinary education. Its proven degree programmes have produced more than 48,000 culinary professionals, including top chefs such as Anthony Bourdain ’78, Cat Cora ’95, and Roy Yamaguchi ’76. The historic SIT-CIA partnership marks the first time the CIA has offered its programmes in Asia.Programmes offered in partnership with SIT:\n• Bachelor of Professional Studies in Culinary Arts\nManagementTHE CULINARY\nINSTITUTE OF AMERICA\nThe Glasgow School of Art is internationally\nrecognised as one of Europe’s leading university-level institutions for the visual creative disciplines. O u r  s t u d i o - b a s e d  a p p r o a c h  t o  l e a r n i n g  a n d  teaching brings disciplines together to explore problems in new ways to ﬁ  nd new innovative\nsolutions. The studio creates the environment for inter-disciplinarity, peer learning, critical enquiry, experimentation and prototyping, helping to address many of the grand challenges confronting society and contemporary business.\nSince the School was founded in 1845 as one\nof the ﬁ  rst Government Schools of Design, as a\ncentre of creativity promoting good design for the manufacturing industries, our role has continually evolved and redeﬁ  ned to reﬂ  ect the needs of the\ncommunities we are part of, embracing the late 19th century ﬁ  ne art and architecture education and\ntoday, digital technology. Then as now, our purpose remains the same – to contribute to a better world through creative education and research.All GSA degree programmes are validated by the University\nof Glasgow. Established in 1451, the University of Glasgow is a member of the prestigious Russell Group of leading UK research universities and a founding member of Universitas 21, an international grouping of universities dedicated to setting worldwide standards for higher education. Students may choose to study honours degree programmes in Communication Design or Interior Design in Singapore.Programmes offered in partnership with SIT:\n• Bachelor of Arts with Honours in Communication Design• Bachelor of Arts with Honours in Interior DesignTHE GLASGOW\nSCHOOL OF ART37SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nThe specialist design programmes and teaching at The\nGlasgow School of Art prepare our students for entry into the increasingly challenging and evolving world of creative industries. We encourage bold, critical and conceptual thinking and clear communication of ideas. Our graduates are skilled, conﬁ  dent and enabled to\ncontribute to and shape current and future knowledge and creative economies – locally, nationally and globally.\n– Mr Chris Hand, Programme Director, GSA Singaporecialis\nw Sc\ne incr\ntive inThe s\nGla\ninto t\nof cre\ned to\nedge\nbally.d ena\ne kno\nand g\nSA Singapore\n38SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nThe University of Manchester (UoM) was established\nin 1824 as England’s ﬁ  rst civic university and is now\nthe largest campus-based university in the UK. A member of the esteemed Russell Group, the UoM has a proud history of achievements with 25 Nobel Laureates among its staff and alumni. The UoM was the ﬁ  rst university in England to offer a nursing\ndegree and appoint a Professor of Nursing. The UoM continues to inﬂ  uence health care policy, practice,\neducation, and research by producing national and international nursing leaders. The UoM’s innovative two-year honours degree programme equips graduates to make evidence-based decisions in their practice, meeting the challenges of the changing demographic in Singapore health care. Clinical attachments allow Registered Nurses to develop and apply analytical skills in practice while the Manchester Leadership Programme provides opportunities to develop leadership skills. The UoM Programme Director, Dr John Costello, looks forward to consolidating the SIT-UoM partnership and the provision of a high standard of educational achievement.Programmes offered in partnership with SIT:\n• Bachelor of Science with Honours in Nursing PracticeTHE UNIVERSITY\nOF MANCHESTER\nAs the programme enters its ﬁ  nal year, the challenge\nr e m a i n s  t o  e n s u r e  t h a t  t h e  h i g h  s t a n d a r d  o f  e d u c a t i o n  that has been achieved so far is maintained, developed and improved. In focusing on our students, we hope to help them achieve their expectations of becoming knowledgeable doers who will make positive contributions to the Singaporean nursing profession. This year, a very high number of graduates will complete the programme with classiﬁ  cations they can be proud of. We have received\nvery positive feedback from hospitals and clinical areas where our students developed their nursing skills and applied theory to practice, and our clinical colleagues tell us that the SIT-UoM students make a difference and bring inspiration, motivation and new ideas to the hospitals. Our students this year can graduate with their heads held high, knowing that they are fulﬁ  lling the aims of SIT –\nbecoming thinking tinkerers, being able to learn, unlearn and relearn, act as catalysts for transformation and most of all, stay grounded in the community.\n– Dr John Costello, Associate Professor, Programme\nDirector, BSc (Honors) Nursing Practiceprogr\nto\nbeen\nprovedAs th\nrem\nthat h\nand i\nmost\nmeion an\nProg\nTrinity College Dublin (TCD) is Ireland’s highest-\nranked university with a history that dates back to 1592. Situated in the very heart of Dublin city, Trinity College Dublin is recognised as a top international centre for research with a high level of international collaboration. As Ireland’s University on the world stage, Trinity is recognised for academic excellence and a transformative student experience. The unique combination of TCD’s academic excellence, vibrant student experience, and convenient city-centre location means students, scientists, and scholars from all over the world continue to choose TCD as a study destination.Programmes offered in partnership with SIT:\n• Bachelor in Science (Physiotherapy)• Bachelor in Science (Occupational Therapy)• Bachelor in Science (Radiation Therapy)\nProgrammes offered jointly with SIT:\n• Bachelor of Science with Honours in Physiotherapy• Bachelor in Science (Diagnostic Radiography)TRINITY\nCOLLEGE DUBLIN39SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nFor over 128 years, Wheelock College (WLC) of\nBoston, USA, has been an outstanding institution that seeks to provide a transformational education to students who are passionate about making the world a better place, with a special emphasis on preparing its learners to teach, mentor, and nurture young children and their families. The Wheelock degree balances a deep understanding of theory w i t h  t h e  d e v e l o p m e n t  o f  r e a l - w o r l d  s k i l l s  i n  i t s  curriculum and internships, guiding its graduates t o  b e c o m e  s k i l f u l ,  s o u g h t - a ft e r  p r a ct i t i o n e r s  a n d  leaders in the professions of education, social work, child life, and juvenile justice and youth advocacy. Its broad-based, globally-focussed degrees provide a distinctly interactive classroom experience for its students, and its early childhood programme offered in conjunction with SIT employs a unique co-instruction model where most of its courses are taught jointly by Wheelock’s internationally renowned faculty members and Singapore instructors. Wheelock College Executive Director, Beth Fredericks, oversees the programme focussed on an on-going\ncommitment to ensuring a rigorous curriculum taught by caring and committed world-class faculty members. This, together with the immersion programme in Boston and tight bonds formed among students, promotes innovation and transformation in the lives of young children and their families.\nProgrammes offered in partnership with SIT:\n• Bachelor of Science in Early Childhood EducationWHEELOCK\nCOLLEGE\nSince the inception of the Physiotherapy and Occupational\nTherapy programmes in 2012 and the Diagnostic Radiography and Radiation Therapy programmes in 2014, the Trinity degree programmes have received good feedback from students, graduates, and employers. The programmes are very popular and Trinity is delighted to continue and develop its collaboration with SIT.\n– Associate Professor John Gormley, TCD Academic\nDirector for SIT programmes, School of Medicineince\ny p\nraphy\ne Trini\nkfince\nThe\nRadio\n2014,\nfd b\nSIT.\nCD Academic\nMedicine\nAs more and more countries commit to early learning as\na priority essential to their economic and civic future, Wheelock College continues to provide highly-trained early childhood educators as a crucial building block for nations to remain competitive and dynamic. As the need for early childhood expertise grows across sectors – technology, media, museums/libraries, business – our graduates will be the creative problem-solvers who are willing to seek out and test new ideas, take risks, learn from failure, and share their ﬁ  ndings.\n– Ms Beth Fredericks, Executive Director, WLC Singaporeand\nty e\nck Co\nod ed\niAs m\na p\nWhee\nchild h\nt\nk out g to s e\nre, and share\nLC Singapor\nThe University of Liverpool is one of the UK’s\nleading research institutions with an annual turnover of £465 million, including £89 million for research. Ranked in the top 1% of higher education institutions worldwide, Liverpool is a member of the prestigious Russell Group of the UK’s leading research universities.\nThe University has 32,000 students, 7,400 of\nwhom travel from all over the world to study there, and 195,000 alumni in 200 countries. Its global focus has led the institution to establish a university in Suzhou near Shanghai in partnership with Xi’an Jiaotong U n i v e rs i ty ,  a s  w e l l  a s  a  ca m pu s  i n  L o n d o n . The University is the largest provider of 100% online postgraduate degree courses in Europe with over 10,000 students studying for Liverpool degrees around the world. Programmes offered in partnership with SIT:\n• Bachelor of Arts with Honours in Criminology and SecurityUNIVERSITY\nOF LIVERPOOL40SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nAs the fourth-oldest university in the English-\nspe aking  world ,  Uo fG  h as  been  inspi ring  people  for over 560 years. It is also part of the United Kingdom’s distinguished Russell Group of leading UK universities and a founding member of Universitas 21 – an international network of universities established as an international reference point and resource for strategic thinking on issues of global signiﬁ  cance. It\nis associated with seven Nobel Laureates and boasts alumni including Adam Smith, Lord Kelvin and James Watt. UofG sustains a broad portfolio of cutting-edge research funded by industry, research councils, and governmental agencies around the world.Programmes offered in partnership with SIT:\n• Bachelor of Engineering with Honours in Aeronautical Engineering• Bachelor of Engineering with Honours in Aerospace Systems• Bachelor of Engineering with Honours in Mechanical Design\nEngineering\n• Bachelor of Engineering with Honours in Mechatronics• Bachelor of Science with Honours in Computing Science\nProgrammes offered jointly with SIT:\n• Bachelor of Science with Honours in NursingUNIVERSITY OF GLASGOW\nThe year 2016 has been an exciting one for the BA (Hons) Criminology\nand Security. We recently completed our ﬁ  rst full cycle of the\nprogramme, and our ﬁ  rst cohort can now enjoy going back into the\n‘real world’ to apply the knowledge and skills that they have gained over the past three years. We look forward to hosting our ﬁ  rst\ngraduation celebration in October 2016 where we will recognise the remarkable achievements of our pioneer batch of 40 students. This will also be a moment to reﬂ  ect on the fantastic collaboration between the\nUniversity of Liverpool and SIT – the programme continues to be one of the most popular courses offered by SIT and it is still truly an honour to be involved in shaping the direction of criminology in Singapore and Southeast Asia given that this remains the ﬁ  rst and only undergraduate\ndegree in criminology in Singapore. In the coming months, we will be increasing our staff numbers by 57% and our student numbers by 30% which is an exciting challenge that we will embrace with full vigour.\n– Dr Leon Moosavi, Programme Director and Lecturer in\nSociology, University of Liverpool\nI am delighted that our programmes with SIT continue to\nact as a beacon among international collaborations, as we aim to equip our staff and students for the challenges of the future. Our new joint Nursing degree is a great example of our continually growing partnership and I look forward to more innovative developments between our two institutions.\n– Professor Anton Muscatelli, Principal & Vice-Chancellor2016\ncurit\nmme, a\nrld’ to\nep a s the ye\nand\nprogra\n‘real w\nover t\nghte\nbe\nto equ\nuture\neo fo uam d\nact\nwe aim\nof the\nexampy 30%\nur. ,\nmbers\nfull vig\nture\ngreat\nlook\nn our\ncelloee is\nhip an\nbetwe\nce-C\nThe Centre for Learning Environment and Assessment\nDevelopment (CoLEAD) was established to develop positive teaching, learning and assessment practices that support the overarching educational vision of SIT. CoLEAD seeks to imbue good learning and teaching frameworks for all degree programmes right from the onset, with clear intentions and directions to develop the SIT-DNA.\nCoLEAD has teams of learning designers and\neducational media producers who support the faculty’s learning needs and classroom teaching through the use of technology. Its mission is to:\n• Develop pedagogy based on IT-enhanced learning\nand promote ICT-enabled learning environments.\n• Induct and provide on-going support for faculty\nmembers in effective teaching and learning practices.\n• Facilitate faculty members in embracing and\nadopting good assessment design practices that drive students’ learning and measure their ability reliably.\n• Drive the learning outcomes of SIT and develop\nthe necessary assessment tools to realise them.\n• Engage in, and promote, the scholarship of teaching\nand learning within and beyond SIT.CoLEAD constantly reaches out\nand connects with faculty to drive effective teaching and assessment practices in SIT. Some activities that were put in place to support these functions include:\nCONNECT AND\nCOLLABORATE WITH COLEAD\nResources\nSupport for classroom practices e.g.\nclassroom observation and microteaching.\nSupport for learning design e.g. module\ndesign and development, lesson planning, design, eLearning & blended learning and assessment design.Providing resources to enhance faculty members’\nteaching and assessment proﬁciencies.\nT eaching Grants\nSupporting and motivating faculty members who\nhave effectively implemented applied learning\nacross SIT through internal awards and grants.\nSIT Advancement for Learning\nand Teaching (SALT) Grant\nTeaching Excellence Award at\nSIT (TEA@SIT)\nJUNE\nLesson Plan\nInnovative T&L\nIntroducing innovative ways to faculty\nmembers to teach differently.\nAdapative Learning Online System\nApplied and Collaborative Learning\nEnvironment (ACE)\nTechnology-enhanced Methodologies\ne.g. Learning Catalytics, NetSupport\nSchool and Camtasia\nVideos/media usage for MOOCs, ﬂipped\nclassroom and planning of e-lessons\nfor blended learning\nT eaching Development\nProviding opportunties for all faculty members to\ndevelop professionally as educators through our signature programmes.\nTeaching Induction Programme (TIP)\nTeaching Foundation Programme (TFP)Communities of PracticeLunchtime SeminarsWorkshops41SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nThe Professional Ofﬁ  cers Division (POD)\nwas established as part of the Academic Group in January 2015 to centrally manage SIT laboratory capabilities and resources, mentor students during laboratory work, p r o j e c t s  a n d  I n t e g r a t e d  W o r k  S t u d y  Programmes (IWSP), as well as work with faculty on industry projects.\nIn AY15, POD set up and operationalised\na total of 30 labs for 8 SIT academic programmes, and also established Lab Standard Operating Procedures (SOPs) and over 90 Risk Assessments (RAs) for the lab teaching modules and project activities. The division also imbues industry ‘shop ﬂ  oor’ practices in the lab\nenvironment, whereby students adhere to regulatory requirements, safety requirements, ‘5S’ housekeeping, and understand risk assessments and safe work procedures.\nPOD continues to adopt safety\nconsciousness while ensuring lab requirements are fulﬁ  lled for the setup\nof another 20 labs for AY16 academic programmes.\nThe division is progressively involved in mentoring students through hands-on projects. For the SEEMS programme, our POs worked closely with students, which culminated in the demonstration ﬂ  ights for the students’\nquadcopter project in April 2016.\nPOs have also mentored students on IWSP for the Accountancy and\nHospitality Business programmes in AY15, and are preparing for student mentoring in AY16 for Sustainable Infrastructure Engineering and ICT IWSP.\nOn the applied research project front, POD supported SIT academic staff\nin 15 applied research projects funded by Enterprise & Innovation Hub and external funding agencies.\n42SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nMoving forward, POD will\ncontinue to strengthen the linkages between SIT students and the industry, as well as promote sharing of SIT laboratory capabilities and resources to achieve higher efﬁ  ciency.\n01SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201639SINGAPORE INSTITUTE OF TECHNOLOGYANNUAL REPORT 2016\n44SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nTRIPARTITE\nRELATIONSHIP – STUDENT, STAFF, INDUSTRY\nStay current and\nrelevant to industry\nthrough bringing\ninnovation to\nindustrial problems\nReceive authentic learning in an\nindustrial setting with real challengesContribute to manpower\ndevelopment; get an innovative solution to a problemSIT is committed to building a\nsymbiotic  relationship with industry.\nThe tight nexus  begins with developing SIT programmes through extensive\nconsultations and collaborative efforts with industry. SIT also caters to industry’s needs in\nmanpower development  and innovation  through\nre-skilling and up-skilling programmes, as well as industry projects. On the other hand, industry provides our students with\nreal work experience\nthrough the Integrated Work Study Programme (IWSP) and collaborative projects. This mutually beneficial relationship is a key feature of SIT’s Applied Learning pedagogy that enables SIT to produce graduates who are\nhighly adaptable  and employable .\nStudentIndustry\nStaff\n45SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nSIT adopts a T-shaped Innovation model\nt o  e n s u r e  t h e  c o n t i n u o u s  d e l i v e r y  o f  an industry-relevant education to our students. The horizontal bar of the model aims to provide broad-based industry support through internal grants. The vertical bar of the model focuses on developing key technology themes in core research areas such as sustainable infrastructure engineering, cyber security, healthcare innovation and lean thinking.SIT’s Enterprise & Innovation Hub (E&I Hub) was\nofﬁ cially launched in January 2015. E&I Hub aims to be\nthe focal point for industry projects and collaboration with companies, moulding enterprising and innovative students by enhancing their learning experience.\nRedeﬁ  ning Innovation\nBuilding Technology Themes through InnovationThe E&I Hub has four distinct areas of work:\n• Act as focal point for industry and community projects• Champion industry and community collaboration• Manage grant schemes that support industry projects• Develop innovative and enterprising students\nStrategic T-shaped Innovation Model\nEnhancement of Student Learning and\nCareers to Stay Industry Relevant\nInternal Grants to Support\nIndustry/Community Projects\nDeep\nFocus\nin Key\nTechnology\nThemes\nIndustry and Community\nIndustry and Community\n46SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nE&I Hub is home to an entrepreneurship ecosystem that\nembraces the enterprising spirit and is a conducive place for students keen to start up. The ecosystem has these components:\nThe Catalyst Fund is an internal fund to support deserving\nbusiness ideas from students. Through regular calls for business ideas, students submit their ideas to a panel for evaluation. Deserving ideas are funded up to $10,000, with examples including:\n• Sustainable living  – This project looks at incorporating a\nthermoelectric generator (TEG) into commonly used gas stove, where the TEG will convert heat energy into electrical energy. The electrical energy could be redistributed back to the energy grid for storage or to be used later.\n• Application for daily chores  – A community-based\napplication which seeks to connect ordinary people with The industry and community projects are complemented\nby E&I Hub’s grant management scheme – Ignition and Innovation Grant. The grant scheme helps to support projects, build capabilities, and allow faculty to remain relevant in the industry. Some 15 industry collaboration projects (involving 32 faculty , 1 2 Professional Ofﬁ  cers and\n76 students) were awarded under the grant.\nBesides supporting broad-based applied research, there\nis also a need to build in-depth vertical components of the T-shaped model by focusing on key technology themes. One effort is to initiate Technology Innovation Centres (TICs) – specialised centres with deep expertise on industry needs.Grants to Support Faculty\nEntrepreneurship Ecosystem\nProjects Supported by Catalyst FundThe development of technology competencies and\nTICs are strategic to SIT and allow for: • Faculty to work with organisations looking for innovative\nsolutions for industry-speciﬁ  c technological challenges;\n• Faculty to initiate the development of technology\nclusters by identifying critical needs of the industry.\nBy forging partnerships with the industry, we are not only\nbuilding the University’s technical competency, but also establishing a symbiotic relationship with industry to make SIT the choice for industry collaboration and project work. This will, in turn, help students apply theory into practice and deliver a truly authentic learning opportunity.\n• Inculcating an I&E culture  – Foster via talks, Enterprise\nImmersion Programmes and activities.\n• Facilitating policies  – Good policy system to facilitate\nenterprising ideas to reap maximum potential (e.g. IP management).\n• Human capital  – Training and exposure to business\nskills via Enterprise Immersion Programme.\n• Finance  – Reﬁ  nement of ideas and businesses to tap on\ngrants and funding.\n• Network  – Vast linkage to professionals (e.g. mentors)\nand assistance to enable starting up.\n• Facilities  – The Catalyst provides incubation space\nfor start-ups and MakerSpace to experiment with prototyping.\nWith the entrepreneurship ecosystem and close\ncollaborations with industry partners, we aim to enhance students’ competencies, inculcate innovation, and infuse an enterprising spirit.\none another for daily chores (e.g. sewing, changing taps,\netc.). The application allows users to put up a “job” and members (e.g. skilled people in the neighbourhood) could help for a small fee.\n47SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nE&I Hub has achieved several milestones in\nAY2015/2016:Community Innovation provides a platform to expose\nstudents to real-life issues affecting community organisations. Through hands-on projects, students address such community issues with technological or innovative improvements.\nS o m e  e x a m p l e s  o f  i n n o v a t i v e  s o l u t i o n s  f o r  t h e\ncommunity were:\n• Interior design  – The project allowed students to\nexercise their knowledge and creativity to conceptualise interior design for the refurbishment of patient-centric activity spaces in Kwong Wai Shiu Hospital.\nFormation of Technology Innovation Centres\n• Launched the Lean Transformation Innovation Centre\n(LTIC)  on 10 March 2016. LTIC will be a focal centre for\nSMEs to acquire relevant knowledge, provide manpower training and also co-develop technological solutions that will help them be more manpower-lean.\n• Establishment of the SIT-LTA Transport Research\nCentre  by partnering Land Transport Authority (LTA)\nto establish a technology centre to support the land transport sector in Singapore.\nClose collaboration with partners\nWe have collaborations with partners in various areas:Community Innovation\nMilestones• New design for walking stick  – A new design was\ndeveloped with inputs from nursing professionals to allow for better mobility.\n• Kwong Wai Shiu Hospital  – Collaboration on a series\nof community innovation projects to improve eldercare services.\n• Institute for Infocomm Research  – Collaborative\nefforts in cyber security and engineering.\nLaunch of The Catalyst\nTo testbed ideas and programmes, E&I Hub piloted a MakerSpace for students named The Catalyst. Within 7 months of its inception, The Catalyst has supported more than 6 industry projects. The Catalyst also hosted visits by university partners including Kanazawa Institute of Technology, Case Western Reserve University as well as political leaders such as Deputy Prime Minister Teo Chee Hean and Acting Minister for Education (Higher Education and Skills), Mr Ong Ye Kung.\n48SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nThe Industry-Programme Partnership Division, under the Industry and Community Group, was set up to facilitate\ncollaboration and deepen partnerships between the University and industry. Through such collaborations, we aim to enhance the delivery of the programme curriculum so that students receive an education that includes substantial industry exposure, in line with SIT’s applied learning pedagogy.\nOur mission is to establish long-term relationships via multiple touch points during the programme lifecycle so as to\nprovide SIT students ample opportunities to be engaged with industry.\n• Industry Programme Scanning (IPS)\n• Dual Studies Programme (DSP)\nIndustry Programme Scanning (IPS)\nThis is done to gather intelligence on economic, market, technological and manpower needs in the various industry sectors. The information is used to determine the viability and relevance of new and existing programmes.\nDual Studies Programme (DSP)\nDual Studies (DS) refers to a practical-oriented training model where the University and companies can complement one another – theoretically-acquired knowledge in the classroom can find practical application in a company. It alternates between coursework at SIT and other project-based work at the host companies. The objective of the DSP is to support companies in building their talent pipeline in the long run. Companies may consider the DSP as part of their talent management strategy.\nAn example of the programme structure is shown below:Mission\nFunctions\n• Industry Learning Labs (I-Labs)\n• Capstone Projects\nDurations are merely indicative and may vary according to programme.Year\n1Year\n2Year\n3Year\n4\nFoundation StudiesCore Studies(During vacation) (Final Year Project)\n(8-12 months)Advanced StudiesIndustry Induction Capstone Project\nIWSP\n49SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nDual Studies Programme (Full)\nStudents on the Dual Studies Full programme are sponsored by companies and they are required to stay with the same company throughout the programme.\nAnother four students started on the Industry Induction\nprogramme for the Bachelor of Engineering degree in Sustainable Infrastructure Engineering-Building Services (SIE-BS) in June 2016 at Civil Engineering ﬁ  rm, Arup.\nSeveral of these companies have indicated their interest to\nextend the collaboration with SIT through the Integrated Work Study Programme in the following years.\nIndustry Learning Labs (I-Labs)\nWith guidance from the Academic Group, IPP works with industry to set up Industry Labs. These are teaching labs which are created with the curriculum in mind. These labs can be located either within the University or within the premises of an industry partner. The Industry Labs are jointly set up by SIT and industry to be used by both students and industry partners to study and work on industry issues.\nStudents will have a chance to translate theory into practice,\nthereby deepening their skillsets and competencies. Usage of equipment hardware or software sponsored by the industry can also help the university to keep teaching tools up to date.\nIndustry Labs can also house advanced technology that is\nnot easily available from external resources. Industry can then tap on these labs to access the latest technologies for prototype and application developments.\nCapstone Projects\nCapstone projects are essentially industry projects adapted to become ﬁ  nal-year projects that are pegged\nat the right level for students. Instead of working on hypothetical problems, Capstone projects provide students with opportunities to address real-world problems.\nIPP will scour the industry for opportunities together with\nthe Academic Group (AG). Once identiﬁ  ed, the relevant\nA G members will translate them into Capstone projects for the ﬁ  nal year students.\nForging Ahead\nThe Industry-Programme Partnership Division facilitates industry engagement ranging from early exposure of students\nthrough industry induction, deepens the industry interaction and exposure by encouraging university-industry collaboration through I-Labs and seeks opportunities for applied learning through joint Capstone projects. This will create a mutually beneﬁ  cial relationship for both the student and company which could ultimately result in employment\nopportunities for students, even before graduation. We continuously strive to develop and maintain sustainable collaboration models that make SIT the university of choice for our valuable industry partners.\nMs Eyrica Lee, an SIT student from the Bachelor of Engineering (Hons) degree programme in Systems Engineering (Electromechanical Systems) was awarded the Dual Studies Sponsorship by Uhlmann Singapore under the pioneer Dual Studies Industry Sponsorship Programme launched by SIT. The AY2016 sponsorship programme saw three students being sponsored by the following companies: Feinmetall Singapore Pte Ltd and Pepperl & Fuchs Asia Pte Ltd.\nFollowing the success of the programme with\nparticipating German companies, it will be extended to local companies with two models – Co-operative model and Dual Studies (DS) model. In the Co-operative model, the student alternates between full-time study in SIT throughout the trimester/s and full-time work in the sponsoring company in the following trimester/s. For the DS model, the student spends part of the week in SIT and the rest of the week in the company.\nDual Studies Programme (Lite)\nStudents on the Dual Studies Lite programme are not sponsored by any company. Although not obliged to do so, students are encouraged to stay with the same company throughout the programme.\nIn May-June 2016, 13 SIT Information & Communications\nTechnology (ICT) students embarked on the inaugural round of Industry Induction at the following companies: Banff Cyber Technology, Data Storage Institute, Deloitte and Touche, Mobile Credit Payment, Quann and Starhub.\n50SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nSIT created the Integrated Work Study Programme (IWSP), a salient feature of the University’s educational experience,\nto provide students with opportunities to integrate the knowledge they have gained in the classroom with real-world practice. The programme is a win-win for both industry partners and students – IWSP is an excellent platform for students to gain work experience, while industry partners gain access to a pool of resources in terms of work-ready employees.\nStudents will be immersed in a real work environment for 8 to 12 months, longer than traditional internships, which\nenables true integration into the workforce. Faculty and company supervisors will work together to achieve the following objectives:\nBuilding Career and Professional Skills\nStudents will go through the experience of the job marketplace by applying to participating companies for IWSP positions, undergoing their employee selection processes, and experiencing subsequent induction and training in the real work environment. This will prepare them to be effective employees in their career and professional life.\nIntegrating Knowledge and Practice\nStudents will be guided to apply theory to practice under the close supervision of a faculty member. Learning objectives will prompt students to reﬂ  ect on how classroom knowledge and skills relate to real\nwork situations.\nDeveloping Skills for Innovation in Companies\nStudents will be challenged during the IWSP to initiate innovation projects. Through such projects, students will have the opportunity to apply innovation skills and develop solutions.\nEmployers found that with the involvement of the SIT supervisors and IWSP’s longer duration as\ncompared to traditional internships, students gained more technical skills and work experiences. They also commented that IWSP students are different from typical interns as they are more serious about their work and have a greater capacity to learn.1\n2\n3\nAt SIT, students engage in the career development process through a myriad of activities\norganised by the University such as Career Fair, networking events, career success workshops, industry talks and company visits. The University’s Career Coaches also support students by conducting resume review sessions and mock interviews.\nCareer Services organises the following Career Success Workshops:\n• Assessment Centre\n• Career Planning and Management• Interview Skills• Job Search Strategies• LinkedIn Workshop• Networking Skills• Resume and Cover Letter Writing\nOver the past year, 37 workshops were\nconducted for 820 students.In the past year, Career Services arranged 13 industry\nand recruitment talks in collaboration with companies such as Google and Thales Group. The division also organised 9 company visits to companies such as Airbus Helicopters and Accenture to provide students networking opportunities with industry experts and potential employers.\nTan Ming Wei\nManufacturingEngineer, BaxaltaTechnical University of Munich, ChemicalEngineering, BScClass of 2014\nSIT Career Services aided me tremendously not only during\nmy course of study, but also after I graduated. The skills taught during the Career Success workshops are still helpful to me today. I remember during one of the workshops, the trainer spoke about effective communication; this p r o m p t e d  m e  t o  o v e r c o m e  m y  s h y n e s s  t o  g a i n  t h e  conﬁ dence to speak and express my point of view.\nMy Career Coach was also very helpful as she taught me\nhow to ask questions to the interviewers in a professional manner, and how to portray myself as calm and conﬁ  dent.\nW i t h  h e r  g u i d a n c e  a s  w e l l  a s  w h a t  I  l e a r n t  f r o m  t h e  workshops, I was able to secure a job in Baxalta just one month after graduation.INDUSTRY TALKS AND\nCOMPANY VISITS\nA professional from LinkedIn teaches students how\nto create personal branding and increase visibility using LinkedIn\nA workshop for students on how to handle an\nAssessment Centre\nervice\nof st\nng the\nay. I re\nr spok\ntCare\ny co\naught d\no me t\nhe trai\nt\nught m\nessiona\nnﬁ dent\nm th\nust onas she\nin a pr\nm and\narnt\nBaxa51SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nCAREER SUCCESS\nWORKSHOPS\nCareer Services actively reaches out to the industry to secure positions for the Integrated Work Study Programme\n(IWSP). In 2015, 83 Accountancy students embarked on the inaugural round of IWSP in 13 companies: Ardent, Baker Tilly, BDO, Deloitte, EY, Foo Kon Tan, KPMG, Mazars, Nexia TS, PKF-CAP, PwC, RSM Chio Lim and RT.Ms Nur Sabreena Binte Hassan\nSystems Engineer,  Land Transport AuthorityNewcastle University, Mechanical Design andManufacturing Engineering,BEng (Hons)Class of 2016\nMs Tan Li May\nIT Engineer, ASE Company\nUniversity of Glasgow,\nComputing Science,\nBSc (Hons)\nClass of 2015M y  C a r e e r  C o a c h  h e l p e d  m e  t o  t a i l o r  m y  r e s u m e  i n  a  w a y  t h a t  i s  i d e a l  a n d\nrelevant to potential employers, which is the ﬁ  rst step in a job search. I met my\ncurrent employer at Career Nexus, where I was able to network with them and submit my resume. With a resume that displayed my strengths and capabilities, I was shortlisted for interviews and offered a job before graduation!\nCareer Services also organised company visits, which gave me the opportunity\nto interact with people from the industry and hear ﬁ  rst-hand about what they\nexpect from fresh graduates.\nMy advice to juniors? The future may seem distant, but in fact, it will come sooner\nthan you think. You can start preparing now by cleaning up your resume and talking to your Career Coach and seniors about the job search process and the different types of job scopes. It may take a while to know where you see yourself in the future but take little steps and never stop trying. Go for interviews with conﬁ dence, keep an open mind, ask questions and always be yourself!\nI found the Interview Skills workshop organised by Career Services very beneﬁ  cial\nas it taught me how to nail an interview. It was a good experience practising with my classmates too.\nI also attended Career Nexus, which gave me insights into the different types\nof jobs in the industry and widened my options. It was through Career Nexus that I secured my current job, because I had the opportunity to chat with my potential employers directly. I got to understand what the company does and the different job roles that were available. Shortly after I submitted my resume, I was shortlisted for an interview and offered a job.\nDuring my time in SIT, I’ve had the chance to attend several company talks and\neven visited Bloomberg, which was an eye-opening experience. I have also sought help from my Career Coach, who gave me guidance and tips, especially with resume writing and interview skills.\nCoac\npot\nployer\nresum e\nlisted fy Ca\neleva\nurrent e\nubmit m\nwas sho\nume an\nand t h\nyourse\ns wityour re\nh proc e\ne you s\ninte\nourse\nInterv\nt me\nates too\nnded Cound\ns it t\nmy class\nalso at\nalks an\nave als\necialompan\nence. I\ntips52SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nCAREER COACHING &\nNETWORKING EVENTS\nEMPLOYER OUTREACH\nFOR IWSP\n01SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 201649SINGAPORE INSTITUTE OF TECHNOLOGYANNUAL REPORT 2016\nAt SIT, we believe strongly that our graduates can serve the\ncommunity through knowledge an d skills that they acquire\nfrom their studies and work experience. Working with faculty, Professional Ofﬁ  cers and their peers, our students are involved\nin projects that help\nimprove the social, economic or\nenvironmental aspects of the community . While SIT provides\nthe opportunities, resources and mentorship for this process, the community, in turn, is a\nlearning platform  for students to\nexercise their skills and knowledge. In the end, SIT graduates will be\ngrounded in the community , looking for opportunities\nwhere they can contribute. They will become part of the support network that\nstrengthens social and economic bonds  of\nthe community.\n55SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nAs we aspire to be a leader in innovative university education by integrating learning, industry and community, SIT\nengages in various projects in an effort to give back to our community.\nIn celebration of Singapore’s 50th anniversary, SIT embarked on the SG50 Punggol Community Project – ‘Remembering the Past, Inspiring the Future’ – to document and celebrate the past, present and future of Punggol community. This project was a starting point for SIT to better integrate with Punggol, which will be home to SIT’s centralised campus in the future. Through oral history interviews, photographic and video narratives, the project aimed to capture a holistic portrait of Punggol, with students from the Communication Design and Interior Design programmes offered by The Glasgow School of Art (GSofA) creating original art pieces. A roving exhibition of the collection and a coffee table book are planned for 2016 – the collection will eventually be displayed at the Punggol campus, while materials gathered will be sent to the National Archives.SG50 Punggol Project\nSeveral prize-winning works from SIT students were\nshowcased at ‘The Future of Us’ , an immersive and multi-sensory exhibition that provided a glimpse into the possibilities of how Singaporeans could live, work and play in the future. University of Glasglow (UofG) students from Mechatronics and Mechanical Design Engineering degree programmes invented the ‘Hybridised Energy Harvester’ that creates power banks, while SIT-GSofA students from the Interior Design degree programme came up with ‘Singapore’s Kampongminium – Sea-ty’ (pictured above), a new housing vision combining sea and western-style clustered living.‘The Future of Us’ Exhibition\n56SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nStudents from SIT are helping to improve eldercare\nthrough innovation and interior design at Kwong Wai Shiu Hospital. A team from SIT worked with the hospital to develop a heel-raise device that provides more objective measurements and enhances effectiveness of rehabilitation. Students from the SIT-GSofA Interior Design programme also designed activity spaces incorporating elderly-friendly features, including ones targeted at dementia patients. The students’ work was showcased to DPM Teo Chee Hean during his visit to SIT@Dover on 28 March 2016, as well as at the Hospital Design and Development Asia Conference held from 29 to 30 March 2016. Improving Eldercare at Kwong Wai Shiu Hospital\nSIT students contributed to Project COMPASS\n(Community Park Safety & Security) by developing two projects – the Automated External Deﬁ  brillator\nStand (AED) Surveillance System – which can be placed at remote areas for use during emergencies; and the Solar-powered Anti-theft Free and Easy Box (SAFE) – a cost-effective anti-theft storage box installed at basketball courts. The project was awarded the Sector Excellence Award by Singapore Police Force and Singapore Civil Defence Force of Home Team. Project Compass\nThe students and staff from SIT who were involved in the innovation project.\nPHOTO: Punggol NPC Community Policing Unit\nFinancial assistance is given to deserving students enrolled\nat SIT. The ﬁ  nancial aid covers expenses that include tuition\nfees and costs for overseas programmes. SIT is firmly committed to a policy that strives to give our neediest students the assurance that a quality university education is well within their reach.\nThanks to our industry partners, government agencies and organisations,\nour students have been able to receive various forms of bonded scholarships through sponsorships to pursue their degree programmes.\nAgri-Food & Veterinary Authority of Singapore\nAlexandra HealthAsia Paciﬁ  c Breweries Foundation\nAssociation of Singapore Marine IndustriesBuilding and Construction AuthorityCentre for Strategic Infocomm TechnologiesEarly Childhood Development AgencyEastern Health AllianceFar East OrganizationInfocomm Development Authority of SingaporeJumbo Group of RestaurantsJurong Health ServicesKeppel Offshore & MarineLand Transport AuthorityMaritimeONEMedia Development Authority of SingaporeMENDAKIMinistry of Communications and InformationMinistry of DefenceMinistry of Home AffairsMOH Holdings Pte Ltd\nThe following industry partners have provided\nscholarships/sponsorships to SIT students\nNational Council of Social Service\nNational Environment AgencyNational Healthcare GroupNational University Health SystemNovartis Singapore Pharmaceutical Manufacturing Pte LtdNTUC First CampusOverseas Union Enterprise LimitedPublic Utilities BoardRafﬂ es Medical Group\nRen Ci HospitalSBS TransitSembcorp Industries LtdSembcorp Marine LtdSingapore Civil Defence ForceSingapore Health Services Pte LtdSingapore-Industry Scholarship (SgIS)Singapore Power LimitedSingTelSociety for the Physically DisabledSt Luke’s Hospital58SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\n59SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nAbwin Pte Ltd\nAmazon Web Services Singapore Private LimitedApplied Materials South East Asia Pte LtdAscendas Funds Management (S) LimitedBaker Tilly TFW LLPBDO LLPBuddhist Compassion Relief Tzu Chi Foundation (Singapore)CEI LimitedCentre for Strategic Infocomm TechnologiesMr Choo Chiau BengMr Choo Chong NgenDou Yee Enterprises (S) Pte LtdDrilmaco Pte LtdECM Libra FoundationEMS Energy LimitedEPS Computer Systems Pte LtdFar East OrganizationFeinmetall Singapore Pte LtdFoo Kon Tan LLPMr Foong Hock MengGIC Private LimitedMr Jeff GohGoh Bee Gah Foundation through SymAsia Foundation LimitedGoh FamilyGoh FoundationHiap Chuan Hardware (Pte) LtdHome-Fix DIY Pte LtdInstitute of Materials (East Asia)JCS-Echigo Pte LtdMr Jeffrey KhooKCTex International LtdKeppel Care Foundation LimitedKeppel Corporation LimitedMr Kevin LiangMr Kuok Khoon HongKwan Im Thong Hood Cho TempleMr Lee Soon TeckMr Lim Siah MongLions Community Service Foundation (Singapore)Mr Low Ming WahMalayan Daching Co Pte LtdDonor Listing (for the ﬁ  nancial year ending\n31 March 2016) We wish to express our deepest appreciation to our generous donors, who believe in transforming hearts and minds,\nas well as industries and communities through education by making possible non-bonded scholarships, study grants, bursaries and excellence awards to nurture and inspire students at SIT.\nMapletree Investments Pte Ltd\nMcLink Asia Pte LtdMicrosoft Operations Pte LtdMun Siong Engineering LimitedNehemiah Foundation through SymAsia Foundation LimitedNexia TS Pte LtdOcean Tankers Pte LtdParsing Pte LtdPerfect Team Engineering Pte LtdPricewaterhouseCoopers LLPQ’son Kitchen Equipment Pte LtdRotary Club of Bugis Junction, SingaporeRotary Club of Jurong Town, SingaporeRSM Chio Lim LLPSafety Systems Engineering Pte LtdSamwoh Corporation Pte LtdSATS LtdSembcorp Industries LtdSembcorp Marine LtdSingapore Chemical Industry Council LimitedSingapore Computer SocietySingapore Food Manufacturers’ AssociationSingapore Leong Khay Huay KuanSingapore Technologies Engineering LtdSintit Realty Pte LtdTAK Products & Services Pte LtdTech Metal Machines Pte LtdTeknor Apex Asia Paciﬁ  c Pte Ltd\nMr Allan Teo Kok JinTexas Instruments Singapore (Pte) LimitedThe Silent Foundation LtdThe Singapore Ireland FundThomson Shin Min FoundationMr Toe Teow HengWilmar International LimitedWing Tai Retail Management Pte LtdMr Albert WongMrs Wong Kwok LeongYangzheng FoundationYeakin Plastic Industry Pte LtdZicom Holdings Private Limited\n60SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nIntroduction\nSIT was incorporated in September 2009 as a Company limited by\nguarantee under the Companies Act (Cap. 50). It is an Institution of Public Character (“IPC”) under the Charities Act (Cap 37).\nSIT is governed by the SIT Act 2014. Its key constituent document is the\nMemorandum and Articles of Association which states that the purpose of the University is to promote and undertake the advancement of education by providing educational facilities and courses of study in all ﬁ elds of knowledge, promote and engage in research and scholarships and\nestablish, operate, promote and maintain the University as a going concern.\nGood corporate governance is the cornerstone of a well-managed\nUniversity which is, in turn, critical to SIT’s performance and operations. The focus of its governance framework, on which the University’s vision, mission and core values are formulated, promotes accountability and transparency and is manifested in the composition of the Board of Trustees (“Board”) and its Committees, division of powers and duties between the Board and Management, adoption of checks and balances and sound measures for internal and corporate controls.\nGovernance Evaluation Checklist\nThe University adheres to the Code of Governance for Charities and Institutions of Public Character (“Code”). The University has complied in material aspects with the principles and guidelines set out in the Code. Where there are departures from the Code, these are explained under the relevant sections of the Annual Report or the Governance Evaluation Checklist (“GEC”).\nAccording to disclosure requirements imposed by the Charity Council,\nMinistry of Culture, Community and Youth, all IPCs are required to publicly disclose their compliance with the Code. The University’s GEC is made available on the website of the Charity Portal at www.charities.gov.sg.\nBoard of Trustees\nThe Board is the highest governing authority of the University and comprises 13 Trustees, chaired by Mr. Ng Yat Chung. The Board oversees the business of the University, ensures that it acts in accordance with its objects, that its funds and assets are properly accounted for and safeguarded and provides guidance and stewardship to Senior Management, conferring regularly with them. The Board is accountable to the Minister for Education, Singapore for its acts and decisions.\nThe Trustees are eminent persons of good repute, sound judgment\nwho possess collective competencies in areas such as the public and private sectors, academia, accounting and ﬁ  nance, law, information\ntechnology, strategic planning, logistics, healthcare and hospitality management and industry knowledge. New Trustees will continue to be selected and invited to serve on the Board on the basis of the diversity of their experience, skills, knowledge, abilities and insight from time to time to ensure constant refreshing of the Board. The Trustees’ proﬁ  les\nappear on pages 4 to 8 of the Annual Report.\nThere is an objective decision-making process, which allows each\nTrustee to exercise his or her own independent judgment. The University has established ﬁ  nancial authorisation and approval limits for operating\nand capital expenditure, the procurement of goods and services, the acquisition and disposal of assets and making investments. The Board approves the annual budget, the use of operating reserves and annual audited ﬁ  nancial statements of SIT, amongst other responsibilities.\nThe Board is supported by seven Board Committees formed in\naccordance with Article 53 of the Articles of Association (“AAs”), namely the Academic Advisory , Audit, Campus Development, Finance , Investments, Partnerships Approval and Remuneration Committees. Each Board Committee has clear Terms of Reference setting out their role, authority, powers and matters requiring their approval. The list of Board Committees is on page 62 of the Annual Report.\nBrieﬂ  y, the responsibilities of the Board Committees are described\nas follows: -\n(a)  The Academic Advisory Committee advises the Board on all\nacademic strategies, policies and issues.\n(b)  The Audit Committee oversees and reviews the University’s internal\ncontrols, integrity of its ﬁ  nancial reporting, legal and regulatory risks,\nenterprise risk management, internal and external audit functions.\n(c)  The Finance Committee provides oversight of the University’s\nﬁ nancial policy management.\n(d)  The Campus Development Committee assists the Board in\nmaintaining oversight of the campus development policies and any other matters related to the acquisition, commissioning and management of signiﬁ  cant physical assets or facilities.\n(e)  The Investment Committee oversees the investment of the\nUniversity’s endowment and surplus funds.\n(f)  The Partnership Approval Committee approves collaborations\nbetween the University and its overseas university partners.\n(g) The Remuneration Committee provides independent advice,\noversight and policy guidance in employee compensation matters.\nEach Board Committee comprises Trustees with appropriate\nqualiﬁ  cations and skills and there is a fair distribution of responsibilities\namongst the Trustees. Where required, non-Trustees who have experience in their respective areas of expertise are invited to provide advice to the Board Committees to enhance the process of decision making. The Board is kept informed of the key matters discussed at each Board Committee meeting.\nManagement of the University\nThe President of the University, Professor Tan Thiam Soon, is appointed by the Board and is the Chief Executive Ofﬁ  cer and the University’s\nacademic and administrative lead. He is responsible to the Board for the conduct, co-ordination and quality of the programmes of the University and its future development. He is empowered with the authority to perform all acts which are necessary to implement the policies, procedures and actions of the Board. As a liaison between the Board and the University, the President is tasked with the responsibility of informing each party of the views and concerns of the other, relating to the programmes and administration of the University. He also arranges for the annual budget of the University to be presented to the Board annually for approval as part of his duties.\nThe proﬁ  les of other members of the Senior Management of the\nUniversity can be found on its corporate web page and at page 10 to 11 of the Annual Report.\nConﬂ icts of Interest\nThe Trustees and staff are required to act in the best interest of the\nUn iv ersity  a t  a l l  ti m es.  P o l i ci es  h a v e  been  de v e l oped  t o  pr e v en t  or  manage situations where conﬂ  icts of interest could arise, by promoting\nintegrity and ethical business conduct. The AAs contain provisions for the management and avoidance of conﬂ  icts of interest by members of\nits Board of Trustees. Such provisions include:\n(a) Permitting a Trustee to be interested in any transaction with the\nUniversity provided that the Trustee has declared the nature of the interest to the other Trustees of the Board as required under the Companies Act of Singapore and complied with the provisions of AAs to abstain from voting on any matter related to the transaction,\n(b) Permitting a Trustee, or a ﬁ  rm associated with the Trustee, to act in\nany professional capacity for the University and to be remunerated for the provision of professional services, and\n(c) Permitting a Trustee to be reimbursed for out-of-pocket expenses,\ntravelling and other expenses properly incurred by the Trustee in attending and returning from meetings of the Board of Trustees, any of its committees, or any general meeting of the University or otherwise in connection with the affairs of the University.\nThe AAs also state that Trustees shall not receive any remuneration\nfor services rendered by them as Trustees. The University has implemented a Conﬂ  icts of Interest Policy which all staff must comply\nwith. In accordance with that Policy, staff must ensure that their private activities and interests do not conﬂ  ict with their professional obligations\nto the University. Where there is a potential conﬂ  ict of interest, the staff\ni s  r e q u i r e d  t o  s u b m i t  f u l l  d i s c l o s u r e  a n d  r e q u e s t  f o r  a n  a p p r o p r i a t e  exemption. The University will grant such exemptions at its discretion. In addition, staff are required to declare their compliance with the University’s prevailing policy on conﬂ  icts of interest annually.\n61SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nInternal Audit provides independent, objective assurance and consulting services\ndesigned to add value and improve the university’s operations. Internal audit activity is guided by a value-driven philosophy of partnering with other departments to enable SIT to meet its business objectives. Our key role is to assist Management in evaluating their risk management, control and governance processes so that business objectives can be met.\nThe Quality Assurance Framework for Universities (QAFU), developed by the\nMinistry of E ducation (MOE) , is a dev elopmental tool to help publicly-funded  universities enhance their quality processes. The inaugural SIT on-site validation by the MOE-commissioned external review panel, comprising local corporate leaders and renowned academics, will be conducted in 2017.\nA University Self-Assessment Report (USAR) will be submitted to the review panel\nin November 2016. In preparation for the USAR, we have begun discussions on our leadership and governance structure, management system, teaching and learning pedagogy, integration of our pedagogy with industry’s needs and the services we provide to the students and other stakeholders. Consequently, we are also reviewing our policies and procedures to ensure continuity and clarity. The recommendations by the review panel will further strengthen our internal processes in building a robust quality assurance system in SIT.\n62SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nREMUNERATION\nCOMMITTEE\nMr Ng Yat Chung (Chairman)\nMr Lam Yi Young\nDr Lim Khiang Wee\nMr TK Udairam\nAUDIT\nCOMMITTEE\nMr Nagaraj Sivaram (Chairman)\nMs Teoh Zsin Woon\nMr Abu Bakar Bin Mohd Nor\nCAMPUS DEVELOPMENT\nCOMMITTEE\nDr Richard Charles Helfer (Chairman)\nMs Teoh Zsin Woon\nProf Heng Chye Kiang\nMr Wen Khai Meng\nPARTNERSHIP APPROVAL\nCOMMITTEE\nMs Rachel Eng (Chairman)\nMr Abu Bakar Bin Mohd Nor\nMr Lam Yi YoungACADEMIC ADVISORY\nCOMMITTEE\nDr Lim Khiang Wee (Chairman)\nProf Heng Chye Kiang\nProf Tan Thiam Soon\nFINANCE\nCOMMITTEE\nMr TK Udairam (Chairman)\nMrs Margaret Lui\nMr Wen Khai Meng\nINVESTMENT\nCOMMITTEE\nMrs Margaret Lui (Chairman)\nMr Ng Yat Chung\nDr Chia Tai Tee (co-opted)\nStatement of Comprehensive Income\nBalance SheetStatement of Changes in Funds and Reserves Statement of Cash Flows64\n65\n66\n67\nIMPORTANT NOTE:\nThe following Financial Statements are extracted from Singapore Institute of Technology’s Audited Financial\nStatements for the year ended 31 Mar 2016. It may not contain sufﬁ  cient information to allow for a full understanding\nof the results and the state of affairs of the Company. For further information, please refer to the complete audited ﬁ nancial statements published on the SIT ofﬁ  cial website at SingaporeTech.edu.sg.\n64SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nFor the ﬁ  nancial year ended 31 March 2016\nGeneral fundsEndowment and\nterm funds Total\n2016 2015 2016 2015 2016 2015\n$ $ $ $ $ $\nRevenue 45,176,520 38,592,658 - - 45,176,520 38,592,658\nOther income 1,334,249 332,110 1,492,604 1,261,000 2,826,853 1,593,110\nOperating expenditure\nStaff and related\nexpenses (48,041,802) (32,111,370) - -(48,041,802) (32,111,370)\nDepreciation and\namortisation expenses (30,220,893) (15,696,574) - -(30,220,893) (15,696,574)\nProgramme and\nstudent-related expenses (57,277,352) (58,424,324) (910,620) (767,649) (58,187,972) (59,191,973)\nRental and other\nfacilities expenses (18,283,788) (7,170,560) - -(18,283,788) (7,170,560)\nOther operating\nexpenses (13,763,628) (7,333,064) (547,684) (794,142) (14,311,312) (8,127,206)\nTotal operating\nexpenditure (167,587,463) (120,735,892) (1,458,304) (1,561,791) (169,045,767) (122,297,683)\n(Deﬁ cit)/surplus before\ninvestment income and government grants (121,076,694) (81,811,124) 34,300 (300,791) (121,042,394) (82,111,915)\nNet investment\nincome/(loss) 381,911 170,670 (16,512,302) 5,251,706 (16,130,391) 5,422,376\n(Deﬁ cit)/surplus before\ngovernment grants (120,694,783) (81,640,454)\n(16,478,002) 4,950,915 (137,172,785) (76,689,539)\nGovernment grants\n141,349,096 89,421,732 - -141,349,096 89,421,732\nNet surplus/(deﬁ  cit) and\ntotal comprehensive income/(loss) 20,654,313 7,781,278 (16,478,002) 4,950,915 4,176,311 12,732,193\n65SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nAs at 31 March 2016\n2016 2015\n$ $\nASSETS\nCurrent assets\nCash and cash equivalents 130,281,892 55,271,249\nFinancial assets, at fair value through proﬁ  t or loss 345,657,818 396,738,853\nFees and other receivables 30,122,947 50,485,293\nStudent loans 133,096 106,270\nOther current assets 6,203,466 7,614,071\n512,399,219 510,215,736\nNon-current assetsProperty, plant and equipment 232,364,580 231,795,991\nIntangible assets 2,133,688 2,649,690\nStudent loans 363,484 250,967\nOther non-current assets 81,836,074 77,999,488\n316,697,826 312,696,136\nTotal assets 829,097,045 822,911,872\nLIABILITIES\nCurrent liabilitiesTrade and other payables 23,794,579 29,532,719\nDeferred tuition fee income 7,640,483 6,591,879\nGrants received in advance 61,568,303 51,731,854\nDerivative ﬁ  nancial instruments - 13,819,772\n93,003,365 101,676,224\nNon-current liabilitiesDeferred capital grants 234,488,511 234,445,681\nOther deferred grants 86,780,063 84,336,554\n321,268,574 318,782,235\nTotal liabilities 414,271,939 420,458,459\nNET ASSETS 414,825,106  402,453,413\nFUNDS AND RESERVES\nEndowment 374,531,852 366,336,470\nAccumulated surplus\n- General funds 51,272,661 30,618,348\n- Endowment and term funds         (10,979,407) 5,498,595\n414,825,106 402,453,413\nFunds managed on behalf of Ministry of Education (“MOE”) 15,424,915 11,829,639\n66SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nFor the ﬁ  nancial year ended 31 March 2016\nAccumulated\nsurplus –\nGeneral fundsEndowment\nand\nterm fundsTotal\n$$ $\n2016\nBeginning of ﬁ  nancial year 30,618,348 371,835,065 402,453,413\nGovernment grants and donations -  8,195,382 8,195,382\nTotal comprehensive income/(loss) 20,654,313 (16,478,002) 4,176,311\nEnd of ﬁ  nancial year 51,272,661 363,552,445 414,825,106\n2015\nBeginning of ﬁ  nancial year 22,837,070 361,585,550 384,422,620\nGovernment grants and donations -  5,298,600 5,298,600\nTotal comprehensive income 7,781,278 4,950,915 12,732,193\nEnd of ﬁ  nancial year 30,618,348 371,835,065 402,453,413\n67SINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 2016\nFor the ﬁ  nancial year ended 31 March 2016\n2016 2015\n$ $\nCash ﬂ  ows from operating activities\nDeﬁ cit before government grants (137,172,785) (76,689,539)\nAdjustments for:\n- Depreciation and amortisation 30,220,893 15,696,574\n- Donations (1,492,604) (1,261,000)\n- Loss on disposal of property, plant and equipment - 84\n- Write-off of property, plant and equipment 1,855 -\n- Net investment loss/(income) 16,130,391 (5,422,376)\n(92,312,250) (67,676,257)\nChange in operating assets and liabilities\n- Fees and other receivables 3,125,456 (15,911,410)\n- Student loans and other assets (2,565,324) (25,401,968)\n- Trade and other payables 1,240,562 (25,253,763)\nCash used in operations (90,511,556) (134,243,398)\nDonations 1,492,604 1,261,000\nNet cash used in operating activities (89,018,952) (132,982,398)\nCash ﬂ  ows from investing activities\nPurchase of property, plant and equipment and intangible assets (36,495,358) (67,644,047)\nProceeds from disposal of property, plant and equipment - 16,440\nPurchase of ﬁ  nancial assets, at fair value through proﬁ  t or loss (24,577,634) (352,732,484)\nProceeds from disposal of ﬁ  nancial assets, at fair value through proﬁ  t or loss 59,392,537 -\nSettlement of currency forwards (13,819,772) (25,101,049)\nDividends and interest received 323,442 369,354\nNet cash used in investing activities (15,176,785) (445,091,786)\nCash ﬂ  ows from ﬁ  nancing activities\nOperating grants received 135,992,666 65,530,358\nDevelopment grants received 33,446,014 157,194,172\nOther government grants received 1,572,318 3,401,638\nEndowment funds received 8,195,382 5,298,600\nNet cash provided by ﬁ  nancing activities 179,206,380 231,424,768\nNet increase/(decrease) in cash and cash equivalents 75,010,643 (346,649,416)\nCash and cash equivalents at beginning of ﬁ  nancial year 55,271,249 401,920,665\nCash and cash equivalents at end of ﬁ  nancial year 130,281,892 55,271,249\nSingapore Institute of Technology\nSIT@Dover, 10 Dover Drive, Singapore 138683\nTel: 6592 1189\nFax: 6592 1190\nAdmissions\nTel: 6592 1136\nEmail: Adm@SingaporeTech.edu.sg\nRegistrar’s Ofﬁ  ce\nTel: 6592 2091\nEmail: Registrar@SingaporeTech.edu.sg\nStudent Life\nTel: 6592 1191\nEmail: SLD@SingaporeTech.edu.sg\nAlumni Ofﬁ  ce\nTel: 6592 1137 / 6592 1094\nEmail: Alumni@SingaporeTech.edu.sg\nGiving to SIT\nTel: 6592 1137 / 6592 1094\nEmail: Advancement@SingaporeTech.edu.sg\nCareer Services\nTel: 6592 8150\nEmail: CareerServices@SingaporeTech.edu.sg\nEnterprise & Innovation Hub\nTel: 6592 6917\nEmail: EIHub@SingaporeTech.edu.sg\nSingaporeTech\n@SingaporeTech\n@SingaporeTech\nSingapore Institute of Technology\nSIT@Dover, 10 Dover Drive, Singapore 138683\nRegistration No. : 200917667D\nSingaporeTech.edu.sg"
}