{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2023-08/Citation%20for%20Mr%20Ng%20Yat%20Chung_SIT%20Graduation%202022_29%20Sep%202022.pdf",
  "type": "pdf",
  "content": "RELEASE VERSION\nMr Lawrence Wong, Deputy Prime Minister and Minister for Finance\nMr Bill Chang, Chairman, S IT Board of Trustees\nProfessor Chua Kee Chaing, President, Singapore Institute of Technology\nDistinguished Honorary Graduand\nLadies and Gentlemen\n1.Good morning. Today, we have the pleas ure of honouring an individual who has\ncontributed greatly  to the success of SIT .  It is none other than our  founding Chairman ,\nMr Ng Yat Chung .\n2.During his tenure from September 2009 to March 2022, Mr Ng Yat Chung steered the\ngrowth and development of SIT as the first university of  applied learning  in Singapore .\nSIT began humbly  as an aggregator of overseas university partner programmes  in 2009,\nwhen it was set up to expand the opportunities for Polytechnic graduates to attain high\nquality undergraduate degrees . With  Mr Ng  at the helm , SIT undertook three key\ninitiatives  which enabled it to grow  from an aggregator role into an institut ion that\nconfer s its own degrees .\n3.First, SIT evolved its own applied learning pedagogy, tailoring it  to fit its student profile\nof predominantly Polytechnic graduates; second, SIT strengthened its partnerships\nwith local employers, including introducing new work -study modalities; third, SIT built\nup the capabilities of its faculty to deliver learning in close c ollaboration with industry.\nSIT was subsequently gazetted  as Singapore’s fifth Autonomous University in March\n2014. Since then, SIT has widened its programme offerings to close to 40\nundergraduate program mes. Student enrolment has grown from nearly 3,500 in 2014\nto about 9,000 in 2021, with a consistently strong employment rate of over 90% for its\ngraduates.\nRELEASE VERSION\n4.Throughout the se years of tremendous growth, Mr Ng kept SIT focused  on its mission\nto develop individu als who build on their interests and talents to impact society . He\nemphasi sed that SIT should always remain responsive to industry needs and ensure\nthat its graduates had skills that were relevant and valued by industry. In this regard,\nhe underscored the importance of having a curriculum that would be adaptable to\nchanging industry needs. He also placed a strong emphasis on practice -oriented\nlearning, industry partnerships and integration of work and study in the curriculum. He\nsteer ed SIT to wards  deepen ing its applied research capabilities, provid ing students\nwith opportunities to undertake industry -inspired research that supports industry\ndevelopment, as well as enabl ing SIT’s faculty to stay in close touch with industry and\nthereby  ensur ing that SIT’s ac ademic programmes kept abreast with business and\ntechnological developments in industry. In this regard, he encouraged SIT to adopt an\nintellectual property policy that incentivized collaboration with industry to develop\ninnovative products and solutions. He also encouraged SIT to continue leveraging its\noverseas university partners to build an extended ecosystem of partners, so that  SIT\ncould  react swiftly to new areas of growth and industry needs. Today, SIT is recogni sed\nas a university of applied learni ng that has strong linkages with industry.\n5.Mr Ng also guided SIT to set up its C ontinuing Education and Training  capabilities  that\ndeliver ed relevant courses to industry professionals as well as skills upgrading\nprogrammes for the industry workforce which  are implemented in conjunction with\ntheir companies. In 2019 , SIT also launched its Industrial Masters and Industrial\nDoctorate degree programmes to strengthen industry’s innovation capabilities.\n6.Mr Ng also played a key role in strengthening SIT’s organi sational structure, processes\nand culture, including in succession plan ning and talent development, internal financial\ncontrols and managing headcount growth, all crit ically important for a new university.\nA firm believer in enterprise risk management, Mr Ng ensured that SIT had effective\nprocesses to identify key risk driver s and appropriate mitigating measures to manage\nthe risks of a young and growing university. He also encouraged greater digitalisation\nin SIT’s academic and corporate activities and led SIT to be an early adopter of cloud\nsolutions for its IT infrastructur e and services since 2014.\n7.Last but certainly not least , Mr Ng was a strong advocate  for SIT’s future consolidated\ncampus that will be  located in the Punggol Digital District or PDD. He envisioned that\nthe co -location would  facilitate cross -fertilisation of knowledge and collaboration\nbetween faculty, staff and students, and companies in PDD as well as the residential\nRELEASE VERSION\ncommunity . The  various projects that would arise from such exchanges and\ncollaboration w ould benefit and con tribute to the broader  industry and community\nwithin the  PDD  area .\n8.Today, SIT is honoured to confer on Mr Ng the Honorary Degree of Doctor of Letters."
}