{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2020-10/Annual_Report_2013.pdf",
  "type": "pdf",
  "content": "SingaporeTech.edu.sg\nFacebook.com/SingaporeTech\nANNUAL REPORT 2013\nSiNgAPORE  iNST iTUTE\nOF TEchNOLO gy\nCONTENTS A UNIQUE\nEDUCATION\nMODEL\nEstablished by the Ministry\nof Education in 2009, SIT’s\nmission is to provide an\nindustry-focused university education for polytechnic\ngraduates in partnership with\nlocal polytechnics and reputable overseas universities to produce\nhighly desired graduates for\ngrowth sectors of the economy.01 chAiRMAN’S MESSA gE\n02 PRES iDENT’S MESSA gE\n03 BOARD OF TRUSTEES\n04 ORgANiSATiON chART\n05 MiLESTONES\n16 OUR gRADUATES\n17 OUR PARTNERS\n24 iNDUSTR y SchOLARS hiPS AND SPONSORS hiPS\n25 OUR DONORS\n26  FiNAN ciAL STATEMENTS\n31 LOOK iNg AhEAD\n2\nSiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 2013SiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 20131\nSince its inception, SIT has been growing at breath-taking\npace with the support of its polytechnic and overseas\nuniversity partners. SIT has expanded its partnerships, and\nthe programmes offered to our students. I am proud to invite University of Liverpool, our latest overseas university\npartner, into our list of partners in 2013. Together with our\noverseas university partners, SIT is committed to providing the best education, and bringing a world of opportunities,\nto our students. We aim to equip our students well with\nindustry-relevant skills and global knowledge.\nDuring the 2012 National Day Rally, Prime Minister Lee\nHsien Loong recognised the efforts of SIT in providing undergraduate opportunities to polytechnic graduates,\nand he spoke about future developments for SIT. In line\nwith the government’s intention to diversify the educational landscape in Singapore, PM Lee announced that SIT would\nbecome Singapore’s fifth university. SIT has been tasked\nto continue opening different educational pathways for polytechnic graduates. SIT is now taking on the challenge of transiting to a university.\nThis year, founding President, Professor Tan Chin Tiong,\ncompleted his secondment to SIT and returned to\nSingapore Management University. Chin Tiong assembled a capable team and was pivotal to the many successes that\nSIT has enjoyed since 2009. The years with Chin Tiong at the\nhelm were characterised by rapid expansion to carve SIT a unique position in Singapore’s higher education landscape.\nIn his place, I am very pleased to welcome Professor\nTan Thiam Soon as SIT’s new President. Thiam Soon was previously the Vice-Provost (Education) at National\nUniversity of Singapore and I greatly admire his vast\nexperience in university education and his dedication to our students. He will build on Chin Tiong’s firm foundation to\nestablish SIT as the next university in Singapore.We also saw changes to the Board of Trustees as part of\nits continuous renewal effort. We welcome on board four\nnew prominent leaders: Mr Lee Kok Choy, Ms Teoh Zsin\nWoon, Mr Thali Koattiah Udairam, and Mr Alvin Tan. Their insights and support will be invaluable for SIT’s next stage\nof development. I also want to thank Dr Beh Swan Gin, Dr\nAbdul Razakjr Bin Omar, Mr Allen Lew Yoong Keong, and Mr Roy Quek Hong Sheng who have stepped down from\nthe Board this year. They were instrumental in steering SIT\nduring its formative years.\nSIT has established a sound foundation after the initial\nstart-up years. There are now newer and higher peaks before us. My fellow Trustees have played crucial roles\nin setting the direction and SIT has benefited from their\nvaluable support and counsel. SIT management and staff have diligently paved the way for programmes for students\nand have transformed the institute into a home away from\nhome. Our polytechnic and overseas university partners have worked with SIT management every step of the way. Our benefactors have also helped contribute to a highly\nsuccessful year for SIT. With the key building blocks in place,\nSIT is ready to take on the challenge to become a university.\nI am confident that SIT will continue to break new ground\nand make a positive contribution to Singapore.Education forms one of the fundamental building blocks of every society. As societies mature, so does our\nunderstanding of the economies and structures that\nsupport them. SIT fully appreciates the role that industry-relevant education plays in uplifting a rapidly modernising\nsociety such as Singapore.\nSince its inception, SIT has not deviated from its task of\noffering specialised degree programmes that cater to\nindustry needs. This year, we have introduced three new degrees with our overseas university partners in Electrical\nPower Engineering, Computing Science, and Criminology\nand Security. The addition of Criminology and Security led us to rename one of our key disciplines to ‘Education &\nSocial Sciences’. Like all our existing degree programmes,\nthe new degree offerings are grounded by the strong need for professionals in the respective fields.\nThe past year was marked by many key milestones for SIT. To better cater to our students, SIT broke ground at all the five local polytechnics for the construction of our SIT\nbuildings. Thus far, we have received warm and genuine\nsupport from our polytechnic partners. They have been very\nsupportive in allocating space to our students for lessons\nduring the construction period. I look forward to the eventual construction of the SIT buildings and the renewed\nsynergy these buildings will bring to the partnerships. When\nthe buildings are ready, they will also play an important role in helping our students identify with SIT.\nIn addition, in early January of 2013, we celebrated SIT’s first graduating cohort from our first five overseas university\npartners: Technische Universität München, Newcastle\nUniversity (UK), DigiPen Institute of Technology, The Culinary Institute of America and University of Nevada,\nLas Vegas. Our pioneer students were bold to take the road less travelled and in so doing showed remarkable\nresilience and perseverance. Evident of strong industry\nsupport for SIT’s specialised degree programmes, we were\nheartened that many of our students received job offers even prior to graduation. We were further elated that most of our\nstudents joined the relevant industry they have been trained for.\nThe celebration was also the last official event presided\nover by founding President Professor Tan Chin Tiong. I\nam grateful to inherit a strong team from Chin Tiong and his work has truly set SIT apart. Through Chin Tiong’s\nleadership and vision, SIT has helped to provide more\ndifferentiated pathways in Singapore’s education playing field. I thank Chin Tiong for his guidance during my transition.\nWith the Prime Minister’s mandate for SIT to become Singapore’s fifth autonomous university in the near future,\nI am cognizant of the importance of the work set out for\nus. I am confident that my capable staff, who have shown incredible dedication in the past year and indeed, previous years, will certainly continue to rise to the task.\nWe are ready – to blaze new trails and set new, higher\nstandards through a differentiated pathway for university\neducation in Singapore.\nPRESIDENT’S MESSAGE CHAIRMAN’S MESSAGE\n4\nSiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 2013SiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 20133\n1 Stepped down on 31 January 2013\n2 Appointed on 1 February 2013\n3 Stepped down on 15 September 2012\n4 Appointed on 16 September 2012\n5 Appointed on 1 April 2013\n6 Stepped down on 5 April 2013Professor Hang Chang Chieh\nHead\nDivision of Engineering &\nTechnology ManagementNational University of Singapore\nProfessor Tan Thiam Soon\n2\nPresident\nSingapore Institute of Technology\nDr Beh Swan Gin3\nPermanent Secretary\nMinistry of Law\nDr Lim Khiang Wee\nExecutive Director\nA*STAR Graduate Academy\nAgency for Science, Technology\nand Research\nMr Lee Kok Choy4\nManaging Director &\nSingapore Country Manager\nMicron Semiconductor Singapore Pte Ltd\nMr Michael Yap\nChairman\nSkyvest International Limited\nMs Rachel Eng Yaag Ngee\nManaging PartnerWongPartnership LLP\nMr Thali Koattiath Udairam\n4\nGroup Chief Executive Officer\nEastern Health Alliance\nMr Roy Quek6\nDeputy Secretary (Health)\nMinistry of HealthProfessor Tan Chin Tiong1\nPresidentSingapore Institute of Technology\nDr Abdul Razakjr Bin Omar\n3\nConsultant, Cardiologist\nRaffles Heart Centre\nDr Richard Charles Helfer\nChairman\nRCH International Pte Ltd\nMr Allen Lew3\nChief Executive Officer Singapore\nSingapore Telecommunications Ltd\nMs Mary Yeo\nVice President\nSupply Chain Operations (South Asia Pacific)\nUnited Parcel Service Singapore Pte Ltd\nMr Pek Hak Bin\nPartner\nHead of Energy and Natural ResourcesKPMG\nMr Tan Yew Hua Alvin\n4\nAssistant Managing Director\nCorporate Development\nSingapore Economic Development Board\nMs Teoh Zsin Woon5\nDeputy Secretary (Development)\nMinistry of HealthMEMBERSCHAIRMAN DEPUTY  CHAIRMAN\nMr Ng Yat Chung\nGroup President and CEONeptune Orient Lines Limited (NOL)Mr Ng Cher Pong Deputy Secretary (Policy)Ministry of Education BOARD OF\nTRUSTEES\nDEPUTY PRESIDENT(ADMINISTRATION) & CFOCORPORATE STRATEGIC PLANNINGADVANCEMENT& ALUMNI\nINDUSTRYVICE PRESIDENT(EXTERNAL RELATIONS) DEPUTY PRESIDENT(ACADEMIC) & PROVOST\nPROGRAMMESADMINISTRATION\nFACULTY (S&T)\nFACULTY\n(NON S&T)VICE PROVOST\nASSOCIATEPROVOST (S&T)\nASSOCIATEPROVOST (NON S&T)\nACADEMIC ANALYSIS& PLANNINGPRESIDENT\nCOMMUNICATIONS& IT\nESTATES\nFINANCE\nHUMAN RESOURCE\nLEGAL\nLIBRARYCOLLABORATIONS\nCORPORATECOMMUNICATIONSCAREER SERVICES\nADMISSIONS\nREGISTRAR’S OFFICE\nSTUDENT LIFESIT ORGANISATION CHART\n6\nSiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 2013SiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 20135\nMILESTONES 2012/13\nAPRIL\nPROJECT  CAMBODIA\nSIT conducted our first overseas community project with Project Khmer\nH.O.P.E., a non-profit organisation that pledges to help needy students,\ngiving them a chance to pursue an education. A total of ten SIT students\nparticipated in this project and it was a memorable and rewarding experience as they had the opportunity to interact with the underprivileged children and\nhelp improve their situation by teaching them about personal hygiene and dispensing medication. Through this trip, our students have gained invaluable lessons on treasuring the simple things in life. 28\nJULY\n5\nSIT@TP BUILDING  GROUNDBREAKING\nCEREMONY\nThe first of five groundbreaking ceremonies took place at Temasek Polytechnic\n(TP) to mark the construction of the new SIT building located on the grounds\nof TP.\nThe SIT@TP building will house The Glasgow School of Art and The Culinary Institute of America when construction is completed. The building will comprise five stories of teaching facilities, academic offices and two large lecture halls, as\nwell as design studios to accommodate the GSA design programmes.\nSIT@TP is located in close proximity to Bedok Reservoir, which is located along the north boundary of the TP campus.\nMost of the facilities in the SIT@TP building are thus arranged in a linear manner to facilitate a maximum frontage facing the reservoir. Common spaces and elevated activity decks also allow students a panoramic view of Bedok\nReservoir. These same vistas will channel airflow into the building to allow for well-ventilated common spaces.11The Singapore Institute of Technology (SIT) was established\nto provide an additional pathway for polytechnic students\nto upgrade themselves in niche degree areas. The model\nwe have adopted features an SIT building within the grounds of each of the five polytechnics. Altogether, our\nfive SIT buildings will be home to over 4,000 students, once\nthey are fully completed.\nThis model allows for greater synergy and efficiency\nbetween SIT and our polytechnic partners by giving our students greater access to existing resources within each polytechnic. Distinctive features across all our buildings\ninclude: a main atrium featuring SIT branding; student-centric common spaces, elevated activity decks and large courtyards; and the use of glass and steel for natural light to shine through and to give a sense of space.\nThe unveiling ceremony was a prelude to the series of five groundbreaking ceremonies that were held later in the\nyear and was presided by then-Minister of State (Defence & Education) Mr Lawrence Wong, as the Guest-of-Honour.\nThe new corporate logo was also revealed at the event to commemorate this milestone in SIT’s history.\nUNVEILING OF SIT’S BUILDING DESIGNSMILESTONES 2012/13\nJULY\nSIT@NP B UILDING  GROUNDBREAKING\nCEREMONY\nThe second groundbreaking ceremony was held at Ngee Ann Polytechnic (NP) to mark the construction of the SIT@NP building.\nThe SIT@NP building will house Newcastle University (UK), University\nof Glasgow and Wheelock College when construction is completed.\nComprising eight storeys of teaching facilities, it will include two semi-basement storeys that hold three large lecture halls. As a departure from the usual classroom setup, SIT-WLC students will be trained in a flexible, simulated pre-school classroom environment during their coursework. SIT-NU students will enjoy the use of studios\nfor design purposes while SIT-UoG students will have access to Engineering studios for coursework on production.\nOne of the main features of the SIT@NP building includes a central atrium with open areas for students to interact.\nIn keeping with its open concept, the SIT@NP building will also feature sky terraces on the third, fifth and seventh\nstoreys overlooking Bukit Timah. It will include naturally ventilated atriums and a naturally lit skylight, and introduce critical façade openings for a wind funnel effect to enhance passive ventilation strategies.\n24\nAUGUST\nRECORD B REAKING E VENT @ A SIA\nSQUARE\nSIT, together with our partners, MGPA and Citibank, organised a record breaking event featuring the largest Singapore Orchid Map in\nthe Singapore Book of Records. Over 800 SIT students and working\nprofessionals came together to show their appreciation for Singapore by creating a gigantic Singapore Map filled with orchids for Singapore’s\n47th birthday.\n1\nSIT@SP BUILDING GROUNDBREAKING\nCEREMONY\nSIT’s third groundbreaking ceremony at SP was held about two weeks\nafter the previous ceremony at NP.\nThe SIT@SP building will house Technische Universität München,\nUniversity of Glasgow and DigiPen Institute of Technology when\nconstruction is completed. Located at the northern edge of SP, it has a distinct grand entrance and main drop-off which is prominent from Dover Road. Apart from lecture theatres and classrooms, the SIT@SP building will also be constructed with industry-standard classrooms and studio facilities, along with acting and animation studios for\nDigiPen's game development courses.\nIn a bid to attain the Green Mark Platinum Award, a slew of design measures have also been put in place. Some of\nthese features include naturally ventilated study areas and classrooms built in a north-south orientation to achieve\nmaximum daylight to minimise the use of artificial lighting.\n7\n8\nSiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 2013SiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 20137\nMILESTONES 2012/13\nSIT S TUDENT  ORIENTATION  CAMP  2012\nMore than 500 freshmen turned up for this fun-filled 3 day 2 night camp\nheld at Sarimbun Scout Camp. Through ice-breakers and games, the\ninitial awkwardness was soon forgotten and it was an event where many\nlasting university friendships were formed.21\nAUGUST\nSIT AS  SINGAPORE ’S FIFTH AUTONOMOUS  UNIVERSIT Y\nDuring the National Day Rally (NDR) on 26 August 2012, Prime Minister Lee Hsien Loong announced that SIT will become the fifth Autonomous University (AU) in Singapore. Based on the Committee on University Education\nPathways beyond 2015 (CUEP)’s recommendation, he emphasised the need to expand the opportunities and\nchoices for higher education in Singapore.\nUpon becoming Singapore’s fifth AU, SIT will:\n•\t\tOffer\tan\tIntegrated\tWork\tStudy\tProgramme,\twhich\tintegrates\tmeaningful\twork\texperience\tinto\tthe\tacademic\ncourse requirements to strengthen the industry orientation of our academic offerings;\n•\tBe\tdifferent\tin\tcharacter\tfrom\tthe\texisting\tAUs\tand\tgroom\tour\tstudents\tto\tbe\tindustry-relevant\tand\twork-ready;\n•\t\tContinue\tto\tforge\tcloser\tcollaborations\twith\tour\toverseas\tuniversity,\tpolytechnic\tand\tindustry\tpartners\tto\tmould\ta\nniche of excellence in applied, solutions-directed research and consultancy capabilities; and\n•\t\tProvide\tindustry-linked\texperiential\tlearning\topportunities\tfor\tour\tstudents,\twhile\tstrengthening\tour\tprofile\tas\tan\tAU.\n26With this, more full-time places would be made\navailable by increasing the current full-time university\nintake:\n•\t\t40%\tof\teach\tcohort\twould\tbe\table\tto\treceive\ta\ngovernment-subsidised degree education by 2020,\nup\tfrom\t27%\tat\tpresent;\tand\n•\t\t\tPublicly-funded\tplaces\tare\texpected\tto\tincrease\tto\n16,000 per year, up from 13,000 at present.MILESTONES 2012/13\nSINGAPORE  UNIVERSITY  GAMES\n(SUniG) 2012\nSIT participated in the Singapore University Games (SUniG) for the first\ntime. 53 SIT athletes contended against athletes from NUS, NTU, SMU\nand SIM in six different sports; namely, Badminton, Bowling, Road Race,\nSoccer, Swimming and Tennis. Our athletes trained hard and played their best despite all odds. Kudos to our athletes!5\nSEPTEMBER\nSIT-GSA-TP S IGNING  CEREMONY\nA signing ceremony was held with The Glasgow School of Art (GSA) and\nTemasek Polytechnic (TP) to commemorate the launch of the Bachelor of Arts with Honours degrees in Communication Design and Interior\nDesign.\nOn this partnership, Professor Seona Reid, former Director of the\nGSA said, “In SIT we have found a partner who shares our ambition,\nunderstands our ethos and has worked tirelessly with us to get to this point. Together we will produce exceptional\nDesign graduates with great futures who will serve Singapore, its economy and society well.”\n17SIT WELCOME  CEREMONY\nThe SIT Welcome Ceremony 2012 celebrated the beginning of the AY2012/13 cohort’s journey and was presided over by Mr Ng Yat Chung,\nChairman, Board of Trustees, SIT.\nThe event also marked the launch of the Value-Added Programme (VAP),\nwhich is designed by our staff and faculty members through consultation with industry partners. The VAP, which is a core component of every\nundergraduate’s portfolio, comprises modules in the areas of career and\npersonal development as well as high-level leadership modules, which aim to:\n•\t\tEquip\tour\tstudents\twith\tsoft\tskills\tand\tmanagement\tskills\trequired\tby\tfresh\tgraduates\tto\texecute\tcomplex\ntechnical projects; and\n•\t\tBuild\tup\tour\tstudents’\tleadership\tabilities\tin\ta\tdemanding\twork\tenvironment.\n26AUGUST\n10\nSiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 2013SiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 20139\nMILESTONES 2012/13\nOCTOBER\nSIT-TCD-NYP S IGNING  CEREMONY\nA signing ceremony was held to seal the partnership between SIT,\nTrinity College Dublin (TCD) and Nanyang Polytechnic (NYP) to offer\nthe first full-time degrees in Physiotherapy and Occupational Therapy\nin Singapore. The ceremony was officiated by Minister for Health, Mr Gan Kim Yong, who also witnessed the signing together with the Irish\nAmbassador to Singapore, H.E. Mr Joseph Hayes.\nDuring the ceremony, Minister Gan elaborated on the significance of this partnership and highlighted the importance of the SIT-TCD degree programmes for allied health professionals in Singapore to meet our increasingly\ncomplex healthcare needs.\n29\nSIT-NU-NYP S IGNING  CEREMONY\nWe commemorated the launch of our Electrical Power Engineering\ndegree programme with a signing ceremony between SIT, Newcastle\nUniversity (UK) and Nanyang Polytechnic (NYP). Mr S Iswaran, Minister\nin the Prime Minister’s Office and Second Minister for Home Affairs and Trade and Industry, graced the occasion as the Guest-of-Honour.\nThe Bachelor of Engineering with Honours in Electrical Power\nEngineering degree programme was initiated by SIT and NU in collaboration with the Energy Market Authority\n(EMA) to train professional engineers to tackle the energy challenges in Singapore. 2M Iswaran first spoke about\nElectrical Power Engineering at the inaugural “In Dialogue with Youth” event during the Singapore International Energy Week 2012.\nHe said, “The power sector offers many opportunities for growth, especially with the advent of new technologies\nand new sources of energy. In tandem, we need to build up the capability and capacity of our people to meet\nthese challenges so as to sustain Singapore’s economic development. This programme offers our students another\neducational pathway and the opportunity to pursue a fulfilling career in an interesting sector with good prospects.”\n30\nDECEM BER\n16TH ASEAN U NIVERSITY G AMES 2012\nThree SIT athletes were selected to represent Singapore in the 16th ASEAN University Games 2012 held in Vientiane, Laos. They participated\nin two different sports; namely, Football and Basketball. Our students\ndisplayed excellent sportsmanship and team spirit throughout the competition and we are extremely proud of them for upholding the\nnation’s name in the highest regard.\n12MILESTONES 2012/13\n28\nAPPRECIATION  DINNER  FOR  SIT\nSTUDENT  LEADERS\nAn appreciation dinner was held at 1 Market by Chef Wan for our SIT\nstudent leaders to recognise their contributions and hard work in\norganising student activities and leading student clubs throughout the year.\nJANUARY\nCELEBRATION  OF SIT'S FIRST GRADUATING  COHORT\nThe Singapore Institute of Technology reached a new\npeak of excellence in January 2013 as we celebrated the\ngraduation of our pioneer cohort at Resorts World Sentosa\nConvention Centre, which was graced by Minister for Education, Mr Heng Swee Keat.\nAt the ceremony, Minister Heng gave a background of SIT’s\nhistory and acknowledged the uniqueness of our industry-focused education. He elaborated on our education model,\nand how it mutually benefits the students and the industry,\nas the former are highly sought after while the latter can gain ready access to graduates with relevant competencies.\nIt was a momentous occasion as we brought together the graduates of our first five overseas university partners who, together with SIT, offered the first ten degree programmes in the areas of Engineering, Interactive Digital\nMedia and Hospitality in 2010. These overseas universities are: Technische Universität München, Newcastle University\n(UK), DigiPen Institute of Technology, The Culinary Institute of America and University of Nevada, Las Vegas.\n11LET’S SERVE  @ PROJECT VIETNAM\nA group of 14 SIT student volunteers embarked on a community project in Hanoi, Vietnam, where they taught and imparted life skills such as\nBasic First Aid, Food Hygiene, Customer Service and Balloon Sculpting\nto the less privileged children and youth over one extremely enriching and fulfilling week.\n16DECEM BER\n12\nSiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 2013SiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 201311\nMILESTONES 2012/13\nJANUARY\nSIT INAUGURAL GRADUATION\nCELEBRATIONS\nWe welcomed our pioneer alumni by celebrating their graduation at\nSingapore’s first coal-fired power station - St James Power Station on 18\nJanuary 2013. Spirits were high as the decibels were turned up on the\ndance floor. Professor Tan Thiam Soon, President, SIT was in attendance, congratulating the new graduates on their achievements.\n18\nSIT O PEN H OUSE 2013\nThe SIT Open House 2013, which was held at *SCAPE, attracted more than 4,000 visitors over two days. The\ntheme of the admission campaign was 'Now's Your Time',\nwhich represented a new beginning for diploma holders looking to further their studies, and for SIT as we transition\nto become Singapore’s fifth Autonomous University.\nThe new degree programmes in Electrical Power\nEngineering and Computing Science offered in partnership\nwith Newcastle University, UK and University of Glasgow respectively were highly popular during the event. The\nevent was a good platform for prospective students and\ntheir parents to obtain first-hand information through\ninteraction with our faculty, staff and students, as well as the overseas universities' faculty members. Useful\ninformation on SIT Career Services, Financial Assistance and Scholarships were also available during the two-day\nevent for the public to find out more about the range of services that we provide for our students.\n19MILESTONES 2012/13\nJOY OF S PRING @ S OCIETY FOR THE\nAGED  SICK\nThe SIT Community Service Club organised a half-day visit to the Society for the Aged Sick to spend quality time with the elderly patients and to\nengage them in activities. Our student volunteers gained an invaluable\nexperience from this visit as they provided unconditional care and concern for the patients, and learnt the true meaning of ‘altruism’.\n26SIT@NYP B UILDING  GROUNDBREAKING\nCEREMONY\nThe fourth groundbreaking ceremony took place in January 2013 at Nanyang Polytechnic (NYP) to mark the construction of the SIT@NYP\nbuilding.\nThe SIT@NYP building will be constructed seven storeys high and will\nhouse several degree programmes from Newcastle University (UK),\nTrinity College Dublin and The University of Manchester when construction is completed.\nSIT@NYP building is the only SIT building with an open study area and project rooms housed in a “POD” that\noverlooks greenery. This presents a newly proposed architectural language of interlocking where lower floors are slid across different levels in stacked ‘programmatic blocks’, which also creates pockets of common areas that\nencourage student interaction.\n22JANUARY\nSIT@RP B UILDING  GROUNDBREAKING\nCEREMONY\nThe final groundbreaking ceremony was held at Republic Polytechnic\n(RP) to mark the construction of the SIT@RP building.\nThe SIT@RP building will house the University of Glasgow when\nconstruction is completed. It will be constructed nine storeys high and is located next to RP’s sports field, adjacent to Admiralty Park.\nSIT@RP building is the tallest SIT building and is presently SIT's first project to have attained the Green Mark Platinum Award. Several strategic measures have been integrated into the design concept to make the project\nmore eco-friendly, such as stack ventilation which induces natural ventilation by relying on air circulation caused\nby thermal stack effect. In addition, it has a green roof which serves to harvest rainwater, absorb heat and provide spatial ambience to visitors. The building also features a green wall which is a louvered screen wall to reduce the\noverall temperatures of the building.\n29\n14\nSiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 2013SiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 201313\nMILESTONES 2012/13\nFEBRUARY\nOUR SINGAPORE  CONVERSATION  @ SIT\nWe held the inaugural session of ‘Our Singapore Conversation @ SIT’ at\nSingapore Polytechnic and received a healthy response from industry\npartners. They engaged in a lively discourse with 80 enthusiastic SIT\nstudents and staff, by sharing their aspirations for Singapore. The interchange of ideas and information was truly beneficial as it allowed\nboth parties to gain new perspectives on national issues.\n28The inaugural graduation ceremony also marked a change of leadership as our Founding President, Professor Tan\nChin Tiong presented the Presidential Medallion to Professor Tan Thiam Soon to signify the hand over.\nAs the Founding President, Professor Tan Chin Tiong played an instrumental role in the development of SIT since it\nstarted in 2009. Not only did he inaugurate the first intake\nof 500 students with 10 degree programmes in 2010, he also oversaw the team that more than doubled the range\nof degree offerings to 26 programmes by early 2013. In\naddition, student intake increased to 1500 by AY2012/13.\nProfessor Tan Chin Tiong has since returned to the\nSingapore Management University as Senior Advisor to the President and Professor at the Lee Kong Chian School\nof Business.1\nLEADERSHIP  RENEWAL\nProfessor Tan Thiam Soon joined SIT on 1 September 2012 as President-designate. He succeeded Professor Tan Chin Tiong as SIT's second President on 1 February 2013.\nIn his previous role as Vice-Provost (Education) at the National University of Singapore (NUS), Professor Tan\nThiam Soon assisted the NUS Provost and was responsible for:\n•\t\tSetting\teducational\tdirections\tand\tpolicies\tfor\tthe\tUniversity\tto\tachieve\thigh\tacademic\tstandards\tand\thigh\nquality of education; and\n•\t\tCo-ordinating\tresearch\tunder\tthe\tvirtual\tIntegrative\tSustainability\tResearch\tCluster\tin\this\tconcurrent\trole\tas\nthe Director of the NUS Energy Office.\nProfessor Tan Thiam Soon’s role in NUS placed him in good stead to lead SIT as our second President and\nhe will work closely with our Board of Trustees to continue expanding SIT as we transit to Singapore’s fifth\nAutonomous University.MILESTONES 2012/13\nSINGAPORE W ORLD W ATER D AY 2013\n30,000 people gathered in support of Singapore World Water Day 2013 and took part in a variety of activities such as dragon boating, cycling\nand kite flying. The SIT Dragon Boat Team took part in the Adopters\nDragon Boat Race and emerged as 1st runner up!\n16REACH F OR T HE S TARS 2013\nThe 3rd annual Reach For The Stars 2013 was held at Raffles City Convention Centre this year – an event specially organised for our\nscholars to celebrate the support given by our scholarship providers and\nsponsors. Mr Ng Yat Chung, Chairman, Board of Trustees, SIT graced the occasion this year.\nOrganised as a cocktail event, our scholars were given the opportunity\nto mingle freely and network with their sponsors, without being\nconfined in a formal setting. This approach kept the conversations spontaneous, where the exchange of ideas and information led to diverse and new perspectives on the industry and economy.\nDuring the event, selected scholars also shared their experiences about life in SIT and expressed their gratitude to\ntheir sponsors. The event was a great success for our scholars and industry partners who turned up to celebrate this joyous occasion.\n14MARCH\nINDUSTRY T ALK: HOW T O HAVE A\nGREAT  CAREER\nSIT alumni, current students and staff from our Alumni and Career Services offices caught up for dinner and mingled over Red Dot’s unique\nbrews on 21 March 2013.\nJonathan Kwan, founder of Kwantum Leap Career Coaching, revealed\nsome of the most common career problems of young aspiring executives\nand covering the importance of career planning prior to commencing the job search.\n21\n16\nSingapore in Stitute of t echnology\nannual  report  2013\nSiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 201315\nMILESTONES 2012/13\nMARCH\nSHOOT -IT-ON FUTSAL  COMPETITION\n2013\nThe inaugural Shoot-IT-on Futsal Competition was organised for SIT\nstudents, working professionals and polytechnic students in a bid to provide\na platform for futsal enthusiasts to get together. The CapitaLand-Raffles\nCity Singapore Team eventually won the battle. Nonetheless, our students put up a good fight and went home feeling contented.\n23\nSTREET B ASNET 2013\n‘Basnet’ is a combination of Basketball and Netball and we held our first ever annual Street Basnet match in March 2013. A total of 107 SIT students\nwere engaged in this match and it was a day of fun and excitement as\nthe male and female students trashed it out with basketball and netball respectively.\n24\nSIT-U oG-RP S IGNING  CEREMONY\nWe commemorated the launch of the Computing Science degree programme with a signing ceremony between SIT, University of Glasgow\n(UoG) and Republic Polytechnic (RP). Ms Rachel Eng, Member, Board of\nTrustees, SIT, graced the event as the Guest-of-Honour.\nThe Bachelor of Science with Honours in Computing Science degree\nprogramme brings the total of SIT's degree offerings with UoG to five.\nOn expanding the partnership with SIT, Professor John Chapman, Vice-Principal and Head of College of Science and\nEngineering, University of Glasgow said, “In 2011, we were delighted and proud to launch our collaboration with SIT and\nestablish the University of Glasgow Singapore (UGS). We knew then that in SIT, we would be working with an excellent organisation – one that is committed and at the forefront of leading the strategic development of partnerships within the\npolytechnic sector.”\n26OUR GRADUATES\nAs SIT graduates, they are our brand ambassadors and carry with them the SIT DNA of\nlearning, unlearning and relearning to the workplace. As they move on to the next stage in their\nlives, the skills and connections built up at SIT will serve them well throughout their careers.\nLeft to right: Mark, Stefhani, Boon Kai, Timothy, Fion\n“My time in school helped me become more independent.\nI have learnt to seek out information and resources needed\nto solve any problem, a skill which will stand me in good stead in the workplace.”\nTay Boon Kai\nEngineer, Large-Scale Systems Group,\nSingapore Technologies Electronics Limited\nBachelor of Science in Electrical Engineering & Information\nTechnology, Technische Universität München“The school created many networking opportunities for\nus and I was able to meet people who opened doors for me. For example, by continuing the conversation with a guest speaker who came to give a talk to my class, I was able to get the connections rolling and eventually landed\nthis position with Singapore Marriott Hotel!”\nStefhani Quek\nManagement Trainee, Singapore Marriott Hotel\nBachelor of Science in Hotel Administration,\nUniversity of Nevada, Las Vegas\n“Seeing people smile and enjoy themselves is what I like\nabout creating games. Now, as part of the pioneering\nteam in a mobile game developer that’s expanding in Asia, I can continue to pursue my passion for coding and creating games.”\nTham Kiat Hoe Timothy\nUnity Developer, 12 Gigs Asia\nBachelor of Science in Computer Science in Real-time Interactive\nSimulation, DigiPen Institute of Technology\n“The specialised knowledge that I gained in class helped me to better understand the inner workings of a ship. This\nhelps me to communicate effectively in the course of my work at the shipyard, with people of all levels and from different backgrounds.”\nFion Heng Pei Ting\nCommercial Officer, Jurong Shipyard\nBachelor of Engineering with Honours in Marine Engineering,\nNewcastle University (UK)“Our Overseas Immersion Programme in California\nwas an amazing eye-opener. I also had the opportunity to work in New York at one of the top restaurants in the world. This global exposure really helped to build up my skills, knowledge and connections.”\nMark Tai Wei Jie\nChef de Partie, Esquina Tapas Bar\nBachelor of Professional Studies in Culinary Arts Management,\nThe Culinary Institute of America\n18\nSiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 2013SiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 201317\nOUR PARTNERS\nOVERSEAS UNIVERSITY\nPARTNERS\nSingapore Polytechnic\nNgee Ann PolytechnicTemasek Polytechnic\nNanyang Polytechnic\nRepublic PolytechnicNewcastle University (UK)Technische Universität MünchenUniversity of Glasgow\nTrinity College Dublin\nThe University of ManchesterThe Glasgow School of ArtDigiPen Institute of Technology\nWheelock College\nThe Culinary Institute of AmericaUniversity of Nevada, Las VegasPOLYTECHNIC\nPARTNERSThE WORLD hAS ARRi VED AT y OUR DOORSTEP\nAt SIT, the world is a smaller place. Our overseas university partners are\namong the best in Engineering and Applied Sciences, Health Sciences, Design,\nInteractive Digital Media, Education and Hospitality. And together with our\npolytechnic partners, we bring them closer to you.\nIn 2013, we expanded our range of degree programmes to create more\nopportunities for prospective students to fulfil their ambitions, upgrade their skills and knowledge, as well as to excel in their chosen careers.\n“ It is very exciting to see the same spirit of engineering captured here in\nSingapore as it is back in Germany. TUM has found a second home here in Singapore and TUM Asia’s collaboration with SIT has shown great synergy.\nWith the pioneer group of TUM-SIT graduates now in the workforce, we are\nexcited to see what the future holds for us.”\n- Dr Markus Wächter, TUM Asia Managing DirectorFounded in 1868 by King Ludwig II, Technische Universität München (TUM) has long established itself as a premier institute\nof higher learning in Germany. Ranked as Germany’s #1 University for 3 consecutive years - 2011, 2012 and 2013 Shanghai\nRanking (Academic Ranking of World Universities, ARWU), TUM has earned itself the reputation of being an institute that\nproduces world-changing technologies - with a total of 13 Nobel Laureates to date. In 2012, TUM celebrated the 10th anniversary of TUM Asia, marking a decade of German academic excellence here in Singapore. Moving forward, TUM Asia strives to launch more Master and Bachelor programmes that continue to be industry-focused and in tune with the needs of\nthe global economy.TECHNISCHE UNIVERSITÄT MÜNCHEN\n(Technical University of Munich, TUM)\nProgrammes offered in partnership with S iT:\n•\t\tBachelor\tof\tScience\tin\tChemical\tEngineering\n•\t\tBachelor\tof\tScience\tin\tElectrical\tEngineering\n& Information TechnologyNU is one of the country’s most reputable higher education institutions and a member of the UK’s elite Russell Group of\n24 internationally-recognised universities. Acclaimed for teaching excellence informed by world-class research, NU offers a\nwide range of industry-relevant degrees in Singapore.  It has an enviable reputation for graduate employment and a global\nnetwork of alumni.NEWCASTLE UNIVERSITY (NU)\n“ Our academic presence in Singapore and collaboration with Singapore’s\nfifth public university have undoubtedly seen significant progress and growth during the last couple of years. We are now delivering seven\nundergraduate degree programmes to over 700 students and will have\nour first grand congregation ceremony in November 2013 in which more than 250 graduates will join our alumni in Singapore. Attraction of NU programmes to Singaporean Diploma graduates has also grown\nsignificantly. This is mainly due to the excellence and relevance of our\nprogrammes which provide quality education with the same rigour and diligence thousands of miles away from our main campus. We are also observing an increasing number of accreditation and approvals from various industries in Singapore, which is extremely encouraging.“\n- Prof Ehsan Mesbahi, Dean (Singapore Campus), Chief Executive, NUIS\nProgrammes offered in partnership with S iT:\n•\t\tBachelor\tof\tEngineering\twith\tHonours\nin\tChemical\tEngineering\n•\t\tBachelor\tof\tEngineering\twith\tHonours\nin Electrical Power Engineering\n•\t\tBachelor\tof\tEngineering\twith\tHonours\nin Marine Engineering\n•\t\tBachelor\tof\tEngineering\twith\tHonours\nin Naval Architecture\n•\t\tBachelor\tof\tEngineering\twith\tHonours\nin Offshore Engineering\n•\t\tBachelor\tof\tEngineering\twith\tHonours\nin Mechanical Design and Manufacturing\nEngineering\n•\t\tBachelor\tof\tScience\twith\tHonours\tin\nFood & Human Nutrition\n20\nSiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 2013SiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 201319\nFounded in 1451, UoG is the fourth-oldest university in the English-speaking world. It is also part of the United Kingdom’s\ndistinguished Russell Group of leading UK universities and a founding member of Universitas 21 – an international network\nof universities established as an international reference point and resource for strategic thinking on issues of global\nsignificance. It is associated with seven Nobel Laureates and boasts alumni like Adam Smith, Lord Kelvin and James Watt. UoG’s School of Engineering sustains a broad portfolio of leading-edge research funded by industry, research councils, and\ngovernmental agencies around the world.UNIVERSITY OF GLASGOW (UoG)\n“ I’m delighted that the partnership we have forged between University\nof Glasgow and Singapore Institute of Technology goes from strength to strength. I will have the great privilege of attending the first set of\ngraduations in Singapore in October – exciting evidence that our joint\nprogrammes are already producing graduates, and graduates of quality. It’s also encouraging to note that we are launching our fifth programme, the BSc Honours in Computing Science, in September, and so meeting our\naspiration to expand our degree options in Singapore. These facts and this\nreport tell a positive story and offer great encouragement to the ongoing success of our collaboration.”\n- Professor Anton Muscatelli, Principal & Vice-Chancellor\nProgrammes offered in partnership with S iT:\n•\t\tBachelor\tof\tEngineering\twith\tHonours\nin Aeronautical Engineering\n•\t\tBachelor\tof\tEngineering\twith\tHonours\nin Aerospace Systems\n•\t\t\tBachelor\tof\tEngineering\twith\tHonours\nin Mechanical Design Engineering\n•\tBachelor\tof\tEngineering\twith\tHonours\nin Mechatronics\n•\t\tBachelor\tof\tScience\twith\tHonours\nin\tComputing\tScienceTHE UNIVERSITY OF MANCHESTER (UoM)\n“ A University of Manchester degree aims to develop capacity for leadership,\nand in Singapore, we are preparing our students to play their part in promoting evidence-based health care. Leading and managing change is\na key theme and we are sure our pioneer cohort will provide excellent role\nmodels for future graduates as we develop our partnership with SIT.”\n- Dr Christine Brown Wilson, Associate Professor, Programme Director, UoMThe University of Manchester was established in 1824 as England’s first civic university and is now the largest campus-\nbased university in the UK. A member of the esteemed Russell group, the University of Manchester has a proud history\nof achievements with 25 Nobel Laureates among its staff and alumni. UoM was the first university in England to offer a\nnursing degree and appoint a Professor of Nursing. UoM continues to influence health care policy, practice, education, and research by producing national and international nursing leaders. The University of Manchester’s innovative two-year\nhonours degree programme equips graduates to make evidence-based decisions in their practice, meeting the challenges\nof the changing demographic in Singapore health care. Clinical attachments allow Registered Nurses to develop and apply analytical skills in practice while the Manchester Leadership Programme provides opportunities to develop leadership\nskills. UoM Programme Director, Dr Christine Brown Wilson, looks forward to welcoming future cohorts as the SIT-UoM\npartnership continues to flourish.\nProgramme offered in partnership with S iT:\n•\t\tBachelor\tof\tScience\twith\tHonours\tin\tNursing\nPractice\nTRINITY COLLEGE DUBLIN (TCD)\nTrinity College Dublin (TCD) is Ireland’s highest-ranked university with a history that dates back to 1592. Situated in the\nvery heart of Dublin city, Trinity College Dublin is recognised as a top international centre for research with a high level of\ninternational collaboration. TCD shares industrial ties with many global organisations including the National Institute of Health\n(NIH) in Washington DC, the Dresden Centre for Radiation Research in Oncology, and other prominent international health organisations. The unique combination of TCD’s academic excellence, vibrant student experience, and convenient city-centre\nlocation means students, scientists, and scholars from all over the world continue to choose TCD as a study destination.\n“ Trinity College Dublin is delighted with the partnership with SIT. The\ninaugural programmes in Physiotherapy and Occupational Therapy commenced in September 2012 and the first year has been a great success. We look forward to a long and productive relationship collaborating in\nteaching and research.”\n-  Associate Professor Juliette Hussey, TCD Academic Director\nfor SIT Programmes\nProgrammes offered in partnership with S iT:\n•\tBachelor\tin\tScience\t(Physiotherapy)\n•\tBachelor\tin\tScience\t(Occupational\tTherapy)Founded in 1845 as a government School of Design, The Glasgow School of Art (GSA) is one of Europe’s leading higher\neducation institutions for creative education and research in design, fine art, and architecture. A GSA education is practice-\nbased, face-to-face, professionally-oriented, and socially-engaged. GSA is ranked top in the UK for visual arts, according to\nthe Guardian University Guide 2012’s Specialist Institutions league table, and was named in the ‘Hot 50’ as a Global Leader in its field by Design Week magazine. All GSA degree programmes are validated by the University of Glasgow, a member of\nthe prestigious Russell Group of leading UK research universities and a founding member of Universitas 21, an international\ngrouping of universities dedicated to setting worldwide standards for higher education. Students may choose to study honours degree programmes in Communication Design or Interior Design in Singapore.THE GLASGOW SCHOOL OF ART (GSA)\n“ Staff and students at the GSA share a passion and concern for visual\nculture. Our education produces graduates who are creative, innovative, and critical thinkers who can be found across the world contributing to the\ncommunities and economies they are part of. Now entering the second year of\nour partnership with SIT, the GSA is delighted to be contributing to the growth and development of Singapore as the creative hub of South East Asia.”\n- Mr Frazer Macdonald Hay, Programme Director, GSofA Singapore\nProgrammes offered in partnership with S iT:\n•\t\tBachelor\tof\tArts\twith\tHonours\nin\tCommunication\tDesign\n•\t\tBachelor\tof\tArts\twith\tHonours\nin Interior Design\n22\nSiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 2013SiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 201321\nCelebrating its 125th anniversary, Wheelock College (WLC) of Boston, USA, is an outstanding institution that seeks to\nprovide a transformational education to students who are passionate about making the world a better place, with a special\nemphasis on preparing its learners to teach, mentor, and nurture young children and their families. The Wheelock degree\nbalances a deep understanding of theory with the development of real-world skills in its curriculum and internships, guiding its graduates to become skilful, sought-after practitioners and leaders in the profession of Early Childhood Education\nand related fields. Its broad-based, globally-focused degree provides a distinctly interactive classroom experience for its\nstudents, with its unique co-instruction model where most of its courses are taught jointly by Wheelock’s internationally renowned faculty members and Singapore instructors.WHEELOCK COLLEGE (WLC)\n“ Wheelock College is a recognised leader in Early Childhood Education. In the globalised world of the 21st Century, providing a\nstrong educational foundation from the earliest years is key to any country’s success. We are privileged to collaborate with the Singapore Institute of Technology to develop the highest quality teachers and educational leaders whom Singapore needs, in\norder to remain one of the world’s most competitive and dynamic economies. The rigorous curriculum taught by caring and\ncommitted world-class faculty members, together with the immersion programme in Boston and tight bonds formed among students, ensure an educational experience that is individualised, life-transforming, and second to none.”\n- Dr Trisha Craig, Executive Director, WLC Singapore\nProgramme offered in partnership with S iT:\n•\t\tBachelor\tof\tScience\tin\tEarly\tChildhood\nEducation“ We are delighted with our ongoing working relationship with SIT. I have\nfull confidence that the collaboration will be instrumental in providing the\ninnovation and manpower needs for building a world-class interactive digital\nmedia and visual effects industry in Singapore. I believe that in the years\nahead, our graduates will form a core group of professionals who will create\nworld-renowned ‘Made-in-Singapore’ products for the global market.”\n-  Mr. Claude Comair, Founder & President of DigiPen Institute of TechnologyDigiPen Institute of Technology is a global leader in game development education. As the first school in the world to\noffer a Bachelor’s degree in game development, DigiPen has advanced the game industry for more than two decades\nby empowering students to become world-class programmers, engineers, designers, and artists. Located in Redmond, Washington, with branch campuses in Singapore and Bilbao, Spain, DigiPen offers undergraduate and graduate degrees\nin video game design and development, hardware and software engineering applied to simulation, fine arts and digital art\nproduction, and sound design, as well as youth programmes and Continuing Education and Training courses. DigiPen students have won more awards at the prestigious Independent Games Festival than those of any other school. In 2011, three of the\nsix finalists in the Student Game competition at the Independent Games Festival China were created by DigiPen students,\nand the winner was DigiPen students' game, Pixi. DigiPen graduates have gone on to create groundbreaking games like Valve Software’s Portal series, and have joined companies that are giants of the industry, such as Microsoft, Nintendo, and Ubisoft. DIGIPEN INSTITUTE OF TECHNOLOGY (DigiPen)\nProgrammes offered in partnership with S iT:\n•\t\tBachelor\tof\tScience\tin\tComputer\tScience\nin Real-Time Interactive Simulation\n•\t\tBachelor\tof\tScience\tin\tComputer\tScience\nand Game Design\n•\t\tBachelor\tof\tFine\tArts\tin\tDigital\tArt\nand Animation\n•\t\tBachelor\tof\tArts\tin\tGame\tDesign\nSince its establishment in 1946, The Culinary Institute of America (CIA) has set the global gold standard for culinary\neducation. Its proven degree programmes have produced more than 45,000 culinary professionals, including top chefs such\nas Anthony Bourdain ’78, Cat Cora ’95, and Roy Yamaguchi ’76. The historic SIT-CIA partnership marks the first time that the\nCIA is offering its programmes in Asia.THE CULINARY INSTITUTE OF AMERICA (CIA)\n“ The partnership with SIT continues to grow and expand while providing our\nstudents with the opportunity to become educated professionals in areas identified by Singapore as economic engines for the country. As SIT becomes\nthe fifth university, the opportunities for SIT and its overseas partners to provide\na platform for educators to innovate, share, and expand their educational offerings are tremendous. We look forward to taking our partnership to the next level.”\n- Chef Eve Felder, Managing Director, CIA SingaporeProgramme offered in partnership with S iT:\n•\t\tBachelor\tof\tProfessional\tStudies\tin\tCulinary\nArts Management\n“ With over 550 students co-enrolled at the Singapore Institute of Technology,\nUNLV has found a partner equally committed to the provision of its Bachelor of Science degree to the students of Singapore.”\n- Richard C. Linstrom, J.D., Associate Dean and Managing DirectorFounded in 1957, UNLV offers more than 200 undergraduate, graduate, and professional degree programmes. It is a public,\nresearch-intensive, and fully accredited institution with about 28,000 students and some 2,800 faculty and staff at its 350-acre\nmain campus, located within view of the famous “Las Vegas Strip” resort corridor.\nUNLV’s William F. Harrah College of Hotel Administration has been granting the U.S. Bachelor of Science degree in Singapore\nat its facility in the National Library Building since 2006. Graduates obtain the knowledge to begin their careers in hospitality-related sectors, and also gain the advanced skills needed to move into responsible positions in other industries or to further their studies with graduate and professional degrees, such as the MS, JD, or PhD. UNIVERSITY OF NEVADA, LAS VEGAS (UNLV)\nProgramme offered in partnership with S iT:\n•\t\tBachelor\tof\tScience\t(Major\tin\tHospitality\nManagement)\n24\nSiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 2013SiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 201323\nPOLYTECHNIC PARTNERS\n“ The construction of the SIT building in SP campus is progressing well and we look forward to its completion in 2014.\nAs Singapore’s fifth autonomous university, SIT will offer even more degree opportunities and options for polytechnic\ngraduates with strengths and passion in applied learning, and serve the diverse needs of our economy.”\nSP Principal & CEO, Mr Tan Choon Shian SINGAPORE  POLYTECHNIC\n“ The Singapore Institute of Technology has made great strides and, with an enhanced mandate to offer its own degree\nprogrammes in addition to those of its overseas university partners, it is poised to take undergraduate education to a whole\nnew level.”\nNP Principal, Mr Chia Mia Chiang NGEE ANN  POLYTECHNIC\n“ Temasek Polytechnic looks forward to extending our partnership with SIT in hosting degree programmes offered by\nreputable universities from around the world, and expanding further education opportunities for polytechnic graduates.”\nTP Principal & CEO, Mr Boo Kheng Hua TEMASEK  POLYTECHNIC\n“ Nanyang Polytechnic (NYP) is pleased to host six degree programmes offered by three renowned universities under the\nSIT umbrella. These programmes are offered by The University of Manchester in Nursing Practice; Newcastle University in\nMechanical Design and Manufacturing Engineering, in Food & Human Nutrition and in Electrical Power Engineering; and\nTrinity College Dublin in Occupational Therapy and in Physiotherapy. These programmes provide polytechnic graduates with more opportunities to upgrade and pursue their degrees at reputable universities. In addition, we welcome SIT onto\nour campus and look forward to the completion of its building, which will add to the dynamism and vibrancy of campus life\nat the Polytechnic.”\nNYP Principal & CEO, Mr Chan Lee Mun NANYANG  POLYTECHNIC\n“ Republic Polytechnic is pleased to host and support the industry-focused degree programmes offered by SIT. The diversity\nof programmes offer polytechnic graduates exciting opportunities. Indeed, this collaboration brings much value-add to\nSingapore’s education landscape.”\nRP Principal/CEO, Mr Yeo Li Pheow REPUBLIC  POLYTECHNIC\nhighER  EDU cATiON, BROUghT cLOSER\nOur partnership with the five local polytechnics is the foundation of our success. We build on\ntheir reputation and strengths by providing an optimal pathway for polytechnic graduates, from\ndiploma to degree.\nThis model brings degree-level education right to the students' doorstep, providing them\nwith world-class infrastructure and excellent facilities to enhance student life. In addition,\nour buildings within the five polytechnics promise great progress as we continue to expand\nour offerings.INDUSTRY SCHOLARSHIPS\nAND SPONSORSHIPS\nTHE FOLLOWING INDUSTRY PARTNERS HAVE PROVIDED\nSCHOLARSHIPS /SPONSORSHIPS  TO SIT STUDENTS :\n•\tAgri-Food\t&\tVeterinary\tAuthority\tof\tSingapore\n•\tAlexandra\tHealth\n•\tAssociation\tof\tSingapore\tMarine\tIndustries\n•\tChangi\tGeneral\tHospital\n(under Eastern Health Alliance)\n•\t\tEarly\tChildhood\tDevelopment\tAgency\n•\tFairmont\tSingapore\t&\tSwissôtel\tThe\tStamford\n•\tFar\tEast\tOrganization\n•\tInfocomm\tDevelopment\tAuthority\tof\tSingapore\n•\tJurong\tHealth\tServices\n•\tJurong\tShipyard•\tKeppel\tCorporation\n•\tMaritime\tPort\tAuthority\tof\tSingapore\n•\tMaritimeONE\n•\tMedia\tDevelopment\tAuthority\tof\tSingapore\n•\tMethodist\tWelfare\tServices\n•\tMinistry\tof\tCommunications\tand\tInformation\n•\tMinistry\tof\tDefence•\tMinistry\tof\tHome\tAffairs•\tMOH\tHoldings\tPte\tLtd\n•\tNational\tCouncil\tof\tSocial\tService•\tNational\tHealthcare\tGroup\n•\tNational\tUniversity\tHealth\tSystem\n•\tNTUC\tFirst\tCampus\n•\tOverseas\tUnion\tEnterprise\tLimited\n•\tPAP\tCommunity\tFoundation•\tRaffles\tMedical\tGroup\n•\tRen\tCi\tHospital\n•\tSakae\tHoldings\tLtd\n•\tSembcorp\tIndustries\tLtd\n•\tSembcorp\tMarine\tLtd\n•\tSingapore\tHealth\tServices\tPte\tLtd\n•\tSingapore\tNational\tCo-operative\tFederation\n•\tSingapore\tPower\tLimited\n•\tSt\tLuke’s\tHospital\n•\tTemasek\tPolytechnic \tNOW’S ThE TiME T O STAND APART\nSIT has been working closely with our industry partners to provide opportunities to deserving\nundergraduates through various scholarships and sponsorships.\nOur industry partners also benefit from our world-class tertiary education by sending their employees to SIT to upgrade their skills and gain new knowledge through our degree\nprogrammes. We strive to nurture and transform students from diverse backgrounds with our\nindustry-focused programmes, and encourage a deeper sharing of experiences and knowledge between fresh young minds and experienced employees.\n26\nSingapore in Stitute of t echnology\nannual  report  2013\nSiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 201325\n•\tASIA S QUARE T OWER 1 P TE LTD\n•\tCHUA T HIAN P OH\n•\tCITIBANK  SINGAPORE  LIMITED\n•\tHB GLASS & A LUMINIUM P TE LTD\n•\tKEPPEL  CORPORATION  LIMITED\n•\tKUOK  KHOON  HONG\n•\tLIAN H O LEE C ONSTRUCTION (P RIVATE ) LIMITED\n•\tSEMBCORP  INDUSTRIES  LTD\n•\tSEMBCORP MARINE L TD\n•\tSINGAPORE  TECHNOLOGIES  ENGINEERING  LTD\n•\tSTARHUB LTD\n•\tTHYE H ONG MANAGEMENT & S ERVICES P TE LTD\n•\tWILMAR I NTERNATIONAL LIMITEDOUR DONORS\nA Big ThANK y OU TO OUR DONORS\nOn behalf of our students, who have benefited greatly from your generosity, we would like to\nexpress our deepest gratitude.\nMany of our students have demonstrated exceptional abilities despite coming from modest\nbackgrounds. More than 75% of our students admitted in the academic year 2013 come\nfrom households with a per capita income (PCI) that is below Singapore’s 2012 National Median PCI of S$2,130. Self-motivated and resourceful, these innovative problem solvers are also highly adaptable.\nWe thank you for enabling them to further realise their potential through the pursuit of\nacademic excellence. Your gifts have touched their lives and also made a difference to SIT,\nas we nurture these outstanding talents.FINANCIAL\nSTATEMENTS\nIMPORTANT  NOTE :\nThe following Financial Statements are extracted from Singapore Institute of Technology’s (SIT) Audited Financial Statements for\nthe year ended 31 Mar 2013. It may not contain sufficient information to allow for a full understanding of the results and the state of affairs of the Company. For further information, please refer to the complete audited financial statements published on the SIT official website at SingaporeTech.edu.sg .27 STATEMENT  OF COMPREHENSIVE  INCOME\n28 BALANCE S HEET\n29 STATEMENT OF C HANGES IN F UNDS AND R ESERVES\n30 STATEMENT  OF CASH FLOWS\n28\nSiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 2013SiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 201327\nSTATEMENT OF\nCOMPREHENSIVE INCOME\nFor the financial year ended 31 March 2013\nGeneral Funds Endowment And Term Funds Total\n2013  2012  2013  2012  2013  2012\n$ $ $ $ $ $\nRevenue  25,013,702  14,226,885  - - 25,013,702  14,226,885\nOther income 175,661 50,488  976,982 450,000  1,152,643  500,488\nOperating expenditure\nStaff and related expenses (13,314,434)  (10,830,401)  - - (13,314,434)  (10,830,401)\nDepreciation and\namortisation expenses  (779,431)  (278,831)  - - (779,431)  (278,831)\nProgramme-related    expenses  (43,593,292)  (26,386,068)  (689,448)  (57,839)  (44,282,740) (26,443,907)\nRental and other\nfacilities expenses (1,488,933)  (1,100,083)  - - (1,488,933)  (1,100,083)\nOther operating expenses  (3,451,561)  (3,688,939)  - - (3,451,561)  (3,688,939)\nTotal operating\nexpenditure (62,627,651) (42,284,322)  (689,448)  (57,839)  (63,317,099)  (42,342,161)\n(Deficit)/surplus before\ngovernment grants  (37,438,288)  (28,006,949)  287,534  392,161  (37,150,754)  (27,614,788)\nGovernment grants 41,179,738  33,366,684  - - 41,179,738  33,366,684\nNet surplus and total\ncomprehensive\nincome  3,741,450  5,359,735  287,534  392,161  4,028,984  5,751,896As at 31 March 2013BALANCE SHEET\n2013  2012\n$  $\nASSETS\nCurrent assets\nCash and cash equivalents   42,365,588  35,357,174\nFees and other receivables   21,462,017  4,342,027\nOther current assets    5,670,948  3,487,084\n69,498,553  43,186,285\nNon-current assets\nProperty, plant and equipment    34,062,366  6,877,204\nIntangible assets    613,209  439,977\nStudent loans    184,133  26,459\nOther non-current assets    10,986,896  4,108\n45,846,604  7,347,748\nTotal assets    115,345,157  50,534,033\nLIABILITIES\nCurrent liabilities\nTrade and other payables   15,831,037  7,978,577\nTuition fees received in advance   4,348,444  2,717,687\nGrants received in advance    31,341,805  18,560,168\n51,521,286  29,256,432\nNon-current liabilities\nDeferred capital grants   34,675,575  7,317,181\nOther deferred grants   10,670,142  -\n45,345,717  7,317,181\nTotal liabilities    96,867,003  36,573,613\nNET ASSETS    18,478,154  13,960,420\nFUNDS AND RESERVES\nEndowment and term funds    1,973,165  1,196,881\nAccumulated surplus\n- General funds    16,504,989  12,763,539\n18,478,154  13,960,420\nFunds’ net assets managed on behalf of Ministry of Education (“MOE”)  6,072,252 2,768,329\n30\nSiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 2013SiNgAPORE  iNST iTUTE  OF TEchNOLO gy\nANNUAL REPORT 201329\nSTATEMENT OF CHANGES\nIN FUNDS AND RESERVES\nAccumulated\nSurplus  Endowment\n(General  And Term\nFunds)  Funds  Total\n$ $ $\n2013\nBeginning of financial year    12,763,539  1,196,881  13,960,420\nTotal comprehensive income     3,741,450  287,534  4,028,984\nGovernment grants    - 488,750  488,750\nEnd of financial year    16,504,989  1,973,165  18,478,154\n2012\nBeginning of financial year    7,403,804  10,000  7,413,804\nTotal comprehensive income     5,359,735  392,161  5,751,896\nGovernment grants    - 660,832  660,832\nDonations     - 133,888  133,888\nEnd of financial year    12,763,539  1,196,881  13,960,420For the financial year ended 31 March 2013STATEMENT OF\nCASH FLOWS\n2013  2012\n$  $\nCash flows from operating activities\nDeficit before government grants   (37,150,754)  (27,614,788)\nAdjustments for:\n- Depreciation and amortisation    779,431  278,831\n- Interest income   (133,305)  (46,842)\n- Donations   (973,410)  (450,000)\n- Loss on disposal of property, plant and equipment    6,911 1,291\n(37,471,127)  (27,831,508)\nChange in operating assets and liabilities\n- Fees and other receivables   (930,725)  (953,137)\n- Other current assets   (2,183,864)  (1,069,719)\n- Trade and other payables   2,533,306  5,425,975\n- Other non-current assets    (10,982,788) 5,832\n- Student loans    (157,674)  (26,459)\nCash used in operations   (49,192,872)  (24,449,016)\nDonations    973,410  450,000\nNet cash used in operating activities   (48,219,462)   (23,999,016)\nCash flows from investing activities\nPurchase of property, plant and equipment   (20,817,122)  (5,371,009)\nPurchase of intangible assets   (204,503)  (311,768)\nInterest received    133,305  46,842\nNet cash used in investing activities   (20,888,320)   (5,635,935)\nCash flows from financing activities\nOperating grants received   49,698,204  47,150,212\nDevelopment grants received   21,765,031  4,040,638\nOther grants and funds received   4,652,961  157,909\nNet cash provided by financing activities   76,116,196 51,348,759\nNet increase in cash and cash equivalents   7,008,414  21,713,808\nCash and cash equivalents at beginning of financial year   35,357,174  13,643,366\nCash and cash equivalents at end of financial year   42,365,588  35,357,174For the financial year ended 31 March 2013\nSingapore in Stitute of t echnology\nannual  report  201331\nLOOKING AHEAD\nAs SIT ramps up towards becoming Singapore’s fifth autonomous university, we are moving\nahead on various fronts to ensure that once Parliament confers degree-awarding status, we will\nbe ready to launch our degree programmes in the next academic year.\nSIT is planning to launch our own degree programmes to cater to industry demands and to\nhelp meet the aspirations of our polytechnic graduates. We will also launch an Integrated Work\nStudy Programme (IWSP) which will incorporate real work into the curriculum so that students not only develop deep specialist skills in their chosen fields but also integrate theoretical\nconcepts with concrete work experience.\nIn line with our efforts, we will be actively ramping up our faculty numbers and moving to our\ninterim campus at Dover by the end of FY2012/13.By STACEY CHIA\nand SANDRA DAVIE\nTHE Singapore Institute of Tech-\nnology (SIT) will become an auton-\nomous university by 2014.\nWhen that happens, it will go\nbeyond its current two-year mod-\nel to offer three- and four-year\ndegree courses.\nIt will also offer its own de-\ngrees – on top of the degrees from\nits partner universities – and run\na cooperative education pro-\ngramme which will require stu-\ndents to alternate between semes-ters of full-time study and rele-vant paid work.\nSIT’s blueprint for conversion\ninto a full-fledged university wasannounced yesterday by its presi-dent-designate Tan Thiam Soonin a press conference held at the\nMinistry of Education (MOE) in\nBuona Vista.\nSIT was marked as one of two\nnew universities – the other being\nSIM University – to add places for\nSingapore’s degree hopefuls.As the Republic’s fifth and\nsixth universities, the two schools\nare expected to provide the bulk\nof the 3,000 additional places\nyearly, and raise the cohort partici-\npation rate from the current 27\nper cent to 40 per cent by 2020.\nThe cohort participation rate re-\nfers to the percentage of students\nin an age group that enters univer-\nsity.\nCurrently, SIT runs degrees\nsuch as in chemical engineeringand interior design offered by its\n10 overseas partners, including\nthe Technical University of Mu-nich and University of Glasgow.\nThese are two-year pro-\ngrammes catering to mostly poly-technic upgraders. More than 90per cent of its students are fromthe polytechnics.\n“It’s not about putting out a\nnew degree programme, it’s really\nabout looking... way beyond the\nnext few years at sectors that weknow will have demand for highly\ntrained manpower,” said Profes-\nsor Tan.Senior Minister of State for\nEducation Lawrence Wong, who\nled the committee that looked in-to expanding university places,\nsaid SIT was picked to offer the ap-\nplied degree pathway because it al-\nready had several elements of\nsuch a model.\nThese include having close\nlinks with the industry. Last year,\nthere were 34 industry partners\nsponsoring scholarships for 12 per\ncent of its students.\nMOE noted in a press state-\nment yesterday that SIT’s current\nprogramme offerings with partner\nuniversities already have a\n“strong applied element”, such as\nin engineering and allied health.\nWhen asked if polytechnic stu-\ndents will take to the cooperativeprogramme requiring them tocombine work and study, Prof\nTan said such an education is not\nthe same as a work attachment.\nHe said that for the pro-\ngramme, employers and work ex-periences of the students will be\ncarefully selected to ensure they\nbuild on what is taught in class.\nMr Wong said that although\nsome students raised concerns\nthat the cooperative education\nwould make their courses longer,they realised it was “not so muchof a trade-off” when its value was\npointed out to them.\n“When you explain to students\nwhat a co-op programme entails\nand it is not just an extended in-ternship... they realise that thisadds value to their experience and\nlater to their ability to get a goodjob,” he said.\nstaceyc@sph.com.sg\nsandra@sph.com.sg\nBy STACEY CHIA\nSTUDENTS who apply to the new\nfull-time degree programmes at\nSIM University (UniSIM) will be\nable to choose between day and\nevening classes.\nThe programmes will be de-\nsigned to be modular to facilitate\ninteraction between the universi-\nty’s younger students in the new\nprogramme, and older students in\nits part-time courses, said Uni-\nSIM president Cheong Hee Kiat.\nSince it started in 2006, the pri-\nvately-owned UniSIM has offered\nonly part-time degree courses forworking adults, but soon they will\nalso have publicly funded,\nfull-time degree programmes.\nThese and other details about\nUniSIM’s plans were announced\nat a press conference held yester-\nday at the Ministry of Education’s\nheadquarters in Buona Vista.\nThe news follows Prime Minis-\nter Lee Hsien Loong’s announce-\nment on Sunday that the Singa-\npore Institute of Technology (SIT)\nand UniSIM will be Singapore’s\nfifth and sixth universities.\nTogether, the two schools will\nadd the bulk of the 3,000 extra\nuniversity places every year.Senior Minister of State for Ed-\nucation Lawrence Wong, who\nheaded the committee to look into\nexpanding university places, said\nat the press conference that Uni-\nSIM was selected for its “strong\nindustry linkages” and good track\nrecord.\nHe said that there were advan-\ntages to using both SIT and Uni-\nSIM to spearhead the new applied\ndegree model.\nThe minister said that SIT’s\nstrengths lie in science and tech-\nnology areas, whereas UniSIM’s\nstrengths were in non-science\nand technology fields, such as lo-gistics and supply-chain manage-\nment.\nProfessor Cheong said it would\ntake time to finalise details of its\nnew full-time programmes, but\nthat the university would adopt\nan open admission policy that\ntakes into account work experi-\nence and talents.\nA prospective student should al-\nso show passion for the fields that\nthey wish to study besides having\ngood grades, he added.\nUniSIM currently offers 55 aca-\ndemic programmes to more than\n12,000 students.\nstaceyc@sph.com.sgBy MATTHIAS CHEW\nAMID calls for funding for Singa-\nporeans pursuing degrees at pri-\nvate schools, a university review\ncommittee has recommended a\nstudy into the quality of coursesoffered at these institutions.\nFunding for subsidies and loans\ncould be contingent on the out-come of this study.\nThe committee, headed by\nSenior Minister of State for Educa-\ntion Lawrence Wong, said in its re-\nport out yesterday: “Without bet-\nter information, it is difficult toprovide more government support\nin a prudent and accountable man-\nner.”\nOne possible outcome, said the\nreport, was that schools found in\nthe study to be of high quality\ncould enjoy “some government\nsupport”, in exchange for tighter\ngovernment oversight.\nAccording to the report, this\nwould ensure accountability in\nthe use of public funds.\nThe report also suggested that\ndata from the study be published\nto encourage private schools to\nraise their quality, and to help stu-\ndents to make more informed\nchoices.\nLast year, 47,493 degree stu-\ndents attended private schools,\nwith more believed to be doing di-ploma courses leading to degrees.\nLeading private schools con-\ntacted yesterday welcomed the\nstudy, saying it would help identi-\nfy reputable institutions.\nSIM Global Education chief Lee\nKwok Cheong said: “Our goal is to\nwork towards gaining the confi-\ndence of the Education Ministry\nto get subsidies for our students,\nhopefully within three years.”\nJames Cook University’s depu-\nty vice-chancellor Dale Anderson,\nwho is in charge of the Singapore\ncampus, said: “For those putting\nin quality programmes, we don’t\nwant to be pulled down.”\nHe added: “We’re going to be\nrelevant if our quality is as good\nas anybody else’s. I believe it’s\ngood, but we need to show that to\nthe Government.”\nmattchew@sph.com.sg\nSIT’s programme offerings such as in engineering (above) already have a “strong\napplied element”, noted the ministry. PHOTO: SINGAPORE INSTITUTE OF TECHNOLOGY\nProf Cheong said details of UniSIM’s\nnew programmes are not finalised.Work-cum-study scheme a feature\nof its autonomous varsity blueprintSIT to be full-fledged\nuniversity by 2014\nFull-time degree courses for UniSIM studentsStudy privateschool coursequality: PanelB6HOME WEDNESDAY, AUGUST 29, 2012\nSource:  The Straits Times © Singapore Press Holdings Limited. Reproduced with permission."
}