{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20220723-the-straits-times-inforthelonghaul.pdf",
  "type": "pdf",
  "content": "Occupational therapist Aaron Chong is always ready to\nembark on a rehabilitation journey with his patients\ngym so that she could practise\nstrategies in managing her condition and continue working from home.”\nSince joining the Community\nCare Sector in May as a full-time occupational therapist with KWSH, he is even more aware of how transformative the profession is.\n“My patients’ performance, their\nparticipation in the therapy process and their satisfaction is what gives the job its rewards,” he says.\nBut even as he keeps his patients’\nneeds in mind, Mr Chong knows\nit is also crucial to prioritise his  Occupational therapy was not a calling that Mr Aaron Chong had expected to embrace.\nBut the curiosity of the 28-year-old\nwas piqued when he was a cancer research technologist at Singapore General Hospital and met some occupational therapists during an orientation programme.\nHe was so inspired by their work\nthat he set out on a “quest” to learn about the profession. He did a job-shadowing stint with an occupational therapist for two weeks at Tan Tock Seng Hospital in 2017, and later took  It’s about enabling\nothers to do the things\nthat give them meaning\nin life – and that\ngives me a sense of\npurpose too.\nMR A ARON\nCHONG\nrecipient of the\nCommunity\nCare Manpower\nDevelopment\nAwards\non a role as a rehabilitation\ncare assistant at Kwong Wai Shiu Hospital (KWSH).\n“These experiences helped\nconfirm what I really wanted to do and led me to pursue my studies in Occupational Therapy at the Singapore Institute of Technology (SIT),”\nhe recalls.\nHis “leap of faith” was\nrewarded when he received the Agency for Integrated Care’s in-service Community Care Manpower Development Awards in 2018. The award sponsored his four-year degree programme at SIT.\nA JOB WITH PURPOSE\nThe sponsorship was also what Mr Chong needed to\ngive his family assurance on his choice of career.\n“My family had some\ninitial misconceptions about what the job is about, what prospects occupational therapists have and whether\nit would lead to a profession in the future,” he says.\nHe did, however, note\nthat occupational therapy is generally less understood compared with physiotherapy, which is related to body functions and can be applied to many different purposes.\n“In occupational therapy,\nour goal is to help people perform all types of activities – not just work-related – that keep them occupied. Wefocus on making sure theyare able to perform activities of daily living such asdressing, showering, toileting and feeding as well asleisure activities they enjoy.\n“It’s about enabling others\nto do the things that givethem meaning in life – and that gives me a sense ofpurpose too.”\nHe shares an example\nof an elderly patient withdementia whom he worked with for a month duringhis clinical placement in the hospital.\nBecause of his condition,\nthe patient was not able toparticipate in the activitieshe used to enjoy, butthrough Mr Chong’s therapyinterventions, he was able tomake a slow return to someof his daily activities suchas reading the papers and doing jigsaw puzzles.\nIN IT FOR THE LONG RUN\nWorking in the Community Care Sector gives Mr Chong more time to serve the post-hospitalisation rehabilitation needs of every patient.\nHe likens the process to\na “marathon” during which patients normally need a longer duration of care – in contrast to a “sprint” in an acute hospital setting where patients are discharged after short-term treatment.\nThe time with his patients\nallows him to build rapport with them and personalise their therapy plans, including taking into account their home and work situations.\nRecalling a patient who\nhad to work from home after a fall, he says: “We had to simulate her workstation at home, shifting furniture around in our rehabilitation In for the long haul\nVisit healthcarescholarships.sg/\nscholarships/undergraduate/community-\ncare-scholarship to kick-start your journey in the Community Care Sector.self-care – something that he has learnt\nfrom a supervisor.\n“To be wholly altruistic could spell\nburnout,” he says.\n“Based on my experience, my advice\nis to treat your patients as good friends so that you can strike a balance between idealism and pragmatism, and make it\na point to care for yourself before caring\nfor others.”TEXT BY EMMY ABDUL ALIMWorking in the\nCommunity Care\nSector enables\noccupational\ntherapist Aaron\nChong to forge a\nconnection with\nhis patients and\nwalk with them\non the road to\nrecovery. PHOTO:\nFRENCHESCAR LIM\nPublication: The Straits Times\nDate: 23 Jul 2022\nHeadline: In for the long haul\nSource: The Straits Times © SPH Media Limited. Reproduced with permission."
}