{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Dou%20Yee%20Enterprises%27%20Beneficial%20Ways.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  07/12\nSITizens have a steadfast friend in Dou Yee Enterprises, the total\nindustrial solutions provider that has supported them through an endowed bursary since 2013 Dou Yee Enterprises’\nBeneficial Ways\n“Thank you, Mr Soo.” The recipients had a chance to personally Mr Soo Ye Wah, Executive Chairman,\nDou Yee International during his first visit to SIT.\nA special performance by Mr Lim Shi Jie (right), a final year student and bursary recipient, and\nMs Yong Jin Yu (left), a second-year student.\nMs Soo Simin (extreme right), Mr Soo Ye Wah’s daughter, was keen to find out more about the\nprogrammes SIT had to offer.\nBursary recipients Mr Tharamuttam Jerin Kuriakose\n(extreme left) and Ms Li Jinglin (second from left),\npresent Mr Soo Ye Wah (second from right) with a\ntoken of appreciation on behalf of SIT, as Prof\nTan Thiam Soon looks on.\nMr Soo Ye Wah, spoke about how he had come from humble beginnings, and encouraged the\nbursary recipients to strive for success.\nThe customary ‘lo hei’ to usher in good tidings for the Lunar New Year!On the corporate website of Dou Yee\nEnterprises (S) Pte Ltd can be found the meaning of its name. Dou (道 ) means\n“the right path”, and Yee (益 ), which\nmeans “beneficial”. It is a name that reflects the company’s principles in the way it conducts its business dealings – and clearly, in its philanthropic undertakings as well.\nOne of the most steadfast benefactors\nof students at the Singapore Institute of Technology (SIT), the Dou Yee Enterprises (S) Pte Ltd has nurtured them since 2013 by making possible a named bursary at SIT with an endowed gift. What is more, the company has renewed and increased its support for financially disadvantaged but deserving SITizens every year. The Dou Yee Enterprises Bursary has nurtured nine recipients so far, and will support even more students in the years to come.\nOn 3 February, 2016, recipients of the\nDou Yee Enterprises Bursary recipients finally had the opportunity to meet the representatives of the company, at a lunch held on the SIT@Dover campus to celebrate the upcoming Lunar New Year.\nAmong the guests from Dou Yee were\nMr Soo Ye Wah, Executive Chairman,\nDou Yee International, Mr Tan Kong Toh,\nGroup President, Dou Yee International,\nand Ms Soo Simin, Mr Soo’s daughter. Prof Tan Thiam Soon, President, SIT, SIT faculty and staff also attended\nthe lunch.\nMr Soo, who was visiting SIT for the first\ntime, shared with SITizens that he too had come from humble beginnings. He said he believed in providing a level playing field so that the younger generation can be “given a reasonable opportunity to move up through education and hard work”. He hoped that bursary recipients would strive for success as he had, and also give back to the community in future when they are able to, Mr Soo also said. Over lunch, the guests were treated to a\nsong performance by bursary recipient\nMr Lim Shi Jie, a final year student from\nthe Bachelor of Engineering (Honours)\nin Aerospace Systems (University of\nGlasgow), and Ms Yong Jin Yu, from\nthe Bachelor of Engineering (Honours)\nin Information and Communications Technology (Software Engineering) degree programme. Bursary recipients also presented Mr Soo with a token of appreciation on behalf of SIT.\nMs Lynn Chua, a first year student from\nthe Bachelor of Engineering (Honours) in Pharmaceutical Engineering who received the bursary, said the appreciation lunch was “an eye-opening experience”. “I was glad to be able to meet my donor face to face and express my heartfelt gratitude to him. I will continue to work hard for my studies so as not to disappoint him.”"
}