{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Touching%20the%20Lives%20of%20SITizens%20in%20Need.pdf",
  "type": "pdf",
  "content": "Thanks to the Lions Community Service Foundation (LCSF), there is a new\nbursary at SIT to help financially disadvantaged Singaporean students\nfrom any degree programme. Three Lions Community Service Foundation\nBursaries will be awarded annually.\nLCSF’s support for SIT began in 2014 with the Lions Community Service\nFoundation Emergency Grants. These provide financial assistance for\nstudents to continue their education when faced with loss or reduction of\nhousehold income because of unforeseen circumstances. Ten students have\nbenefited so far and last December, the Foundation renewed its funding for\nthe Emergency Grants.SiTIZEN  |  04/12\nNew Bursary for SIT Students\nMade possible by Lions Community Service Foundation, it will support\nthree undergraduates annuallyThe Singapore Institute of Technology (SIT) welcomed some special visitors to\nits SIT@Dover campus on 16 February 2017. The board members of The Silent\nFoundation, including its Founder & Executive Chairman, Mr Teng Ngiek Lian,\nheld a meeting on campus before they were hosted to lunch by Prof Tan Thiam\nSoon, President, SIT. Also attending the appreciation lunch were recipients of\nthe Silent Minority Compassionate Bursary, as well as SIT faculty and staff.\nFor the Foundation’s board members, this was their first visit to SIT since they\nbegan supporting SIT students with a term gift of $30,000 in 2015. This first gift\nfrom the Foundation allowed SIT to award six Silent Minority Compassionate\nBursaries to minority students in need of financial assistance.\nMore recently, in August 2016, the Foundation decided to render permanent\nits philanthropic commitment to deserving SITizens. It gave the University an\nendowed gift of $200,000 to make possible a new bursary – called the Silent\nMinority Bursary – for minority Singaporean undergraduates in times of need.\nThanks to this gift, at least three bursaries will be awarded annually from\nAY2019/20,  when the fund reaches steady state.\nThe Silent Foundation was founded in 2010 by Mr Teng who felt that he\nhad benefited tremendously from society all these years. The Foundation is\ndedicated to assisting the ‘silent sufferers’ – those who have been overlooked\nby society and tend to be voiceless.Board members from The Silent Foundation with their bursary recipients as well as SIT faculty and staff.\n(From left) Vice-Chairman Anthony Tay and Chairman\nEric Ng of Lions Community Service Foundation, and\nMs Joan Toh of SIT’s Advancement & Alumni Division.\nBursary recipient, Mr Muhammad Muhaimin bin Othman (right)\nthanking Mr Teng Ngiek Lian. He was grateful for the help he\nreceived, saying that there is “someone out there who wants me\nto succeed.”\nTouching the Lives\nof SITizens in need\nBoard members of The Silent Foundation met with recipients\nof the Silent Minority Compassionate Bursary during a lunch\nreception at the SIT@Dover campusMs Nurul Atiqa binte Mohd Tahir, a bursary\nrecipient and final year student from\nthe Bachelor of Science (Hons) in Nursing\nPractice degree programme (The University\nof Manchester) was initially nervous to meet\nMr Teng and the board members from the\nFoundation. She was pleasantly surprised to find\nout how approachable Mr Teng is. She said,\n“He shared with us about how he did not come\nfrom a well-off family and that he had gone\nthrough hardship to get to where he is today.”\nSeated next to Mr Teng at the lunch, she also\nreceived an important life lesson from him. “I\nlearnt that one should be humble no matter\nwhere you are in life,” she added.\n“We hope to be able to help as many deserving students as we can, in their journey and aspiration to complete their\nuniversity studies,” said Mr Eric Ng, Chairman, Lions Community Service Foundation.\nLCSF was formally registered as a charity in 2003 and is the leading source of philanthropic giving for humanitarian\nservices conducted in Singapore using funds raised by the Lions Clubs. Its current Institute of Public Character (IPC)\nstatus enables it to support the relief work and community service projects and activities carried out by the Lions Clubs in\nSingapore. These include bursaries and study awards to deserving and needy students, financial assistance to destitute\nindividuals or families, non-governmental voluntary organisations in need of funding for specific projects or recurring\nprogrammes, and administering of funds raised by Lions Clubs.Prof Tan Thiam Soon, President, SIT (left), gives a small memento\nto Mr Teng Ngiek Lian, Founder & Executive Chairman, The\nSilent Foundation."
}