{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-10/SLT2204%20Stuttering%20Leaflet-231024.pdf",
  "type": "pdf",
  "content": "A Guide for Medical Professionals\nROLE OF SPEECH THERAPISTS\nSpeech therapists play a vital role in supporting children\nwho stutter. They assess and diagnose stuttering. Once a\ndiagnosis is made, speech therapists work with parents\nand children who stutter to manage their stuttering,\nbuild confidence and improve communication.\nInterventions are tailored to the child’s specific needs\nand aligned with the family’s goals.\nAdditionally, speech therapists provide information\ncounselling and caregiver training to families, offering\nguidance on how to improve family communication and\ncreate a more supportive communication environment at\nhome. Lastly, they collaborate with teachers to foster a\nnurturing atmosphere in school and may refer the family\nto other professionals if additional support is needed.\nOnslow, M. (2024). Stuttering and its treatment: Twelve lectures. 1.\nOnslow, M., & O’Brian, S. (2012). Management of childhood stuttering.\nPediatric Child Health, 49(2), 112-115.2.\nLim, V. P. C., Onslow, M., Yiong, H. C., & Lincoln, M. (2008). Stuttering in\nEnglish-Mandarin bilingual speakers: The influence of language\ndominance on stuttering severity. Journal of Speech, Language, and\nHearing Research, 51(6), 1522–1537. 3.\nSmith, A., & Weber, C. (2017). How stuttering develops: The\nmultifactorial dynamic pathways theory. Journal of Speech, Language,\nand Hearing Research, 60(9), 2483-2505. 4.\nReilly, S., Onslow, M., Packman, A., Cini, E., Conway, L., Ukoumunne, O.\nC., Bavin, E.L., Prior, M., Eadie, P., Block, S., & Wake, M. (2013). Natural\nhistory of stuttering to 4 years of age: A prospective community-based\nstudy. Pediatrics, 132(3), 460-7. 5.\nBloodstein, O., Ratner, N., B., & Brundage, S. B. (2021). A handbook on\nstuttering (7th ed.). Plural Publishing, Inc.6.\nCreated by SIT SLT AY22 Students: Aisyah Bte Sulaiman, Alisa Ng Jie Yi, Lee\nJia En, Mardiah binte Zahrin, Ng Min Hooi Nathaniel, Nur Rizwana Binti\nMohamed Yunus, Sim En Qi & Sitti Haajar Bte Hasnan\nReviewed by: Dr Valerie Lim (SIT) and Dr Susan Block (La Trobe University)\nDesign created using Canva.   2\n31\n1\nStuttering typically emerges between 2-5 years of age, when\na child’s language abilities are still developing and may not\nkeep up with what they want to express. The onset of\nstuttering may be sudden or gradual, with stuttering severity\nvarying from day to day depending on the speaking situation\nand environment. WHAT IS STUTTERING?\nCHARACTERISTICSCAUSESDevelopmental stuttering is a motor speech processing\ndisorder affecting the rhythm and flow of speech.\nIndividuals who stutter know exactly what they want to say\nbut struggle to get their words out. About 1 in 100 of the\npopulation stutters. In children, stuttering is relatively\ncommon, with approximately 1 in 20 beginning to stutter in\nthe preschool years.\nStuttering in Bilinguals\nIn bilinguals, stuttering will present in all the languages a\nchild speaks. In most cases, stuttering may be more\npronounced in the less dominant language because\nindividuals will have more difficulties expressing their\nthoughts and communicating in a language that they are\nless proficient in.\nThe exact cause of stuttering is currently unknown and\nlikely to be multifactorial. Research has shown that\nstuttering is related to a deficit in neural speech processing\nand has a genetic link. About 6 to 7 in 10 children who\nstutter have a family history of stuttering.\nStuttering is not caused by low IQ, or psychological or\nemotional issues.\nStuttering can be characterised by the following\nbehaviours :\n1) Repetition of sounds, syllables, phrases of words\n“I w-w-want noodles for-for-for dinner.”\n2) Prolongations or stretching out of sounds\n“MMMMummy, where’s my bag?”\n3) Blocks or getting stuck on words, where there is\nan inappropriate or awkward pause\n“This is ... my toy.” 1WHAT IS STUTTERING?\n4\nStuttering is most remediable within the first 6 years of life.\nResearch indicates that children who receive intervention\nduring the preschool years are 7.7 times more likely to recover\nfrom stuttering. These can be accompanied by secondary behaviors such as\ninterjections (“It um looks um like um this but um um bigger.”)\nand/or facial movements (e.g., eye blinking and jaw jerking).\nStuttering vs. Normal Dysfluencies\nSPONTANEOUS RECOVERY\nIMPACT OF STUTTERING\nResearch has shown that stuttering can have a socio-emotional\nimpact on children who stutter. They may be teased, bullied,\nor ignored by peers because of stuttering. As a result of such\nnegative communication experiences, children who stutter may\ndevelop social anxiety, low self-esteem, and avoid speaking\nsituations in which they are more likely to stutter, for example,\nspeaking in front of large groups of people. In such cases, it\nmay affect their overall academic and vocational\nachievements, and have lifelong impact if stuttering persists\ninto adulthood.\nClinicians should NOT adopt a ‘wait and see’ approach.\nChildren who present with stuttering behaviours should be\nidentified and referred to a Speech Therapist as early as\npossible! This is so that they can receive the support they\nrequire to help their stuttering and wellbeing. IMPORTANCE OF TREATMENTWhen children are learning to put their words together, it is\ncommon for them to repeat or revise their words and\nsentences when speaking. However, children who stutter will\ntypically display different types of disfluencies (as described\nabove), and may show more tension or struggle when speaking.\nAbout 6 to 7 in 10 children who stutter can recover\nspontaneously. However, it is difficult to predict who will and\nwill not recover. Factors that increase the risk of stuttering\npersistence include :\nBeing male\nStuttering for more than 12 months\nHaving a family member who is still stuttering.5\n6\n21Developmental Stuttering\n– A Guide for Medical Professionals –"
}