{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/digital_newsroom_uploads/20220818lhzb-dreambigstartsmall-investinginthefutureoffood.pdf",
  "type": "pdf",
  "content": "立足当下积极创新　打造未来食品趋势\n新加坡人热爱美食，因此本\n地食品制造业发展蓬勃，生产饮料、糕点、乳制品、零食等的企业就有1000多家。除了供应本地市场，这些食品也出口到世界各地。例如，第一家食品厂公司的Spri\nng Home冷冻食品和Cocoba公\n司的Irvins薯片，远至美国，近至菲律宾都能买到。　　近年来， 我国致力于推动创新， 包括替代蛋白质等新颖食品，成 为 亚 洲 的“ 食 品 硅 谷 ”。 举 个 例子，新加坡在2020年成为全球首个批准售卖培植鸡肉的国家 。\n推动创新迎合消费者需求\n到2030年，亚洲消费者在食品方面的支出预计将增加逾一倍，从4万亿美元增至超过8万亿美元。这将为食品制造商带来振奋人心的新机遇。　　然而，在这个竞争极为激烈的行业里，各企业必须积极迎合消费者日新月异的需求。　　例如，目前的冠病疫情让消费者更重视方便、健康又美味，而且更可持续的食品。　　亚洲与世界各地也面临人口老龄化问题，这意味着市场对适合年长者的营养食品需求与日俱增。　　因此，企业必须开拓创新，以满足消费者不断演变的需求且把握增长机遇，同时在海内外开拓利基市场。　　这可以是推出新产品迎合不同的消费者，或创造产品特色，从竞争者中脱颖而出。　　许多中小企业可能因创新所需的成本和专业知识，而认为开拓创新艰巨复杂。这种想法是可以理解的。　　有些企业面对收入减少， 必须 节 省 开 支 ，不 得 不 打 消 投 入 资 金开 发 新 产 品 的 念 头 ；有 些 企 业 则认为只有大企业才有能力创新。　　然而，近期能源成本和原材料价格上涨，导致竞争激烈、利润收紧，因此企业更应抓紧机遇，及早开拓利基市场。\n利用共享设施推出新产品\n政府已投入资源，协助食品企业应对设施匮乏和设备昂贵的问题。例如，新加坡企业发展局在2018年推出跨机构倡议“食新计划”（FoodInnovate），协助食品企业创新及把产品推出市场。　　食品企业通过这项计划共享设施、 掌握创新能力及接触广泛的合 作 伙 伴 网 络 。迄 今，计 划 已 协 助企业把近400种新产品推出市场。　　例如，瑞兴西饼店（Swee Heng Bakery）推出的低升糖指数班兰戚风蛋糕，就是通过“食新计划”与食品科技公司Alchemy Foodtech联合开发的产品之一。　　今年4月，企发局与裕廊集团和新加坡理工大学合作，在圣诺哥裕廊集团食品中心设立食品厂（FoodPlant）。这个小批量食品生产共享设施让企业无须投入高额成本就能租用厂房和各种先进设备，进而节省运营成本。　　例如，企业能通过食品厂内的双螺杆挤压机利用高水分挤压技术，生产植物肉产品，以吸引新客群。　　那些想要出口或生产耐储存产品的企业，也可以通过杀菌机等新技术，延长或提升产品的保质期。本地餐馆潮州鱼汤（Fish Soup Paradise）将自家汤品装袋密封后，再通过高温杀菌技术，将产品保质期从冷冻储存三个月，延长至室温储存六个月。　　那些需要专业咨询的企业， 也可向食品厂的顾问了解未来食品、年长者营养品及先进食品加工等新兴领域的相关信息与建议。\n小批量生产测试新产品\n中小企业面临的另一个共同挑战，是难以展开概念验证及研发与创新的漫长酝酿期。许多中小企业也无法找到合适的收费制造商与它们合作进行试点测试。　　食品厂让企业通过小批量生产，测试新产品的可行性。这样一来，中小企业可小批量研发新产品，而无须满足收费制造商一般要求的最低订购量。　　食品厂获得新加坡食品局的许可，这意味着厂内所生产的食品可市售。中小企业可在研发新产品后，迅速展开市场调查，才进行全面生产。这有助企业以最低的成本测试新产品。\n与海外伙伴合作推动创新\n合作是推动创新的要素。中小企业可与合适的海外伙伴合作，增强它们的专长、知识和网络，以取得更好的成果。　　例如，自2019年起，企发局与莫纳什大学的食品创新中心合作，协助食品制造商开发新产品，或把产品本地化，以迎合澳大利亚消费者的需求。　　生产少糖甚至无糖较健康巧克力的中小企业Chocoworks，通过这项合作搜集澳大利亚消费者对其产品的反馈。Chocoworks打算把这些反馈应用在未来的产品开发，更好地满足澳大利亚的市场需求。　　新加坡理工大学与食品厂也与新西兰政府支持的试点规模食品加工设施Foodbowl合作，以加强共享设施的食品创新与生产能力。食品厂与Foodbowl将寻求合作机会，以开发新技术，提升食品生产流程，实现可持续发展的目标。　　此外，合适的人才也是推动创新不可或缺的要素。我们鼓励企业着眼长期，投入人力资本。　　企业可从现有的课程中选择，协助员工提升技能。新加坡理工大学就提供使用食品厂内高科技设备的相关培训。例如，食品技术专业人员可参加首办的高水分挤压技术持续教育与培训课程，了解这项技术如何将植物蛋白质制成肉类替代品，以及学习操作双螺杆挤压机。　　为了进一步扩大这个领域的人才库，企发局与精深技能发展局和劳动力发展局密切合作，确认其他有助本地食品企业创新的新技能。我们将探讨开办培训课程或展开人才交流计划，以应对这些新需求。　　有了这些资源和协助，我们鼓励更多中小企业以开放的心态，迈出开拓创新的第一步。我们希望本地企业在海内外推出更多创新产品，促进新加坡成为亚洲领先的食品与营养品枢纽。\n林美吟博士是食品厂\n（FoodPlant）总裁\n郑佳佳是新加坡企业发展局\n食品制造业署长\n林美吟\n企业新知\n郑佳佳\nPublication: Lianhe Zaobao\nDate: 18 August 2022\nHeadline: Dream big, start small. Investing in\nthe future of food\nSource: Lianhe Zaobao © SPH Media Limited. Reproduced with permission."
}