{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/Recognition%20of%20Excellence%202016.pdf",
  "type": "pdf",
  "content": "SiTIZEN  |  06/12 SiTIZEN  |  07/12\nThe Singapore Institute of Technology’s (SIT) Recognition of Excellence\nwas held on 26 Oct 2016 at the Student Activities Centre at the SIT@Dover campus. Now in its second year, it is a special and important occasion on the SIT calendar to celebrate the achievements of SIT students and to recognise donors whose gifts support student excellence through scholarships and student performance awards.\nAt this year’s ceremony, 15 named scholarships were awarded to 35 students\nfrom various degree programmes offered at SIT. These non-bonded scholarships were presented along with 24 Book Prizes and three Outstanding Student Awards. All were made possible by generous donors.\nWelcoming the afternoon’s guests to the event, Prof Loh Han Tong, Deputy\nPresident (Academic) & Provost, SIT, noted the increase in the number of awards that were presented this year, thanks to support from SIT’s donors. He said, “These scholarships, prizes and awards to be presented today will spur our students on their journey to learn and to excel.”\nAn acoustic performance from Muzeka, SIT’s student\nband, jazzes up the afternoon.\nMr Sharil Reiza (left), who received the EnGro Scholarship and the Rotary Club of Bugis Junction Outstanding Student Award, and Ms Lim Pei Shan, recipient of the Kewalram Chanrai Group Scholarship, charmed the guests\nwith their heartfelt appreciation presentation.Scholarship recipients at the Recognition of Excellence together with SIT Senior Management.\nFor Ms Lim Pei Shan, who is enrolled in\nthe Hospitality Business programme at SIT, receiving the Kewalram Chanrai Group Scholarship has inspired even bigger dreams for her. The first-year undergraduate said, “This scholarship will not just help me financially – I can see now the possibility of my helping to shape the future of hospitality in Singapore, particularly the tourism industry, with lots of hard work.”\nThanking the donors for their\ntransformative philanthropy and “making the pivotal difference in the life-long journey to pursue excellence”, Prof Tan Thiam Soon, President, SIT, said, “Our donors have set an example for our students on how giving back can change the lives of others.”\nMore than 200 guests attended the\nceremony, including SIT’s donors and friends, SIT senior management, faculty and staff, as well as representatives from SIT’s Overseas University partners. Of course, the stars of the evening were the award and scholarship recipients, who had loved ones by their side to join in the happy occasion. (From right) Scholarship recipients, Mr Chew Kia Yong\nand Ms Neo Belinda sharing mementos with their\nfriends and loved ones.\n(From left) Mr Chan Wing Leong, Deputy President\n(Administration) & Chief Financial Officer, SIT, and Prof Loh Han Tong, Deputy President (Academic) & Provost, SIT, greet donors, Dr Reto Callegari, Club Treasurer/\nPast President, and Mr Alex Eow, Past President, from\nthe Rotary Club of Bugis Junction.\nScholarship recipients and award winners such as Mr Eu Jun Wei (left), a Sembcorp Marine Book Prize\nrecipient, received their certificates from Prof Tan\nThiam Soon, President, SIT.In its second year, the Recognition of Excellence was held\nat the Student Activities Centre at SIT@Dover campus. Mr Pang Yao Yi (second from right), recipient of the Wilmar Scholarship, gets a photo op with Prof Tan Thiam Soon, President, SIT (second from left), flanked by his proud parents.\nMr Tan Cheng Gay, Chairman & Chief Executive Officer, EnGro Corporation (middle), speaking to the recipients\nof the EnGro Scholarship at the reception.Soul Extreme, SIT’s very own hiphop group, giving the\nafternoon’s programme an energetic opening.\nTime for thanks and celebration – Mr Kevin Liang, CEO, EPS Computer Systems Pte Ltd (right) pictured\nhere with Mr Tan Dong Xiang, recipient of the EPS\nComputer Systems Scholarship.\n24 Book Prizes and 3 Outstanding Student Awards were presented at SIT’s\nsecond Recognition of Excellence, a special reception to celebrate student achievement and the philanthropic support to nurture student excellence;\n15 non-bonded scholarships were also awarded to 35 recipientsRecognition of Excellence…\nand Supportive Donors"
}