{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2023-09/AR2023-Applied-Research.pdf",
  "type": "pdf",
  "content": "Applied Research\nGrowing applied research is key to strengthening SIT’s applied learning. Focusing on translational\nresearch and innovation, we aspire for research outcomes that demonstrate application pathways\nwhich will drive industry transformation and train talent for industry.\nSince ramping up research in 2020, SIT inked close to 150 applied research-related agreements\nwith industry partners to work on research and innovation projects. SIT’s external grants and\nindustry contributions have grown by 4.0 and 3.9 times respectively, from FY2020 to FY2022.\nCommunity Health\nTransformationSustainable\nFood InnovationSustainable\nInfrastructure\nEngineering &\nMaintenanceSustainable\nMaritime\nEngineeringEnergy\nResilience\nTECH ENABLERS\nArtificial Intelligence, Cybersecurity, Augmented/Virtual Reality,\n5G/6G & Future Communications, Robotics and Autonomous SystemsTRANSLATIONAL RESEARCH AND INNOVATION FOCUS\nSIT’s research focuses on 5 domain areas, with Sustainable Maritime Engineering identified as a new domain focus\nin our translational research strategy in FY2022. As we prepare to relocate to our new campus in Punggol, which\nis situated in a digital and coastal district, we look forward to growing our thought leadership in these domains,\nworking with industry partners and leveraging our Living Labs.\nSTRATEGIC TRANSLATIONAL RESEARCH PROGRAMMES AND ENABLERS\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202322\nAPPLIED RESEARCH PROJECTS: KEY HIGHLIGHTS\nIn FY2022, some of our applied research outputs have been adopted by and delivered impact to industry partners.\nDEVELOPING SUSTAINABLE AND SMART\nTECHNOLOGIES FOR SHIPS AND SYSTEMS\nOver the last 3 years, SIT secured $1.5 million in applied\nresearch grants in maritime engineering. Projects included\n(i) digital twinning of electrical harbourcraft for design\nenhancements with Seatech and the Technology Centre\nfor Offshore and Marine, Singapore, as well as (ii) data-\ndriven AI models for estimating ships’ carbon emissions\nwith Wärtsilä and the National University of Singapore.\nPrevious collaborations with PSA Marine and Penguin\nInternational supported maritime sustainability, notably\nwith Greenhouse Gases (GHG) emissions mapping.\nSTRENGTHENING SINGAPORE’S R&D EFFORTS IN\nSUSTAINABLE MARITIME ENGINEERING\nFaculty members from SIT’s Naval Architecture and\nMarine Engineering programme onboard Penguin Tenaga,\nSingapore’s first hybrid-powered vessel.\nDRIVING SUSTAINABLE FOOD INNOVATION\nFoodPlant, a shared food production facility jointly set up by Enterprise Singapore, JTC Corporation and SIT,\nwas officially launched in April 2022 to support innovation in the food manufacturing industry. The facility is\nlicensed by the Singapore Food Agency and equipped with state-of-the-art food processing technologies,\nfeaturing 12 specialised rooms for small-batch food production.\nAs of March 2023, close to 30 companies comprising both MNCs and SMEs have benefitted from this facility,\nproducing more than 100 prototypes, of which 7 have been commercialised. FoodPlant helped a local company,\nFish Soup Paradise, to develop new shelf-stable soup pouches, which could be stored at ambient temperatures\nand ready to be heated up for consumption. To date, Fish Soup Paradise has sold more than 10,000 packs of\nsoup and is building its own food facility to scale production. Another beneficiary of FoodPlant is Sustyfoods,\na direct-to-consumer brand selling healthy, calorie-controlled food products online, which used to outsource\ntheir production. By partnering with FoodPlant, they were able to lower their costs of production by about\n30% and catalyse their own food manufacturing business. Other companies which have developed commercial\nproducts through FoodPlant’s support are Agrocorp International, WellSpent and Green Capsule.\nFoodPlant has conducted 4 customised training courses in collaboration with Workforce Singapore for\n6 companies, as well as another 3 customised training courses to help Singapore food companies adopt\nadvanced food processing technologies.\nADVANCING FOOD INNOVATION\nCommercialised products from FoodPlant. (Photos are sourced from the respective companies)23\nAPPLIED RESEARCH\nIMPROVING PRODUCTIVITY IN THE\nCONSTRUCTION SECTOR\nThe Construction Technology Innovation Laboratory\n(CTIL) serves as a platform for the development of\ninnovative construction technologies to enhance the\nproductivity of the Singapore construction sector. In\nFY2022, CTIL successfully obtained $1.47 million for 3\nresearch projects working with 4 industry partners. CTIL\nalso developed 2 patents during this period.\nSTRENGTHENING SINGAPORE’S\nTUNNELLING AND INFRASTRUCTURE\nDEVELOPMENT CAPABILITIES\nThe Centre for Infrastructure and Tunnel Engineering\n(CITE) was established in collaboration with the Land\nTransport Authority (LTA). The centre focuses on projects\nto enhance productivity and safety throughout the\nlifecycle of infrastructure and tunnels, including design,\nconstruction, operation and maintenance. CITE also plays\na vital role in upskilling civil engineers in these domains.ENHANCING SUSTAINABLE INFRASTRUCTURE\nENGINEERING AND MAINTENANCE\nAn example of an ongoing project is the development\nof high-performance pre-engineered steel concrete\ncomposite beams that offer several advantages over\ntraditional concrete flooring systems, including cost-\neffectiveness, reduced weight and lower embodied\ncarbon emissions. The industry partner is currently\nconducting trials to assess the technology’s feasibility\nand effectiveness.CITE worked with LTA on a project that focuses on\nconcrete reinforcement with steel fibres to make tunnels\nsafer, save man hours and minimise corrosion from water\nseepage. These fibres greatly increase the durability\nof concrete and prevent cracking, which is particularly\ncrucial for transport tunnels such as MRT lines, where\nthe availability of limited operational downtime restricts\nrepair opportunities. CITE provided material tests, design\nreviews, as well as scaled model tests.CITE staff and students conducting lab test for the Fibre Concrete project.\nDevelopment of high-performance pre-engineered steel\nconcrete composite beams by CTIL. (Photo: Prof. Yang Bo,\nChongqing University, China)\nChart comparing embodied carbon emissions volume from\nhigh-performance beam to other conventional beams.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202324\nHELPING COMPANIES TACKLE ENERGY\nCHALLENGES\nThe Energy Efficiency Technology Centre (EETC), a\ncollaboration between SIT and the National Environment\nAgency (NEA), supported more than 25 SMEs to conduct\nenergy sustainability assessments to identify opportunities\nthat can reduce energy-related costs, pollution and\ngreenhouse gas emissions. These initiatives under Phase\n1 will help the SMEs catalyse substantial energy savings\nof up to 12 million kWh (equivalent to about $1.6 million\nin electricity bill savings) and annual carbon abatement of\nup to 4.5 million kgCO2e upon implementation of these\nenergy conservation strategies.\nEETC will train a pipeline of SIT engineering undergraduates\nand upskill existing energy efficiency practitioners in the\nfield. As of FY2022, 70 students have completed their\nattachment in EETC and worked under the supervision\nof Singapore Certified Energy Manager (SCEM)-qualified\nenergy specialists. These training initiatives will grow the\npipeline of talent in the industry.\nWith a recent second tranche of funding from NEA for\nPhase 2, EETC will broaden its impact by establishing a\nspecialised training facility to conduct a hands-on training\nmodule for the SCEM course to support more SMEs ENHANCING ENERGY RESILIENCE\nin developing and upskilling these capabilities in their\nemployees. EETC will also leverage the SIT Punggol\nCampus as a testbed to unlock new opportunities to\ncatalyse applied research projects.\nDRIVING INDUSTRY INNOVATION\nTHROUGH INNOHUB\nInnoHub comprises 4 interconnected innovation centres,\nnamely Design Factory@SIT (DF@SIT), National Additive\nManufacturing Innovation Cluster (NAMIC Hub@\nSIT), Rapid Product Innovation and Development\n(RaPID) Centre, and SIT-Poly Innovation Centre of\nExcellence (SPICE). These centres work synergistically\nto drive innovation and contribute to the development\nof innovative solutions for industry.As of 31 March 2023, InnoHub and its innovation\ncentres have secured nearly $6 million in external\nfunding to set up the innovation infrastructure and\nto support their manpower resources. More than 600\nstudents and Professional Officers actively participated\nin various innovation projects and activities, successfully\ndeveloping 25 innovation projects in collaboration\nwith industry.Training of talent pipeline for the industry.\nTeam members from Innohub and the 4 innovation centres.\n25\nAPPLIED RESEARCH\nPOLLEN-BASED HYDROGEL FILM\nTO PREVENT POST-SURGERY\nCOMPLICATIONS\nA/Prof Cheow Wean Sin from the Food, Chemical and\nBiotechnology Cluster teamed up with local startup\nSporogenics, to develop a fully biodegradable and\nbiocompatible pollen-based hydrogel film to prevent\npost-surgery complications. The hydrogel film acts\nas a membrane barrier against peritoneal adhesion\nand releases a treatment drug at the adhesion site.\nThe prototypes are undergoing clinical trials, and\nSporogenics hopes to introduce hydrogel film to the\nglobal market by 2026.\nA/Prof Cheow Wean Sin developed a hydrogel film that can\nprevent post-surgery complications.CONTRIBUTING TO COMMUNITY\nHEALTH TRANSFORMATION\n(Left) Design for Additive Manufacturing (DfAM) enhanced passive heat sink and the different generated design computational\nresults, a project by NAMIC Hub@SIT.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202326\nCOVID-19 WASTEWATER-BASED\nEPIDEMIOLOGY\nAsst Prof Elisa Ang from the Engineering Cluster\ncollaborated with the Home Team Science and Technology\nAgency (HTX) to develop a robust predictive algorithm\nthat can estimate the prevalence of symptomatic and asymptomatic COVID-19 infection based on measurable\ndata obtained through wastewater monitoring. The\ndeveloped algorithm can take the measured RNA copies\nin wastewater and estimate the prevalence of COVID-19\ninfection. The algorithm can also be utilised for disease\nmonitoring or other applications that require wastewater-\nbased surveillance such as drug detection.\nUNDERSTANDING BEHAVIOURAL MAP\nTO ASSESS QUALITY OF PHYSICAL\nACTIVITY IN STROKE SURVIVORS\nA behavioural map to assess the quality of physical\nactivity in residential stroke survivors across different\ninstitutional settings in Singapore was developed by a\nHealth and Social Science faculty, Asst Prof Choo Pei Ling\nand her team. The behavioural map was validated across\n4 community hospitals and nursing homes to capture a\nmyriad of rehabilitation settings. 11 SIT physiotherapy\nstudents were trained in a real-life healthcare setting and\nemployed by hospitals and polyclinics upon graduation.COVID-19\nwastewater-based\nepidemiology\nwith predictive\nalgorithm.\nMOTIVATE: A MULTI-MODAL TRAINING\nPROGRAMME TO PROMOTE PHYSICAL\nACTIVITY AFTER STROKE\nThe MOTIVATE project, funded by SIT’s Ignition Grant\nand in collaboration with the Singapore National Stroke\nAssociation, developed a multimodal training programme\nto promote physical activity (PA) after stroke in Singapore. A/Prof Kwah Li Khim from the Health and Social Science\nCluster led this initiative, which has since secured a\nSingHealth research grant to test the programme’s\neffectiveness through a randomised controlled trial. This\nproject could potentially lead to the development of an\naffordable and scalable programme that will offer stroke\npatients the same PA opportunities as the able-bodied\npopulation in Singapore.\nLed and facilitated by A/Prof Kwah Li Khim from SIT and A/Prof Shamala Thilarajah from SGH, a workshop was held with stroke\nsurvivors and caregivers from Singapore National Stroke Association to refine the physical activity programme. (Photo: diFilm Pixel\nworks/James Chung)\nAn SIT physiotherapy student assisting a residential participant\nin Ang Mo Kio-Thye Hua Kwan Hospital to put on the\naccelerometer/activity tracker.27\nAPPLIED RESEARCH\nDEVELOPING FIRST-OF-ITS-KIND\nCURATED AUGMENTED REALITY TRAIL\nIN THE HEARTLAND\nSupported by SIT’s Ignition Grant, Prof Lim Boon Huat\nfrom the Business, Communication and Design Cluster\ncollaborated with the South West Community Development\nCouncil, Corporate Alliance for Good Ltd, LDR Technology\nPte Ltd and SG Digital Office to launch the Heartland\nGems @ South West Augmented Reality Trail on\n2 July 2022. This initiative aims to encourage residents\nto appreciate the rich history, culture and heritage of the\nheartlands and learn new digital skills in support of the\nDigital for Life movement. SIT students were involved in\nthe development of the user experience concept and\ndigital content for the trail, as well as the design of a\nheritage logo embedded with a QR code.ADVANCING INFOCOMM\nTECHNOLOGY ADOPTION\nSouth West District Mayor Low Yen Ling (right), with SIT faculty and students at the launch of the Heartland Gems @ South West\nAugmented Reality (AR) Trail on 2 July 2022. (Photo: South West Community Development Council)\nReal-time Risk Assessment Cooperative Mode (ReRAC).\nMobile Camera Acquisition System (MoCAS).ENHANCING ROAD SAFETY THROUGH A\nREAL-TIME RISK ASSESSMENT SYSTEM\nThis 4-party collaborative project is supported by the\nNational Research Foundation, Singapore, and the LTA\nunder its Urban Mobility Grand Challenge Programme, and\nled by Senior Lecturer Dan Chia (Infocomm Technology)\nin partnership with MooVita, Strides Frontiers and the\nUniversity of Glasgow, Singapore. The team developed a\nreal-time risk assessment methodology and created a novel\nSpatial Temporal Risk Estimation Ensemble Technique\n(STREET) algorithm using deep learning embedded with a\nmodel-based risk tagging approach. The outcome product\nis a Mobile Camera Acquisition System (MoCAS) that\nperforms STREET risk tagging of the environment. Building\non this outcome, the team moved on to develop a novel\nReal-time Risk Assessment Cooperative Mode (ReRAC)\nsystem to alert drivers in advance of potentially hazardous\nevents at specific times and locations. The technology\nenables advance notice through Smart Infrastructure,\nincluding 5G communication and edge computing for\ndrivers to avoid risk. This Smart Infrastructure equipped\nwith the ReRAC will be deployed at 6 locations within\nNgee Ann Polytechnic.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202328\nIn addition to securing grants, our academic staff are also\nactively encouraged to leverage SIT’s Industrial Doctorate\nand Industrial Masters (ID/IM) programmes to grow their\nresearch capability through practice-oriented research\nwith industry partners. SIT’s ID/IM programmes have\ngarnered the participation of 21 companies.An example of a successful partnership is NVIDIA,\nwhich currently has 7 employees enrolled in our ID/\nIM programmes.TRAINING MANPOWER FOR INDUSTRY\nTHROUGH APPLIED RESEARCH\nCURRENT ENROLMENT (AS OF FY22)\nFY2020 Enrolment FY2021 Enrolment FY2022 Enrolment05101520253035\n2 261531\n258\n212\n114\n4\nM.Eng M.ClinRes D.Eng D.ClinRes TotalCURRENT ENROLMENT (AS OF FY2022)29\nAPPLIED RESEARCH"
}