{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2025-03/SIT%20Commitment%20to%20Sustainable%20Procurement__0.pdf",
  "type": "pdf",
  "content": "SIT’s Commitment to Sustainable Procurement\nOur Commitment\nSIT adopts  the GreenGov.SG  green procurement guidelines  and integra tes the principles of the  “4 Rs”\n- Reduce, Reuse, Responsible Sourcing  and Responsible Disposal  - into our procurement\nprocesses  where feasible . We strive  to make  more intentional purchase decisions  that support our\ncommitment towards ensuring a more sustainable future .\nReduce\nOne of the  most impactful strategies we employ is reducing unnecessary purchases. This approach not\nonly conserves resources  but is also align ed to  the first step of our procurement life  cycle - establishing\nthe need .\nTo avoid unnecessary purchases , we seek  to first evaluate our needs critically. Before any purchase is\nmade, we ask whether the item is essential and whether we can achieve our goals without procuring it.\nBy rigorously assessing the necessity of each potential purchase, we avoid acquiring items that may\nnot really be needed.\nReuse\nTo avoid unnecessary purchases , we promote  making the most of what we already have. This involves\nreusing items so as to extend their life cycle , working with suppliers to  maintain and repair equipment,\nre-purposing materials and finding innovative ways to extend the life of our assets. For example, instead\nof buying new furniture, we partner vendors to refurbish existing pieces, thus giving them a new lease\nof life and minimising  waste.\nFurthermore , we continu ally monitor our consumption and purchasing trends  and seek to  identify areas\nwhere we can reduce unnecessary purchases through  reusing  what we have .\nResponsible Sourcing\nWhere needs have been established and purchases deemed necessary, SIT practi ces responsible\nsourcing.  This means considering the environmental and social impact that we create  on the supply\nchain.\nSIT is committed to sourcing  for products that meet high environmental standards. We prioriti se items\nwith certification such as those pertaining to the Singapore Green Labelling Scheme (SGLS), Mandatory\nEnergy Labelling Scheme (MELS), ENERGY STAR and Forest Stewardship Council (FSC). For\ninstance, when purchasing equipment  such as  laptops , SIT opts for ENERGY STAR -rated devices,\nwhich are energy efficien t. This not only reduces energy consumption but also lowers operatin g costs.\nWhen evaluating high -value and high -footprint purchases, SIT aims to employ the Life Cycle Cost\nAnalysis (LCCA) and Total Cost of Ownership (TCO) method ology . These consider not just the initial\nacquisition cost but also the long -term expen diture  related to energy consumption, maintenance and\ndisposal.\nSIT also encourages suppliers to share  about  their sustainability credentials and practi ces. We look for\ncertification such as ISO 14001 for environmental management, ISO 45001 for occupational health and\nsafety and participation in the National Environment Agency’s (NEA) Producer Responsibility Scheme\n(PRS). By aligning our suppliers with our sustainability goals, we foster a more sustainable supply chain.\nResponsible Disposal\nTowards the end of a product’s life cycle when reus ing is not feasible, SIT encourages the engagement\nof responsible suppliers for proper recycling and/or waste treatment.  These companies can ensure that\nwaste is recycled, resold or  disposed of  in an environmentally friendly manner.\nThrough these sustainable procurement  initiatives, we aim  to reduce  our carbon footprint. By avoiding\nunnecessary purchases, sourcing responsibly, managing waste effectively and continu ally improving\nour procurement  practices, we can contribute towards making a significant positive impact  on\nsustainability ."
}