{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2024-10/3%20-%20Zero%20Trust%20Cybersecurity%20for%20Industry%20Control%20Systems.pdf",
  "type": "pdf",
  "content": "SIT Internal\nZero Trust Cybersecurity for Industry Control Systems\nIndustry Control System (ICS) environments often control critical infrastructure such as\nhealthcare, power plants, water treatment facilities, transportation systems, etc. The traditional\nperimeter -based security approach for ICS assumes devices and networ k traffic on the inside\nnetworks are generally trusted. However, there are three basic threat vectors for the network\nsettings.\n1) A user’s credentials may have been compromised and used in an attack to gain access to the\ninside network;\n2) A device may be compromised by installing a malware program. That compromised device\ncan then attack other devices on the internal network;\n3) A vulnerability can be exploited by adversaries, and that can negatively impact on the internal\nnetwork.\nZero trust security strategy “Never trust, always verify” changes ICS security from traditional\nperimeter -based security approaches to a more dynamic and adaptive model based on\ncontinuous verification and least privilege access. Zero trust replaces implic it trust with explicit\nand continuous monitoring and verification based on the risk factors and the threat landscape,\nregardless of user location or used device. Zero trust reduces the attack surface and minimises\nthe impact of breaches by enforcing strict  access controls and segmentation, making it more\ndifficult for attackers to move laterally within the network and access critical systems. Zero trust\ncybersecurity helps protect ICS systems from cyber threats by ensuring that only authorised\nusers and dev ices can access and manipulate them.\nIndustrial Doctorate students in SIT will conduct applied and impactful research with industry,\ne.g., A Zero Trust Healthcare Monitoring and Securing Framework to be adopted by hospitals to\nsecure remote monitoring and systems management of healthcare devi ces, systems and\nnetwork.\nSelected Publications:\n1. Huaqun Guo and Xingjie Yu. A Survey on Blockchain Technology and its security . Blockchain:\nResearch and Applications, Elsevier, Volume 3, Issue 2, June 2022. (Best Paper Award) Impact\nfactor: 6.9\n2. Eyasu Getahun Chekole, Sudipta Chattopadhyay, Martin Ochoa, Huaqun Guo, and Unnikrishnan\nCheramangalath. CIMA: Compiler -Enforced Resilience Against Memory Safety Attacks in Cyber -\nPhysical Systems . Computers & Security, Elsevier, Volume 94, July 2020. Impact factor: 5.6\n3. Luying Zhou, Huaqun Guo, and Gelei Deng. A fog computing based approach to DDoS mitigation\nin IIoT systems . Computers & Security - Journal, Elsevier, Vol. 85, pp. 51 -62, August 2019. Impact\nfactor: 5.6\n4. Dong Li, Huaqun Guo, Jianying Zhou, Luying Zhou, and Jun Wen Wong. SCADAWall: A CPI -\nEnabled Firewall Model for SCADA Security . Computers & Security Journal, Elsevier, Vol. 80, pp.\n134-154, January 2019. Impact factor: 5.6\n5. Huaqun Guo, Yongdong Wu, Feng Bao, Hongmei Chen and Maode Ma. UBAPV2G: A Unique\nBatch Authentication Protocol for Vehicle -to-Grid Communications . IEEE Transactions on Smart\nGrid, Vol. 2, No. 4, pp. 707 -714, December 2011. (No Impact factor in 2011. Now Impact Factor:\n8.6)"
}