{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2023-09/AR2023-President-Message.pdf",
  "type": "pdf",
  "content": "President’s Message\nIn 2022, we took in a record 3,121 new SITizens from\na pool of 13,000 applicants, a 5.7% increase over the\nprevious year. 88% of new SITizens were admitted to\ntheir first choice of degree programmes, a year-on-year\nincrease of 2%.\nWith the easing of pandemic restrictions, our freshmen\nwere welcomed in person at SIT@Dover for their First-\nYear Experience induction programmes. Our annual\ncareer networking event, Career Nexus, drew around\n2,000 SITizens and over 200 company representatives.\nAs part of our Overseas Immersion Programme, we also\nsupported more than 1,000 SITizens in the United States,\nEurope and Asia.\nWe continued to celebrate the achievements of\nour SITizens. More than 2,200 graduates from 47\nundergraduate and postgraduate programmes were\nconferred degree scrolls at SIT’s Graduation Ceremony\n2022. For his contributions to the growth of SIT, Dr Ng\nYat Chung, founding Chairman of SIT’s Board of Trustees,\nwas conferred the University’s first honorary degree.\nAt the same time, we have made our educational offerings\nmore accessible to needy undergraduate students. With\nstrong support from donors, we launched a new Forward\nSITizen initiative that allows eligible students to cover\n100% of their subsidised fees through a combination\nof government-funded public bursaries, donated\nscholarships and bursaries offered by SIT.\nBRIDGING LEARNING AND WORK\nA key focus of our pedagogy is helping students\nconnect what they learn with the workplace. In 2022,\nwe introduced new learning pathways that aim to\nbetter synthesise these elements into a holistic learning\nexperience, enhancing the competitiveness and future\nemployability of our students.\nWe introduced a new Term-In Term-Out structure for\n2 new undergraduate degree programmes — Applied\nComputing (Fintech specialisation) and Digital Supply\nChain. This pathway, which alternated between time\nspent in the classroom and time spent in the workplace, gave students regular opportunities to apply the skills\nand knowledge acquired in a real-world setting. Industry\npartners benefitted by being able to tap talent in areas of\nhigh demand. So far, 15 companies are working with us to\nhost our students during the term-out trimesters, including\nDBS, UOB, AIA, Prudential, YCH and ST Logistics.\nAnother major development was the full implementation\nof the Undergraduate Programme Structure (UPS), which\nformally incorporated interdisciplinary learning and\ntransferable skills components into SIT’s curricula. UPS\nprovides a formal structure for a holistic SIT education that\nprepares our students to be both career- and future-ready.\nFor example, the Social Innovation Project module has\nbeen included in all degree programmes from 2022. This\ngives students an opportunity to work in interdisciplinary\nteams to develop solutions for society in areas such as\nsustainability and caring for the elderly.\nSTRENGTHENING LIFELONG LEARNING\nIn the Continuing Education and Training space, we\ncontinued to partner with companies such as Applied\nMaterials, Rohde & Schwarz, Rotary Engineering and SMRT\nto upskill their employees and build new capabilities.\nIn response to the Ministry of Education’s focus on\nlifelong learning and the goal to raise the lifetime\ncohort participation rate to 60% by 2025, we launched\nSingapore’s first Competency-based Stackable Micro-\ncredentials (CSM) pathway. The pathway, recognising\nthe importance of schedule flexibility for in-employment\nlearners, is designed to be mainly delivered online. It\nsupports individuals seeking to pivot to new roles by\nacquiring specific skillsets, as well as those looking to\nacquire new degrees. The pathway is competency-based\nand will allow for the recognition of prior learning,\nwhether acquired through formal programmes or work\nexperience. In November 2022, we inked memoranda\nof understanding with telecommunications provider\nSingtel and technology services firm NCS to upskill\ntheir employees through CSM. We are on target to start\nwith 150 learners in 2023, partnering with polytechnics\nand industry in the development and delivery of micro-\ncredentials in the field of Applied Computing.2022 has proven to be fruitful. We sustained our strong pedagogical focus on applied learning\nand this is encapsulated in the annual report theme, “Deepening Applied Learning”. The theme\nreflects our commitment to being Singapore’s premier university of applied learning, and our efforts\nto continually find new ways to maximise the potential of our learners and to transform learning.\nSINGAPORE INSTITUTE OF TECHNOLOGY\nANNUAL REPORT 202306\nA key focus of our\npedagogy is helping\nstudents connect what\nthey learn with the\nworkplace. In 2022, we\nintroduced new learning\npathways that aim to\nbetter synthesise\nthese elements into\na holistic learning\nexperience,\nenhancing the\ncompetitiveness\nand future\nemployability of\nour students.GROWING APPLIED RESEARCH AND\nINDUSTRY COLLABORATIONS\nAs an applied learning university, we focus on translational\nresearch and innovation co-creation with industry. We\nofficially opened FoodPlant, Singapore’s first shared\nfacility for small-batch food production, in April 2022. We\nalso launched InnoHub, a one-stop centre where small\nand medium-sized enterprises can tap resources to help\nthem innovate and move up the innovation value chain.\nDuring the year, we also continued to attract competitive\nresearch grants to work with industry and deepen our\nresearch track record and capacity.\nDuring the year, our network of industry and public agency\npartnerships expanded with engagements with agri-food\nfirm Agrocorp, French energy and services company ENGIE,\nSingHealth and the National Council of Social Service,\namongst others. These partnerships are multifaceted in\nareas of continuing education, applied research and in\nproviding authentic learning experiences for our SITizens.\nNEW OPPORTUNITIES AT PUNGGOL\nCAMPUS\nWe expect to start the new academic year in 2024 in\nour new Punggol Campus — the first time that the SIT\nfamily will be under one roof. We are greatly anticipating\nthe move, and are particularly excited about the new\nopportunities that will come with it.\nIn 2022 we launched our Living Lab initiative in partnership\nwith Singapore Power (SP), SMRT, SingHealth and\nENGIE in the respective fields of energy, transport,\nhealthcare, and district cooling systems. Living Labs\nenhance the authenticity of our students’ learning and\nfacilitate impactful research. For instance, SP has pledged\nadditional funding for the multi-energy microgrid that\nwill power our Punggol Campus, providing learning and\nresearch opportunities in power engineering for both\nour students and academic staff.\nWith a shared space, we see an opportunity to turbocharge\nour community-building efforts, which have already begun\nin 2022. We strengthened and relaunched our Culture\nInduction Programme to enable employees to better\nunderstand our culture and their place in it. We also\nrefreshed our core values to incorporate sustainability, a\nkey priority for SIT. With this inclusion, our 6 core values\nare Purpose and Agility, Respect and Sustainability, and\nIntegrity and Excellence.\nMOVING FORWARD\nAs we embrace the future together, we remain committed\nto enhancing applied learning experiences, driving\ninnovation and preparing individuals for success in an ever-evolving world. The support from our stakeholders\nhas been instrumental thus far and will continue to be\ncritical to our future success.\nI look forward to an even better year ahead, in which SIT\nwill continue to distinguish itself as a premier university\nof applied learning.\nPROFESSOR CHUA\nKEE CHAING\nPresident07\nPRESIDENT’S MESSAGE"
}