{
  "url": "https://www.singaporetech.edu.sg/sites/default/files/2023-10/20231013_Business%20Times_Education%20-%20next%20frontier%20of%20Singapore-Indonesian%20cooperation.pdf",
  "type": "pdf",
  "content": "INDONESIA has much going for it at the moment. Its economy is on a\nsound footing, it has a growing middle class, and fiscally prudent policies\nhave enabled the government to invest heavily in infrastructure over the\npast decade.\nBut while its physical infrastructure has improved vastly , the same\ncannot be said about its soft infrastructure, in particular its human cap-\nital. While the populous country has a large labour pool, its talent pool is\nrelatively small. This is especially evident in the fast-growing digital sec-\ntor where, according to the country’s Ministry of Communications and\nInformatics, Indonesia has an annual shortfall of 600,000 digital talents.\nA recent survey by Google and Economist Impact found that around 60\nper cent of Indonesian employees consider digital skills the most impor-\ntant to acquire. If the future of Indonesia’s economy is digital, then In-\ndonesians are highly aware of the need to upgrade their digital skills.\nData from 2020 suggests that less than 1 per cent of the Indonesian\nworkforce possessed advanced digital skills that will fuel the country’s\ngrowth in the future.\nThe Google-Economist Impact report also noted that Indonesia’s dig-\nitally skilled workforce can contribute as much as US$303 billion (S$4 1 3\nbillion) by 2030, accounting for 1 6 per cent of its gross domestic product.\nThe numbers speak for themselves. The question that needs to be an-\nswered is – how does Indonesia upgrade its talent pool to meet the grow-\ning needs of the economy in the shortest time possible?\nThe answer may be found in a new initiative recently launched by Sin-\ngapore and Indonesia to foster greater collaboration between institutes\nof higher learning from both nations.\nWorking together\nThe RI-Singapore University Network will link Singapore’s six autono-\nmous universities with Indonesian varsities to collaborate on a wide\nrange of activities including research, postgraduate programmes, exec-\nutive education initiatives and student mobility projects.\nAs the rector of University of Indonesia, Professor Ari Kuncoro, noted,\nthat Singapore universities – including the Singapore Management Uni-\nversity (SMU) which last December established an Overseas Centre in Ja-\nkarta – can play a critical role in advancing Indonesia’s human capital de-\nvelopment.\nWhile the University of Indonesia has initiated collaboration with both\nlocal and foreign universities, he emphasised that even more important\nfor the university is collaborating with university partners in South-east\nAsia, including Singapore, to advance the world of education.\nDeveloping cross-border collaboration is thus high on the agenda of\nboth sides. In this regard, SMU has begun to explore and foster collab-\noration not only with Indonesian university partners but also with indus-\ntry players.\nBut going alone can be an uphill battle. So four Singapore universities –\nSMU, Singapore University of T echnology and Design (SUTD), Singapore\nUniversity of Social Sciences (SUSS), and the Singapore Institute of T ech-\nnology – teamed up to hold a “Study in Singapore” dialogue session in\nJakarta recently .\nThis was the first time Singapore universities have come together and\njudging from the response, more such collaborative initiatives may be in\nthe pipeline. During the session held at the SMU office in Jakarta, with\nparticipants including education counsellors and principals of both pri-\nvate and public schools, each university had an opportunity to outline\ntheir unique individual offerings.\nRanking fourth globally behind China, India and the United States in\nterms of size, Indonesia’s education system is both large and varied. It\nweaves between public and private systems and has both centralised and\ndecentralised governmental oversight. Navigating such a complex sys-\ntem can be daunting but there is growing openness by the Indonesian\nhigher education institutes to partner and collaborate with foreign uni-\nversities.\nIndonesia is expected to become the world’s seventh-largest economy\nby 2030, according to the McKinsey Global Institute. Its large youthful\nworkforce has the potential to be one of the country’s most powerful eco-\nnomic levers if it is adequately trained and skilled.\nSingapore’s highly advanced higher education institutes can participa-\nte in this huge growth opportunity by collaborating with their Indonesian\nuniversity partners, not just in terms of student exchanges but through\nthe development of joint programmes in areas such as data analytics,\nbusiness and finance, digital marketing, information systems, as well as\ngreen finance.\nThe two close neighbours have enjoyed a symbiotic relationship over\nmany decades in economics, business, investments, military and cultural\nexchanges. Education can be the next frontier for cooperation.\nThe writer is director of the Singapore Management University’s\nOverseas Centre JakartaEducation – next frontier\nof Singapore-Indonesian\ncooperation?\nBy Shoeb KagdaPublication: The Business Times\nDate: 13 Oct 2023\nHeadline: Education - next frontier of\nSingapore-Indonesian cooperation?\nSource: The Business Times © SPH Media Limited. Reproduced with permission."
}