{
  "url": "https://www.singaporetech.edu.sg/sitizen-ambassadors/faq",
  "title": "Frequently Asked Questions | SITizen Ambassadors",
  "meta": {
    "description": null,
    "keywords": null
  },
  "text_lines": [
    "Skip to main content",
    "Our Ambassadors",
    "About Us",
    "Gallery",
    "FAQ",
    "Login",
    "Frequently",
    "asked questions",
    "What will I gain from becoming a SITizen Ambassador?",
    "Through this programme, you will gain a deeper understanding of SIT’s history, mission, vision, values, and ecosystem. You will learn life skills that will benefit you outside of your academic journey, and even in your future careers.",
    "Being part of the programme will connect you with a network of peers, university staff, industry partners, and external stakeholders who are an integral part of SIT. If you would like more information about the benefits of being a SITizen Ambassador, look out for the email about the recruitment cycle in August!",
    "What is the application and selection process for becoming a SITizen Ambassador like?",
    "The process to become a SITizen Ambassador consists of two stages:",
    "Interested applicants must submit a personal statement, resume, corporate headshot, sample video, and staff/faculty testimonials (if any) online.",
    "Successful applicants will be called for a round of group interviews, conducted either in person or online.",
    "A significant amount of thought and deliberation goes into the decision-making and shortlisting of each SITizen Ambassador. Hence, the process does take a while. All applicants will be notified via email about the status of their applications.",
    "Which service track will I be assigned to as a SITizen Ambassador?",
    "All interested applicants will be asked to rank their choice of service tracks according to preference. The final assignment of service tracks will depend on various factors, including the number of vacancies available per service track, and the suitability of candidates. To find out more about the service tracks, click",
    "here",
    "(Login required).",
    "How will I be supported in my role as a SITizen Ambassador?",
    "A dedicated team of SIT Staff from Student Life Division will support and guide SITizen Ambassadors in the preparation and execution of their duties. Additionally, SIT Staff from the various service tracks will continue to provide supplementary support to the Ambassadors. Finally, to complement this, former Ambassadors will return to serve as mentors to current serving Ambassadors.",
    "What are the learning opportunities for a SITizen Ambassador?",
    "As SITizen Ambassadors, a wide array of learning opportunities will be made available to you. SITizen Ambassadors will represent SIT at various events, dialogues, and conferences. They will speak to potential students and share SIT’s merits with external parties and stakeholders. They will be able to learn by receiving guidance from staff of various divisions within SIT. SITizen Ambassadors will also work with the SIT student community to facilitate and coordinate various SIT flagship programmes. Finally, all SITizen Ambassadors will attend a robust Core Training programme to ensure that they are adequately prepared for their duties ahead.",
    "What are some topics that will be covered during the 2-day Core Training Programme?",
    "All SITizen Ambassadors will undergo a specially designed 2-day Core Training Programme. This robust and multifaceted programme will include a wide array of topics, including public speaking, emceeing, and networking skills. This intensive workshop will prepare SITizen Ambassadors with the basic skills to successfully begin their journey as SITizen Ambassadors. Additional training will be carried out periodically to supplement the core training.",
    "What are some examples of representation in which SITizen Ambassadors are involved in?",
    "SITizen Ambassadors are involved in receiving, engaging, and networking with various stakeholders at various events. Some examples include SIT Open House, outreach programmes, donor events, ceremonies, as well as ministerial and national-level events.",
    "Do I need prior leadership experience to become a SITizen Ambassador?",
    "No prior experience is required. The programme is suitable for SITizens who possess a strong belief in SIT’s cause, unwavering commitment, and a passion to serve.",
    "Can I join the SITizen Ambassador programme if I am a freshman?",
    "Yes. You will be provided with training on SIT's history, ecosystem, mission, as well as skills development. Each senior or freshman will create their own journey and lend their unique SIT Story to the University.",
    "What will I gain from being a SITizen Ambassador?",
    "Through this programme, SITizen Ambassadors will gain a deep understanding of SIT’s history, mission, vision, values, and ecosystem. SITizen Ambassadors will be given training in life skills that are applicable beyond students’ academic journey. These skill sets and experiences will serve them well in the workplace. The programme also exposes SITizen Ambassadors to a network of peers, staff, industry partners, and external stakeholders.",
    "What does being a SITizen Ambassador entail?",
    "SITizen Ambassadors are a cadre of students who are deeply passionate about SIT and embody the SITizen-DNA. The Ambassadors help to co-create the future of SIT as a reputable University of Applied Learning by representing SIT in a wide array of events",
    "and serving as strong advocates of SIT to their peers as well as members of the public by sharing their personal SIT experience.",
    "How long is the commitment period for SITizen Ambassadors?",
    "Once a SITizen, always a SITizen! SITizen Ambassadors will begin their service term after completing the core and",
    "specialised training. They may continue serving as Alumni Ambassadors even beyond graduation.",
    "When does the SITizen Ambassador recruitment cycle begin?",
    "The next recruitment cycle is scheduled for August 2023. Do visit the SITizen Ambassador booth during Club Fair 2023 for more information or look out for the Announcement EDM via your SIT email closer to the date.",
    "How do I get in touch with the SITizen Ambassadors?",
    "You may email us at SITizen.Ambassadors@singaporetech.edu.sg to find out more!",
    "Address",
    "1 Punggol Coast Road Singapore 828608",
    "tel",
    "+65 6592 1189",
    "fax",
    "+65 6592 1190",
    "Academic Policies",
    "Privacy Policy",
    "Safety and Health",
    "Terms of Use",
    "Whistleblowing",
    "Copyright © 2025 Singapore Institute of Technology. All Rights Reserved.",
    "var staticJsAssetsPath = window.location.origin + '/js/';",
    "{\"path\":{\"baseUrl\":\"\\/sitizen-ambassadors\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/4\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"ajaxPageState\":{\"libraries\":\"eJwrzizJrErNi0_MTUosLk5MyS8q1k_PyU9KzNEpriwuSc3VB4qnAgAuFw8x\",\"theme\":\"sitizen_ambassadors\",\"theme_token\":null},\"ajaxTrustedUrl\":[],\"user\":{\"uid\":0,\"permissionsHash\":\"7065913129c256d72ff1d3a6334596404d30f5943b772d21373b7096e6c79f73\"}}"
  ],
  "desc_divs": [],
  "article_texts": [],
  "links": [
    "https://www.singaporetech.edu.sg/sitizen-ambassadors/faq#main-content",
    "https://www.singaporetech.edu.sg/sitizen-ambassadors/",
    "https://www.singaporetech.edu.sg/sitizen-ambassadors/",
    "https://www.singaporetech.edu.sg/sitizen-ambassadors/our-ambassadors",
    "https://www.singaporetech.edu.sg/sitizen-ambassadors/about-us",
    "https://www.singaporetech.edu.sg/sitizen-ambassadors/gallery",
    "https://www.singaporetech.edu.sg/sitizen-ambassadors/faq",
    "https://www.singaporetech.edu.sg/sitizen-ambassadors/user/login",
    "https://sitsingaporetechedu.sharepoint.com/sites/Students/Pages/Student%20Life/SITIZEN-AMBASSADORS.aspx",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.youtube.com/user/SingaporeTech",
    "https://twitter.com/singaporetech",
    "https://www.linkedin.com/company/singapore-institute-of-technology",
    "https://www.singaporetech.edu.sg/policies/academic-policies",
    "https://www.singaporetech.edu.sg/policies/privacy-statement",
    "https://www.singaporetech.edu.sg/policies/safety-and-health-policy",
    "https://www.singaporetech.edu.sg/policies/terms-use",
    "https://www.singaporetech.edu.sg/policies/whistleblowing"
  ],
  "images": [
    "/sitizen-ambassadors/sites/sitizen-ambassadors/themes/custom/sitizen-ambassadors/logo.svg",
    "/sitizen-ambassadors/sites/sitizen-ambassadors/themes/custom/sitizen-ambassadors/logo.svg"
  ]
}