{
  "url": "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/upskilling-not-uphill-task",
  "title": "Upskilling is Not an Uphill Task | Singapore Institute of Technology",
  "meta": {
    "description": "Questions like “Am I too old?”, “Will I be able to keep up?” and “Can I afford it?” are often on the minds of adult learners when considering upskilling and upgrading. Robin Ngan, Director of the SITLEARN, tackles these questions and shares tips for how to make the most of one’s lifelong learning journey.",
    "keywords": null
  },
  "text_lines": [
    "Skip to main content",
    "Manage My Account",
    "Mega menu",
    "Courses",
    "Dropdown",
    "Goals",
    "Dropdown",
    "For Organisations",
    "Insights",
    "Resources",
    "Dropdown",
    "Connect With Us",
    "Dropdown",
    "Business, Communication and Design",
    "Accounting and Finance",
    "Business Management",
    "Design Innovation",
    "Leadership and Communication",
    "View All",
    "Arrow",
    "Dropdown",
    "Engineering",
    "Building Services",
    "Civil Engineering",
    "Electrical Engineering",
    "Power and Clean Energy",
    "View All",
    "Arrow",
    "Dropdown",
    "Food, Chemical and Biotechnology",
    "Chemical Engineering",
    "Process Engineering",
    "Process Safety",
    "View All",
    "Arrow",
    "Dropdown",
    "Health and Social Sciences",
    "Elder Health and Rehabilitation",
    "Health Sciences",
    "Occupational Therapy",
    "Social Sciences",
    "View All",
    "Arrow",
    "Dropdown",
    "Infocomm Technology",
    "AI and Machine Learning",
    "Cybersecurity",
    "Data Science and Analytics",
    "Internet of Things",
    "View All",
    "Arrow",
    "Dropdown",
    "Search for Courses",
    "Course Brochure",
    "Course Finder",
    "Arrow",
    "Dropdown",
    "Take a Course",
    "Business, Communication and Design",
    "Engineering",
    "Food, Chemical and Biotechnology",
    "Health and Social Sciences",
    "Infocomm Technology",
    "Explore Courses",
    "Arrow",
    "Dropdown",
    "Earn Stackable Certificates",
    "Competency-based Stackable Micro-credential (CSM) Pathways",
    "Arrow",
    "Modular Certification Pathways",
    "Arrow",
    "Dropdown",
    "Obtain a Professional Certification",
    "Browse Professional Exams and Preparatory Courses",
    "Arrow",
    "Dropdown",
    "Make a Career Transition",
    "SkillsFuture Career Transition Programme",
    "Arrow",
    "Dropdown",
    "Lead with Impact",
    "Executive Education",
    "Arrow",
    "Dropdown",
    "Attend an Event",
    "Discover Upcoming Events",
    "Arrow",
    "Dropdown",
    "For SITizens",
    "Learn for Life",
    "Arrow",
    "Dropdown",
    "Funding",
    "Available Funding",
    "Arrow",
    "Dropdown",
    "Need Help?",
    "FAQ",
    "Arrow",
    "Dropdown",
    "Who We Are",
    "About Us",
    "Arrow",
    "Dropdown",
    "Let’s Connect",
    "Getting to SIT",
    "Contact Us",
    "Join Our Mailing List",
    "Arrow",
    "Dropdown",
    "Business, Communication and Design",
    "Accounting and Finance",
    "Business Management",
    "Design Innovation",
    "Leadership and Communication",
    "View All",
    "Arrow",
    "Dropdown",
    "Engineering",
    "Building Services",
    "Civil Engineering",
    "Electrical Engineering",
    "Power and Clean Energy",
    "View All",
    "Arrow",
    "Dropdown",
    "Food, Chemical and Biotechnology",
    "Chemical Engineering",
    "Process Engineering",
    "Process Safety",
    "View All",
    "Arrow",
    "Dropdown",
    "Health and Social Sciences",
    "Elder Health and Rehabilitation",
    "Health Sciences",
    "Occupational Therapy",
    "Social Sciences",
    "View All",
    "Arrow",
    "Dropdown",
    "Infocomm Technology",
    "AI and Machine Learning",
    "Cybersecurity",
    "Data Science and Analytics",
    "Internet of Things",
    "View All",
    "Arrow",
    "Dropdown",
    "Search for Courses",
    "Course Brochure",
    "Course Finder",
    "Arrow",
    "Dropdown",
    "Take a Course",
    "Business, Communication and Design",
    "Engineering",
    "Food, Chemical and Biotechnology",
    "Health and Social Sciences",
    "Infocomm Technology",
    "Explore Courses",
    "Arrow",
    "Dropdown",
    "Earn Stackable Certificates",
    "Competency-based Stackable Micro-credential (CSM) Pathways",
    "Arrow",
    "Modular Certification Pathways",
    "Arrow",
    "Dropdown",
    "Obtain a Professional Certification",
    "Browse Professional Exams and Preparatory Courses",
    "Arrow",
    "Dropdown",
    "Make a Career Transition",
    "SkillsFuture Career Transition Programme",
    "Arrow",
    "Dropdown",
    "Lead with Impact",
    "Executive Education",
    "Arrow",
    "Dropdown",
    "Attend an Event",
    "Discover Upcoming Events",
    "Arrow",
    "Dropdown",
    "For SITizens",
    "Learn for Life",
    "Arrow",
    "Dropdown",
    "Funding",
    "Available Funding",
    "Arrow",
    "Dropdown",
    "Need Help?",
    "FAQ",
    "Arrow",
    "Dropdown",
    "Who We Are",
    "About Us",
    "Arrow",
    "Dropdown",
    "Let’s Connect",
    "Getting to SIT",
    "Contact Us",
    "Join Our Mailing List",
    "Arrow",
    "Dropdown",
    "Mega menu",
    "< Back",
    "Courses",
    "Dropdown",
    "Goals",
    "Dropdown",
    "For Organisations",
    "Insights",
    "Resources",
    "Dropdown",
    "Connect With Us",
    "Dropdown",
    "Quick Links",
    "Manage My Account",
    ".page-node-type-programme #how-to-apply {\n    height: auto;\n  }",
    "Home",
    "Insights",
    "Upskilling is Not an Uphill Task",
    "Upskilling is Not an Uphill Task",
    "Questions like “Am I too old?”, “Will I be able to keep up?” and “Can I afford it?” are often on the minds of adult learners when considering upskilling and upgrading. Robin Ngan, Director of the SITLEARN, tackles these questions and shares tips for how to make the most of one’s lifelong learning journey.",
    "Course Insights",
    "19 Mar 2024",
    "tag",
    "Competency-based Education, Career Growth and Transition",
    "Robin Ngan is the Director of SITLEARN, the Lifelong Learning Division of the Singapore Institute of Technology (SIT). (SIT Photo: Keng Photography/Tan Eng Keng)",
    "For Robin Ngan, advocating for adult learning is more than just about doing his job as the Director of SIT’s Lifelong Learning Division –",
    "SIT",
    "LEARN",
    ".",
    "As someone who went through the adult learning pathway, Robin personally resonates with many of the doubts and challenges that adult learners face. He has also come out the other side of the learning journey and seen how learning with the right motivation can result in highly fulfilling outcomes.",
    "Robin’s awakening moment happened at age 34, after working for about 10 years. He shares: “At the time, I realised that with my business degree qualifications, I wasn’t getting where I wanted to be with my career and I wanted to pursue my passion in Learning and Development. So, I decided to embark on a part-time master’s programme. I continue to take up relevant courses that equips me with the competencies to perform my role well. Today, I can say from personal experience that pursuing lifelong learning has really changed my life in a huge way.",
    "I hope that by sharing my own experiences and insight, I will be able to help others see how important it is to embrace lifelong learning.”",
    "Q. What are some of the concerns and mental barriers that adult learners face today?",
    "Robin:",
    "There are a range of concerns that adult learners typically face. One is whether they can balance their work, study, family, and financial commitments. Another is the anxiety of whether they can successfully transition into a new career.",
    "Regarding mental barriers, it can include factors like whether they can cope with new learning technologies after so many years out of school, or whether they can integrate well with their classmates who may be much younger than them.",
    "For others, it could be the reluctance or fear to step out of their comfort zone. Being complacent and not taking charge of one’s professional development can hamper employability and the ability to stay relevant to the evolving job role.",
    "Q. What can be done to address these concerns and overcome mental barriers?",
    "Robin:",
    "The first step is to get informed about available options and pathways. For example, suppose the concern is about balancing work and study commitments. In that case, they can consider short-form learning, such as boot camps and workshops, instead of long-form learning, such as diploma or degree programmes. Knowing how much of the learning is done face-to-face or asynchronously will also be helpful.",
    "Communicating the need for support is another important step in the process. Rather than simply dwelling on one’s self-doubts, it will be better to talk it over with family members and bosses to see if they can support you through your learning journey. There are also mentors, success coaches, and professional counsellors that you can speak with to help you plan your career path and navigate through the learning process. Learners who pursue long form learning such as a diploma or degree can also support each other through study groups and project teams.",
    "One crucial step is based on the Japanese philosophy of 'Ikigai', which refers to one’s reason for living. Every individual needs to find their “why”. Are you embarking on this learning journey because you want to advance in your career, become an expert in a particular area, or simply wish to fulfil your dream to get a degree? Once you are clear about your motivations, set your goals and commit to your pursuit of your dream.",
    "Q: How different is the learning process for adult learners today, as compared to what learners may have experienced during their student days?",
    "Robin:",
    "What many of us went through in polytechnic or university is Education 1.0 – which refers to traditional full-time studies. Then came Education 2.0, which refers to part-time studies especially for in-employment learners. Today, we have Education 3.0, which is essentially competency-based education. At SIT, for example, we launched our Competency-based Stackable Micro-credentials (CSM) pathway in 2022 for our",
    "Bachelor of Science (Honours) in Applied Computing",
    "programme, specially designed to provide an upgrading pathway for in-employment learners and companies who prefers a competency-based approach and flexible model of education.",
    "Learners have the flexibility to choose",
    "standalone or stackable micro-credentials",
    "or decide if they are ready to commit to the degree pathway. SIT’s success coaches  support our CSM students’ learning journey and help them overcome challenges. Success coaches provide learning, motivational and personal development strategies as required. SIT will also recognise an adult learner’s prior learning and work experience. The learning is also conducted in a more flexible and asynchronous approach so it allows adult learners to learn anytime, anywhere and they will only be required to return to campus for the hands-on, practical lessons.",
    "A key driver for these changes is the learning revolution, which has caused our skills to have a much shorter lifespan. There is also a greater push towards skills-based hiring and we believe that a competency-based approach will help individuals to unlock their true potential and demonstrate the value that they can bring to the organisation.",
    "Q: What factors should be taken into consideration when selecting a course for upgrading?",
    "Robin:",
    "It is very important to start with a clear goal in mind. This will help you to choose the right course for your objective, be it to gain mastery, secure a better remuneration package, to pick up a new skill, or to transition into a new career.",
    "We live in an age of information overload, so it will help to consider some of these key factors when sifting through the vast range of courses available:",
    "How will the course help me advance my career and personal growth?",
    "Who is the course targeted at?",
    "What can I expect to acquire in terms of competencies and practice?",
    "What experience does the faculty bring to the learning?",
    "How much of the teaching is real-time vs asynchronous (on-demand learning)?",
    "What support services (success coaches, job placement, etc) are provided?",
    "What certifications or credentials will you receive at the end of the programme?",
    "Robin Ngan (standing) regularly conducts talks with industry partners such as SMRT on encouraging employees to take charge of their career and professional growth by developing their own individual learning roadmap. (Photo: SITLEARN)",
    "Q: Any tips for sustaining oneself through the learning journey?",
    "Robin:",
    "Going back to your “why” can help keep you going and tide you through busy and stressful periods. Some may decide to pursue a degree to help uplift  their family while some are compelled to do so to fulfil their dream. Knowing your compelling reason will help you stay centred on why you are pursuing this learning programme in the first place and motivate you to reach your goals.",
    "You need to also devise and commit to a plan – such as the number of hours set aside for studying, work, family and other personal commitments.",
    "Besides time management, energy management is also essential. Take note of which part of the day your energy level is at an optimal level for you to focus on your studies and remember to take regular breaks. Also, figure out what your de-stressing or coping mechanisms (such as hobbies or exercise) are and make time for them.",
    "You also need to celebrate small successes often with your loved ones and friends. We should not look at lifelong learning as a one-off upgrading journey, but an ongoing lifelong process -- so we must pace ourselves well.",
    "Q: How old is too old for upgrading?",
    "Robin:",
    "As clichéd as it may sound, age is just a number. Upgrading should be a timeless pursuit as long as we are curious, healthy and breathing.",
    "In fact, the World Economic Forum’s Future of Jobs 2023 report highlighted curiosity and lifelong learning as one of the most in-demand skills now and beyond. Staying curious and investing in learning is pivotal for individuals and organisations as we learn to adapt to a volatile, uncertain, complex, and ambiguous (VUCA) world, especially when we must deal with the new realities of the COVID19 pandemic, digitalisation, artificial intelligence, and other rapid technological advances.",
    "Hence, we should view learning as a muscle that requires continuous exercise throughout life.",
    "Q: What are the support systems available for adult learners?",
    "Robin:",
    "There are various support systems being provided by Institutes of Higher Learning (IHLs), employers and the government.",
    "From the employers' side, the more well-established companies today have good support systems in place such as career managers and mentors to help employees plan out their career aspirations and point them to the avenues available. They also provide continuous learning support through scholarships, sponsorships, and study leave for in-employment staff who work and study at the same time.",
    "At the national level, we have SkillsFuture Singapore which provides regular job and skills reports and insights that can help an individual understand the changing job landscape and in-demand skills. The Straits Times  reported that NTUC’s Employment and Employability Institute (e2i) will take over two career centres and 10 Jobs and Skills Centres from Workforce Singapore (WSG) from 1 April 2024. These centres provide career advisory services for adult learners.",
    "There are also financial aid and subsidies available for those keen to upgrade themselves. The amount of funding subsidy differs based on your age group, but learners above 40 can receive up to 90% of funding support to pursue courses. Many people have yet to use their existing SkillsFuture credits and the Budget 2024 announced a $4,000 SkillsFuture top-up for Singaporeans aged 40 and above. Subsidies and monthly training allowances will also be available to those pursuing another full-time diploma or enrolling in full-time and career transition courses, so I strongly encourage them to see that as a passport to a new chapter of possibilities.",
    "It is also important to build and stay connected to an active network which comprises mentors, industry association and community of practices to stay updated on the evolving trends, skills demands and job insights in the respective sectors.",
    "With the above support systems in place, adult learners are in a much better position today to pursue both short and long form learning. However, nothing will change until they are ready to move out of their comfort  zone to the learning and growth zone. There is a need to eradicate self-doubt thoughts and address confidence issues.",
    "You do not want to reach a stage  where you realise that your skills or the job that you had performed for years is no longer relevant. Be intentional in mapping your life journey, take charge of your career and professional development and live life without regrets.",
    "This article was originally published on",
    "SIT's Digital Newsroom",
    ".",
    "About SITLEARN",
    "SITLEARN is the lifelong learning division of Singapore Institute of Technology (SIT), Singapore's first University of Applied Learning. We focus on providing lifelong learning opportunities for working adults to upgrade their skills and knowledge for the workplace.",
    "Learn more",
    "arrow--right",
    "Related Courses",
    "Infocomm Technology",
    "Digital Logic and Computing",
    "Specialised micro-credential for strong technical and theoretical foundation in digital and IT fundamentals, programming, logic and discrete structures. Earn a Specialist Certificate and stack it towards a degree in Applied Computing.",
    "calendar-day",
    "01 Sep 2025",
    "clock-five",
    "3+ months",
    "delivery-mode",
    "Blended",
    "dollar-sign",
    "SGD\n      \n $9,868.86",
    "Up to 90% SF Funding",
    "Stackable towards:",
    "Bachelor of Science (Honours) in Applied Computing (via the CSM Pathway)",
    "tag",
    "Programming and Software Development, Computer Architecture, Competency-based Education",
    "Infocomm Technology",
    "Information Security Risk Management and Audit",
    "Specialised micro-credential for strong technical and theoretical expertise in information systems audit, security management, and risk management based on Agile. Earn a Specialist Certificate and stack it towards a degree in Applied Computing.",
    "calendar-day",
    "01 Sep 2025",
    "clock-five",
    "3+ months",
    "delivery-mode",
    "Blended",
    "dollar-sign",
    "SGD\n      \n $9,868.86",
    "Up to 90% SF Funding",
    "Stackable towards:",
    "Bachelor of Science (Honours) in Applied Computing (via the CSM Pathway)",
    "tag",
    "Information Security, Cybersecurity, Risk Management, Audit, Competency-based Education",
    "Engineering",
    "Data Analytics for Engineering",
    "Specialised micro-credential for strong technical and theoretical expertise in data analytics. Earn a Specialist Certificate and stack it towards a degree in Electrical and Electronic Engineering.",
    "calendar-day",
    "01 Sep 2025",
    "clock-five",
    "3+ months",
    "delivery-mode",
    "Blended",
    "dollar-sign",
    "SGD\n      \n $10,006.20",
    "Up to 90% SF Funding",
    "Stackable towards:",
    "BEng (Hons) Electrical & Electronic Engineering or Infrastructure & Systems Engineering",
    "tag",
    "Data Science and Analytics, AI and Machine Learning, Competency-based Education",
    "Engineering",
    "Sustainable Energy Systems",
    "Specialised micro-credential for strong technical and theoretical expertise in renewable integration, energy storage, and smart grid deployment. Earn a Specialist Certificate and stack it towards a degree in Electrical and Electronics Engineering.",
    "calendar-day",
    "01 Sep 2025",
    "clock-five",
    "3+ months",
    "delivery-mode",
    "Blended",
    "dollar-sign",
    "SGD\n      \n $10,006.20",
    "Up to 90% SF Funding",
    "Stackable towards:",
    "BEng (Hons) in Electrical & Electronic Engineering (via the CSM Pathway)",
    "tag",
    "Electrical Engineering, Power and Clean Energy, Sustainability, Competency-based Education",
    "Engineering",
    "Engineering Design and Solutioning",
    "Specialised micro-credential for strong technical and theoretical expertise in engineering design, 3D modelling and analysis and prototype development. Earn a Specialist Certificate and stack it towards a degree in Infrastructure and Systems Engineering.",
    "calendar-day",
    "01 Sep 2025",
    "clock-five",
    "3+ months",
    "delivery-mode",
    "Blended",
    "dollar-sign",
    "SGD\n      \n $10,006.20",
    "Up to 90% SF Funding",
    "Stackable towards:",
    "BEng (Hons) in Infrastructure & Systems Engineering (via the CSM Pathway)",
    "tag",
    "Systems Engineering, Transport Engineering, Competency-based Education",
    "Engineering",
    "Electronic Systems",
    "Specialised micro-credential for strong technical and theoretical expertise in electronic systems to model, analyse, and interpret performance and specifications efficiently. Earn a Specialist Certificate and stack it towards a degree in Electrical and Electronic Engineering.",
    "calendar-day",
    "01 Sep 2025",
    "clock-five",
    "3+ months",
    "delivery-mode",
    "Blended",
    "dollar-sign",
    "SGD\n      \n $10,006.20",
    "Up to 90% SF Funding",
    "Stackable towards:",
    "BEng (Hons) in Electrical & Electronic Engineering (via the CSM Pathway)",
    "tag",
    "Electronics Engineering, Telematics, Competency-based Education",
    "❮",
    "❯",
    "Keep Reading",
    "Participant Story",
    "From Wilderness to Workplace: Finding Purpose and Power Through Lifelong Learning",
    "08 May 2025",
    "“These programmes…are more than technical certifications – they're fundamental operating systems for professional effectiveness.” \r\n-- Eltian Chen, Graduate of (SCTP) Programme for the Lean Six Sigma Champion and Operational Excellence Manager",
    "tag",
    "Lean and Six Sigma, Career Growth and Transition",
    "Participant Story",
    "More alumni return to S’pore universities to study, but more support needed",
    "12 May 2024",
    "More people are returning to their alma mater for further studies over the past few years, with government support and more alumni engagement.",
    "tag",
    "Career Growth and Transition, Competency-based Education",
    "Course Insights",
    "Improving Patient Outcomes through Advanced Clinical Supervision Competency",
    "03 Apr 2024",
    "The Singapore Institute of Technology (SIT) taps on evidence-based education practices to address the increasing demand for advanced clinical supervision competencies among Allied Health Professionals and improve patient outcomes.",
    "tag",
    "Health Sciences, Adult and Geriatric Rehabilitation, Competency-based Education",
    "Course Insights",
    "What’s needed for stackable microcredentials toward a degree?",
    "29 Sep 2023",
    "Forest Tan describes how to begin creating a flexible pathway where learners can accumulate microcredentials aligned to industry that can stack toward a degree.",
    "tag",
    "Competency-based Education",
    "Course Insights",
    "How to coach in-employment lifelong learners for success",
    "21 Sep 2023",
    "A team from Singapore Institute of Technology offers insights from working with in-employment learners who are seeking to upskill by studying for degrees.",
    "tag",
    "Competency-based Education",
    "Course Insights",
    "The future of learning: How competency-based education is shaping skills development",
    "08 Aug 2023",
    "As the shelf-life of skills shortens, it's time to rethink the traditional approach to upskilling. With competency-based education, employees are able to master the skills that directly impact their careers, and employers are able to assess competency accurately.",
    "tag",
    "Competency-based Education",
    "❮",
    "❯",
    "#block-announcement-popup {\n display: none;\n}",
    "New Engineering Micro-credentials Launching Soon!",
    "Exciting news! We are introducing new micro-credentials in Electrical and Electronic Engineering & Infrastructure and Systems Engineering. Be among the first to know by registering your interest today!",
    "Register now →",
    "SIT reserves the right to make changes to published course information, including dates, times, venues, fees and instructors without prior notice.",
    "Address",
    "1 Punggol Coast Road Singapore 828608",
    "Contact Us",
    "Send an Enquiry",
    "Visiting SIT",
    "Our Campus Locations",
    "Privacy Statement",
    "Safety and Health",
    "Social Media Guidelines",
    "Terms of Use",
    "Whistleblowing",
    "CET Course Terms & Conditions",
    "Copyright ©",
    "2025",
    "Singapore Institute of Technology. All Rights Reserved.",
    ".contact-link2 a:link,  .contact-link2 a:visited {\n    border-bottom:0px;\n}",
    "{\"path\":{\"baseUrl\":\"\\/sitlearn\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/18241\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"colorbox\":{\"transition\":\"elastic\",\"speed\":350,\"opacity\":0.84999999999999998,\"slideshow\":false,\"slideshowAuto\":true,\"slideshowSpeed\":2500,\"slideshowStart\":\"start slideshow\",\"slideshowStop\":\"stop slideshow\",\"current\":\"{current} of {total}\",\"previous\":\"\\u00ab Prev\",\"next\":\"Next \\u00bb\",\"close\":\"Close\",\"overlayClose\":true,\"returnFocus\":true,\"maxWidth\":\"85%\",\"maxHeight\":\"80%\",\"initialWidth\":\"1%\",\"initialHeight\":\"1%\",\"fixed\":true,\"scrolling\":true,\"mobiledetect\":false,\"mobiledevicewidth\":\"480px\"},\"simple_popup_blocks\":{\"settings\":[]},\"lazyLoadUrl\":\"\\/sitlearn\\/term_reference_fancytree\\/subTree\",\"blazy\":{\"loadInvisible\":false,\"offset\":100,\"saveViewportOffsetDelay\":50,\"validateDelay\":25,\"container\":\"\",\"loader\":true,\"unblazy\":false,\"visibleClass\":false},\"blazyIo\":{\"disconnect\":false,\"rootMargin\":\"0px\",\"threshold\":[0,0.25,0.5,0.75,1]},\"slick\":{\"accessibility\":true,\"adaptiveHeight\":false,\"autoplay\":false,\"pauseOnHover\":true,\"pauseOnDotsHover\":false,\"pauseOnFocus\":true,\"autoplaySpeed\":3000,\"arrows\":true,\"downArrow\":false,\"downArrowTarget\":\"\",\"downArrowOffset\":0,\"centerMode\":false,\"centerPadding\":\"50px\",\"dots\":false,\"dotsClass\":\"slick-dots\",\"draggable\":true,\"fade\":false,\"focusOnSelect\":false,\"infinite\":true,\"initialSlide\":0,\"lazyLoad\":\"ondemand\",\"mouseWheel\":false,\"randomize\":false,\"rtl\":false,\"rows\":1,\"slidesPerRow\":1,\"slide\":\"\",\"slidesToShow\":1,\"slidesToScroll\":1,\"speed\":500,\"swipe\":true,\"swipeToSlide\":false,\"edgeFriction\":0.34999999999999998,\"touchMove\":true,\"touchThreshold\":5,\"useCSS\":true,\"cssEase\":\"ease\",\"cssEaseBezier\":\"\",\"cssEaseOverride\":\"\",\"useTransform\":true,\"easing\":\"linear\",\"variableWidth\":false,\"vertical\":false,\"verticalSwiping\":false,\"waitForAnimate\":true},\"field_group\":{\"html_element\":{\"mode\":\"insight_header\",\"context\":\"view\",\"settings\":{\"classes\":\"\",\"show_empty_fields\":false,\"id\":\"\",\"element\":\"div\",\"show_label\":false,\"label_element\":\"h3\",\"label_element_classes\":\"\",\"attributes\":\"\",\"effect\":\"none\",\"speed\":\"fast\"}}},\"user\":{\"uid\":0,\"permissionsHash\":\"6865a5a4a677c61446c24b3c09f1809962249dff5b0b68c3d1096b60d4557c4b\"}}"
  ],
  "desc_divs": [
    "SITLEARN is the lifelong learning division of Singapore Institute of Technology (SIT), Singapore's first University of Applied Learning. We focus on providing lifelong learning opportunities for working adults to upgrade their skills and knowledge for the workplace.\nLearn more\narrow--right",
    "Specialised micro-credential for strong technical and theoretical foundation in digital and IT fundamentals, programming, logic and discrete structures. Earn a Specialist Certificate and stack it towards a degree in Applied Computing.",
    "Specialised micro-credential for strong technical and theoretical expertise in information systems audit, security management, and risk management based on Agile. Earn a Specialist Certificate and stack it towards a degree in Applied Computing.",
    "Specialised micro-credential for strong technical and theoretical expertise in data analytics. Earn a Specialist Certificate and stack it towards a degree in Electrical and Electronic Engineering.",
    "Specialised micro-credential for strong technical and theoretical expertise in renewable integration, energy storage, and smart grid deployment. Earn a Specialist Certificate and stack it towards a degree in Electrical and Electronics Engineering.",
    "Specialised micro-credential for strong technical and theoretical expertise in engineering design, 3D modelling and analysis and prototype development. Earn a Specialist Certificate and stack it towards a degree in Infrastructure and Systems Engineering.",
    "Specialised micro-credential for strong technical and theoretical expertise in electronic systems to model, analyse, and interpret performance and specifications efficiently. Earn a Specialist Certificate and stack it towards a degree in Electrical and Electronic Engineering.",
    "“These programmes…are more than technical certifications – they're fundamental operating systems for professional effectiveness.” \r\n-- Eltian Chen, Graduate of (SCTP) Programme for the Lean Six Sigma Champion and Operational Excellence Manager",
    "More people are returning to their alma mater for further studies over the past few years, with government support and more alumni engagement.",
    "The Singapore Institute of Technology (SIT) taps on evidence-based education practices to address the increasing demand for advanced clinical supervision competencies among Allied Health Professionals and improve patient outcomes.",
    "Forest Tan describes how to begin creating a flexible pathway where learners can accumulate microcredentials aligned to industry that can stack toward a degree.",
    "A team from Singapore Institute of Technology offers insights from working with in-employment learners who are seeking to upskill by studying for degrees.",
    "As the shelf-life of skills shortens, it's time to rethink the traditional approach to upskilling. With competency-based education, employees are able to master the skills that directly impact their careers, and employers are able to assess competency accurately."
  ],
  "article_texts": [
    "Upskilling is Not an Uphill Task\nQuestions like “Am I too old?”, “Will I be able to keep up?” and “Can I afford it?” are often on the minds of adult learners when considering upskilling and upgrading. Robin Ngan, Director of the SITLEARN, tackles these questions and shares tips for how to make the most of one’s lifelong learning journey.\nCourse Insights\n19 Mar 2024\ntag\nCompetency-based Education, Career Growth and Transition\nRobin Ngan is the Director of SITLEARN, the Lifelong Learning Division of the Singapore Institute of Technology (SIT). (SIT Photo: Keng Photography/Tan Eng Keng)\nFor Robin Ngan, advocating for adult learning is more than just about doing his job as the Director of SIT’s Lifelong Learning Division –\nSIT\nLEARN\n.\nAs someone who went through the adult learning pathway, Robin personally resonates with many of the doubts and challenges that adult learners face. He has also come out the other side of the learning journey and seen how learning with the right motivation can result in highly fulfilling outcomes.\nRobin’s awakening moment happened at age 34, after working for about 10 years. He shares: “At the time, I realised that with my business degree qualifications, I wasn’t getting where I wanted to be with my career and I wanted to pursue my passion in Learning and Development. So, I decided to embark on a part-time master’s programme. I continue to take up relevant courses that equips me with the competencies to perform my role well. Today, I can say from personal experience that pursuing lifelong learning has really changed my life in a huge way.\nI hope that by sharing my own experiences and insight, I will be able to help others see how important it is to embrace lifelong learning.”\nQ. What are some of the concerns and mental barriers that adult learners face today?\nRobin:\nThere are a range of concerns that adult learners typically face. One is whether they can balance their work, study, family, and financial commitments. Another is the anxiety of whether they can successfully transition into a new career.\nRegarding mental barriers, it can include factors like whether they can cope with new learning technologies after so many years out of school, or whether they can integrate well with their classmates who may be much younger than them.\nFor others, it could be the reluctance or fear to step out of their comfort zone. Being complacent and not taking charge of one’s professional development can hamper employability and the ability to stay relevant to the evolving job role.\nQ. What can be done to address these concerns and overcome mental barriers?\nRobin:\nThe first step is to get informed about available options and pathways. For example, suppose the concern is about balancing work and study commitments. In that case, they can consider short-form learning, such as boot camps and workshops, instead of long-form learning, such as diploma or degree programmes. Knowing how much of the learning is done face-to-face or asynchronously will also be helpful.\nCommunicating the need for support is another important step in the process. Rather than simply dwelling on one’s self-doubts, it will be better to talk it over with family members and bosses to see if they can support you through your learning journey. There are also mentors, success coaches, and professional counsellors that you can speak with to help you plan your career path and navigate through the learning process. Learners who pursue long form learning such as a diploma or degree can also support each other through study groups and project teams.\nOne crucial step is based on the Japanese philosophy of 'Ikigai', which refers to one’s reason for living. Every individual needs to find their “why”. Are you embarking on this learning journey because you want to advance in your career, become an expert in a particular area, or simply wish to fulfil your dream to get a degree? Once you are clear about your motivations, set your goals and commit to your pursuit of your dream.\nQ: How different is the learning process for adult learners today, as compared to what learners may have experienced during their student days?\nRobin:\nWhat many of us went through in polytechnic or university is Education 1.0 – which refers to traditional full-time studies. Then came Education 2.0, which refers to part-time studies especially for in-employment learners. Today, we have Education 3.0, which is essentially competency-based education. At SIT, for example, we launched our Competency-based Stackable Micro-credentials (CSM) pathway in 2022 for our\nBachelor of Science (Honours) in Applied Computing\nprogramme, specially designed to provide an upgrading pathway for in-employment learners and companies who prefers a competency-based approach and flexible model of education.\nLearners have the flexibility to choose\nstandalone or stackable micro-credentials\nor decide if they are ready to commit to the degree pathway. SIT’s success coaches  support our CSM students’ learning journey and help them overcome challenges. Success coaches provide learning, motivational and personal development strategies as required. SIT will also recognise an adult learner’s prior learning and work experience. The learning is also conducted in a more flexible and asynchronous approach so it allows adult learners to learn anytime, anywhere and they will only be required to return to campus for the hands-on, practical lessons.\nA key driver for these changes is the learning revolution, which has caused our skills to have a much shorter lifespan. There is also a greater push towards skills-based hiring and we believe that a competency-based approach will help individuals to unlock their true potential and demonstrate the value that they can bring to the organisation.\nQ: What factors should be taken into consideration when selecting a course for upgrading?\nRobin:\nIt is very important to start with a clear goal in mind. This will help you to choose the right course for your objective, be it to gain mastery, secure a better remuneration package, to pick up a new skill, or to transition into a new career.\nWe live in an age of information overload, so it will help to consider some of these key factors when sifting through the vast range of courses available:\nHow will the course help me advance my career and personal growth?\nWho is the course targeted at?\nWhat can I expect to acquire in terms of competencies and practice?\nWhat experience does the faculty bring to the learning?\nHow much of the teaching is real-time vs asynchronous (on-demand learning)?\nWhat support services (success coaches, job placement, etc) are provided?\nWhat certifications or credentials will you receive at the end of the programme?\nRobin Ngan (standing) regularly conducts talks with industry partners such as SMRT on encouraging employees to take charge of their career and professional growth by developing their own individual learning roadmap. (Photo: SITLEARN)\nQ: Any tips for sustaining oneself through the learning journey?\nRobin:\nGoing back to your “why” can help keep you going and tide you through busy and stressful periods. Some may decide to pursue a degree to help uplift  their family while some are compelled to do so to fulfil their dream. Knowing your compelling reason will help you stay centred on why you are pursuing this learning programme in the first place and motivate you to reach your goals.\nYou need to also devise and commit to a plan – such as the number of hours set aside for studying, work, family and other personal commitments.\nBesides time management, energy management is also essential. Take note of which part of the day your energy level is at an optimal level for you to focus on your studies and remember to take regular breaks. Also, figure out what your de-stressing or coping mechanisms (such as hobbies or exercise) are and make time for them.\nYou also need to celebrate small successes often with your loved ones and friends. We should not look at lifelong learning as a one-off upgrading journey, but an ongoing lifelong process -- so we must pace ourselves well.\nQ: How old is too old for upgrading?\nRobin:\nAs clichéd as it may sound, age is just a number. Upgrading should be a timeless pursuit as long as we are curious, healthy and breathing.\nIn fact, the World Economic Forum’s Future of Jobs 2023 report highlighted curiosity and lifelong learning as one of the most in-demand skills now and beyond. Staying curious and investing in learning is pivotal for individuals and organisations as we learn to adapt to a volatile, uncertain, complex, and ambiguous (VUCA) world, especially when we must deal with the new realities of the COVID19 pandemic, digitalisation, artificial intelligence, and other rapid technological advances.\nHence, we should view learning as a muscle that requires continuous exercise throughout life.\nQ: What are the support systems available for adult learners?\nRobin:\nThere are various support systems being provided by Institutes of Higher Learning (IHLs), employers and the government.\nFrom the employers' side, the more well-established companies today have good support systems in place such as career managers and mentors to help employees plan out their career aspirations and point them to the avenues available. They also provide continuous learning support through scholarships, sponsorships, and study leave for in-employment staff who work and study at the same time.\nAt the national level, we have SkillsFuture Singapore which provides regular job and skills reports and insights that can help an individual understand the changing job landscape and in-demand skills. The Straits Times  reported that NTUC’s Employment and Employability Institute (e2i) will take over two career centres and 10 Jobs and Skills Centres from Workforce Singapore (WSG) from 1 April 2024. These centres provide career advisory services for adult learners.\nThere are also financial aid and subsidies available for those keen to upgrade themselves. The amount of funding subsidy differs based on your age group, but learners above 40 can receive up to 90% of funding support to pursue courses. Many people have yet to use their existing SkillsFuture credits and the Budget 2024 announced a $4,000 SkillsFuture top-up for Singaporeans aged 40 and above. Subsidies and monthly training allowances will also be available to those pursuing another full-time diploma or enrolling in full-time and career transition courses, so I strongly encourage them to see that as a passport to a new chapter of possibilities.\nIt is also important to build and stay connected to an active network which comprises mentors, industry association and community of practices to stay updated on the evolving trends, skills demands and job insights in the respective sectors.\nWith the above support systems in place, adult learners are in a much better position today to pursue both short and long form learning. However, nothing will change until they are ready to move out of their comfort  zone to the learning and growth zone. There is a need to eradicate self-doubt thoughts and address confidence issues.\nYou do not want to reach a stage  where you realise that your skills or the job that you had performed for years is no longer relevant. Be intentional in mapping your life journey, take charge of your career and professional development and live life without regrets.\nThis article was originally published on\nSIT's Digital Newsroom\n.\nAbout SITLEARN\nSITLEARN is the lifelong learning division of Singapore Institute of Technology (SIT), Singapore's first University of Applied Learning. We focus on providing lifelong learning opportunities for working adults to upgrade their skills and knowledge for the workplace.\nLearn more\narrow--right\nRelated Courses\nInfocomm Technology\nDigital Logic and Computing\nSpecialised micro-credential for strong technical and theoretical foundation in digital and IT fundamentals, programming, logic and discrete structures. Earn a Specialist Certificate and stack it towards a degree in Applied Computing.\ncalendar-day\n01 Sep 2025\nclock-five\n3+ months\ndelivery-mode\nBlended\ndollar-sign\nSGD\n      \n $9,868.86\nUp to 90% SF Funding\nStackable towards:\nBachelor of Science (Honours) in Applied Computing (via the CSM Pathway)\ntag\nProgramming and Software Development, Computer Architecture, Competency-based Education\nInfocomm Technology\nInformation Security Risk Management and Audit\nSpecialised micro-credential for strong technical and theoretical expertise in information systems audit, security management, and risk management based on Agile. Earn a Specialist Certificate and stack it towards a degree in Applied Computing.\ncalendar-day\n01 Sep 2025\nclock-five\n3+ months\ndelivery-mode\nBlended\ndollar-sign\nSGD\n      \n $9,868.86\nUp to 90% SF Funding\nStackable towards:\nBachelor of Science (Honours) in Applied Computing (via the CSM Pathway)\ntag\nInformation Security, Cybersecurity, Risk Management, Audit, Competency-based Education\nEngineering\nData Analytics for Engineering\nSpecialised micro-credential for strong technical and theoretical expertise in data analytics. Earn a Specialist Certificate and stack it towards a degree in Electrical and Electronic Engineering.\ncalendar-day\n01 Sep 2025\nclock-five\n3+ months\ndelivery-mode\nBlended\ndollar-sign\nSGD\n      \n $10,006.20\nUp to 90% SF Funding\nStackable towards:\nBEng (Hons) Electrical & Electronic Engineering or Infrastructure & Systems Engineering\ntag\nData Science and Analytics, AI and Machine Learning, Competency-based Education\nEngineering\nSustainable Energy Systems\nSpecialised micro-credential for strong technical and theoretical expertise in renewable integration, energy storage, and smart grid deployment. Earn a Specialist Certificate and stack it towards a degree in Electrical and Electronics Engineering.\ncalendar-day\n01 Sep 2025\nclock-five\n3+ months\ndelivery-mode\nBlended\ndollar-sign\nSGD\n      \n $10,006.20\nUp to 90% SF Funding\nStackable towards:\nBEng (Hons) in Electrical & Electronic Engineering (via the CSM Pathway)\ntag\nElectrical Engineering, Power and Clean Energy, Sustainability, Competency-based Education\nEngineering\nEngineering Design and Solutioning\nSpecialised micro-credential for strong technical and theoretical expertise in engineering design, 3D modelling and analysis and prototype development. Earn a Specialist Certificate and stack it towards a degree in Infrastructure and Systems Engineering.\ncalendar-day\n01 Sep 2025\nclock-five\n3+ months\ndelivery-mode\nBlended\ndollar-sign\nSGD\n      \n $10,006.20\nUp to 90% SF Funding\nStackable towards:\nBEng (Hons) in Infrastructure & Systems Engineering (via the CSM Pathway)\ntag\nSystems Engineering, Transport Engineering, Competency-based Education\nEngineering\nElectronic Systems\nSpecialised micro-credential for strong technical and theoretical expertise in electronic systems to model, analyse, and interpret performance and specifications efficiently. Earn a Specialist Certificate and stack it towards a degree in Electrical and Electronic Engineering.\ncalendar-day\n01 Sep 2025\nclock-five\n3+ months\ndelivery-mode\nBlended\ndollar-sign\nSGD\n      \n $10,006.20\nUp to 90% SF Funding\nStackable towards:\nBEng (Hons) in Electrical & Electronic Engineering (via the CSM Pathway)\ntag\nElectronics Engineering, Telematics, Competency-based Education\n❮\n❯\nKeep Reading\nParticipant Story\nFrom Wilderness to Workplace: Finding Purpose and Power Through Lifelong Learning\n08 May 2025\n“These programmes…are more than technical certifications – they're fundamental operating systems for professional effectiveness.” \r\n-- Eltian Chen, Graduate of (SCTP) Programme for the Lean Six Sigma Champion and Operational Excellence Manager\ntag\nLean and Six Sigma, Career Growth and Transition\nParticipant Story\nMore alumni return to S’pore universities to study, but more support needed\n12 May 2024\nMore people are returning to their alma mater for further studies over the past few years, with government support and more alumni engagement.\ntag\nCareer Growth and Transition, Competency-based Education\nCourse Insights\nImproving Patient Outcomes through Advanced Clinical Supervision Competency\n03 Apr 2024\nThe Singapore Institute of Technology (SIT) taps on evidence-based education practices to address the increasing demand for advanced clinical supervision competencies among Allied Health Professionals and improve patient outcomes.\ntag\nHealth Sciences, Adult and Geriatric Rehabilitation, Competency-based Education\nCourse Insights\nWhat’s needed for stackable microcredentials toward a degree?\n29 Sep 2023\nForest Tan describes how to begin creating a flexible pathway where learners can accumulate microcredentials aligned to industry that can stack toward a degree.\ntag\nCompetency-based Education\nCourse Insights\nHow to coach in-employment lifelong learners for success\n21 Sep 2023\nA team from Singapore Institute of Technology offers insights from working with in-employment learners who are seeking to upskill by studying for degrees.\ntag\nCompetency-based Education\nCourse Insights\nThe future of learning: How competency-based education is shaping skills development\n08 Aug 2023\nAs the shelf-life of skills shortens, it's time to rethink the traditional approach to upskilling. With competency-based education, employees are able to master the skills that directly impact their careers, and employers are able to assess competency accurately.\ntag\nCompetency-based Education\n❮\n❯"
  ],
  "links": [
    "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/upskilling-not-uphill-task#main-content",
    "https://sitlearn.singaporetech.edu.sg/profile/",
    "https://www.singaporetech.edu.sg/sitlearn/",
    "https://www.singaporetech.edu.sg/sitlearn/",
    "https://www.singaporetech.edu.sg/sitlearn/organisations",
    "https://www.singaporetech.edu.sg/sitlearn/insights",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A51",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A53",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A60",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A57",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A19",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A52",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A56",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A74",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A49",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A20",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A54",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A69",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A70",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A22",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A48",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A62",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A66",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A201",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A21",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A191",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A58",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A59",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A196",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A23",
    "https://www.singaporetech.edu.sg/sitlearn/courses/course-brochure",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/courses/business-communication-design",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering",
    "https://www.singaporetech.edu.sg/sitlearn/courses/food-chemical-biotechnology",
    "https://www.singaporetech.edu.sg/sitlearn/courses/health-social-sciences",
    "https://www.singaporetech.edu.sg/sitlearn/courses/infocomm-technology",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/modular-certification-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/professional-exams-preparatory-courses",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/upskilling-not-uphill-task",
    "https://www.singaporetech.edu.sg/sitlearn/executive-education",
    "https://www.singaporetech.edu.sg/sitlearn/events",
    "https://www.singaporetech.edu.sg/sitlearn/resources/learn-for-life",
    "https://www.singaporetech.edu.sg/sitlearn/resources/funding",
    "https://www.singaporetech.edu.sg/sitlearn/resources/faq",
    "https://www.singaporetech.edu.sg/sitlearn/about-us",
    "https://www.singaporetech.edu.sg/sitlearn/getting-sit",
    "https://www.singaporetech.edu.sg/sitlearn/contact-us",
    "https://www.singaporetech.edu.sg/sitlearn/join-our-mailing-list",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A51",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A53",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A60",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A57",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A19",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A52",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A56",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A74",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A49",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A20",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A54",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A69",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A70",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A22",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A48",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A62",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A66",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A201",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A21",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A191",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A58",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A59",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A196",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A23",
    "https://www.singaporetech.edu.sg/sitlearn/courses/course-brochure",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/courses/business-communication-design",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering",
    "https://www.singaporetech.edu.sg/sitlearn/courses/food-chemical-biotechnology",
    "https://www.singaporetech.edu.sg/sitlearn/courses/health-social-sciences",
    "https://www.singaporetech.edu.sg/sitlearn/courses/infocomm-technology",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/modular-certification-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/professional-exams-preparatory-courses",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/upskilling-not-uphill-task",
    "https://www.singaporetech.edu.sg/sitlearn/executive-education",
    "https://www.singaporetech.edu.sg/sitlearn/events",
    "https://www.singaporetech.edu.sg/sitlearn/resources/learn-for-life",
    "https://www.singaporetech.edu.sg/sitlearn/resources/funding",
    "https://www.singaporetech.edu.sg/sitlearn/resources/faq",
    "https://www.singaporetech.edu.sg/sitlearn/about-us",
    "https://www.singaporetech.edu.sg/sitlearn/getting-sit",
    "https://www.singaporetech.edu.sg/sitlearn/contact-us",
    "https://www.singaporetech.edu.sg/sitlearn/join-our-mailing-list",
    "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/upskilling-not-uphill-task",
    "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/upskilling-not-uphill-task",
    "https://www.singaporetech.edu.sg/sitlearn/organisations",
    "https://www.singaporetech.edu.sg/sitlearn/insights",
    "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/upskilling-not-uphill-task",
    "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/upskilling-not-uphill-task",
    "https://sitlearn.singaporetech.edu.sg/profile/",
    "https://www.singaporetech.edu.sg/sitlearn/",
    "https://www.singaporetech.edu.sg/sitlearn/insights",
    "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/upskilling-not-uphill-task",
    "https://www.singaporetech.edu.sg/sitlearn/",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/applied-computing-csm",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/applied-computing",
    "https://www.singaporetech.edu.sg/news",
    "https://www.singaporetech.edu.sg/sitlearn/about-us",
    "https://www.singaporetech.edu.sg/sitlearn/courses/infocomm-technology/digital-logic-computing-microcredential",
    "https://www.singaporetech.edu.sg/sitlearn/courses/infocomm-technology/information-security-risk-management-audit-microcredential",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/data-analytics-engineering-microcredential",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/sustainable-energy-systems-microcredential",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/engineering-design-solutioning-microcredential",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/electronic-systems-microcredential",
    "https://www.singaporetech.edu.sg/sitlearn/insights/participant-story/wilderness-workplace-finding-purpose-power-through-lifelong-learning",
    "https://www.singaporetech.edu.sg/sitlearn/insights/participant-story/more-alumni-return-spore-universities-study-more-support-needed",
    "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/improving-patient-outcomes-through-advanced-clinical-supervision-competency",
    "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/whats-needed-stackable-microcredentials-toward-degree",
    "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/how-coach-employment-lifelong-learners-success",
    "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/future-learning-how-competency-based-shaping-skills-development",
    "https://sit.au1.qualtrics.com/jfe/form/SV_6FKhISzRqyVUdYq",
    "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/upskilling-not-uphill-task#0",
    "https://www.google.com/maps/place/Singapore+Institute+of+Technology+(SIT)+-+Punggol/@1.41364,103.91229,14z/data=!4m6!3m5!1s0x31da1515bfb2d263:0xc71c56458ac08497!8m2!3d1.4136399!4d103.9122896!16s%2Fg%2F11t42h3wb_",
    "https://www.singaporetech.edu.sg/contact-us",
    "https://www.singaporetech.edu.sg/campus-locations",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.linkedin.com/company/singapore-institute-of-technology",
    "https://www.youtube.com/user/SingaporeTech",
    "https://www.tiktok.com/@singaporetech",
    "https://www.singaporetech.edu.sg/sitlearn/privacy-statement",
    "https://www.singaporetech.edu.sg/safety-and-health-policy",
    "https://www.singaporetech.edu.sg/social-media-guidelines",
    "https://www.singaporetech.edu.sg/sitlearn/terms-use",
    "https://www.singaporetech.edu.sg/whistleblowing",
    "https://www.singaporetech.edu.sg/sitlearn/media/sit-cet-terms-conditions"
  ],
  "images": [
    "/sitlearn/sites/sitlearn/files/2024-03/Insights-Robin.jpg",
    "/sitlearn/sites/sitlearn/files/2024-03/Insights-Robin2.jpg",
    "/sitlearn/sites/sitlearn/files/2023-03/aboutus-banner.jpg",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E"
  ]
}