{
  "url": "https://www.singaporetech.edu.sg/sitlearn/sites/sitlearn/files/2025-01/2025-01%20SIT%20CET%20Terms%20and%20Conditions%20%28final%29.pdf",
  "type": "pdf",
  "content": "SINGAPORE INSTITUTE OF TECHNOLOGY        PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 1 of 7\nEffective: 1 Nov 2024  SIT Restricted  SIT Restricted  SIT Restricted\nCONTINUING EDUCATION AND TRAINING (CET)  COURSES\nTERMS & CONDITIONS\nLearners for Singapore Institute of Technology’s (SIT’s) CET Courses  (CET Learners)  are advised to\nread these Terms and Conditions as well as the FAQs on SIT ’s website before registering for or\nattending a course.\n1. ACCOUNT REGISTRATION\n1.1 CET Learners  must  register for an account first on the SIT course registration portal  before\napplying for course s. Compan ies applying on behalf of employees  should register for a\ncompany account instead. Please follow the instructions in the registration guide  found in our\nFAQ section .\n1.2 All company -sponsored and self -sponsored CET Learners  are responsible for ensuring the\naccuracy of their entries, including their  and/or their  organisation’s billing details\n(name/entity/UEN ) (if relevant) , their full name  as per NRIC/FIN/passport or official ID , and\nother personal data . It is advisable to gather  these information before registering for the\ncourse .\n2. COURSE REGISTRATION\n2.1 CET Learners  and/or companies  should take note of the individual course registration closing\ndates listed on the course website .  SIT will notify CET Learners  or companies through the\ncontact details provided during registration  in writing regarding registration outcome prior  to\nthe course commencement .\n2.2 All fees mentioned include prevailing G oods and Services Tax (GST) . CET Learners  (and/or\nsponsoring compan ies, where  applicable) are responsible for any applicable taxes and bank\ncharges.\n2.3 All courses are subject to confirmation by SIT. SIT reserve s the right to reject any course\nregistration at its sole discretion without providing a reason.\n2.4 Payment of course fees or submission of the online course registration indicates full\nacceptance of these  CET Terms & Conditions  by the CET Learner .\n3. COURSE FUNDING\n3.1 CET Learners  must  meet the following criteria to be eligible for  Skillsfuture Singapore (“ SSG”)\ngrant or funding:\nSINGAPORE INSTITUTE OF TECHNOLOGY        PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 2 of 7\nEffective: 1 Nov 2024  SIT Restricted  SIT Restricted  SIT Restricted\n(a) Must be a Singapore Citizen (SC), Permanent Resident (PR) or Long Term Visit Pass Plus\n(LTVP+)1 holder .\n(b) Pass all associated course assessment(s) during the course to obtain certification.\n(c) Pay the Nett Course Fee based on the SIT’s invoice :\n(i) Before  course  commencement for self -sponsored CET Learners ,\n(ii) Within sixty (60) days after course end date for company -sponsored CET Learners .\nNote : Nett Course Fee  refers to the course fee (inclusive of applicable GST) minus any\napplicable SSG course fee grant and other funding support.\n3.2 When using SSG grants, funding, and/or SkillsFuture Credit (“ SFC”), CET Learners  should refer\nto SSG’s terms and conditions for use of such funding as specified on SSG’s website. SIT will not\nbe responsible for any consequences arising for the CET Learner ’s non -compliance with SSG’s\nterms and conditions.\n3.3 For CET Learners  who are not eligible for SSG grant of funding, Nett Course Fee payable  must\nbe made in full after registration  and upon receiving SIT’s notification to do so. SIT reserves the\nright to revoke a CET Learner ’s enrolment should full payment not be received prior to course\ncommencement.\n4. PAYMENT\n4.1 CET Learners  are required to make fee payment based on the amount specified in the SIT\ninvoice.\n4.2 Partial or full payment using SFC  is considered  fulfilled only upon su ccessful receipt of the SFC\ndisbursement by SIT, after approval  by SSG.\n4.3 CET Learners  or companies (as the case may be)  will receive an invoice from SIT via email on\nthe Nett Course Fee (or full Course Fee, as the case may be)  payable. Once generated, SIT's\ninvoices cannot be modified. For subsequent written requests regarding change items on the\ninvoice, SIT reserves the right to impose a non -refundable administrative fee of S$40 (plus\nprevailing GST).\n4.4 We do not accept walk -in payments. Both self -sponsored and company -sponsored CET\nLearners  can make online payments through the SIT  course registration e -payment portal.\n1 The LTVP+ scheme currently applies to lawful foreign spouses of SCs with (i) at least one SC child or are expecting one from\nthe marriage, or at least three years of marriage, and (ii) where the SC sponsor is able to support the family. LTVP+ holders\ncan be identified with their green visit pass cards, with the word ‘PLUS’ on the back of the card.\nSINGAPORE INSTITUTE OF TECHNOLOGY        PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 3 of 7\nEffective: 1 Nov 2024  SIT Restricted  SIT Restricted  SIT Restricted\nOnline payment options include PayNow/SGQR, internet banking, credit card, or debit card.\nCompanies can also pay via bank transfer by following the instructions provided on the SIT\ninvoice.\n4.5 CET Learners  are solely  responsible for any bank charges incurred. SIT cannot be held liable for\ndelayed registration confirmation if the CET Learner  or company fails to provide sufficient\ninformation for correct course application  identification and tagging.\n5. COURSE  CHANGES AND CANCELLATION\n5.1 While SIT endeavours to  organise and conduct every  course , SIT reserves the right to cancel\nany course and/or m odify  the venue, trainer, course dates, and/or fees . For example, SIT may\ncancel a course  if the minimum  required  number of fee -paying CET Learners  (as determined\nby SIT at its sole discretion) is not met or due to  unforeseen circumstances . If SIT\ncancels/changes any course details:\n(a) CET Learners  will receive advance notification of such changes via email .\n(b) If a course :\n(i) has been  cancelled ; or\n(ii) is rescheduled  by SIT  and the CET Learner  duly inform SIT that he/she is unable to\nattend on the rescheduled date ;\nthe Nett Course Fee received  from the CET Learner  or company  will be refunded .\n5.2 CET Learners  should note that SIT may not maintain a waiting list for the rescheduled course .\n5.3 Except where otherwise informed , there will be no make -up lessons for classes missed by the\nCET Learner  due to course changes  for any reason.\n5.4 Except as provided  above, CET Learners  and sponsoring companies acknowledge and agree\nthat they  have no further  rights or claims  against SIT regarding course cancellation ,\nrescheduling , or failure to complete the course  for any reason.\n6. WITHDRAWAL CHARGES\n6.1 Once SIT has confirm ed the course  application in writing, CET Learners  and companies cannot\ndefer, switch, or find a replace ment to attend the course .\n6.2 To withdraw from a course , CET Learners  or companies (as the case may be)  must notify  SIT\nvia SITLEARN@singaporetech.edu.sg  with written justifications . No withdrawals are allowed\nSINGAPORE INSTITUTE OF TECHNOLOGY        PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 4 of 7\nEffective: 1 Nov 2024  SIT Restricted  SIT Restricted  SIT Restricted\nonce the course  has started  unless there are medical or compassionate reasons , and SIT retains\nthe right  to allow for withdrawal and/or waive the withdrawal charges (set out below) at its\nsole discretion .\n6.3 Withdrawals without written justifications  and/or n on-attendance is considered an absence,\nand withdrawal charges  as specified in Table 1  shall apply .\nTable 1. Withdrawal  charges  for all Courses\nConditions  Withdrawal\nCharges\n1A SIT has cancelled or  rescheduled the course\nNo charge\n1B CET Learner  did not attend any class and provided withdrawal notification\nto SIT more than 14 calendar days before the course  started\n1C CET Learner  did not attend any classes and provided withdrawal\nnotification to SIT between 7 and 14 calendar days (including both days)\nbefore the course  started.  50% of Nett\nCourse  Fee*\npayable\n1D CET Learner  did not attend any classes and provided withdrawal\nnotification to SIT less than 7 calendar days before the course  started.  100% of Nett\nCourse  Fee*\npayable  1E CET Learner  did not attend class and did not provide any prior notification\nabout their absence.\n* For situations where there is no SSG funding, the full unsubsidised fee applies.\n7. COURSE CERTIFICATE  AND ATTENDANCE\n7.1 Attendance -taking is mandatory. For SSG -funded courses, SSG has mandated the use of e -\nattendance via SingPass commencing from 1 Oct ober  2023  for real-time tracking of CET\nLearner  (aka the CET Learner) attendance and grant g overnance.\n7.2 CET Learners  will receive their certificate ( either as  a hard copy or digital certificate) if they\nmeet all these requirements :\n(a) Attain a minimum of 75% attendance ;\n(b) Pass all associated course assessments ; and\n(c) Fully pay the ir Nett Course Fee:\n(i) Self-sponsored CET Learners  with SSG grant or funding  having paid their fees\nbefore the course commences .\nSINGAPORE INSTITUTE OF TECHNOLOGY        PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 5 of 7\nEffective: 1 Nov 2024  SIT Restricted  SIT Restricted  SIT Restricted\n(ii) Company -sponsored CET Learners  with SSG grant  or funding  having paid  their fees\nwithin sixty (60) days after the course end date.\n7.3 Course certificates will be issued under the CET Learner ’s registered official full name. Changes\nto the CET Learner ’s name will only be accommodated according to their official identification\n(NRIC/FIN/passport or official ID).\n7.4 Any replacement will only be provided in a digital format. We will also provide  only  a digital\ncopy to replace any damaged  certificate.\n7.5 SIT reserves the right to :\n(a) Withhold or r evoke  course certificate s if CET Learners  have not fulfilled any of the\nrequirements set out in  paragraph 7.2 above ;\n(b) Withhold or revoke course certificates if CET Learners  violate any relevant SIT’s Code of\nConduct  for Learners ;\n(c) Retain course  fees if CET Learners  do not complete the course , with no refunds ; and\n(d) Recover unpaid  course fee s and deny future course admission, even if assessment and\nattendance requirements are met .\n7.6 In the event that CET Learner s fail any associated assessment during the course to obtain\ncertification , the CET Learner s will still be liable for 100% of Nett Course Fee payable and  may\nfurther no longer be eligible  for SSG grants/ subsidies  for that course .\n8. PERSONAL DATA\n8.1 SIT’s processing of personal data is governed by SIT’s Personal Data Protection Policy. In\naddition to the purposes for the collection, use and disclosure of personal data set out in the\npolicy, SIT may  also collect, process , disclose and retain CET Learner  personal data  (including\ndetails of CET Learner ’s employment status ) for the following purposes  (which  may be revised\nfrom time to time) :\n(a) Administering and verifying applications for course enrolment or eligibility for\ngovernment subsidies (such as for SSG) including issuing invoices to the CET Learner ;\n(b) Updating the CET Learners  about upcoming relevant courses, events and/or surveys ,\ncareer  and consultancy services,  through marketing communications ;\n(c) Facilitating the CET Learner ’s use of online services available on SIT's websites and/or\nthrough other digital communication channels;\nSINGAPORE INSTITUTE OF TECHNOLOGY        PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 6 of 7\nEffective: 1 Nov 2024  SIT Restricted  SIT Restricted  SIT Restricted\n(d) Conducting research or tracking the CET Learner ’s development and employability post -\ncourse  completion  (including contacting a CET Learner ’s employer) , as well as performing\nmarket -related or similar research and analysis for SIT's operational strategy and policy\nplanning ; and\n(e) Where the CET Learner  has applied for and is eligible for government agency  grants\nand/or subsidies, t o comply with SIT’s reporting and audit requirements to SSG and/or\nany other relevant government body/agency .\n8.2 For SSG-funded courses, SIT is also required  to preserve and/or disclose the CET Learners ’ data\nto SSG or its appointed auditor(s), vendor(s), and/or nominated representatives for conducting\nSSG-commissioned surveys under the ir Training Quality and Outcomes Measure (TRAQOM)\ninitiative, effectiveness surveys, audits related to courses, or any other purposes deemed\nappropriate by SSG.\n8.3 SIT may take photographs during course , including synchronous e-learning sessions , for\nvalidating attendance records or authenticating the CET Learner ’s identity in the course or\nprofessional examination organised by SIT .\n8.4 For enquiries relating to SIT’s use of personal data, please contact dpo@singaporetech.edu.sg\nor refer to SIT’s data protection policies at https://www.singaporetech.edu.sg/privacy -\nstatement  for more information .\n9. INTELLECTUAL PROPERTY\n9.1 All intellectual property  in materials  provided by SIT during the course will belong solely to SIT,\nand SIT shall grant to CET Learners  a non -exclusive,  non-transferable , non -sublicensable,\nroyalty -free license to use such materials . The CET Learner  shall not reproduce such materials\nwithout explicit written consent from SIT.\n9.2 SIT may  use commercially available tools to review the accuracy and relevancy of your\nsubmissions for course assessments . CET Learners  consent to SIT transferring  your submissions\nto external parties for the  purposes of review  and marking.\n10. GENERAL\n10.1 While courses are  designed for educational , learning  and training purposes, SIT does not\nguarantee specific results, examination success, mastery of disciplines or skills, or other\ntangible or intangible outcomes. SIT will not be held liable for any claims, losses, and damages\nincurred or sustained by the CET Learners  related to their application or course  attendance,\nexcept in cases of SIT’s own  gross  negligence or wilful misconduct.\nSINGAPORE INSTITUTE OF TECHNOLOGY        PUNGGOL COAST ROAD, SINGAPORE 828608       MAIN +65 6592 1189   FAX +65 6592 1190    SingaporeTech.edu.sg\nReg. No.: 200917667D\nPage 7 of 7\nEffective: 1 Nov 2024  SIT Restricted  SIT Restricted  SIT Restricted\n10.2 Unless otherwise specified, CET Learners  (especially those attending credit -bearing courses)\nwill agree to adhere to  SIT’s Code of  Conduct  for Learners  upon course enrolment and\nacknowledges that there may be consequences for breaching such codes/rules .\n10.3 SIT reserves the right to take appropriate actions, including informing law enforcement\nauthorities of serious violations, and imposing suspension or blacklisting upon the CET Learners\nin cases of misconduct, transgression, or infractions of a disciplinary nature or breaches\noccurring during participation in the CET course.\n10.4 SIT reserves the right  to amend course policies and processes without prior notice, effective\nupon publication on its website.\n10.5 The CET Terms & Conditions are governed by Singapore law, and the courts of Singapore have\nexclusive jurisdiction over any disputes arising out of or relating to them.  If any court finds that\nany provisions in these Terms & Conditions (or any part thereof) is invalid, illegal or\nunenforceable, that provision or part shall, to the extent required, be deemed to be deleted,\nand the validity and enforceability of the other provisions herein shall not be affected.\n***"
}