{
  "url": "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
  "title": "SkillsFuture Career Transition Programme | Singapore Institute of Technology",
  "meta": {
    "description": "The SCTP helps mid-career individuals gain industry skills and expand employment prospects with project opportunities, career support, and up to 95% funding.",
    "keywords": null
  },
  "text_lines": [
    "Skip to main content",
    "Manage My Account",
    "Mega menu",
    "Courses",
    "Dropdown",
    "Goals",
    "Dropdown",
    "For Organisations",
    "Insights",
    "Resources",
    "Dropdown",
    "Connect With Us",
    "Dropdown",
    "Business, Communication and Design",
    "Accounting and Finance",
    "Business Management",
    "Design Innovation",
    "Leadership and Communication",
    "View All",
    "Arrow",
    "Dropdown",
    "Engineering",
    "Building Services",
    "Civil Engineering",
    "Electrical Engineering",
    "Power and Clean Energy",
    "View All",
    "Arrow",
    "Dropdown",
    "Food, Chemical and Biotechnology",
    "Chemical Engineering",
    "Process Engineering",
    "Process Safety",
    "View All",
    "Arrow",
    "Dropdown",
    "Health and Social Sciences",
    "Elder Health and Rehabilitation",
    "Health Sciences",
    "Occupational Therapy",
    "Social Sciences",
    "View All",
    "Arrow",
    "Dropdown",
    "Infocomm Technology",
    "AI and Machine Learning",
    "Cybersecurity",
    "Data Science and Analytics",
    "Internet of Things",
    "View All",
    "Arrow",
    "Dropdown",
    "Search for Courses",
    "Course Brochure",
    "Course Finder",
    "Arrow",
    "Dropdown",
    "Take a Course",
    "Business, Communication and Design",
    "Engineering",
    "Food, Chemical and Biotechnology",
    "Health and Social Sciences",
    "Infocomm Technology",
    "Explore Courses",
    "Arrow",
    "Dropdown",
    "Earn Stackable Certificates",
    "Competency-based Stackable Micro-credential (CSM) Pathways",
    "Arrow",
    "Modular Certification Pathways",
    "Arrow",
    "Dropdown",
    "Obtain a Professional Certification",
    "Browse Professional Exams and Preparatory Courses",
    "Arrow",
    "Dropdown",
    "Make a Career Transition",
    "SkillsFuture Career Transition Programme",
    "Arrow",
    "Dropdown",
    "Lead with Impact",
    "Executive Education",
    "Arrow",
    "Dropdown",
    "Attend an Event",
    "Discover Upcoming Events",
    "Arrow",
    "Dropdown",
    "For SITizens",
    "Learn for Life",
    "Arrow",
    "Dropdown",
    "Funding",
    "Available Funding",
    "Arrow",
    "Dropdown",
    "Need Help?",
    "FAQ",
    "Arrow",
    "Dropdown",
    "Who We Are",
    "About Us",
    "Arrow",
    "Dropdown",
    "Let’s Connect",
    "Getting to SIT",
    "Contact Us",
    "Join Our Mailing List",
    "Arrow",
    "Dropdown",
    "Business, Communication and Design",
    "Accounting and Finance",
    "Business Management",
    "Design Innovation",
    "Leadership and Communication",
    "View All",
    "Arrow",
    "Dropdown",
    "Engineering",
    "Building Services",
    "Civil Engineering",
    "Electrical Engineering",
    "Power and Clean Energy",
    "View All",
    "Arrow",
    "Dropdown",
    "Food, Chemical and Biotechnology",
    "Chemical Engineering",
    "Process Engineering",
    "Process Safety",
    "View All",
    "Arrow",
    "Dropdown",
    "Health and Social Sciences",
    "Elder Health and Rehabilitation",
    "Health Sciences",
    "Occupational Therapy",
    "Social Sciences",
    "View All",
    "Arrow",
    "Dropdown",
    "Infocomm Technology",
    "AI and Machine Learning",
    "Cybersecurity",
    "Data Science and Analytics",
    "Internet of Things",
    "View All",
    "Arrow",
    "Dropdown",
    "Search for Courses",
    "Course Brochure",
    "Course Finder",
    "Arrow",
    "Dropdown",
    "Take a Course",
    "Business, Communication and Design",
    "Engineering",
    "Food, Chemical and Biotechnology",
    "Health and Social Sciences",
    "Infocomm Technology",
    "Explore Courses",
    "Arrow",
    "Dropdown",
    "Earn Stackable Certificates",
    "Competency-based Stackable Micro-credential (CSM) Pathways",
    "Arrow",
    "Modular Certification Pathways",
    "Arrow",
    "Dropdown",
    "Obtain a Professional Certification",
    "Browse Professional Exams and Preparatory Courses",
    "Arrow",
    "Dropdown",
    "Make a Career Transition",
    "SkillsFuture Career Transition Programme",
    "Arrow",
    "Dropdown",
    "Lead with Impact",
    "Executive Education",
    "Arrow",
    "Dropdown",
    "Attend an Event",
    "Discover Upcoming Events",
    "Arrow",
    "Dropdown",
    "For SITizens",
    "Learn for Life",
    "Arrow",
    "Dropdown",
    "Funding",
    "Available Funding",
    "Arrow",
    "Dropdown",
    "Need Help?",
    "FAQ",
    "Arrow",
    "Dropdown",
    "Who We Are",
    "About Us",
    "Arrow",
    "Dropdown",
    "Let’s Connect",
    "Getting to SIT",
    "Contact Us",
    "Join Our Mailing List",
    "Arrow",
    "Dropdown",
    "Mega menu",
    "< Back",
    "Courses",
    "Dropdown",
    "Goals",
    "Dropdown",
    "For Organisations",
    "Insights",
    "Resources",
    "Dropdown",
    "Connect With Us",
    "Dropdown",
    "Quick Links",
    "Manage My Account",
    ".page-node-type-programme #how-to-apply {\n    height: auto;\n  }",
    "Home",
    "SkillsFuture Career Transition Programme",
    "SkillsFuture Career Transition Programme",
    "Switch career or enhance your prospects with in-demand skills and personalised career support at SITLEARN.",
    "Eligible for SkillsFuture funding, credits offset & training allowance.",
    "Are you a mid-career professional pivoting to a new field or seeking critical skills and guidance that’ll enhance your career outlook?",
    "You've come to the right place.",
    "SkillsFuture Career Transition Programme (SCTP)",
    "A train-and-place initiative by SkillsFuture, designed to support mid-career individuals in Singapore thrive in the fast-changing world.",
    "With a focus on sectors with good hiring opportunities, the programme aims to help you acquire industry-relevant skills to improve your employability and to enable you in your transition to new sectors or job roles with confidence.",
    "Why enrol into SCTP at SIT",
    "LEARN",
    "?",
    "Develop Applicable, In-Demand Skills",
    "Our signature \"Learning by Doing\" teaching approach ensures you gain practical, hands-on experience and skills that you can directly apply in real-world situations. You'll be ready to hit the ground running.",
    "Earn Industry-Recognised Certifications",
    "Achieve certifications that are valued by industry leaders, such as the Green Belt in Lean Six-Sigma. These credentials will enhance your professional profile and open doors to new opportunities.",
    "Balance Your Training with Your Daily Life",
    "With a combination of weekday evening and weekend classes in blended format, our training sessions are designed to fit seamlessly into your busy schedule.",
    "Access Generous Financial Support",
    "Our courses are eligible for SkillsFuture funding and training allowance so you can invest in your future without financial strain. Eligible learners get up to 95% funding on course fees along with up to S$3,000 monthly allowance.",
    "Learn more about our SCTP programme",
    "Download Programme Brochure Now",
    "Programmes Available Under SCTP",
    "Infocomm Technology",
    "(SCTP) Cloud Computing and DevOps Programme",
    "A 4+ month programme that equips learners with cloud and DevOps skills to enhance agility, efficiency, and competitiveness in digital environments.",
    "calendar-day",
    "Refer to schedule",
    "clock-five",
    "4+ months",
    "dollar-sign",
    "Refer to schedule",
    "Up to 95% SF Funding",
    "Upcoming Course Dates:",
    "Starting 14 Oct 2025",
    "tag",
    "Cloud Computing, Project Management, Programming and Software Development, Career Growth and Transition",
    "Infocomm Technology",
    "(SCTP) Data Analytics and Business Intelligence Programme",
    "A 4+ month programme covering data analytics, with hands-on experience using tools like SQL, Python, and Tableau for practical industry applications.",
    "calendar-day",
    "Refer to schedule",
    "clock-five",
    "4+ months",
    "dollar-sign",
    "Refer to schedule",
    "Up to 95% Course Fees Funding & Up to $3,000 Monthly Training Allowance",
    "Upcoming Course Dates:",
    "16 Jun – 18 Oct 2025",
    "tag",
    "Data Science and Analytics, Business Management, Career Growth and Transition",
    "Business, Communication and Design",
    "(SCTP) Digital Product Management Programme",
    "A 3+ month programme covering digital product management, agile methods, UX design, and metrics, preparing you for CSPO certification.",
    "calendar-day",
    "Refer to schedule",
    "clock-five",
    "3+ months",
    "dollar-sign",
    "Refer to schedule",
    "Up to 95% Course Fees Funding & Up to $3,000 Monthly Training Allowance",
    "Upcoming Course Dates:",
    "14 Jul – 25 Oct 2025",
    "tag",
    "Business Management, Project Management, Career Growth and Transition",
    "Infocomm Technology",
    "(SCTP) Full Stack Software Development Programme",
    "A 4+ month programme that teaches essential front-end and back-end skills, including HTML, JavaScript, and React, for software development.",
    "calendar-day",
    "Refer to schedule",
    "clock-five",
    "4+ months",
    "dollar-sign",
    "Refer to schedule",
    "Up to 95% SF Funding",
    "Upcoming Course Dates:",
    "Starting 9 Sep 2025",
    "tag",
    "Programming and Software Development, Business Management, Career Growth and Transition",
    "Business, Communication and Design",
    "(SCTP) Programme in Design Innovation",
    "A 3-4 month module that equips mid-career individuals with design innovation skills to address early-stage company challenges through omni-channel solutions.",
    "calendar-day",
    "Refer to schedule",
    "clock-five",
    "3+ months",
    "dollar-sign",
    "Refer to schedule",
    "Up to 95% SF + UTAP Funding",
    "Stackable towards:",
    "Postgraduate Certificate in Design Strategy and Innovation",
    "tag",
    "Design Innovation, Business Management, Career Growth and Transition",
    "Business, Communication and Design",
    "(SCTP) Programme for the Lean Six Sigma Champion and Operational Excellence Manager",
    "A 3 months programme designed specifically for mid-career professionals aiming to elevate proficiency in Lean and Six Sigma methodologies.",
    "calendar-day",
    "Refer to schedule",
    "clock-five",
    "3 months",
    "dollar-sign",
    "Refer to schedule",
    "Up to 95% SF + UTAP Funding",
    "tag",
    "Lean and Six Sigma, Business Management",
    "Infocomm Technology",
    "(SCTP) UX/UI Design Programme",
    "A 3+ month programme that equips learners with user-centric design skills to enhance customer satisfaction and create impactful UI/UX solutions.",
    "calendar-day",
    "Refer to schedule",
    "clock-five",
    "3+ months",
    "dollar-sign",
    "Refer to schedule",
    "Up to 95% Course Fees Funding & Up to $3,000 Monthly Training Allowance",
    "tag",
    "User Experience Design, Design Innovation, Career Growth and Transition",
    "Experienced Career Coach to Support You",
    "Whether you need guidance on skills or fields to pursue, have questions on how our programme could be of support to you, our career coach, Joe, is ready to help.",
    "Meet Joe Leong: Your Career Coach",
    "Joe Leong is a dedicated and experienced career coach specialising in helping mid-career professionals navigate their career transitions and up-level their skills. With a strong background in career development and a passion for empowering individuals, Joe has successfully guided numerous professionals towards achieving their career goals.",
    "Your Programme Journey",
    "Apply for Programme & Funding",
    "Apply for your selected SCTP programme and SkillsFuture subsidies and Training Allowance",
    "Receive Application & Training Allowance Offer",
    "Receive updates on your applications via emails",
    "Attend & Complete Programme",
    "Be sure to meet programme and funding requirements for certificate and fundings",
    "Participate in Career Support Activities",
    "Attend career preparation workshops and leverage employment facilitation services*",
    "* SIT will aid career advisory and connect trainees to government agencies and its relevant employers in their search for relevant jobs. However, SIT cannot guarantee job placements at the end of the programme even though SIT will make an effort to support trainees in their job search.",
    "Financial Support As You Train",
    "SkillsFuture Course Fee Funding Support",
    "Eligible Individuals",
    "Funding Category",
    "Funding Amount",
    "Singapore Citizens, Permanent Residents, and Long-Term Visit Pass-Plus (LTVP+) Holders",
    "Self-sponsored learners (either unemployed or in-employment individuals)",
    "At least 21 years old",
    "Singapore Citizen (Below 40) / Singapore PR / LTVP+ Holder",
    "Up to 70% of course fees",
    "Singapore Citizen (40 & above)",
    "Funded under SkillsFuture Mid-Career Enhanced Subsidy (MCES)",
    "Up to 90% of course fees",
    "Singapore Citizen who meets the additional course fee funding support criteria*",
    "Up to 95% of course fees",
    "SkillsFuture Credit",
    "Learners may also use their SkillsFuture Credit and Additional SkillsFuture Credit (Mid-Career Support) to further offset out-of-pocket course fees.",
    "SkillsFuture Mid-Career Training Allowance",
    "Eligible Individuals",
    "Eligible Programmes",
    "Allowance Amount",
    "Allowance Duration",
    "Singapore Citizens, aged 40 and above",
    "All SCTPs at SIT",
    "LEARN",
    "that start from 1 April 2025 and onwards",
    "50% of your average income over the latest available 12-month period, capped at S$3,000 per month",
    "Use Training Allowance Calculator",
    "Capped at a total period of 24 months over an individual's lifetime",
    "Note:",
    "* Individuals who fall into either of the following categories:",
    "–",
    "Long-term unemployed individuals; or",
    "–",
    "Persons with disabilities; or",
    "–",
    "Individuals in need of financial assistance – ComCare Short-to-Medium Term Assistance (SMTA) recipients or Workfare Income Supplement (WIS) recipients",
    "Trainees may also use SkillsFuture Credit and Additional SkillsFuture Credit (Mid-Career Support) to offset out-of-pocket course fees.",
    "Frequently Asked Questions",
    "SCTP at SIT",
    "LEARN",
    "chevron--up",
    "Who is eligible for SCTP?",
    "The SCTP is open to all Singapore Citizens and Permanent Residents, particularly mid-career individuals looking to transition to new sectors or job roles. Both employed and unemployed individuals are eligible.",
    "chevron--up",
    "What is the duration of a SCTP at SITLEARN?",
    "The duration of a SCTP at SIT",
    "LEARN",
    "typically ranges from four to six months, depending on the specific programme and its requirements.",
    "chevron--up",
    "Will the programme lead to job placements for me?",
    "While our SCTP provides career advisory and employment facilitation services to help you in your job search, it does not guarantee job placements. You are encouraged to be proactive and open to job opportunities available.",
    "chevron--up",
    "Will I need to have certain minimum academic qualifications to sign up for the SCTP?",
    "Minimum academic qualifications may be required for some SCTPs. You will be assessed by our SIT",
    "LEARN",
    "admission and review committee on your suitability for our programme prior to enrolment.",
    "chevron--up",
    "Can I take up another course under the SCTP if I have not managed to find a job after completing a course?",
    "Yes, you can take up another SCTP if you have not managed to find a job after completing a course. However, your suitability for the new course will be assessed by SIT",
    "LEARN",
    "admission and review committee.",
    "chevron--up",
    "Do I need to pay the full amount of course fees first then receive SkillsFuture Funding after?",
    "No, you do not need to pay the full amount of course fees upfront. Different tier of SkillsFuture Funding is applied directly to the course fees, reducing the amount you need to pay out-of-pocket.",
    "chevron--up",
    "Can I use my SkillsFuture Credit and additional SkillsFuture Credit (Mid-Career Support) to offset the out-of-pocket course fees payable?",
    "Yes, you can use your SkillsFuture Credit and additional SkillsFuture Credit (Mid-Career Support) to offset the out-of-pocket course fees payable for SCTP.",
    "chevron--up",
    "Can I attend 2 SCTP programmes concurrently?",
    "No. You cannot enrol in two SCTP programmes at the same time, whether full-time or part-time, if they overlap. You must complete one SCTP before starting another.",
    "chevron--up",
    "Can I re-attend the same SCTP programme that I have completed previously?",
    "No. You cannot re-attend the same SCTP programme you have completed previously.",
    "SkillsFuture Course Funding Support",
    "chevron--up",
    "How do I know if I qualify for SkillsFuture Course Fees Funding Support?",
    "Singapore Citizens, Permanent Residents and LTVP+ holders are eligible for SkillsFuture Course Fees Funding Support on SkillsFuture supported courses.",
    "chevron--up",
    "If I fail the programme or drop out, what will happen to the funding I’ve received?",
    "If you fail the programme or drop out without a valid reason, you may be required to refund the course fee subsidy you received. Trainees are encouraged to complete all modules and pass the assessments to fully benefit from the programme and retain the funding support.",
    "chevron--up",
    "What if I turn 40 years old in the middle of the programme?",
    "If you turn 40 years old during the programme, you will become eligible for the Mid-Career Enhanced Subsidy from the month you turn 40. This subsidy can cover up to 90% of programme fees.",
    "SkillsFuture Mid-Career Training Allowance (TA)",
    "chevron--up",
    "Who is eligible for SkillsFuture Mid-Career Training Allowance?",
    "Singapore Citizens aged 40 years old and above are eligible for SkillsFuture Mid-Career Training Allowance when they enrol into full-time TA Elgiible SCTPs.",
    "chevron--up",
    "When do I apply for SkillsFuture Mid-Career Training Allowance?",
    "You can submit your Training Allowance application up to three (3) months before the programme start date.",
    "chevron--up",
    "Can I be employed and still be eligible for the SkillsFuture Mid-Career Training Allowance when enrolling into a full-time SCTP?",
    "You can be employed and still apply for the Training Allowance for an eligible full-time training programme. Individuals must meet the full-time training intensity and programme requirements each month in order to receive the monthly payout.",
    "chevron--up",
    "How do I know how many months of SkillsFuture Mid-Career Training Allowance payout I will receive for the application?",
    "The maximum eligible period in the application refers to the maximum number of months you can receive for the Training Allowance. The actual number of months you will receive for the Training Allowance depends on the actual course duration and fulfilment of the training requirements each month.",
    "chevron--up",
    "How is my monthly TA computed?",
    "It is computed based on the latest available 12 months of income data from Government records (E.g CPF Board, IRAS) as of course start date.",
    "chevron--up",
    "What if my course has been deferred or cancelled?",
    "Your TA application will be cancelled, and you will need to re-submit a TA application where your SCTP enrolment will be treated as a new SCTP enrolment.",
    "chevron--up",
    "What are the programme requirements I need to fulfil in order to receive the monthly training allowances?",
    "You will need to fulfil a minimum of 75% attendance of trainer led sessions for each of the training month of the programme.",
    "For Employers",
    "Partner with SIT",
    "LEARN",
    "to",
    "Recruit Skilled Professionals for Your Organisation",
    "SPEAK WITH US TODAY",
    "About SIT",
    "LEARN",
    "SIT",
    "LEARN",
    "is the lifelong learning division of the Singapore Institute of Technology, Singapore's first University of Applied Learning. SIT",
    "LEARN",
    "is dedicated to providing high-quality, industry-relevant training and education to professionals and mid-career individuals. Through its innovative Applied Learning approach, SIT",
    "LEARN",
    "equips learners with practical skills and knowledge that are directly applicable in the workplace, helping them stay competitive in the evolving job market.",
    "Explore More Courses",
    "Discover courses that can enhance your skillset, elevate your career, and take it to the next level.",
    "Take a Course",
    "Our portfolio of short SkillsFuture-funded courses will help you contextualise and apply concepts to tackle real-world challenges.",
    "Learn more",
    "Earn Stackable Certificates",
    "Whether you are looking to enhance your skills or explore new areas of expertise, our learning pathways provide the flexibility and recognition you need to succeed.",
    "Learn more",
    "Obtain a Professional Certification",
    "Advance your career with industry-recognised licences and certificates through preparatory courses or examinations.",
    "Learn more",
    "Transform Your Organisation",
    "Tailored to your organisation's specific training needs, custom courses enable you to grow key talent and specialist expertise to meet the future demands of work.",
    "Learn more",
    "Stay informed.",
    "Be inspired.",
    "Subscribe now and receive our brochure for the latest updates on our courses, events and insights.",
    "Latest in-demand courses",
    "Upcoming information sessions and events",
    "Thought-provoking insights and stories",
    "First Name",
    "*",
    "Last Name",
    "*",
    "Email",
    "*",
    "Interests (You may choose more than 1)",
    "*",
    "Business, Communication and Design",
    "Engineering",
    "Food, Chemical and Biotechnology",
    "Health and Social Sciences",
    "Infocomm Technology",
    "Please select at least 1 interest.",
    "By clicking \"Subscribe\", you agree to our \"",
    "Terms of Use",
    "\" and also agree that SIT (and its service providers and agents) may collect, use, disclose and/or process your personal data to send you information related to the topic(s) of interest you have selected above, which may include information on courses, seminars, events, resources and/or surveys offered by SIT and/or its Overseas University partners.",
    "We look forward to journeying with you on your path of lifelong learning. You can manage your preferences or unsubscribe at any time through the links provided in our communications. To learn more about how SIT protects your personal data, you may refer to SIT's Personal Data Protection Policy",
    "here",
    ".",
    "updateCheckboxVal(\"Interest_BCD\");\n    updateCheckboxVal(\"Interest_ENG\");\n    updateCheckboxVal(\"Interest_FCB\");\n    updateCheckboxVal(\"Interest_HSS\");\n    updateCheckboxVal(\"Interest_ICT\");\n\n    function updateCheckboxVal(attrName) {\n        if (attrName) {\n            var checkboxName = attrName + \"_checkbox\";\n            var intAttr = document.getElementsByName(attrName);\n            var intCheckbox = document.getElementsByName(checkboxName);\n            if (intCheckbox && intAttr) {\n                intAttr[0].value = intCheckbox[0].checked;\n            }\n        }\n    }\n\n    function updatesUponSubmit() {\n        var checkboxes = document.querySelectorAll('[data-group=\"check-box-group\"]');\n        var boxSelected = false;\n        for (var i = 0, l = checkboxes.length; i < l; i++) {\n            if (checkboxes[i].checked) {\n                boxSelected = true;\n                break;\n            }\n        }\n        if (boxSelected) {\n            var gmt8Date = new Date().toLocaleDateString(\"en-US\", { timeZone: \"Asia/Singapore\" });\n            const now = new Date().toUTCString();\n            var optinEmailDate = document.getElementsByName(\"OptinEmailDate\");\n            var createdDate = document.getElementsByName(\"CreatedDate\");\n            var formSubmissionDate = document.getElementsByName(\"FormSubmissionDate\");\n            var primaryKey = document.getElementsByName(\"PrimaryKey\");\n            var getEmail = document.getElementById(\"email\").value;\n            var getWebsource = document.getElementById(\"websourceID\").value;\n\n            optinEmailDate[0].value = now;\n            createdDate[0].value = now;\n            formSubmissionDate[0].value = now;\n            primaryKey[0].value = getEmail + getWebsource + gmt8Date;\n\t\t\t\n            updateCheckboxVal(\"Interest_BCD\");\n            updateCheckboxVal(\"Interest_ENG\");\n            updateCheckboxVal(\"Interest_FCB\");\n            updateCheckboxVal(\"Interest_HSS\");\n            updateCheckboxVal(\"Interest_ICT\");\n\t\t\t\n        } else {\n            var checkboxes = document.querySelector('.error-message');\n            checkboxes.classList.add('active');\n            return false;\n        }\n    }",
    "#block-announcement-popup {\n display: none;\n}",
    "New Engineering Micro-credentials Launching Soon!",
    "Exciting news! We are introducing new micro-credentials in Electrical and Electronic Engineering & Infrastructure and Systems Engineering. Be among the first to know by registering your interest today!",
    "Register now →",
    "SIT reserves the right to make changes to published course information, including dates, times, venues, fees and instructors without prior notice.",
    "Address",
    "1 Punggol Coast Road Singapore 828608",
    "Contact Us",
    "Send an Enquiry",
    "Visiting SIT",
    "Our Campus Locations",
    "Privacy Statement",
    "Safety and Health",
    "Social Media Guidelines",
    "Terms of Use",
    "Whistleblowing",
    "CET Course Terms & Conditions",
    "Copyright ©",
    "2025",
    "Singapore Institute of Technology. All Rights Reserved.",
    ".contact-link2 a:link,  .contact-link2 a:visited {\n    border-bottom:0px;\n}",
    "{\"path\":{\"baseUrl\":\"\\/sitlearn\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/17\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"ajaxPageState\":{\"libraries\":\"eJyNkmFuwyAMhS9EQtULIQNOw2piZKBtdvqRJmtSbZr2B7332QbZxhJ8ztoG7uEDHsqudjk37QhyppDL5onBbzIxzUMg-rbCMWTcnMCwqTvapNwVfSgsRhB8ZEH9gyjHxGL5oT0OUKm8gAkThamVvHs18FTgjpkj6oPu8-3yV6zPY4iKYOZajK2BPIrJNRTUK-w22FnI2FGwAjL_q-AJXxWxdQi6jaig9A5SCTypBAIXgTRm7aUmoH4nfZ1StW3aI3qVQ0yEJnGqyVhid836F9byijmfzicNzrH49oZZL94jFqSb4LaDC7E9JoxtB7uLONV3917dBCHIdCBJWuNPv6QbuyzVSY1Wu5oLR5XnXDDqZaLqFvCe9fNcv90RRPaV8AvDS_2N\",\"theme\":\"sit_2020\",\"theme_token\":null},\"ajaxTrustedUrl\":[],\"colorbox\":{\"transition\":\"elastic\",\"speed\":350,\"opacity\":0.84999999999999998,\"slideshow\":false,\"slideshowAuto\":true,\"slideshowSpeed\":2500,\"slideshowStart\":\"start slideshow\",\"slideshowStop\":\"stop slideshow\",\"current\":\"{current} of {total}\",\"previous\":\"\\u00ab Prev\",\"next\":\"Next \\u00bb\",\"close\":\"Close\",\"overlayClose\":true,\"returnFocus\":true,\"maxWidth\":\"85%\",\"maxHeight\":\"80%\",\"initialWidth\":\"1%\",\"initialHeight\":\"1%\",\"fixed\":true,\"scrolling\":true,\"mobiledetect\":false,\"mobiledevicewidth\":\"480px\"},\"simple_popup_blocks\":{\"settings\":[]},\"lazyLoadUrl\":\"\\/sitlearn\\/term_reference_fancytree\\/subTree\",\"blazy\":{\"loadInvisible\":false,\"offset\":100,\"saveViewportOffsetDelay\":50,\"validateDelay\":25,\"container\":\"\",\"loader\":true,\"unblazy\":false,\"visibleClass\":false},\"blazyIo\":{\"disconnect\":false,\"rootMargin\":\"0px\",\"threshold\":[0,0.25,0.5,0.75,1]},\"views\":{\"ajax_path\":\"\\/sitlearn\\/views\\/ajax\",\"ajaxViews\":{\"views_dom_id:31cbedf903e62297592f318c5642de6ff5d025db6bef8ace399c5cac6afe707b\":{\"view_name\":\"event\",\"view_display_id\":\"block_3_upcoming_events\",\"view_args\":\"all\",\"view_path\":\"\\/node\\/17\",\"view_base_path\":null,\"view_dom_id\":\"31cbedf903e62297592f318c5642de6ff5d025db6bef8ace399c5cac6afe707b\",\"pager_element\":0}}},\"user\":{\"uid\":0,\"permissionsHash\":\"6865a5a4a677c61446c24b3c09f1809962249dff5b0b68c3d1096b60d4557c4b\"}}"
  ],
  "desc_divs": [
    "A 4+ month programme that equips learners with cloud and DevOps skills to enhance agility, efficiency, and competitiveness in digital environments.",
    "A 4+ month programme covering data analytics, with hands-on experience using tools like SQL, Python, and Tableau for practical industry applications.",
    "A 3+ month programme covering digital product management, agile methods, UX design, and metrics, preparing you for CSPO certification.",
    "A 4+ month programme that teaches essential front-end and back-end skills, including HTML, JavaScript, and React, for software development.",
    "A 3-4 month module that equips mid-career individuals with design innovation skills to address early-stage company challenges through omni-channel solutions.",
    "A 3 months programme designed specifically for mid-career professionals aiming to elevate proficiency in Lean and Six Sigma methodologies.",
    "A 3+ month programme that equips learners with user-centric design skills to enhance customer satisfaction and create impactful UI/UX solutions.",
    "Apply for your selected SCTP programme and SkillsFuture subsidies and Training Allowance",
    "Receive updates on your applications via emails",
    "Be sure to meet programme and funding requirements for certificate and fundings",
    "Attend career preparation workshops and leverage employment facilitation services*"
  ],
  "article_texts": [
    "SkillsFuture Career Transition Programme\nSwitch career or enhance your prospects with in-demand skills and personalised career support at SITLEARN.\nEligible for SkillsFuture funding, credits offset & training allowance.\nAre you a mid-career professional pivoting to a new field or seeking critical skills and guidance that’ll enhance your career outlook?\nYou've come to the right place.\nSkillsFuture Career Transition Programme (SCTP)\nA train-and-place initiative by SkillsFuture, designed to support mid-career individuals in Singapore thrive in the fast-changing world.\nWith a focus on sectors with good hiring opportunities, the programme aims to help you acquire industry-relevant skills to improve your employability and to enable you in your transition to new sectors or job roles with confidence.\nWhy enrol into SCTP at SIT\nLEARN\n?\nDevelop Applicable, In-Demand Skills\nOur signature \"Learning by Doing\" teaching approach ensures you gain practical, hands-on experience and skills that you can directly apply in real-world situations. You'll be ready to hit the ground running.\nEarn Industry-Recognised Certifications\nAchieve certifications that are valued by industry leaders, such as the Green Belt in Lean Six-Sigma. These credentials will enhance your professional profile and open doors to new opportunities.\nBalance Your Training with Your Daily Life\nWith a combination of weekday evening and weekend classes in blended format, our training sessions are designed to fit seamlessly into your busy schedule.\nAccess Generous Financial Support\nOur courses are eligible for SkillsFuture funding and training allowance so you can invest in your future without financial strain. Eligible learners get up to 95% funding on course fees along with up to S$3,000 monthly allowance.\nLearn more about our SCTP programme\nDownload Programme Brochure Now\nProgrammes Available Under SCTP\nInfocomm Technology\n(SCTP) Cloud Computing and DevOps Programme\nA 4+ month programme that equips learners with cloud and DevOps skills to enhance agility, efficiency, and competitiveness in digital environments.\ncalendar-day\nRefer to schedule\nclock-five\n4+ months\ndollar-sign\nRefer to schedule\nUp to 95% SF Funding\nUpcoming Course Dates:\nStarting 14 Oct 2025\ntag\nCloud Computing, Project Management, Programming and Software Development, Career Growth and Transition\nInfocomm Technology\n(SCTP) Data Analytics and Business Intelligence Programme\nA 4+ month programme covering data analytics, with hands-on experience using tools like SQL, Python, and Tableau for practical industry applications.\ncalendar-day\nRefer to schedule\nclock-five\n4+ months\ndollar-sign\nRefer to schedule\nUp to 95% Course Fees Funding & Up to $3,000 Monthly Training Allowance\nUpcoming Course Dates:\n16 Jun – 18 Oct 2025\ntag\nData Science and Analytics, Business Management, Career Growth and Transition\nBusiness, Communication and Design\n(SCTP) Digital Product Management Programme\nA 3+ month programme covering digital product management, agile methods, UX design, and metrics, preparing you for CSPO certification.\ncalendar-day\nRefer to schedule\nclock-five\n3+ months\ndollar-sign\nRefer to schedule\nUp to 95% Course Fees Funding & Up to $3,000 Monthly Training Allowance\nUpcoming Course Dates:\n14 Jul – 25 Oct 2025\ntag\nBusiness Management, Project Management, Career Growth and Transition\nInfocomm Technology\n(SCTP) Full Stack Software Development Programme\nA 4+ month programme that teaches essential front-end and back-end skills, including HTML, JavaScript, and React, for software development.\ncalendar-day\nRefer to schedule\nclock-five\n4+ months\ndollar-sign\nRefer to schedule\nUp to 95% SF Funding\nUpcoming Course Dates:\nStarting 9 Sep 2025\ntag\nProgramming and Software Development, Business Management, Career Growth and Transition\nBusiness, Communication and Design\n(SCTP) Programme in Design Innovation\nA 3-4 month module that equips mid-career individuals with design innovation skills to address early-stage company challenges through omni-channel solutions.\ncalendar-day\nRefer to schedule\nclock-five\n3+ months\ndollar-sign\nRefer to schedule\nUp to 95% SF + UTAP Funding\nStackable towards:\nPostgraduate Certificate in Design Strategy and Innovation\ntag\nDesign Innovation, Business Management, Career Growth and Transition\nBusiness, Communication and Design\n(SCTP) Programme for the Lean Six Sigma Champion and Operational Excellence Manager\nA 3 months programme designed specifically for mid-career professionals aiming to elevate proficiency in Lean and Six Sigma methodologies.\ncalendar-day\nRefer to schedule\nclock-five\n3 months\ndollar-sign\nRefer to schedule\nUp to 95% SF + UTAP Funding\ntag\nLean and Six Sigma, Business Management\nInfocomm Technology\n(SCTP) UX/UI Design Programme\nA 3+ month programme that equips learners with user-centric design skills to enhance customer satisfaction and create impactful UI/UX solutions.\ncalendar-day\nRefer to schedule\nclock-five\n3+ months\ndollar-sign\nRefer to schedule\nUp to 95% Course Fees Funding & Up to $3,000 Monthly Training Allowance\ntag\nUser Experience Design, Design Innovation, Career Growth and Transition\nExperienced Career Coach to Support You\nWhether you need guidance on skills or fields to pursue, have questions on how our programme could be of support to you, our career coach, Joe, is ready to help.\nMeet Joe Leong: Your Career Coach\nJoe Leong is a dedicated and experienced career coach specialising in helping mid-career professionals navigate their career transitions and up-level their skills. With a strong background in career development and a passion for empowering individuals, Joe has successfully guided numerous professionals towards achieving their career goals.\nYour Programme Journey\nApply for Programme & Funding\nApply for your selected SCTP programme and SkillsFuture subsidies and Training Allowance\nReceive Application & Training Allowance Offer\nReceive updates on your applications via emails\nAttend & Complete Programme\nBe sure to meet programme and funding requirements for certificate and fundings\nParticipate in Career Support Activities\nAttend career preparation workshops and leverage employment facilitation services*\n* SIT will aid career advisory and connect trainees to government agencies and its relevant employers in their search for relevant jobs. However, SIT cannot guarantee job placements at the end of the programme even though SIT will make an effort to support trainees in their job search.\nFinancial Support As You Train\nSkillsFuture Course Fee Funding Support\nEligible Individuals\nFunding Category\nFunding Amount\nSingapore Citizens, Permanent Residents, and Long-Term Visit Pass-Plus (LTVP+) Holders\nSelf-sponsored learners (either unemployed or in-employment individuals)\nAt least 21 years old\nSingapore Citizen (Below 40) / Singapore PR / LTVP+ Holder\nUp to 70% of course fees\nSingapore Citizen (40 & above)\nFunded under SkillsFuture Mid-Career Enhanced Subsidy (MCES)\nUp to 90% of course fees\nSingapore Citizen who meets the additional course fee funding support criteria*\nUp to 95% of course fees\nSkillsFuture Credit\nLearners may also use their SkillsFuture Credit and Additional SkillsFuture Credit (Mid-Career Support) to further offset out-of-pocket course fees.\nSkillsFuture Mid-Career Training Allowance\nEligible Individuals\nEligible Programmes\nAllowance Amount\nAllowance Duration\nSingapore Citizens, aged 40 and above\nAll SCTPs at SIT\nLEARN\nthat start from 1 April 2025 and onwards\n50% of your average income over the latest available 12-month period, capped at S$3,000 per month\nUse Training Allowance Calculator\nCapped at a total period of 24 months over an individual's lifetime\nNote:\n* Individuals who fall into either of the following categories:\n–\nLong-term unemployed individuals; or\n–\nPersons with disabilities; or\n–\nIndividuals in need of financial assistance – ComCare Short-to-Medium Term Assistance (SMTA) recipients or Workfare Income Supplement (WIS) recipients\nTrainees may also use SkillsFuture Credit and Additional SkillsFuture Credit (Mid-Career Support) to offset out-of-pocket course fees.\nFrequently Asked Questions\nSCTP at SIT\nLEARN\nchevron--up\nWho is eligible for SCTP?\nThe SCTP is open to all Singapore Citizens and Permanent Residents, particularly mid-career individuals looking to transition to new sectors or job roles. Both employed and unemployed individuals are eligible.\nchevron--up\nWhat is the duration of a SCTP at SITLEARN?\nThe duration of a SCTP at SIT\nLEARN\ntypically ranges from four to six months, depending on the specific programme and its requirements.\nchevron--up\nWill the programme lead to job placements for me?\nWhile our SCTP provides career advisory and employment facilitation services to help you in your job search, it does not guarantee job placements. You are encouraged to be proactive and open to job opportunities available.\nchevron--up\nWill I need to have certain minimum academic qualifications to sign up for the SCTP?\nMinimum academic qualifications may be required for some SCTPs. You will be assessed by our SIT\nLEARN\nadmission and review committee on your suitability for our programme prior to enrolment.\nchevron--up\nCan I take up another course under the SCTP if I have not managed to find a job after completing a course?\nYes, you can take up another SCTP if you have not managed to find a job after completing a course. However, your suitability for the new course will be assessed by SIT\nLEARN\nadmission and review committee.\nchevron--up\nDo I need to pay the full amount of course fees first then receive SkillsFuture Funding after?\nNo, you do not need to pay the full amount of course fees upfront. Different tier of SkillsFuture Funding is applied directly to the course fees, reducing the amount you need to pay out-of-pocket.\nchevron--up\nCan I use my SkillsFuture Credit and additional SkillsFuture Credit (Mid-Career Support) to offset the out-of-pocket course fees payable?\nYes, you can use your SkillsFuture Credit and additional SkillsFuture Credit (Mid-Career Support) to offset the out-of-pocket course fees payable for SCTP.\nchevron--up\nCan I attend 2 SCTP programmes concurrently?\nNo. You cannot enrol in two SCTP programmes at the same time, whether full-time or part-time, if they overlap. You must complete one SCTP before starting another.\nchevron--up\nCan I re-attend the same SCTP programme that I have completed previously?\nNo. You cannot re-attend the same SCTP programme you have completed previously.\nSkillsFuture Course Funding Support\nchevron--up\nHow do I know if I qualify for SkillsFuture Course Fees Funding Support?\nSingapore Citizens, Permanent Residents and LTVP+ holders are eligible for SkillsFuture Course Fees Funding Support on SkillsFuture supported courses.\nchevron--up\nIf I fail the programme or drop out, what will happen to the funding I’ve received?\nIf you fail the programme or drop out without a valid reason, you may be required to refund the course fee subsidy you received. Trainees are encouraged to complete all modules and pass the assessments to fully benefit from the programme and retain the funding support.\nchevron--up\nWhat if I turn 40 years old in the middle of the programme?\nIf you turn 40 years old during the programme, you will become eligible for the Mid-Career Enhanced Subsidy from the month you turn 40. This subsidy can cover up to 90% of programme fees.\nSkillsFuture Mid-Career Training Allowance (TA)\nchevron--up\nWho is eligible for SkillsFuture Mid-Career Training Allowance?\nSingapore Citizens aged 40 years old and above are eligible for SkillsFuture Mid-Career Training Allowance when they enrol into full-time TA Elgiible SCTPs.\nchevron--up\nWhen do I apply for SkillsFuture Mid-Career Training Allowance?\nYou can submit your Training Allowance application up to three (3) months before the programme start date.\nchevron--up\nCan I be employed and still be eligible for the SkillsFuture Mid-Career Training Allowance when enrolling into a full-time SCTP?\nYou can be employed and still apply for the Training Allowance for an eligible full-time training programme. Individuals must meet the full-time training intensity and programme requirements each month in order to receive the monthly payout.\nchevron--up\nHow do I know how many months of SkillsFuture Mid-Career Training Allowance payout I will receive for the application?\nThe maximum eligible period in the application refers to the maximum number of months you can receive for the Training Allowance. The actual number of months you will receive for the Training Allowance depends on the actual course duration and fulfilment of the training requirements each month.\nchevron--up\nHow is my monthly TA computed?\nIt is computed based on the latest available 12 months of income data from Government records (E.g CPF Board, IRAS) as of course start date.\nchevron--up\nWhat if my course has been deferred or cancelled?\nYour TA application will be cancelled, and you will need to re-submit a TA application where your SCTP enrolment will be treated as a new SCTP enrolment.\nchevron--up\nWhat are the programme requirements I need to fulfil in order to receive the monthly training allowances?\nYou will need to fulfil a minimum of 75% attendance of trainer led sessions for each of the training month of the programme.\nFor Employers\nPartner with SIT\nLEARN\nto\nRecruit Skilled Professionals for Your Organisation\nSPEAK WITH US TODAY\nAbout SIT\nLEARN\nSIT\nLEARN\nis the lifelong learning division of the Singapore Institute of Technology, Singapore's first University of Applied Learning. SIT\nLEARN\nis dedicated to providing high-quality, industry-relevant training and education to professionals and mid-career individuals. Through its innovative Applied Learning approach, SIT\nLEARN\nequips learners with practical skills and knowledge that are directly applicable in the workplace, helping them stay competitive in the evolving job market.\nExplore More Courses\nDiscover courses that can enhance your skillset, elevate your career, and take it to the next level.\nTake a Course\nOur portfolio of short SkillsFuture-funded courses will help you contextualise and apply concepts to tackle real-world challenges.\nLearn more\nEarn Stackable Certificates\nWhether you are looking to enhance your skills or explore new areas of expertise, our learning pathways provide the flexibility and recognition you need to succeed.\nLearn more\nObtain a Professional Certification\nAdvance your career with industry-recognised licences and certificates through preparatory courses or examinations.\nLearn more\nTransform Your Organisation\nTailored to your organisation's specific training needs, custom courses enable you to grow key talent and specialist expertise to meet the future demands of work.\nLearn more\nStay informed.\nBe inspired.\nSubscribe now and receive our brochure for the latest updates on our courses, events and insights.\nLatest in-demand courses\nUpcoming information sessions and events\nThought-provoking insights and stories\nFirst Name\n*\nLast Name\n*\nEmail\n*\nInterests (You may choose more than 1)\n*\nBusiness, Communication and Design\nEngineering\nFood, Chemical and Biotechnology\nHealth and Social Sciences\nInfocomm Technology\nPlease select at least 1 interest.\nBy clicking \"Subscribe\", you agree to our \"\nTerms of Use\n\" and also agree that SIT (and its service providers and agents) may collect, use, disclose and/or process your personal data to send you information related to the topic(s) of interest you have selected above, which may include information on courses, seminars, events, resources and/or surveys offered by SIT and/or its Overseas University partners.\nWe look forward to journeying with you on your path of lifelong learning. You can manage your preferences or unsubscribe at any time through the links provided in our communications. To learn more about how SIT protects your personal data, you may refer to SIT's Personal Data Protection Policy\nhere\n.\nupdateCheckboxVal(\"Interest_BCD\");\n    updateCheckboxVal(\"Interest_ENG\");\n    updateCheckboxVal(\"Interest_FCB\");\n    updateCheckboxVal(\"Interest_HSS\");\n    updateCheckboxVal(\"Interest_ICT\");\n\n    function updateCheckboxVal(attrName) {\n        if (attrName) {\n            var checkboxName = attrName + \"_checkbox\";\n            var intAttr = document.getElementsByName(attrName);\n            var intCheckbox = document.getElementsByName(checkboxName);\n            if (intCheckbox && intAttr) {\n                intAttr[0].value = intCheckbox[0].checked;\n            }\n        }\n    }\n\n    function updatesUponSubmit() {\n        var checkboxes = document.querySelectorAll('[data-group=\"check-box-group\"]');\n        var boxSelected = false;\n        for (var i = 0, l = checkboxes.length; i < l; i++) {\n            if (checkboxes[i].checked) {\n                boxSelected = true;\n                break;\n            }\n        }\n        if (boxSelected) {\n            var gmt8Date = new Date().toLocaleDateString(\"en-US\", { timeZone: \"Asia/Singapore\" });\n            const now = new Date().toUTCString();\n            var optinEmailDate = document.getElementsByName(\"OptinEmailDate\");\n            var createdDate = document.getElementsByName(\"CreatedDate\");\n            var formSubmissionDate = document.getElementsByName(\"FormSubmissionDate\");\n            var primaryKey = document.getElementsByName(\"PrimaryKey\");\n            var getEmail = document.getElementById(\"email\").value;\n            var getWebsource = document.getElementById(\"websourceID\").value;\n\n            optinEmailDate[0].value = now;\n            createdDate[0].value = now;\n            formSubmissionDate[0].value = now;\n            primaryKey[0].value = getEmail + getWebsource + gmt8Date;\n\t\t\t\n            updateCheckboxVal(\"Interest_BCD\");\n            updateCheckboxVal(\"Interest_ENG\");\n            updateCheckboxVal(\"Interest_FCB\");\n            updateCheckboxVal(\"Interest_HSS\");\n            updateCheckboxVal(\"Interest_ICT\");\n\t\t\t\n        } else {\n            var checkboxes = document.querySelector('.error-message');\n            checkboxes.classList.add('active');\n            return false;\n        }\n    }\n#block-announcement-popup {\n display: none;\n}\nNew Engineering Micro-credentials Launching Soon!\nExciting news! We are introducing new micro-credentials in Electrical and Electronic Engineering & Infrastructure and Systems Engineering. Be among the first to know by registering your interest today!\nRegister now →\nSIT reserves the right to make changes to published course information, including dates, times, venues, fees and instructors without prior notice.\nAddress\n1 Punggol Coast Road Singapore 828608\nContact Us\nSend an Enquiry\nVisiting SIT\nOur Campus Locations\nPrivacy Statement\nSafety and Health\nSocial Media Guidelines\nTerms of Use\nWhistleblowing\nCET Course Terms & Conditions\nCopyright ©\n2025\nSingapore Institute of Technology. All Rights Reserved.\n.contact-link2 a:link,  .contact-link2 a:visited {\n    border-bottom:0px;\n}\n{\"path\":{\"baseUrl\":\"\\/sitlearn\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/17\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"ajaxPageState\":{\"libraries\":\"eJyNkmFuwyAMhS9EQtULIQNOw2piZKBtdvqRJmtSbZr2B7332QbZxhJ8ztoG7uEDHsqudjk37QhyppDL5onBbzIxzUMg-rbCMWTcnMCwqTvapNwVfSgsRhB8ZEH9gyjHxGL5oT0OUKm8gAkThamVvHs18FTgjpkj6oPu8-3yV6zPY4iKYOZajK2BPIrJNRTUK-w22FnI2FGwAjL_q-AJXxWxdQi6jaig9A5SCTypBAIXgTRm7aUmoH4nfZ1StW3aI3qVQ0yEJnGqyVhid836F9byijmfzicNzrH49oZZL94jFqSb4LaDC7E9JoxtB7uLONV3917dBCHIdCBJWuNPv6QbuyzVSY1Wu5oLR5XnXDDqZaLqFvCe9fNcv90RRPaV8AvDS_2N\",\"theme\":\"sit_2020\",\"theme_token\":null},\"ajaxTrustedUrl\":[],\"colorbox\":{\"transition\":\"elastic\",\"speed\":350,\"opacity\":0.84999999999999998,\"slideshow\":false,\"slideshowAuto\":true,\"slideshowSpeed\":2500,\"slideshowStart\":\"start slideshow\",\"slideshowStop\":\"stop slideshow\",\"current\":\"{current} of {total}\",\"previous\":\"\\u00ab Prev\",\"next\":\"Next \\u00bb\",\"close\":\"Close\",\"overlayClose\":true,\"returnFocus\":true,\"maxWidth\":\"85%\",\"maxHeight\":\"80%\",\"initialWidth\":\"1%\",\"initialHeight\":\"1%\",\"fixed\":true,\"scrolling\":true,\"mobiledetect\":false,\"mobiledevicewidth\":\"480px\"},\"simple_popup_blocks\":{\"settings\":[]},\"lazyLoadUrl\":\"\\/sitlearn\\/term_reference_fancytree\\/subTree\",\"blazy\":{\"loadInvisible\":false,\"offset\":100,\"saveViewportOffsetDelay\":50,\"validateDelay\":25,\"container\":\"\",\"loader\":true,\"unblazy\":false,\"visibleClass\":false},\"blazyIo\":{\"disconnect\":false,\"rootMargin\":\"0px\",\"threshold\":[0,0.25,0.5,0.75,1]},\"views\":{\"ajax_path\":\"\\/sitlearn\\/views\\/ajax\",\"ajaxViews\":{\"views_dom_id:31cbedf903e62297592f318c5642de6ff5d025db6bef8ace399c5cac6afe707b\":{\"view_name\":\"event\",\"view_display_id\":\"block_3_upcoming_events\",\"view_args\":\"all\",\"view_path\":\"\\/node\\/17\",\"view_base_path\":null,\"view_dom_id\":\"31cbedf903e62297592f318c5642de6ff5d025db6bef8ace399c5cac6afe707b\",\"pager_element\":0}}},\"user\":{\"uid\":0,\"permissionsHash\":\"6865a5a4a677c61446c24b3c09f1809962249dff5b0b68c3d1096b60d4557c4b\"}}"
  ],
  "links": [
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme#main-content",
    "https://sitlearn.singaporetech.edu.sg/profile/",
    "https://www.singaporetech.edu.sg/sitlearn/",
    "https://www.singaporetech.edu.sg/sitlearn/",
    "https://www.singaporetech.edu.sg/sitlearn/organisations",
    "https://www.singaporetech.edu.sg/sitlearn/insights",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A51",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A53",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A60",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A57",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A19",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A52",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A56",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A74",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A49",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A20",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A54",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A69",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A70",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A22",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A48",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A62",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A66",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A201",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A21",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A191",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A58",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A59",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A196",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A23",
    "https://www.singaporetech.edu.sg/sitlearn/courses/course-brochure",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/courses/business-communication-design",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering",
    "https://www.singaporetech.edu.sg/sitlearn/courses/food-chemical-biotechnology",
    "https://www.singaporetech.edu.sg/sitlearn/courses/health-social-sciences",
    "https://www.singaporetech.edu.sg/sitlearn/courses/infocomm-technology",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/modular-certification-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/professional-exams-preparatory-courses",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/executive-education",
    "https://www.singaporetech.edu.sg/sitlearn/events",
    "https://www.singaporetech.edu.sg/sitlearn/resources/learn-for-life",
    "https://www.singaporetech.edu.sg/sitlearn/resources/funding",
    "https://www.singaporetech.edu.sg/sitlearn/resources/faq",
    "https://www.singaporetech.edu.sg/sitlearn/about-us",
    "https://www.singaporetech.edu.sg/sitlearn/getting-sit",
    "https://www.singaporetech.edu.sg/sitlearn/contact-us",
    "https://www.singaporetech.edu.sg/sitlearn/join-our-mailing-list",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A51",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A53",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A60",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A57",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A19",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A52",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A56",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A74",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A49",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A20",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A54",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A69",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A70",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A22",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A48",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A62",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A66",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A201",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A21",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A191",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A58",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A59",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A196",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A23",
    "https://www.singaporetech.edu.sg/sitlearn/courses/course-brochure",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/courses/business-communication-design",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering",
    "https://www.singaporetech.edu.sg/sitlearn/courses/food-chemical-biotechnology",
    "https://www.singaporetech.edu.sg/sitlearn/courses/health-social-sciences",
    "https://www.singaporetech.edu.sg/sitlearn/courses/infocomm-technology",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/modular-certification-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/professional-exams-preparatory-courses",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/executive-education",
    "https://www.singaporetech.edu.sg/sitlearn/events",
    "https://www.singaporetech.edu.sg/sitlearn/resources/learn-for-life",
    "https://www.singaporetech.edu.sg/sitlearn/resources/funding",
    "https://www.singaporetech.edu.sg/sitlearn/resources/faq",
    "https://www.singaporetech.edu.sg/sitlearn/about-us",
    "https://www.singaporetech.edu.sg/sitlearn/getting-sit",
    "https://www.singaporetech.edu.sg/sitlearn/contact-us",
    "https://www.singaporetech.edu.sg/sitlearn/join-our-mailing-list",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/organisations",
    "https://www.singaporetech.edu.sg/sitlearn/insights",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://sitlearn.singaporetech.edu.sg/profile/",
    "https://www.singaporetech.edu.sg/sitlearn/",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/register-interest-sctp",
    "https://www.singaporetech.edu.sg/sitlearn/courses/infocomm-technology/sctp-cloud-computing-devops-programme",
    "https://www.singaporetech.edu.sg/sitlearn/courses/infocomm-technology/sctp-data-analytics-business-intelligence-programme",
    "https://www.singaporetech.edu.sg/sitlearn/courses/business-communication-design/sctp-digital-product-management-programme",
    "https://www.singaporetech.edu.sg/sitlearn/courses/infocomm-technology/sctp-full-stack-software-development-programme",
    "https://www.singaporetech.edu.sg/sitlearn/courses/business-communication-design/sctp-programme-design-innovation",
    "https://www.singaporetech.edu.sg/sitlearn/courses/business-communication-design/sctp-programme-lean-six-sigma-champion-operational-excellence-manager",
    "https://www.singaporetech.edu.sg/sitlearn/courses/infocomm-technology/sctp-uxui-design-programme",
    "https://sg.linkedin.com/in/joeleong-career-enabler",
    "mailto:Joe.Leong@singaporetech.edu.sg?subject=SkillsFuture Career Transition Programme (SCTP)",
    "https://ta.myskillsfuture.gov.sg/calculator/form",
    "https://www.singaporetech.edu.sg/sitlearn/contact-us",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/learning-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/professional-exams-preparatory-courses",
    "https://www.singaporetech.edu.sg/sitlearn/organisations",
    "https://www.singaporetech.edu.sg/sitlearn/terms-use",
    "https://www.singaporetech.edu.sg/sitlearn/privacy-statement",
    "https://sit.au1.qualtrics.com/jfe/form/SV_6FKhISzRqyVUdYq",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme#0",
    "https://www.google.com/maps/place/Singapore+Institute+of+Technology+(SIT)+-+Punggol/@1.41364,103.91229,14z/data=!4m6!3m5!1s0x31da1515bfb2d263:0xc71c56458ac08497!8m2!3d1.4136399!4d103.9122896!16s%2Fg%2F11t42h3wb_",
    "https://www.singaporetech.edu.sg/contact-us",
    "https://www.singaporetech.edu.sg/campus-locations",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.linkedin.com/company/singapore-institute-of-technology",
    "https://www.youtube.com/user/SingaporeTech",
    "https://www.tiktok.com/@singaporetech",
    "https://www.singaporetech.edu.sg/sitlearn/privacy-statement",
    "https://www.singaporetech.edu.sg/safety-and-health-policy",
    "https://www.singaporetech.edu.sg/social-media-guidelines",
    "https://www.singaporetech.edu.sg/sitlearn/terms-use",
    "https://www.singaporetech.edu.sg/whistleblowing",
    "https://www.singaporetech.edu.sg/sitlearn/media/sit-cet-terms-conditions"
  ],
  "images": [
    "/sitlearn/sites/sitlearn/files/styles/full_width_large/public/2025-03/sctp-banner-alternative_0.png.webp?itok=Ip8BKLcU",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "/sitlearn/sites/sitlearn/files/2023-12/Joe%20Leong.jpg",
    "/sitlearn/sites/sitlearn/files/2023-03/application-banner.jpg",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E"
  ]
}