{
  "url": "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering",
  "title": "Electrical and Electronic Engineering | Singapore Institute of Technology",
  "meta": {
    "description": "Earn Specialist Certificates to broaden your career prospects in Electrical and Electronic Engineering. Stack them towards a degree in (EE) Engineering with our unique Competency-based Stackable Micro-credential (CSM) Pathway designed for working professionals.",
    "keywords": null
  },
  "text_lines": [
    "Skip to main content",
    "Manage My Account",
    "Mega menu",
    "Courses",
    "Dropdown",
    "Goals",
    "Dropdown",
    "For Organisations",
    "Insights",
    "Resources",
    "Dropdown",
    "Connect With Us",
    "Dropdown",
    "Business, Communication and Design",
    "Accounting and Finance",
    "Business Management",
    "Design Innovation",
    "Leadership and Communication",
    "View All",
    "Arrow",
    "Dropdown",
    "Engineering",
    "Building Services",
    "Civil Engineering",
    "Electrical Engineering",
    "Power and Clean Energy",
    "View All",
    "Arrow",
    "Dropdown",
    "Food, Chemical and Biotechnology",
    "Chemical Engineering",
    "Process Engineering",
    "Process Safety",
    "View All",
    "Arrow",
    "Dropdown",
    "Health and Social Sciences",
    "Elder Health and Rehabilitation",
    "Health Sciences",
    "Occupational Therapy",
    "Social Sciences",
    "View All",
    "Arrow",
    "Dropdown",
    "Infocomm Technology",
    "AI and Machine Learning",
    "Cybersecurity",
    "Data Science and Analytics",
    "Internet of Things",
    "View All",
    "Arrow",
    "Dropdown",
    "Search for Courses",
    "Course Brochure",
    "Course Finder",
    "Arrow",
    "Dropdown",
    "Take a Course",
    "Business, Communication and Design",
    "Engineering",
    "Food, Chemical and Biotechnology",
    "Health and Social Sciences",
    "Infocomm Technology",
    "Explore Courses",
    "Arrow",
    "Dropdown",
    "Earn Stackable Certificates",
    "Competency-based Stackable Micro-credential (CSM) Pathways",
    "Arrow",
    "Modular Certification Pathways",
    "Arrow",
    "Dropdown",
    "Obtain a Professional Certification",
    "Browse Professional Exams and Preparatory Courses",
    "Arrow",
    "Dropdown",
    "Make a Career Transition",
    "SkillsFuture Career Transition Programme",
    "Arrow",
    "Dropdown",
    "Lead with Impact",
    "Executive Education",
    "Arrow",
    "Dropdown",
    "Attend an Event",
    "Discover Upcoming Events",
    "Arrow",
    "Dropdown",
    "For SITizens",
    "Learn for Life",
    "Arrow",
    "Dropdown",
    "Funding",
    "Available Funding",
    "Arrow",
    "Dropdown",
    "Need Help?",
    "FAQ",
    "Arrow",
    "Dropdown",
    "Who We Are",
    "About Us",
    "Arrow",
    "Dropdown",
    "Let’s Connect",
    "Getting to SIT",
    "Contact Us",
    "Join Our Mailing List",
    "Arrow",
    "Dropdown",
    "Business, Communication and Design",
    "Accounting and Finance",
    "Business Management",
    "Design Innovation",
    "Leadership and Communication",
    "View All",
    "Arrow",
    "Dropdown",
    "Engineering",
    "Building Services",
    "Civil Engineering",
    "Electrical Engineering",
    "Power and Clean Energy",
    "View All",
    "Arrow",
    "Dropdown",
    "Food, Chemical and Biotechnology",
    "Chemical Engineering",
    "Process Engineering",
    "Process Safety",
    "View All",
    "Arrow",
    "Dropdown",
    "Health and Social Sciences",
    "Elder Health and Rehabilitation",
    "Health Sciences",
    "Occupational Therapy",
    "Social Sciences",
    "View All",
    "Arrow",
    "Dropdown",
    "Infocomm Technology",
    "AI and Machine Learning",
    "Cybersecurity",
    "Data Science and Analytics",
    "Internet of Things",
    "View All",
    "Arrow",
    "Dropdown",
    "Search for Courses",
    "Course Brochure",
    "Course Finder",
    "Arrow",
    "Dropdown",
    "Take a Course",
    "Business, Communication and Design",
    "Engineering",
    "Food, Chemical and Biotechnology",
    "Health and Social Sciences",
    "Infocomm Technology",
    "Explore Courses",
    "Arrow",
    "Dropdown",
    "Earn Stackable Certificates",
    "Competency-based Stackable Micro-credential (CSM) Pathways",
    "Arrow",
    "Modular Certification Pathways",
    "Arrow",
    "Dropdown",
    "Obtain a Professional Certification",
    "Browse Professional Exams and Preparatory Courses",
    "Arrow",
    "Dropdown",
    "Make a Career Transition",
    "SkillsFuture Career Transition Programme",
    "Arrow",
    "Dropdown",
    "Lead with Impact",
    "Executive Education",
    "Arrow",
    "Dropdown",
    "Attend an Event",
    "Discover Upcoming Events",
    "Arrow",
    "Dropdown",
    "For SITizens",
    "Learn for Life",
    "Arrow",
    "Dropdown",
    "Funding",
    "Available Funding",
    "Arrow",
    "Dropdown",
    "Need Help?",
    "FAQ",
    "Arrow",
    "Dropdown",
    "Who We Are",
    "About Us",
    "Arrow",
    "Dropdown",
    "Let’s Connect",
    "Getting to SIT",
    "Contact Us",
    "Join Our Mailing List",
    "Arrow",
    "Dropdown",
    "Mega menu",
    "< Back",
    "Courses",
    "Dropdown",
    "Goals",
    "Dropdown",
    "For Organisations",
    "Insights",
    "Resources",
    "Dropdown",
    "Connect With Us",
    "Dropdown",
    "Quick Links",
    "Manage My Account",
    ".page-node-type-programme #how-to-apply {\n    height: auto;\n  }",
    "Home",
    "CSM Pathways",
    "Electrical and Electronic Engineering",
    "Electrical and Electronic Engineering",
    "Earn Specialist Certificates to broaden your career prospects in Electrical and Electronic Engineering. Stack them towards a degree in (EE) Engineering with our unique Competency-based Stackable Micro-credential (CSM) Pathway designed for working professionals.",
    "tag",
    "Electrical Engineering, Electronics Engineering, Power and Clean Energy, Sustainability, Data Science and Analytics, Robotics and Automation, Advanced Manufacturing, Competency-based Education",
    "Overview",
    "In today’s digitally interconnected world, there is a growing demand for electrical and electronic engineers skilled in systems integration, automation, and digital technologies to meet industry needs and tackle complex engineering challenges.",
    "To address this demand, the Competency-based Stackable Micro-credential (CSM) Pathway in Electrical and Electronic Engineering offers you the opportunity to master these sought-after competencies through micro-credentials.",
    "Through this pathway, you have the flexibility to choose individual micro-credentials that match your progression needs and earn Specialist Certificates, which serve as recognition of your expertise. If you have aspirations for a degree, you may enrol in the degree programme and stack these micro-credentials towards a Bachelor of Engineering (Honours) in Electrical and Electronic Engineering.",
    "Our micro-credentials are designed to equip you with the skills and knowledge to excel in new or advanced job roles, in areas such as data analytics, internet of things, operational excellence, semiconductor manufacturing, energy systems, and more.",
    "The blended learning model adopted in each micro-credential combines the best of online and in-person delivery, ensuring a holistic learning experience. You will also be supported by success coaches who will ensure that you have the tools and guidance needed to succeed.",
    "Micro-credentials Available",
    "Each micro-credential can be taken individually. Upon completion of each micro-credential, you will be awarded a Specialist Certificate.",
    "List of Micro-credentials",
    "Micro-credential Title",
    "Type",
    "Credits",
    "Next Run",
    "Data Analytics for Engineering",
    "Engineering",
    "18",
    "Sep 2025",
    "Operational Excellence in Engineering",
    "Engineering",
    "18",
    "Jan 2025",
    "Electronic Systems",
    "Programme",
    "18",
    "Sep 2025",
    "Sensing and Actuation*",
    "Programme",
    "18",
    "TBC",
    "Semiconductor Manufacturing and Process Control",
    "Programme Elective",
    "18",
    "May 2025",
    "Sustainable Energy Systems",
    "Programme Elective",
    "18",
    "Sep 2025",
    "Robotics and Automation*",
    "Programme Elective",
    "18",
    "TBC",
    "Environmental Sustainability Measurement and Management",
    "Unrestrictive Elective",
    "18",
    "Sep 2025",
    "Smart Maintenance",
    "Unrestrictive Elective",
    "18",
    "Jan 2025",
    "Note:",
    "Micro-credentials denoted by asterisk (*) are pending funding approval from SkillsFuture Singapore. If you are planning to stack to a degree, SSG funding is only available for up to six micro-credentials (i.e. 120 credits). Micro-credentials titles are subject to change without prior notice.",
    "Why Choose SIT's micro-credentials and CSM Pathways?",
    "Aligned with Industy Demand",
    "Our programmes have a strong focus on industry-relevant skills and collaboration with industry partners.",
    "This ensures that you are well-prepared for the demands of the IT sector.",
    "Competency-based Education",
    "Our \"Learning by Doing\" approach empowers you with real-world competencies with hands-on experience.",
    "This enables you to apply skills and create value for both you and your employer readily.",
    "Flexible and Modular Programme",
    "Our unique degree pathway offers unparalleled flexibility through its stackable micro-credentials.",
    "This allows you to tailor your education to your career needs whilst you build towards a degree.",
    "Coaching for Success",
    "Our team of qualified success coaches, alongside SIT Faculty, will provide dedicated support for your learning journey.",
    "This ensures that you have the tools and guidance needed to succeed.",
    "Certificate and Assessment",
    "A Specialist Certificate for each micro-credential will be issued to learners who:",
    "Attend at least 75% of the course and",
    "Undertake and pass all credit bearing assessments",
    "Stacking to a Degree:",
    "You have the flexibility to convert to the direct honours degree programme via the annual admission cycle from March – May and stack your acquired micro-credentials to a",
    "BEng (Hons) in Electrical and Electronic Engineering",
    "The conversion to the degree pathway will take into account other prior learning such as industry certifications or competencies acquired from work, providing you with credit or exemptions",
    "You will be subject to SIT’s tuition fees and may qualify for the Ministry of Education (MOE) tuition grant, based on eligibility criteria set by MOE. Please note that the SkillsFuture subsidy will no longer be applicable once you convert to the degree pathway.",
    "To switch to the degree pathway, you must pass at least one micro-credential (Engineering/Programme/Programme Elective) with a minimum grade of 'C' and meet the degree's eligibility criteria",
    "Each micro-credential is valid for 5 years when used for stacking to a degree",
    "Financial Support",
    "Micro-credentials in Electrical and Electronic Engineering, except those denoted by asterisk (*) are eligible for SkillsFuture funding of up to 90% course fees.",
    "If you are planning to stack to a degree, SkillsFuture funding is only available for up to six micro-credentials (i.e., 120 credits).",
    "SkillsFuture Course Fee Funding Support",
    "Eligible Individuals",
    "Funding Category",
    "Funding Amount",
    "Singapore Citizens, Permanent Residents, and Long-Term Visit Pass-Plus (LTVP+) Holders",
    "Singapore Citizen (Below 40) / Singapore PR / LTVP+ Holder",
    "Up to 70% of course fees",
    "Singapore Citizen (40 & above)",
    "Funded under SkillsFuture Mid-Career Enhanced Subsidy (MCES)",
    "Up to 90% of course fees",
    "Frequently Asked Questions",
    "Curriculum and programme structure",
    "chevron--up",
    "Can I switch to the degree programme at any time?",
    "You may apply for the degree programme during the annual admission cycle from March – May. You must pass at least one Engineering, Programme, or Programme Elective micro-credential with a minimum grade of 'C' and meet the degree's eligibility criteria.",
    "Visit",
    "here",
    "for more information on the degree programme.",
    "chevron--up",
    "How does stacking to a degree work?",
    "Our BEng (Hons) in Electrical and Electronic Engineering degree (via the CSM Pathway) offers a flexible and modular structure comprising of the following:",
    "Two Engineering micro-credentials (covering data analytics and operational excellence)",
    "Two Programme micro-credentials (covering the necessary fundamental knowledge and skills for engineering majors)",
    "Two Programme Elective micro-credentials (covering specific knowledge and skills for a targeted industry",
    "One Unrestricted Elective (choose either a micro-credential or a set of modules from any cluster for broadening learning)",
    "Relevant micro-credentials that you obtain can be stacked progressively to complete this degree.",
    "In addition to SIT’s micro-credentials, your pathway to a degree will also take into account other prior learning such as industry certifications or competencies acquired from work, which will provide you with credit or exemptions.",
    "Visit",
    "here",
    "for more information on the degree programme.",
    "chevron--up",
    "Do I need to take micro-credentials in a particular order?",
    "Although we provide a recommended study pathway for the degree programme, you are not required to take micro-credentials in a prescribed order. SIT will state the recommended baseline competencies that an individual should have before embarking on a micro-credential.",
    "chevron--up",
    "How long does it take to complete one micro-credential?",
    "It takes one trimester (3+ months) to complete a micro-credential.",
    "chevron--up",
    "I'm interested in other areas of engineering. Will you be offering other micro-credentials?",
    "SIT regularly reviews its curriculum to ensure that it remains industry-relevant. We are looking to expand the list of micro-credentials.",
    "chevron--up",
    "What is the structure of micro-credentials?",
    "Micro-credentials are largely taught asynchronously, which gives you the flexibility to learn whenever and wherever you choose. Each micro-credential combines online delivery for topics and in-person delivery for lab sessions and integrated project. The learning activities vary for each micro-credential.",
    "chevron--up",
    "What is the role of the success coach in the micro-credential?",
    "Success coaches will work with you to develop a personalised learning plan. They will provide you with a wide range of resources and support services to help you navigate your learning journey.",
    "Application",
    "chevron--up",
    "Am I guaranteed a place in the micro-credential upon registration?",
    "Acceptance into the micro-credential will be determined by the Teaching Team and/or if you fulfil the assumed prior knowledge (if any) stated in each respective micro-credential’s webpage. Places are allocated on a first-come, first-served basis.",
    "chevron--up",
    "Are there any interviews or additional assessments as part of the admission process?",
    "No, there won’t be any interviews or additional assessments. However, you would need to provide supporting documents listed in the application form for a smoother admission process.",
    "chevron--up",
    "Can I enrol in multiple micro-credentials at the same time?",
    "It is not advisable to enrol in more than one micro-credential at any one time given the associated commitment and workload.",
    "chevron--up",
    "How will I be notified about the status of my micro-credential application?",
    "You will receive an email notification from SIT",
    ".",
    "Funding",
    "chevron--up",
    "Are all micro-credentials subsidised by SkillsFuture Singapore?",
    "The list of micro-credentials subsidised by SkillsFuture Singapore (SSG) will be progressively updated.  If you are planning to stack to a degree, SSG funding is only available for up to six micro-credentials (i.e. 120 credits).",
    "Related Insights",
    "Course Insights",
    "What’s needed for stackable microcredentials toward a degree?",
    "29 Sep 2023",
    "Forest Tan describes how to begin creating a flexible pathway where learners can accumulate microcredentials aligned to industry that can stack toward a degree.",
    "tag",
    "Competency-based Education",
    "Course Insights",
    "How to coach in-employment lifelong learners for success",
    "21 Sep 2023",
    "A team from Singapore Institute of Technology offers insights from working with in-employment learners who are seeking to upskill by studying for degrees.",
    "tag",
    "Competency-based Education",
    "Course Insights",
    "The future of learning: How competency-based education is shaping skills development",
    "08 Aug 2023",
    "As the shelf-life of skills shortens, it's time to rethink the traditional approach to upskilling. With competency-based education, employees are able to master the skills that directly impact their careers, and employers are able to assess competency accurately.",
    "tag",
    "Competency-based Education",
    "❮",
    "❯",
    "Explore More Courses",
    "Designed for busy professionals and executives, our courses are designed for those with ambition to grow in their career. Discover new opportunities to explore and hone your craft with us.",
    "Take a Course",
    "Our portfolio of short SkillsFuture-funded courses will help you contextualise and apply concepts to tackle real-world challenges.",
    "Learn more",
    "Earn Stackable Certificates",
    "Whether you are looking to enhance your skills or explore new areas of expertise, our learning pathways provide the flexibility and recognition you need to succeed.",
    "Learn more",
    "Obtain a Professional Certification",
    "Advance your career with industry-recognised licences and certificates through preparatory courses or examinations.",
    "Learn more",
    "Make a Career Transition",
    "Enhance your employability in new sectors or job roles through the SkillsFuture Career Transition Programme.",
    "Learn more",
    "Overview",
    "Micro-credentials Available",
    "Modules Available",
    "Courses Available",
    "Certificate and Assessment",
    "FAQ",
    "Related Events",
    "Related Insights",
    "Apply Now",
    "Register Interest",
    "Download Brochure",
    "Back to top",
    "/sitlearn/register-interest/csm-engineering",
    "#block-announcement-popup {\n display: none;\n}",
    "New Engineering Micro-credentials Launching Soon!",
    "Exciting news! We are introducing new micro-credentials in Electrical and Electronic Engineering & Infrastructure and Systems Engineering. Be among the first to know by registering your interest today!",
    "Register now →",
    "SIT reserves the right to make changes to published course information, including dates, times, venues, fees and instructors without prior notice.",
    "Address",
    "1 Punggol Coast Road Singapore 828608",
    "Contact Us",
    "Send an Enquiry",
    "Visiting SIT",
    "Our Campus Locations",
    "Privacy Statement",
    "Safety and Health",
    "Social Media Guidelines",
    "Terms of Use",
    "Whistleblowing",
    "CET Course Terms & Conditions",
    "Copyright ©",
    "2025",
    "Singapore Institute of Technology. All Rights Reserved.",
    ".contact-link2 a:link,  .contact-link2 a:visited {\n    border-bottom:0px;\n}",
    "{\"path\":{\"baseUrl\":\"\\/sitlearn\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/19006\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"colorbox\":{\"transition\":\"elastic\",\"speed\":350,\"opacity\":0.84999999999999998,\"slideshow\":false,\"slideshowAuto\":true,\"slideshowSpeed\":2500,\"slideshowStart\":\"start slideshow\",\"slideshowStop\":\"stop slideshow\",\"current\":\"{current} of {total}\",\"previous\":\"\\u00ab Prev\",\"next\":\"Next \\u00bb\",\"close\":\"Close\",\"overlayClose\":true,\"returnFocus\":true,\"maxWidth\":\"85%\",\"maxHeight\":\"80%\",\"initialWidth\":\"1%\",\"initialHeight\":\"1%\",\"fixed\":true,\"scrolling\":true,\"mobiledetect\":false,\"mobiledevicewidth\":\"480px\"},\"simple_popup_blocks\":{\"settings\":[]},\"lazyLoadUrl\":\"\\/sitlearn\\/term_reference_fancytree\\/subTree\",\"field_group\":{\"html_element\":{\"mode\":\"default\",\"context\":\"view\",\"settings\":{\"classes\":\"\",\"show_empty_fields\":false,\"id\":\"learning-pathway-overview\",\"element\":\"div\",\"show_label\":false,\"label_element\":\"h3\",\"label_element_classes\":\"\",\"attributes\":\"\",\"effect\":\"none\",\"speed\":\"fast\"}}},\"blazy\":{\"loadInvisible\":false,\"offset\":100,\"saveViewportOffsetDelay\":50,\"validateDelay\":25,\"container\":\"\",\"loader\":true,\"unblazy\":false,\"visibleClass\":false},\"blazyIo\":{\"disconnect\":false,\"rootMargin\":\"0px\",\"threshold\":[0,0.25,0.5,0.75,1]},\"slick\":{\"accessibility\":true,\"adaptiveHeight\":false,\"autoplay\":false,\"pauseOnHover\":true,\"pauseOnDotsHover\":false,\"pauseOnFocus\":true,\"autoplaySpeed\":3000,\"arrows\":true,\"downArrow\":false,\"downArrowTarget\":\"\",\"downArrowOffset\":0,\"centerMode\":false,\"centerPadding\":\"50px\",\"dots\":false,\"dotsClass\":\"slick-dots\",\"draggable\":true,\"fade\":false,\"focusOnSelect\":false,\"infinite\":true,\"initialSlide\":0,\"lazyLoad\":\"ondemand\",\"mouseWheel\":false,\"randomize\":false,\"rtl\":false,\"rows\":1,\"slidesPerRow\":1,\"slide\":\"\",\"slidesToShow\":1,\"slidesToScroll\":1,\"speed\":500,\"swipe\":true,\"swipeToSlide\":false,\"edgeFriction\":0.34999999999999998,\"touchMove\":true,\"touchThreshold\":5,\"useCSS\":true,\"cssEase\":\"ease\",\"cssEaseBezier\":\"\",\"cssEaseOverride\":\"\",\"useTransform\":true,\"easing\":\"linear\",\"variableWidth\":false,\"vertical\":false,\"verticalSwiping\":false,\"waitForAnimate\":true},\"user\":{\"uid\":0,\"permissionsHash\":\"6865a5a4a677c61446c24b3c09f1809962249dff5b0b68c3d1096b60d4557c4b\"}}"
  ],
  "desc_divs": [
    "Forest Tan describes how to begin creating a flexible pathway where learners can accumulate microcredentials aligned to industry that can stack toward a degree.",
    "A team from Singapore Institute of Technology offers insights from working with in-employment learners who are seeking to upskill by studying for degrees.",
    "As the shelf-life of skills shortens, it's time to rethink the traditional approach to upskilling. With competency-based education, employees are able to master the skills that directly impact their careers, and employers are able to assess competency accurately."
  ],
  "article_texts": [],
  "links": [
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering#main-content",
    "https://sitlearn.singaporetech.edu.sg/profile/",
    "https://www.singaporetech.edu.sg/sitlearn/",
    "https://www.singaporetech.edu.sg/sitlearn/",
    "https://www.singaporetech.edu.sg/sitlearn/organisations",
    "https://www.singaporetech.edu.sg/sitlearn/insights",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A51",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A53",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A60",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A57",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A19",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A52",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A56",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A74",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A49",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A20",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A54",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A69",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A70",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A22",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A48",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A62",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A66",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A201",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A21",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A191",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A58",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A59",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A196",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A23",
    "https://www.singaporetech.edu.sg/sitlearn/courses/course-brochure",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/courses/business-communication-design",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering",
    "https://www.singaporetech.edu.sg/sitlearn/courses/food-chemical-biotechnology",
    "https://www.singaporetech.edu.sg/sitlearn/courses/health-social-sciences",
    "https://www.singaporetech.edu.sg/sitlearn/courses/infocomm-technology",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/modular-certification-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/professional-exams-preparatory-courses",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering",
    "https://www.singaporetech.edu.sg/sitlearn/executive-education",
    "https://www.singaporetech.edu.sg/sitlearn/events",
    "https://www.singaporetech.edu.sg/sitlearn/resources/learn-for-life",
    "https://www.singaporetech.edu.sg/sitlearn/resources/funding",
    "https://www.singaporetech.edu.sg/sitlearn/resources/faq",
    "https://www.singaporetech.edu.sg/sitlearn/about-us",
    "https://www.singaporetech.edu.sg/sitlearn/getting-sit",
    "https://www.singaporetech.edu.sg/sitlearn/contact-us",
    "https://www.singaporetech.edu.sg/sitlearn/join-our-mailing-list",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A51",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A53",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A60",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A57",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A19",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A52",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A56",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A74",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A49",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A20",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A54",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A69",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A70",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A22",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A48",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A62",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A66",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A201",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A21",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A191",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A58",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A59",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A196",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A23",
    "https://www.singaporetech.edu.sg/sitlearn/courses/course-brochure",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/courses/business-communication-design",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering",
    "https://www.singaporetech.edu.sg/sitlearn/courses/food-chemical-biotechnology",
    "https://www.singaporetech.edu.sg/sitlearn/courses/health-social-sciences",
    "https://www.singaporetech.edu.sg/sitlearn/courses/infocomm-technology",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/modular-certification-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/professional-exams-preparatory-courses",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering",
    "https://www.singaporetech.edu.sg/sitlearn/executive-education",
    "https://www.singaporetech.edu.sg/sitlearn/events",
    "https://www.singaporetech.edu.sg/sitlearn/resources/learn-for-life",
    "https://www.singaporetech.edu.sg/sitlearn/resources/funding",
    "https://www.singaporetech.edu.sg/sitlearn/resources/faq",
    "https://www.singaporetech.edu.sg/sitlearn/about-us",
    "https://www.singaporetech.edu.sg/sitlearn/getting-sit",
    "https://www.singaporetech.edu.sg/sitlearn/contact-us",
    "https://www.singaporetech.edu.sg/sitlearn/join-our-mailing-list",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering",
    "https://www.singaporetech.edu.sg/sitlearn/organisations",
    "https://www.singaporetech.edu.sg/sitlearn/insights",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering",
    "https://sitlearn.singaporetech.edu.sg/profile/",
    "https://www.singaporetech.edu.sg/sitlearn/",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/data-analytics-engineering-microcredential",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/operational-excellence-engineering-microcredential",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/electronic-systems-microcredential",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/semiconductor-manufacturing-process-control-microcredential",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/sustainable-energy-systems-microcredential",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/environmental-sustainability-measurement-management-microcredential",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/smart-maintenance-microcredential",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/electrical-electronic-engineering-csm",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/electrical-electronic-engineering-csm",
    "https://www.singaporetech.edu.sg/undergraduate-programmes/electrical-electronic-engineering-csm",
    "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/whats-needed-stackable-microcredentials-toward-degree",
    "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/how-coach-employment-lifelong-learners-success",
    "https://www.singaporetech.edu.sg/sitlearn/insights/course-insights/future-learning-how-competency-based-shaping-skills-development",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/learning-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/learning-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/learning-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/professional-exams-preparatory-courses",
    "https://www.singaporetech.edu.sg/sitlearn/professional-exams-preparatory-courses",
    "https://www.singaporetech.edu.sg/sitlearn/professional-exams-preparatory-courses",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering#overview",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering#micro-credentials",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering#modular-certification-courses",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering#skills-pathway-courses",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering#certificate-assessment",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering#faqs",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering#related-events",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering#related-insights",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering#course-runs",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering#course-runs",
    "https://admission-postgrad.singaporetech.edu.sg/ ",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering",
    "https://www.singaporetech.edu.sg/sitlearn/register-interest/csm-engineering",
    "https://sit.au1.qualtrics.com/jfe/form/SV_6FKhISzRqyVUdYq",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways/electrical-electronic-engineering#0",
    "https://www.google.com/maps/place/Singapore+Institute+of+Technology+(SIT)+-+Punggol/@1.41364,103.91229,14z/data=!4m6!3m5!1s0x31da1515bfb2d263:0xc71c56458ac08497!8m2!3d1.4136399!4d103.9122896!16s%2Fg%2F11t42h3wb_",
    "https://www.singaporetech.edu.sg/contact-us",
    "https://www.singaporetech.edu.sg/campus-locations",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.linkedin.com/company/singapore-institute-of-technology",
    "https://www.youtube.com/user/SingaporeTech",
    "https://www.tiktok.com/@singaporetech",
    "https://www.singaporetech.edu.sg/sitlearn/privacy-statement",
    "https://www.singaporetech.edu.sg/safety-and-health-policy",
    "https://www.singaporetech.edu.sg/social-media-guidelines",
    "https://www.singaporetech.edu.sg/sitlearn/terms-use",
    "https://www.singaporetech.edu.sg/whistleblowing",
    "https://www.singaporetech.edu.sg/sitlearn/media/sit-cet-terms-conditions"
  ],
  "images": [
    "/sitlearn/sites/sitlearn/files/2024-05/csm-electricalandelectronicengineering.jpg",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E"
  ]
}