{
  "url": "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory",
  "title": "DSF6030 Managing and Leading Artificial Intelligence Projects for Smart Factory | Singapore Institute of Technology",
  "meta": {
    "description": "Gain business deployment skills for successful AI projects, validate project viability, and deliver strategic benefits through rapid prototyping and risk management.",
    "keywords": null
  },
  "text_lines": [
    "Skip to main content",
    "Manage My Account",
    "Mega menu",
    "Courses",
    "Dropdown",
    "Goals",
    "Dropdown",
    "For Organisations",
    "Insights",
    "Resources",
    "Dropdown",
    "Connect With Us",
    "Dropdown",
    "Business, Communication and Design",
    "Accounting and Finance",
    "Business Management",
    "Design Innovation",
    "Leadership and Communication",
    "View All",
    "Arrow",
    "Dropdown",
    "Engineering",
    "Building Services",
    "Civil Engineering",
    "Electrical Engineering",
    "Power and Clean Energy",
    "View All",
    "Arrow",
    "Dropdown",
    "Food, Chemical and Biotechnology",
    "Chemical Engineering",
    "Process Engineering",
    "Process Safety",
    "View All",
    "Arrow",
    "Dropdown",
    "Health and Social Sciences",
    "Elder Health and Rehabilitation",
    "Health Sciences",
    "Occupational Therapy",
    "Social Sciences",
    "View All",
    "Arrow",
    "Dropdown",
    "Infocomm Technology",
    "AI and Machine Learning",
    "Cybersecurity",
    "Data Science and Analytics",
    "Internet of Things",
    "View All",
    "Arrow",
    "Dropdown",
    "Search for Courses",
    "Course Brochure",
    "Course Finder",
    "Arrow",
    "Dropdown",
    "Take a Course",
    "Business, Communication and Design",
    "Engineering",
    "Food, Chemical and Biotechnology",
    "Health and Social Sciences",
    "Infocomm Technology",
    "Explore Courses",
    "Arrow",
    "Dropdown",
    "Earn Stackable Certificates",
    "Competency-based Stackable Micro-credential (CSM) Pathways",
    "Arrow",
    "Modular Certification Pathways",
    "Arrow",
    "Dropdown",
    "Obtain a Professional Certification",
    "Browse Professional Exams and Preparatory Courses",
    "Arrow",
    "Dropdown",
    "Make a Career Transition",
    "SkillsFuture Career Transition Programme",
    "Arrow",
    "Dropdown",
    "Lead with Impact",
    "Executive Education",
    "Arrow",
    "Dropdown",
    "Attend an Event",
    "Discover Upcoming Events",
    "Arrow",
    "Dropdown",
    "For SITizens",
    "Learn for Life",
    "Arrow",
    "Dropdown",
    "Funding",
    "Available Funding",
    "Arrow",
    "Dropdown",
    "Need Help?",
    "FAQ",
    "Arrow",
    "Dropdown",
    "Who We Are",
    "About Us",
    "Arrow",
    "Dropdown",
    "Let’s Connect",
    "Getting to SIT",
    "Contact Us",
    "Join Our Mailing List",
    "Arrow",
    "Dropdown",
    "Business, Communication and Design",
    "Accounting and Finance",
    "Business Management",
    "Design Innovation",
    "Leadership and Communication",
    "View All",
    "Arrow",
    "Dropdown",
    "Engineering",
    "Building Services",
    "Civil Engineering",
    "Electrical Engineering",
    "Power and Clean Energy",
    "View All",
    "Arrow",
    "Dropdown",
    "Food, Chemical and Biotechnology",
    "Chemical Engineering",
    "Process Engineering",
    "Process Safety",
    "View All",
    "Arrow",
    "Dropdown",
    "Health and Social Sciences",
    "Elder Health and Rehabilitation",
    "Health Sciences",
    "Occupational Therapy",
    "Social Sciences",
    "View All",
    "Arrow",
    "Dropdown",
    "Infocomm Technology",
    "AI and Machine Learning",
    "Cybersecurity",
    "Data Science and Analytics",
    "Internet of Things",
    "View All",
    "Arrow",
    "Dropdown",
    "Search for Courses",
    "Course Brochure",
    "Course Finder",
    "Arrow",
    "Dropdown",
    "Take a Course",
    "Business, Communication and Design",
    "Engineering",
    "Food, Chemical and Biotechnology",
    "Health and Social Sciences",
    "Infocomm Technology",
    "Explore Courses",
    "Arrow",
    "Dropdown",
    "Earn Stackable Certificates",
    "Competency-based Stackable Micro-credential (CSM) Pathways",
    "Arrow",
    "Modular Certification Pathways",
    "Arrow",
    "Dropdown",
    "Obtain a Professional Certification",
    "Browse Professional Exams and Preparatory Courses",
    "Arrow",
    "Dropdown",
    "Make a Career Transition",
    "SkillsFuture Career Transition Programme",
    "Arrow",
    "Dropdown",
    "Lead with Impact",
    "Executive Education",
    "Arrow",
    "Dropdown",
    "Attend an Event",
    "Discover Upcoming Events",
    "Arrow",
    "Dropdown",
    "For SITizens",
    "Learn for Life",
    "Arrow",
    "Dropdown",
    "Funding",
    "Available Funding",
    "Arrow",
    "Dropdown",
    "Need Help?",
    "FAQ",
    "Arrow",
    "Dropdown",
    "Who We Are",
    "About Us",
    "Arrow",
    "Dropdown",
    "Let’s Connect",
    "Getting to SIT",
    "Contact Us",
    "Join Our Mailing List",
    "Arrow",
    "Dropdown",
    "Mega menu",
    "< Back",
    "Courses",
    "Dropdown",
    "Goals",
    "Dropdown",
    "For Organisations",
    "Insights",
    "Resources",
    "Dropdown",
    "Connect With Us",
    "Dropdown",
    "Quick Links",
    "Manage My Account",
    ".page-node-type-programme #how-to-apply {\n    height: auto;\n  }",
    "Home",
    "Courses",
    "Engineering",
    "DSF6030 Managing and Leading Artificial Intelligence Projects for Smart Factory",
    "DSF6030 Managing and Leading Artificial Intelligence Projects for Smart Factory",
    "Gain business deployment skills for successful AI projects, validate project viability, and deliver strategic benefits through rapid prototyping and risk management.",
    "tag",
    "Advanced Manufacturing, AI and Machine Learning, Data Science and Analytics, Internet of Things",
    "Course Overview",
    "Domain",
    "Engineering",
    "Format",
    "Modular Certification Course",
    "Duration",
    "1+ months",
    "Fee Subsidy",
    "Up to 90% SF Funding",
    "Effective from AY2024/25 Trimester 2 (January 2025), the Postgraduate Certificate in Data Engineering and Smart Factory will be retired. For more details, please refer to the full notice",
    "here",
    ".",
    "Most AI Deep Learning and data science projects fail, despite promising test results and clear problem statements at the start.",
    "This is because many users may start off with unrealistic expectations due to an inadequate understanding of AI; what it can and cannot do, and IT managers may fail to understand the privacy, ethics, cyber security, and governance issues related to this new disruptive science. Additionally, there may not be enough high-quality data available, and users do not understand the importance of garbage in, garbage out.",
    "The aim of this module is to provide a business deployment perspective of foundational Deep Learning AI capabilities, ranging from Natural Language Processing to Machine Vision; in a manner that requires little or no coding. Neural networks and how Deep Learning works, the data input requirements, project lifecycle, and the development framework would be introduced. What problems each specific AI algorithm can solve would be illustrated in an interactive workshop session and the enterprise benefits would be highlighted via case studies; e.g. enhanced productivity for corporate decision-making, process automation, or difficult unattended problem-solving.",
    "The focus is on rapid prototyping and guiding the users and the relevant project team members to validate project viability using the data and requirements that are available. Importantly, you will gain the skills to highlight missing gaps, and failure scenarios and to discuss AI compliance, privacy, and cyber security requirements at the design phase, avoiding misunderstanding of the project’s complexity and hence be able to protect the project from failure.",
    "Finally, modern challenges such as ensuring man-in-the-loop AI oversight, cyber security hardening against adversarial AI attacks, and privacy obligations would be covered as new requirements for an upgraded corporate IT risk management framework that will be instrumental in protecting the company’s digitalisation efforts.",
    "The future of AI continues to shine brightly, and we aim to highlight major high-value factory automation future possibilities as AI and Big Data systems converge pervasively, and 5G and IoT AI at the edge become commodity. With these insights, you will master key leadership skills to manage and plan AI projects successfully and hence, deliver strategic benefits to the corporation.",
    "Who Should Attend",
    "Engineers and Project Managers of factory and automation systems",
    "Professionals with work exposure to manage automation projects or are managing factory innovation deployments, capabilities and associated risks",
    "\"This course enabled me to better understand future trends in the smart factory and build better rapport with each other.\"",
    "Yeoh Wee Chye",
    "-",
    "\"Course was really interesting and fundamental enough for an individual to understand and start exploring the world of Artificial Intelligence.\"",
    "Macalino Noel Minjoot",
    "Electromechanical System Integrator, WaveScan Technologies",
    "❮",
    "❯",
    "What You Will Learn",
    "The architecture, applications and operations of popular AI Deep Learning systems and how they would benefit smart factory via enhanced productivity in corporate decision-making, process automation and problem-solving",
    "Overview of software development using AI frameworks",
    "Overview of Natural Language Processing (NLP) AI systems and key applications",
    "Overview of AI vision processing systems for object recognition, segmentation, pose, biometrics and action recognition",
    "Overview of AI Ethics, governance, AI cyber security vulnerabilities such as Adversarial Attacks, data security, privacy and common implementation weaknesses. Understand privacy and cyber security best practices for AIOps and the need for ethics, transparency and fairness for Trustworthy AI",
    "Overview of AI Project Management and leadership roles",
    "State-of-the-art in AI, future trends and developments; new pending problems that can be solved with better algorithms and the cost reduction expected as the technology advances",
    "Analyse the feasibility of user requirements, data input requirements, AI project life cycle and deployment suitability for Smart Factory",
    "Teaching Team",
    "Yu Chien Siang",
    "Chief Innovation & Trust Officer, Amaris AI",
    "View profile",
    "close",
    "Yu Chien Siang",
    "Chief Innovation & Trust Officer, Amaris AI",
    "Prof Yu Chien Siang is the Chief Innovation & Trust Officer for Amaris AI, an AI startup that offers full stack AI as a service and is currently also Professor (ICT) at SIT. He was the Chief Innovation Officer (CIO) of a department in the Ministry of Home Affairs and later of Certis Cisco. In this role, he pioneered and developed new AI systems, i.e. embedded AI for low power and low cost edge systems, led a Malware and IoT Security Lab, as well as a Robotics and Drones Lab. Prior to this, he was the most senior Computer Security Consultant at the Singapore government. He was awarded the Carl Duisberg Gesellschaft Scholarship to pursue his studies at a German university and graduated as a Data Systems Engineer. During his study, he received training at the Siemens Research Laboratory and IBM R&D Laboratory in Boblingen. He has been working in the Civil Service since 1981 and was awarded National Day Honours, the Public Administration Medal (Silver) in 1993 and (Silver) Bar in 2004. He was also given the Cyber Security Hall of Fame in 2018, an inaugural professional category award from AISP and supported by the Cyber Security Agency.  \r\nHe has been active in the fields of IT leadership, innovation development and its related cultural transformation and IT Security for more than 30 years. During this time, he led numerous national-level IT projects in information security such as the Electronic Road Pricing (ERP), Standard Operating Environment (SOE) etc., IoT security via the ANSES project and homeland security, developing workflow and people identification operational systems. He was instrumental in evolving many advanced systems architecture used in the public service and the fundamental mechanisms required for their large systems rollout. He invented unique low cost smart card readers, strong cryptographic systems, more efficient protocols and fault tolerant designs. He was also a pioneer in robotics cum drone and AI hacking and new ideas like adaptive security (Liquid Defence) and Security by Design.\r\nIn addition, he is teaching a series of AI courses, titled Eureka!AI for C-suite and modern cyber security for CISOs at NUS and the undergraduate course on “Introduction to Cyber Crime”, but now renamed as “Introduction to Cyber Security” in his capacity as Adjunct Associate Professor at the Department of Mathematics of the National University of Singapore. He is member of the Singapore government’s Cyber Security Advisory Group and was an ex-President of the Singapore Microcomputer Society, a pioneer in the exploitation of microcomputers and a regular speaker at government events, being the founder of the Governmentware show. He has also been one of the judges for the RSA Innovation Sandbox since 2014. He is currently a member of ITSC, worked on ISO security standards and was involved in the early days of the AISP.",
    "Schedule",
    "Course Run",
    "Dates",
    "Time",
    "April – May 2024 Run",
    "9, 17, 24 April & 8, 15, 21 and 29 May 2024",
    "9:00 am – 6:00 pm",
    "Certificate and Assessment",
    "A Certificate of Attainment will be issued to participants who",
    "Attend at least 75% of the module; and",
    "Undertake and pass credit-bearing assessment during the module",
    "Participants who meet the attendance requirement but do not pass the assessment will receive a Certificate of Participation.",
    "Fee Structure",
    "The full fee for this course is S$5,886.00.",
    "Category",
    "After SF Funding",
    "Singapore Citizen (Below 40)",
    "S$1,765.80",
    "Singapore Citizen (40 & Above)",
    "S$685.80",
    "Singapore PR / LTVP+ Holder",
    "S$1,765.80",
    "Non-Singapore Citizen",
    "S$5,886.00 (No Funding)",
    "Note:",
    "All fees above include GST. GST applies to individuals and Singapore-registered companies.",
    "arrow--right",
    "Funding",
    "Learn more about funding schemes available",
    "Course Runs",
    "There are no upcoming course runs at the moment.",
    "Subscribe to our mailing list to learn about the latest dates as soon as they become available.",
    "SUBSCRIBE NOW",
    "Learning Pathway",
    "Earn a Postgraduate Certificate",
    "The Postgraduate Cetificate in Data Engineering and Smart Factory is designed to equip engineers for greater business competitiveness amidst the exponential growth in robotic automation, information and communication technologies.",
    "Explore More",
    "arrow--right",
    "Related Insights",
    "Participant Story",
    "Learning for Life Series - Seaw Ker Boon",
    "13 May 2021",
    "He may have already traded in his student card for a staff pass, but SIT alumni and staff member Seaw Ker Boon chose to head back to the classroom to become a student once again. The aspiring software architect shares why he attended the Machine Learning courses under the SITLEARN programme.",
    "tag",
    "AI and Machine Learning",
    "You May Also Like",
    "Infocomm Technology",
    "Generative Artificial Intelligence Fundamentals",
    "Be introduced to creative AI, covering generative models, their applications, ethics, and hands-on experience.",
    "calendar-day",
    "Upcoming runs:",
    "10 Jul 2025",
    "09 Oct 2025",
    "clock-five",
    "2 days",
    "delivery-mode",
    "In-person",
    "dollar-sign",
    "SGD\n      \n $2,180.00",
    "Up to 90% SF Funding",
    "tag",
    "AI and Machine Learning",
    "Executive Education",
    "Machine Learning and AI Data Analytics for the Semiconductor Industry",
    "Learn to address semiconductor manufacturing complexities with AI and ML and gain hands-on experience using Python programming.",
    "calendar-day",
    "14 Jul 2025",
    "clock-five",
    "6.5 days over 3 months",
    "delivery-mode",
    "In-person",
    "dollar-sign",
    "SGD\n      \n $7,793.50",
    "Up to 90% SF Funding",
    "tag",
    "Data Science and Analytics, AI and Machine Learning, Executive Education",
    "Infocomm Technology",
    "Artificial Intelligence in Broad Strokes",
    "This course demystifies machine learning concepts and helps you gain technical grounding and foresight for digital transformation in business.",
    "calendar-day",
    "17 Jul 2025",
    "clock-five",
    "2 days",
    "delivery-mode",
    "In-person",
    "dollar-sign",
    "SGD\n      \n $1,744.00",
    "Up to 90% SF Funding",
    "tag",
    "AI and Machine Learning, Computer Ethics and Privacy",
    "Executive Education",
    "Chief Open Source Officer Programme",
    "An executive programme that trains leaders in open source technology, risk management, and innovation, preparing them for Chief Open Source Officer roles.",
    "calendar-day",
    "28 Jul 2025",
    "clock-five",
    "4 weeks",
    "delivery-mode",
    "In-person",
    "dollar-sign",
    "SGD\n      \n $8,720.00",
    "Up to 90% SF Funding",
    "tag",
    "Business Management, Leadership and Communication, Internet of Things, Executive Education",
    "Business, Communication and Design",
    "Data Forensics in Accounting",
    "Supported by CPA Australia, this course teaches you how to plan, design, and apply data analytics tests to identify red flags of fraud.",
    "calendar-day",
    "14 Aug 2025",
    "clock-five",
    "2 days",
    "delivery-mode",
    "In-person",
    "dollar-sign",
    "SGD\n      \n $1,962.00",
    "Up to 90% SF Funding",
    "tag",
    "Accounting and Finance, Business Management, Data Science and Analytics, Audit",
    "Engineering",
    "Data Analytics for Engineering",
    "Specialised micro-credential for strong technical and theoretical expertise in data analytics. Earn a Specialist Certificate and stack it towards a degree in Electrical and Electronic Engineering.",
    "calendar-day",
    "01 Sep 2025",
    "clock-five",
    "3+ months",
    "delivery-mode",
    "Blended",
    "dollar-sign",
    "SGD\n      \n $10,006.20",
    "Up to 90% SF Funding",
    "Stackable towards:",
    "BEng (Hons) Electrical & Electronic Engineering or Infrastructure & Systems Engineering",
    "tag",
    "Data Science and Analytics, AI and Machine Learning, Competency-based Education",
    "❮",
    "❯",
    "Overview",
    "Who Should Attend",
    "What You Will Learn",
    "Teaching Team",
    "Schedule",
    "Certificate and Assessment",
    "Fee Structure",
    "Course Runs",
    "Learning Pathway",
    "FAQ",
    "Apply Now",
    "Register Interest",
    "Download Brochure",
    "Back to top",
    "DSF6030",
    "#block-announcement-popup {\n display: none;\n}",
    "New Engineering Micro-credentials Launching Soon!",
    "Exciting news! We are introducing new micro-credentials in Electrical and Electronic Engineering & Infrastructure and Systems Engineering. Be among the first to know by registering your interest today!",
    "Register now →",
    "SIT reserves the right to make changes to published course information, including dates, times, venues, fees and instructors without prior notice.",
    "Address",
    "1 Punggol Coast Road Singapore 828608",
    "Contact Us",
    "Send an Enquiry",
    "Visiting SIT",
    "Our Campus Locations",
    "Privacy Statement",
    "Safety and Health",
    "Social Media Guidelines",
    "Terms of Use",
    "Whistleblowing",
    "CET Course Terms & Conditions",
    "Copyright ©",
    "2025",
    "Singapore Institute of Technology. All Rights Reserved.",
    ".contact-link2 a:link,  .contact-link2 a:visited {\n    border-bottom:0px;\n}",
    "{\"path\":{\"baseUrl\":\"\\/sitlearn\\/\",\"pathPrefix\":\"\",\"currentPath\":\"node\\/9246\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"colorbox\":{\"transition\":\"elastic\",\"speed\":350,\"opacity\":0.84999999999999998,\"slideshow\":false,\"slideshowAuto\":true,\"slideshowSpeed\":2500,\"slideshowStart\":\"start slideshow\",\"slideshowStop\":\"stop slideshow\",\"current\":\"{current} of {total}\",\"previous\":\"\\u00ab Prev\",\"next\":\"Next \\u00bb\",\"close\":\"Close\",\"overlayClose\":true,\"returnFocus\":true,\"maxWidth\":\"85%\",\"maxHeight\":\"80%\",\"initialWidth\":\"1%\",\"initialHeight\":\"1%\",\"fixed\":true,\"scrolling\":true,\"mobiledetect\":false,\"mobiledevicewidth\":\"480px\"},\"simple_popup_blocks\":{\"settings\":[]},\"lazyLoadUrl\":\"\\/sitlearn\\/term_reference_fancytree\\/subTree\",\"field_group\":{\"html_element\":{\"mode\":\"default\",\"context\":\"view\",\"settings\":{\"classes\":\"group-programme-details grid gap-4 m-0 bs-columns-1 bs-columns-sm-3\",\"show_empty_fields\":false,\"id\":\"\",\"element\":\"div\",\"show_label\":false,\"label_element\":\"h3\",\"label_element_classes\":\"\",\"attributes\":\"\",\"effect\":\"none\",\"speed\":\"fast\"}}},\"blazy\":{\"loadInvisible\":false,\"offset\":100,\"saveViewportOffsetDelay\":50,\"validateDelay\":25,\"container\":\"\",\"loader\":true,\"unblazy\":false,\"visibleClass\":false},\"blazyIo\":{\"disconnect\":false,\"rootMargin\":\"0px\",\"threshold\":[0,0.25,0.5,0.75,1]},\"slick\":{\"accessibility\":true,\"adaptiveHeight\":false,\"autoplay\":false,\"pauseOnHover\":true,\"pauseOnDotsHover\":false,\"pauseOnFocus\":true,\"autoplaySpeed\":3000,\"arrows\":true,\"downArrow\":false,\"downArrowTarget\":\"\",\"downArrowOffset\":0,\"centerMode\":false,\"centerPadding\":\"50px\",\"dots\":false,\"dotsClass\":\"slick-dots\",\"draggable\":true,\"fade\":false,\"focusOnSelect\":false,\"infinite\":true,\"initialSlide\":0,\"lazyLoad\":\"ondemand\",\"mouseWheel\":false,\"randomize\":false,\"rtl\":false,\"rows\":1,\"slidesPerRow\":1,\"slide\":\"\",\"slidesToShow\":1,\"slidesToScroll\":1,\"speed\":500,\"swipe\":true,\"swipeToSlide\":false,\"edgeFriction\":0.34999999999999998,\"touchMove\":true,\"touchThreshold\":5,\"useCSS\":true,\"cssEase\":\"ease\",\"cssEaseBezier\":\"\",\"cssEaseOverride\":\"\",\"useTransform\":true,\"easing\":\"linear\",\"variableWidth\":false,\"vertical\":false,\"verticalSwiping\":false,\"waitForAnimate\":true},\"user\":{\"uid\":0,\"permissionsHash\":\"6865a5a4a677c61446c24b3c09f1809962249dff5b0b68c3d1096b60d4557c4b\"}}"
  ],
  "desc_divs": [
    "Learn more about funding schemes available",
    "Learn more about funding schemes available",
    "The Postgraduate Cetificate in Data Engineering and Smart Factory is designed to equip engineers for greater business competitiveness amidst the exponential growth in robotic automation, information and communication technologies.\nExplore More\narrow--right",
    "He may have already traded in his student card for a staff pass, but SIT alumni and staff member Seaw Ker Boon chose to head back to the classroom to become a student once again. The aspiring software architect shares why he attended the Machine Learning courses under the SITLEARN programme.",
    "Be introduced to creative AI, covering generative models, their applications, ethics, and hands-on experience.",
    "Learn to address semiconductor manufacturing complexities with AI and ML and gain hands-on experience using Python programming.",
    "This course demystifies machine learning concepts and helps you gain technical grounding and foresight for digital transformation in business.",
    "An executive programme that trains leaders in open source technology, risk management, and innovation, preparing them for Chief Open Source Officer roles.",
    "Supported by CPA Australia, this course teaches you how to plan, design, and apply data analytics tests to identify red flags of fraud.",
    "Specialised micro-credential for strong technical and theoretical expertise in data analytics. Earn a Specialist Certificate and stack it towards a degree in Electrical and Electronic Engineering."
  ],
  "article_texts": [],
  "links": [
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory#main-content",
    "https://sitlearn.singaporetech.edu.sg/profile/",
    "https://www.singaporetech.edu.sg/sitlearn/",
    "https://www.singaporetech.edu.sg/sitlearn/",
    "https://www.singaporetech.edu.sg/sitlearn/organisations",
    "https://www.singaporetech.edu.sg/sitlearn/insights",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A51",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A53",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A60",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A57",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A19",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A52",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A56",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A74",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A49",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A20",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A54",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A69",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A70",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A22",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A48",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A62",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A66",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A201",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A21",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A191",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A58",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A59",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A196",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A23",
    "https://www.singaporetech.edu.sg/sitlearn/courses/course-brochure",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/courses/business-communication-design",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering",
    "https://www.singaporetech.edu.sg/sitlearn/courses/food-chemical-biotechnology",
    "https://www.singaporetech.edu.sg/sitlearn/courses/health-social-sciences",
    "https://www.singaporetech.edu.sg/sitlearn/courses/infocomm-technology",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/modular-certification-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/professional-exams-preparatory-courses",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory",
    "https://www.singaporetech.edu.sg/sitlearn/executive-education",
    "https://www.singaporetech.edu.sg/sitlearn/events",
    "https://www.singaporetech.edu.sg/sitlearn/resources/learn-for-life",
    "https://www.singaporetech.edu.sg/sitlearn/resources/funding",
    "https://www.singaporetech.edu.sg/sitlearn/resources/faq",
    "https://www.singaporetech.edu.sg/sitlearn/about-us",
    "https://www.singaporetech.edu.sg/sitlearn/getting-sit",
    "https://www.singaporetech.edu.sg/sitlearn/contact-us",
    "https://www.singaporetech.edu.sg/sitlearn/join-our-mailing-list",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A51",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A53",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A60",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A57",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A19",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A52",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A56",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A74",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A49",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A20",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A54",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A69",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A70",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A22",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A48",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A62",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A66",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A201",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A21",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A191",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A58",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A59",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=topics%3A196",
    "https://www.singaporetech.edu.sg/sitlearn/courses?f%5B0%5D=domain%3A23",
    "https://www.singaporetech.edu.sg/sitlearn/courses/course-brochure",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/courses/business-communication-design",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering",
    "https://www.singaporetech.edu.sg/sitlearn/courses/food-chemical-biotechnology",
    "https://www.singaporetech.edu.sg/sitlearn/courses/health-social-sciences",
    "https://www.singaporetech.edu.sg/sitlearn/courses/infocomm-technology",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/csm-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/modular-certification-pathways",
    "https://www.singaporetech.edu.sg/sitlearn/professional-exams-preparatory-courses",
    "https://www.singaporetech.edu.sg/sitlearn/skillsfuture-career-transition-programme",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory",
    "https://www.singaporetech.edu.sg/sitlearn/executive-education",
    "https://www.singaporetech.edu.sg/sitlearn/events",
    "https://www.singaporetech.edu.sg/sitlearn/resources/learn-for-life",
    "https://www.singaporetech.edu.sg/sitlearn/resources/funding",
    "https://www.singaporetech.edu.sg/sitlearn/resources/faq",
    "https://www.singaporetech.edu.sg/sitlearn/about-us",
    "https://www.singaporetech.edu.sg/sitlearn/getting-sit",
    "https://www.singaporetech.edu.sg/sitlearn/contact-us",
    "https://www.singaporetech.edu.sg/sitlearn/join-our-mailing-list",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory",
    "https://www.singaporetech.edu.sg/sitlearn/organisations",
    "https://www.singaporetech.edu.sg/sitlearn/insights",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory",
    "https://sitlearn.singaporetech.edu.sg/profile/",
    "https://www.singaporetech.edu.sg/sitlearn/",
    "https://www.singaporetech.edu.sg/sitlearn/courses",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory",
    "https://www.singaporetech.edu.sg/sitlearn/modular-certification-pathways/data-engineering-smart-factory",
    "https://www.singaporetech.edu.sg/sitlearn/resources/funding",
    "https://www.singaporetech.edu.sg/sitlearn/join-our-mailing-list",
    "https://www.singaporetech.edu.sg/sitlearn/modular-certification-pathways/data-engineering-smart-factory",
    "https://www.singaporetech.edu.sg/sitlearn/insights/participant-story/learning-life-series-seaw-ker-boon",
    "https://www.singaporetech.edu.sg/sitlearn/courses/infocomm-technology/generative-artificial-intelligence-fundamentals",
    "https://www.singaporetech.edu.sg/sitlearn/courses/executive-education/machine-learning-ai-data-analytics-semiconductor-industry",
    "https://www.singaporetech.edu.sg/sitlearn/courses/infocomm-technology/artificial-intelligence-broad-strokes",
    "https://www.singaporetech.edu.sg/sitlearn/courses/executive-education/chief-open-source-officer-programme",
    "https://www.singaporetech.edu.sg/sitlearn/courses/business-communication-design/data-forensics-accounting",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/data-analytics-engineering-microcredential",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory#overview",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory#who-should-attend",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory#what-you-will-learn",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory#teaching-team",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory#schedule",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory#certificate-assessment",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory#fee-structure",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory#course-runs",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory#learning-pathway",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory#faqs",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory#course-runs",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory#course-register-link",
    "https://admission-postgrad.singaporetech.edu.sg/ ",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory",
    "https://sit.au1.qualtrics.com/jfe/form/SV_6FKhISzRqyVUdYq",
    "https://www.singaporetech.edu.sg/sitlearn/courses/engineering/dsf6030-managing-leading-artificial-intelligence-projects-smart-factory#0",
    "https://www.google.com/maps/place/Singapore+Institute+of+Technology+(SIT)+-+Punggol/@1.41364,103.91229,14z/data=!4m6!3m5!1s0x31da1515bfb2d263:0xc71c56458ac08497!8m2!3d1.4136399!4d103.9122896!16s%2Fg%2F11t42h3wb_",
    "https://www.singaporetech.edu.sg/contact-us",
    "https://www.singaporetech.edu.sg/campus-locations",
    "https://www.facebook.com/SingaporeTech/",
    "https://www.instagram.com/singaporetech/",
    "https://www.linkedin.com/company/singapore-institute-of-technology",
    "https://www.youtube.com/user/SingaporeTech",
    "https://www.tiktok.com/@singaporetech",
    "https://www.singaporetech.edu.sg/sitlearn/privacy-statement",
    "https://www.singaporetech.edu.sg/safety-and-health-policy",
    "https://www.singaporetech.edu.sg/social-media-guidelines",
    "https://www.singaporetech.edu.sg/sitlearn/terms-use",
    "https://www.singaporetech.edu.sg/whistleblowing",
    "https://www.singaporetech.edu.sg/sitlearn/media/sit-cet-terms-conditions"
  ],
  "images": [
    "/sitlearn/sites/sitlearn/files/2023-03/course-postgradcertindataengandsmartfactory-banner.jpg",
    "/sitlearn/sites/sitlearn/files/2023-02/Avatar%20Male_0.png",
    "/sitlearn/sites/sitlearn/files/2023-02/Avatar%20Male_0.png",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "/sitlearn/sites/sitlearn/files/2023-03/course-postgradcertindataengandsmartfactory-banner.jpg",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E",
    "data:image/svg+xml;charset=utf-8,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20viewBox%3D'0%200%201%201'%2F%3E"
  ]
}