{
  "url": "https://www.singaporetech.edu.sg/sitlearn/sites/sitlearn/files/2024-09/SITLEARN%20Website%20-%20Account%20and%20Course%20Registration%20Guide%20for%20HR%20or%20Company-sponsored%20Participants_V5.pdf",
  "type": "pdf",
  "content": "Updated: 12 September  2024  Page 1 of 25\nSITLEARN  Website - Account Creation  and Course Registration Guide  for\nCorporate HR or Company -Sponsored Participants\nContents\nSITLEARN Website - Account Creation and Course Registration Guide for Corporate HR or Company -Sponsored Participants  .............. 1\n1 Creating an Account  ................................................................................................................................................................................ 2\n1.1 Sign In  .......................................................................................................................................................................................... 2\n1.1.1 Corporate HR or Company -Sponsored Participants  .......................................................................................................... 3\n1.1.2 Corporate Login  .................................................................................................................................................................  6\n2 Link Your Social Media Accounts  ............................................................................................................................................................ 9\n3 Manage Mailing Preferences  .................................................................................................................................................................. 9\n4 Register for a Course ............................................................................................................................................................................. 11\n4.1 Course Registration for HR/Company -Sponsored Participants  ...................................................................................................... 11\n4.2.1 Upload Single Participant  ........................................................................................................................................................ 15\n4.2.2 Upload Multiple Participants  .................................................................................................................................................. 16\n5 Payment for HR/Company -Sponsored Participants  .............................................................................................................................. 20\n5.1 Online and Offline Payment for HR/Company -Sponsored Participants  ......................................................................................... 20\n6 Course Status  ........................................................................................................................................................................................ 23\n7. Course Withdrawal or Course Cancellation  ......................................................................................................................................... 25\nUpdated: 12 September  2024  Page 2 of 25\n1 Creating an A ccount\nVisit SITLEARN  - Home  (singaporetech.edu.sg/sitlearn /) and click “ Manage My Account ” at the top right of the\nwebsite. We recommend using  a Chrome or Microsoft Edge  browser  for registrations .\nPlease note that you are required  to have an account with SIT LEARN  before registering  for the course(s) that\nyou are keen to attend.\n1.1 Sign In\nFor existing corporate HR or company -sponsored participants , please s ign in through “ Corporate - Login” .\n• Corporate HR : You are  signing up for courses on behalf of your colleagues.\n• Company -sponsored participants : You are signing up for courses  yourself and are sponsored by your\ncompany .\nNote:\n• All corporate users are now required to log  in to corporate accounts with their registered\ncorporate email address for course registration.\n• Corporate account user id EC000***@ext.siat.edu.sg  will no longer be valid for corporate\naccount login.\n• Please refer to the updated corporate account login guide below.\nUpdated: 12 September  2024  Page 3 of 25\n1.1.1 Corporate HR or Company -Sponsored  Participants\nOn the Sign In page, c lick on  to create a new corporate account.\nOn the Corporate Sign -up page, you are required to f ill in the relevant details  for all sections:  Company\nInformation , Company Address , and Company Contact . Please note that one  corporate email address can only\nbe used to register for one  company UEN.  You may check your company’s UEN number here:\nhttps://www.uen.gov.sg/ueninternet/faces/pages/uenSrch.jspx\nNote:  The correspondences on account creation, billing , and course details will be sent to the email provided\nin Company Contact.\nUpdated: 12 September  2024  Page 4 of 25\nUpdated: 12 September  2024  Page 5 of 25\nUpon completion, kindly c heck the boxes for your Acknowledge ment  and click “Submit” to proceed.  You will\nreceive an email notification  upon the submission of the Corporate Sign- up form .\nYour account creation request is now under review  and the process  may take up to three  (3) working days .\nOnce your request has been approved  by SIT LEARN , you will receive the following  email :\nUpdated: 12 September  2024  Page 6 of 25\n1.1.2 Corporate Login\nVisit SITLEARN  - Home  (singaporetech.edu.sg/sitlea rn/) and click “ Manage My Account ” at the top right of the\nwebsite  and select   to log  in.\nYou will be directed  to the Sign In page as shown below . Kindly e nter your registered email address and click\n“Send verification code”.\nNote:  If you encounter any issues receiving the verification code, please check your email spam folder  and/or\nensure that your company VPN connection is disconnected before requesting for the verification code .\nOtherwise, click “Send new code” to resend the code.\nHumanResource @company .com\nUpdated: 12 September  2024  Page 7 of 25\nA one -time verification code will be sent to your registered  email :\nPlease enter the verification code on the Sign In page within 5 minutes and click “Verify code”.\nHumanResource @company .com\n925938\nUpdated: 12 September  2024  Page 8 of 25\nOnce the code has been verified successfully, click “Login” to proceed,  and you will be directed  to our\nhomepage.\nOnce you have logged in  successfully, you will be brought to your Profile page,  and you can:\n- View Your Profile\n- View / Edit / Cancel Your  Courses\n- Manage Your Mailing Preferences\nIf you would like to update your profile details, please email us at SITLEARN@SingaporeTech.edu.sg .\nHumanResource @company .com\nUpdated: 12 September  2024  Page 9 of 25\n2 Link Your Social Media Accounts\nClick “Manage External Authentication” if you would like to link your other social media p latforms to your\nSITLEARN  account  for easy access .\nClick “Connect ” on the social media platform you would like to connect  to and log in accordingly.\n3 Manage Mailing Preference s\nTo update your mailing preference s, click  “Manage Mailing Preferences”.\nUpdated: 12 September  2024  Page 10 of 25\nSelect the categor ies that you are interested in and click “Submit”.\nUpdated: 12 September  2024  Page 11 of 25\n4 Register for a Course1\n4.1 Course Registration for  HR/Company -Sponsored Participants\nKindly ensure you have an account with SIT LEARN  and log in before registering for the course (s). Please\nrefer to 1 Creating an Account  on the steps of creating a corporate account with us.\nUpon successful login, please  browse through our courses on our website  under “Courses” or “Goals”.\nAlternatively,  you can search for a course via our Course Finder .\n1 Course includes Seminars, Symposiums, Examinations, Workshops etc.\nUpdated: 12 September  2024  Page 12 of 25\nSelect and click “Apply Now” and choose the course run you wish to register for.\nUpdated: 12 September  2024  Page 13 of 25\nFill in and v erify the relevant details and check the declaration box before clicking “Save & Add Participants”.\nUpdated: 12 September  2024  Page 14 of 25\n4.2 Add Participant(s)\nIt is recommended that you add participant(s) as follows:\n1. Single participant -  Click  “+ Add Participant”\n2. Multiple participants -  Click “Upload  Participants”  via the excel file\nUpdated: 12 September  2024  Page 15 of 25\n4.2.1 Upload Single Participant\nYou may add the participant s one by one  by clicking on  . You will be prompt ed with\nanother page to fill in the participant’s details . Click “Submit” once all the relevant information has been filled\nin.\nUpdated: 12 September  2024  Page 16 of 25\n4.2.2 Upload Multiple Participants\nYou may bulk upload a list of participant s via the excel template by clicking on  to add\nmultiple course  participants .\nA pop -up will appear. Follow the steps on the pop -up window  and click “Download Template” .\nWe encourage you to always download the template for each registration, ensuring that you have the latest\nversion and to prevent errors when uploading the list of participants.\nThe latest template  can also be downloaded here: Multiple Participants Template .\nOn the template, enable editing and content; and fill in the relevant details  on the “Participants” tab .\nAn “Instructions” tab is available to assist you in completing each of the fields.\n• For SkillsFuture -funded courses, please fill in all the fields listed.\n• For non -funded courses, fields highlighted in orange are non -mandatory.\nChoose your completed template  and click “U pload ”.\nUpdated: 12 September  2024  Page 17 of 25\nYou will be able to preview the list of participants you have added . Required information that is missing ,\nduplicate email address es, or invalid information will be highlighted in red.  You may either ,\n- Click “Edit” to input/edit the individual registrant manually  or;\n- Update the relevant information in the template  before uploading again. Click “Submit”  to save\nuploaded list of participants.\nYou can view the list of participants you have added or uploaded under Registration Participant Information.\nYou may click on the dropdown to Edit / Delete the participant too.\nUpdated: 12 September  2024  Page 18 of 25\nUpload  the relevant documents under “Supporting Documents” , check the declaration box  and click “Next ”.\nYou will be brought to the Payment Summary Page and view the breakdown of the course fee .\nClick “Submit” to register for the course.\nUpdated: 12 September  2024  Page 19 of 25\nA pop -up message will appear to notify  you that SIT LEARN  has received your registration , as shown below.\nYou will receive an email o n the outcome of your registration at least 7 -  21 calendar days before the course\nstart date. Click “O K” to complete the registration submission.\nOnce registration is submitted, your registration will be reflected under “My  Courses” and the registration\nstatus will be indicated as “Pending Approval”. Note:  No payment is required at this point. The “Pay” button is\nnot clickable until the registration status is updated to “Pending Payment”.\nAn auto -generated email (as follows) will be sent to you to notify you o f the registration submission .\nDear Dr Human Resource,\nThank you for your registration for  Artificial Intelligence in Broad Strokes [CSE -OP-202206000114 12/10/2022 9:00 AM –  19/10/2022 6:00\nPM]\nYour registration status is Pending Approval .\nWe will inform you on the final registration status 7– 21 calendar days before the course start date.\nIf you are registering on behalf of other individuals, please access your account to check on the specific individual’s regis tration status and inform\nthem on their status.\nPayment\nIf the registration status is successful, we will notify you for payment as a company -sponsored participant . If you are self -sponsored, do inform\nus in writing immediately as the invoicing is different.\nFinancial Charges\nPlease take note of applicable financial charges should you withdraw once the course application is confirmed by SIT in writing to you.\nNotice Period  Withdrawal Charges\nMore than 14 days before the start of the course  No charge\n7–14 days before the start of the course  50% of net course fee payable\nLess than 7 days from the start of the course  100% of net course fee payable\nPre-course Information\nWe will email confirmed participants with pre -course administrative information before course commencement.\nKindly contact sitlearn@singaporetech.edu.sg\nif you require any clarification.\nThank you.\nSincerely,\nSITLEARN\nSingapore Institute of Technology\nUpdated: 12 September  2024  Page 20 of 25\n5 Payment for H R/Company -Sponsored Participants\n5.1 Online and Offline Payment for H R/Company -Sponsored Participants\nOnce the course is confirmed to run, a n email on payment will be sent to you. Please follow the instructions\nindicated in the email to make payment for the course.\nDear Dr Human Resource,\nThank you for your interest in Artificial Intelligence in Broad Strokes [CSE -OP-202206000114 12/10/2022 9:00 AM –  19/10/2022 6:00 PM]\nPlease find enclosed invoice and payment instructions.\nYou may login via https://sitlearn.singaporetech.edu.sg/SignIn?returnUrl=%2F  and proceed to “My Courses” to make the payment. For offline payment,\nplease forward the invoice to your Finance Division for payment processing. Please take note that our payment terms are immediate.\nWithdrawal\nNo withdrawal is allowed once course has started.  Any no -show will be considered as absentee. No portion of the course fees shall be refunded if a\nparticipant fails to complete the course for any reason or does not turn up on the first day of the course or after the cours e start date.\nNotice Period  Withdrawal Charges\nMore than 14 days before the start of the course  No charge\n7–14 days before the start of the course  50% of net course fee payable\nLess than 7 days from the start of the course  100% of net course fee payable\nPre-course Information\nWe will email confirmed participants with pre -course administrative information before course commencement.\nKindly contact sitlearn@singaporetech.edu.sg\nif you require any clarification.\nThank you.\nSincerely,\nSITLEARN\nSingapore Institute of Technology\nAlternatively, you may proceed to log  in via SIT LEARN  - Home  (singaporetech.edu.sg/sitlearn ) and click\n“Manage My Account ” at the top right of the website.  Once you have logged in successfully, select  “My  Courses”\non your profile page. Click “Pay” to proceed with the course fee payment.\nUpdated: 12 September  2024  Page 21 of 25\nThe d etails of the course fees and their  breakdown will be displayed on  the payment summary page. Select\nyour preferred payment mode and click “Submit”.\nOnce SIT LEARN  has received payment, you will receive two  emails - one on Course Confirmation and another\non Invoice .\nDear Dr Human Resource,\nThank you for the payment.\nEnclosed is the invoice copy with the updated payment status for your retention.\nWithdrawal\nNo withdrawal is allowed once course has started.  Any no -show will be considered as absentee. No portion of the course fees shall be\nrefunded if a participant fails to complete the course for any reason or does not turn up on the first day of the course or after the course\nstart date.\nNotice Period  Withdrawal Charges\nMore than 14 days before the start of the course  No charge\n7–14 days before the start of the course  50% of net course fee payable\nLess than 7 days from the start of the course  100% of net course fee payable\nPre-course Information\nWe will email confirmed participants with pre -course administrative information before course commencement.\nKindly contact sitlearn@singaporetech.edu.sg\nif you require any clarification.\nThank you.\nSincerely,\nSITLEARN\nSingapore Institute of Technology\nUpdated: 12 September  2024  Page 22 of 25\nDear Dr Human Resource,\nThank you for your registration for Artificial Intelligence in Broad Strokes [CSE -OP-202206000114 12/10/2022 9:00 AM –\n19/10/2022 6:00 PM]\nYour registration status: Course Confirmed .\nIf you are registering on behalf of others, please access your account to check on the specific individual’s registration status and inform them on their status.\nPayment\nWe will soon notify you for payment. Please follow the payment instructions in the invoice.\na. If you are self -sponsored and have chosen to utilise SkillsFuture Credits, we may require you to pay in the event of any\nunsuccessful disbursement of funding from SkillsFuture Singapore.\nb. If you are company -sponsored, we will invoice your company directly.\nWithdrawal\nNo withdrawal is allowed once course has started.  Any no -show will be considered as absentee. No portion of the course fees shall be\nrefunded if a participant fails to complete the course for any reason or does not turn up on the first day of the course or after the course\nstart date.\nNotice Period  Withdrawal Charges\nMore than 14 days before the start of the course  No charge\n7–14 days before the start of the course  50% of net course fee payable\nLess than 7 days from the start of the course  100% of net course fee payable\nPre-course Information\nWe will email confirmed participants with pre -course administrative information before course commencement.\nKindly contact sitlearn@singaporetech.edu.sg\nif you require any clarification.\nThank you.\nSincerely,\nSITLEARN\nSingapore Institute of Technology\nFive days prior to the course ’s start date, you will receive a Pre -course Letter with administrative details.\nUpdated: 12 September  2024  Page 23 of 25\n6 Course Status\nTo check the status of your course, you may visit SITLEARN  - Home  (singaporet ech.edu.sg/sitlearn /) and click\n“Manag e My Account ” at the top right of the website.   Once you have logged in  successfully , select “My\nCourses” on your Profile page to view the courses that you have registered  for.\nYou will see the  list of the courses  you have registered for.\nUpdated: 12 September  2024  Page 24 of 25\nRegistration Status  Action Required\nDraft  Course registration has not been  submitted yet, please complete\ncourse registration and submit .\nPending Approval  We have received your course registration, you will receive the\noutcome of your registration 3 weeks prior to  the course start date\nfor non -credit bearing courses and 6 weeks for credit -bearing courses.\nPending Payment  The c ourse has been approved. Please proceed to make payment.\nSuccessful  We have received payment for the course. You will receive a pre -\ncourse letter with administrative details 5 days prior to the course\nstart date.\nUpdated: 12 September  2024  Page 25 of 25\n7. Course Withdrawal or Course Cancellation\nWithdrawal\nNo withdrawal is allowed once the course has started. Any no -show will be considered as an absentee. No\nportion of the course fees shall be refunded if a participant fails to complete the course for any reason or does not turn up on the first day of the course or after the course start date.\nNotice Period  Withdrawal Charges\nMore than 14 days before the start of the course  No charge\n7–14 days before the start of the course  50% of net course fee payable\nLess than 7 days from the start of the course  100% of net course fee payable\nYou are allowed to edit/ cancel a participant’s registration  before the submission. Once you have logged\nin, you may click on the “Profile”  dropdown at and select “My  Courses” to view the courses that you have\nregistered  for.  Click on the “Action” dropdown and select “Edit”/“Cancel”.\nShould you w ish to withdraw from the course  after registration submission , please  email us at\nsitlearn@singaporetech.edu.sg  for the withdrawal request (subject to the w ithdrawal charges). Please\nrefer to our terms and conditions  for more details.\nCourse Cancellation\nIn the event of course cancellation, y ou will be notified through email that  your registration is\nunsuccessful .\nDear  Dr Human Resource,\nWe regret to inform you that your registration is unsuccessful . The course may either have been rescheduled,\ncancelled or reached maximum class size.\nIf you are registering on behalf of other individuals, please access your account to check on the specific individual’s\nregistration status and inform them on their status.\nOnce again, we apologise for the inconvenience caused.\nThere may be future runs of this course. However, we will not be able to put you on a waiting list  nor register on your\nbehalf for future runs of the course. You may wish to subscribe to our mailing list for course announcement s and\nregister if a future run of this course is available .\nKindly contact sitlearn@singaporetech.edu.sg\nif you require any clarification.\nThank you.\nSincerely,\nSITLEARN\nSingapore Institute of Technology"
}