{
  "url": "https://www.singaporetech.edu.sg/sitlearn/sites/sitlearn/files/2023-03/Prior%20Learning%20Assessment%20%28PLA%29.pdf",
  "type": "pdf",
  "content": "Page 1 of 3\nPrior Learning Assessment (PLA)\nfor enrollment to\nCertificate in Clinical Supervision (Accelerated)\nCourse\nPage 2 of 3\nIntroduction\nThe accelerated pathway for the Certificate in Clinical Supervision programme recognises the prior\nlearning and work experiences of Senior Allied Health Educators and offers a shorter route to completion\nof the Certificate in Clinical Supervision course.\nParticipants will need to meet ALL prerequisites  to qualify for enrollment into the accelerated pathway.\n● Possess at least five years of clinical experience as an AHP.\n● Supervised at least 4 AHP students or staff as the main  Clinical Educator or Supervisor and\ndemonstrated achievement of the course competencies through a reflection portfolio.\n● Completed the 'I am a Clinical Educator' (ICE) workshop or equivalent basic c linical education\ntraining.\nApplicants are to submit a Prior Learning Assessment (PLA) at the point of registration for the course.\nContent in PLA should include the following :\n1. Title page\n2. Cover letter\n3. Curriculum Vitae (CV) as Allied health educator\n4. Reflection portfolio of past experiences as main clinical educator or supervisor\nPlease refer to submission guidelines below for content details and format of PLA submission.\nFollowing review of the PLA by the core teaching team, SIT will send a response to applicants within 1\nmonth to confirm enrollment into the accelerated pathway or offer enrollment into the full course if the\npre-requisites are not met.\nSubmission guidelines for PLA\nFormat of PL A submission:\n1. Can be in word or pdf document\n2. Minimum font of 11 in arial or times new roman\n3. Total pages should be no more than 5 pages , including title page.\nContent to be included in PLA submission:\n1. Title page\n- Please include your full name, profession, AHPC number (if relevant), PLA submission\nand Accelerated course date you are applying for.\n2. Cover letter\n- Please include your aims and key learning goals for enrolment to the certificate course\nand potential  application of new learning to your workplace.\nPage 3 of 3\n3. Curriculum Vitae (CV) as Allied health educator\n- Please include only relevant experiences as an allied health educator  over the past 10\nyears e.g. years of being a clinical educator, estimated total numb er of learners\nsupervised/educated, attendance and/or delivery of clinical education programmes, or\nparticipation in education initiatives. ( You can attach relevant screenshots of certificates of\neducation courses, attendance at education conferences etc) .\n- Briefly  mention your clinical experience or educational qualification for context; do not\ninclude screenshots of clinical courses.\n4. Reflection portfolio:\n- Please include a list of at least 4 learners you previously supervised as main Clinical\neducator or Clinical supervisor in table format, and\n- your reflections on achievement of competencies in three key domains in this course.\nTable.  Learners I had previously supervised as main Clinical educator or Clinical supervisor\n(minimally 4 learners to be listed in table)\nStudent\nSN.    Supervision\nstarted\n(e.g.Mar 21)  Duration of\nsupervision\n(e.g.7wks)    Learner profile\n(e.g. Yr 3 OT student, 1st year\ncond -reg DR, 2nd clinical\nrotation PT)  Main workplace context\n(e.g. Acute inpatient ward,\nmental health outpatient)\n(Adapted from Skills Framework) Assessments (5hrs)\nReflections:\nDescribe how you have demonstrated achievement of some competencies in the three key domains in\nthis course, based on specific incidents of your past experiences as Clinical educator or Clinical\nsupervisor for the above 4 learners.  Also share reflections on your key learning points from the\noccasion.\n1. Assessing progress of learners\nDescribe at least one occasion of how you communicated performance gaps and developed an\nimprovement plan for the learner and your learning points after that occasion.\n2. Facilitating learning of learners\nCompare two different approaches you used to edu cate learners with different learning styles and\nlearning needs.\n3. Supporting well -being of learners\nDescribe at least one occasion of how you used a learner -centric approach or created a safe\nlearning environment to facilitate learners’ well -being and your learning points after that occasion."
}