{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-25.pdf",
  "type": "pdf",
  "content": "ISSUE NO. 25  |  NOVEMBER 2019\nWHAT’S\nHAPPENING\naround our little\nbig campusDear SIT Alumni,\nSITizen is a publication by the\nSIT Advancement & Alumni Division.\nFor enquiries, please e-mail us at\nAlumni@SingaporeTech.edu.sg\n© Singapore Institute of Technology 2019Once a SiTizen, Always a SiTizen\nThe year 2019 was full of milestones for the Singapore Institute of Technology (SIT).\nWe marked our ‘5+5’ celebrations – celebrating the fifth year since becoming an\nAutonomous University (AU) in 2014, and also our first five years as an institute of\nhigher learning.\nThe fifth Recognition of Excellence was also held this year on 30 October 2019 when\nperformance awards and scholarships supported by SIT’s philanthropic partners were\npresented to over 240 students in front of their loved ones. Most memorably, the\nstudents had the opportunity to thank and interact with their donors who had made\npossible the scholarships and awards.\nEarlier in September, Prime Minister Lee Hsien Loong officiated the groundbreaking\nceremony of SIT’s future campus in Punggol. Situated in the heart of the new Punggol\nDigital District, the campus (which is expected to be completed in 2023) will be integrated\nwith industry and community to provide a vibrant applied learning environment for\nSIT students.\nThis year, SIT graduated a record number of more than 1,800 alumni including those\nin pioneer cohorts of 13 SIT-conferred and SIT-joint degree programmes. These new\ngraduates join the ranks of what is now a 10,000-strong alumni family. They marked this\nrite of passage with a night at the New Alumni Welcome Party held on 1 November 2019.\nSITizens can not only look forward to good job prospects – as indicated in the latest\nresults for the Graduate Employment Survey – but also mentoring opportunities with\nSIT’s donors and friends. The second run of The SITuation Room on 28 August 2019\nprovided a platform for Engineering alumni and students to have insightful conversations\nwith experienced industry practitioners in a casual setting, prior to smaller group\nmentoring sessions.\nSIT’s alumni work hard but they also know how to play hard – together and at\nactivities run by SIT Alumni Networks – at Futsal games, at the latest run of\nCheerS IT’s Thursday (CheerSIT) and while learning a new skill at the Leather Craft\nWorkshop that was fully subscribed within hours of registration opening. So do also\nlook out for a whole slew of new workshops in the coming months!\nAs always, we hope you will enjoy reading this issue of SITizen. Should you wish to\ncontribute a story, please drop us a line at Alumni@SingaporeTech.edu.sg“5+5” Good Years, and Many More to Come\nGroundbreaking for\nSIT’s Future Campus\nin Punggol\nNew Energy Efficiency\nTechnology Centre at SIT\nGraduations Galore\nSIT Graduates Continue\nto be in Demand\nby Industry\nBursaries and Grants\nto Nurture SITizens\nHonouring Donors,\nRecognising Excellence\nEngineering the SITuation\nwith Industry Veterans\nTime Out for Futsal and\nQuality Leather Crafting\nAlways a Good\nThai-ming for CheerSIT\nYaaam Seng to the\nClass of 2019\nSiTIZEN  |  03/20 SiTIZEN  |  02/20\nSIT is Building a New Home!\nSIT representatives explaining the key features of the future SIT campus to Prime Minister Lee Hsien Loong\n(sixth from left), Singapore Cabinet ministers, and guests.\nMrs Pearlyn Chong, Managing Partner, Lo Hock Ling &\nCo (left); and Mr Chew Ghim Bok, Past District Governor,\nRotary Club of Bugis Junction.(From left): Prof Yaacob Ibrahim, Advisor, Office of the President, SIT, introduces Mr Patrick Lee, President,\nYangzheng Foundation to Mr Rodger Kimpton, Past President, Rotary Club of Jurong Town.Officiating the groundbreaking (from left): SIT alumnus Ms Ong Wen Hui; Prof Chua Kee Chaing, Senior Minister Teo Chee Hean; Mr Ng Yat Chung, Chairman, SIT;\nPrime Minister Lee Hsien Loong; Prof Tan Thiam Soon; Minister Ong Ye Kung; Minister Ng Eng Hen; Senior Minister of State Janil Puthucheary; and SIT student\nMr Muhammad Firdaus Bin Ayub.\nPM Lee and Prof Tan together with student helpers and performers for the ceremony.Foreground, from left: Mr Choo Chong Ngen, Chairman, Worldwide Hotels and Dr Chua Thian Poh,\nChairman & CEO, Ho Bee Land; accompanied by Prof Loh Han Tong, Deputy President (Technical\nDevelopment), SIT for a tour of the model of the future SIT campus in Punggol.\nProf Tan (in red polo shirt) with (from left): Mr Philip Khoo, Managing Director, Kimly Construction;\nDr Ho Nyok Yong, Chief Operating Officer, Samwoh Corporation; and Mr Eric Soh, Chief Executive\nOfficer, Samwoh Corporation.The Singapore Institute of Technology\n(SIT) kicked off the commencement of\nconstruction works for its centralised\ncampus in Punggol with a groundbreaking\nceremony on 10 September 2019,\nofficiated by Guest of Honour, Prime\nMinister Lee Hsien Loong. The campus,\nsituated in the Punggol Digital District\n(PDD), will strengthen SIT’s position as\nan industry-focused university of applied\nlearning with close ties to the community.\nBorderless and integrated with the\nsurrounding community and industry,\nthe centralised campus in Punggol will\nprovide a vibrant learning environment\nwhich underpins SIT’s applied learning\npedagogy. Its location within the PDD, SIT marked the next step towards its future campus in the Punggol district with a\ngroundbreaking ceremony on 10 September 2019\nwhich is set to be a vibrant district\nhousing key growth industries of the\ndigital economy, will support students in\nfinding authentic learning opportunities\nin industry spaces located within and\nbeyond the campus, fostering exchange\nof ideas with industry professionals. The\ncampus is envisioned as a ‘living lab’\nthat integrates applied research and\ninnovation for SIT and its partners.\nIn his welcoming remarks, PM Lee\nspoke about the strong growth SIT had\nundergone in the past 10 years, and\nhow it “offers a focused, applied, high\nquality education, directly relevant,\nand opening clear paths for further\ndevelopment.” He said that its niche offerings in areas such as sustainable\ninfrastructure engineering, intelligent\ntransportation engineering, and allied\nhealth were meeting industry needs for\nhigh skilled operational talent.\nHe also affirmed the important role\nthat the upcoming campus would have\nin the future: “This new campus, in the\nheart of the Punggol Digital District,\nwill strengthen the close nexus that\nSIT already has with industry. We hope\nto support an ecosystem for digital\nand tech companies here, to trial new\nconcepts to work, study and live, before\nscaling them up nationally. By being\nco-located here, SIT faculty and\nstudents collaborate with industry\nprofessionals on projects and test-\nbedding opportunities.”\nDuring the ceremony, Prof Tan Thiam\nSoon, President, SIT, reiterated the\nuniversity’s mission: “SIT’s role is to\nprovide an applied learning pathway\nfor young Singaporeans, in particular\npolytechnic graduates, to harness their\naspirations. At steady state, SIT will\nhave an annual intake of over 3,000\nundergraduates and will play a key role\nin meeting the government’s target of\n40 per cent cohort participation rate\nby 2020.”\nSiTIZEN  |  04/20\nFrom left: Er Lee Chuan Seng, Chairman, National Environment Agency, Mr Ananda\nRam Bhaskar, Deputy CEO (Environmental Protection), National Environment Agency,\nMr Albert Chua, Permanent Secretary, Ministry of the Environment and Water Resources,\nAssoc Prof Ivan Lee, Vice President (Industry and Community), SIT, and Mr Ronnie Tay,\nDeputy President (Administration) and Chief Financial Officer, SIT, at the MOU signing\nceremony for the launch of the EETC at the opening of the National Energy Efficiency\nConference 2019.The Singapore Institute of Technology (SIT)\nhosted Mr Chan Chun Sing, Minister for Trade\nand Industry, at the Dialogue with SITizens\nheld on 3 October 2019 at the SIT@Dover\ncampus. The event saw over 200 attendees,\nincluding current students and SIT alumni,\nas well as SIT faculty and staff.\nMade possible by the Student Organising\nCommittee, the theme for the event was\n“Catalysts for Economic Growth: Competitive\nSkillsets”. Speaking at the Ho Bee Auditorium,\nMinister Chan shared his insights on how\nSITizens could navigate potential challenges\nafter entering the workforce while staying\nOn 3 October 2019, the National Environment Agency (NEA)\nand the Singapore Institute of Technology (SIT) signed a\nMemorandum of Understanding (MOU) for a new Energy\nEfficiency Technology Centre (EETC) at SIT. The Centre is set\nto launch by the end of 2019.\nThe EETC will catalyse the energy efficiency improvements\nof small and medium enterprises (SMEs) by increasing\naccessibility to energy assessment for SMEs. SMEs onboard\nthe programme will receive a diagnosis of their energy\nperformance and recommendation on areas for improvement\nat a low cost and, at the same time, have their staff trained in\nenergy assessment skills for continual improvement.SITizens Treated to\nSpecial Dialogue with\nTrade and Industry\nMinister Chan Chun Sing\nNew EETC to provide energy consultancy\nservices to SMEs, train undergrads in\nindustrial energy efficiency and upskill\nexisting EE practitioners\nThe EETC aims to train a pipeline of SIT engineering\nundergraduates and upskill existing energy efficiency\npractitioners in industrial energy efficiency. Individuals\nin the programme, including undergraduates from\nSIT’s Sustainable Infrastructure Engineering (Building\nServices), Mechanical Design and Manufacturing\nEngineering as well as Electrical Power Engineering\nprogrammes, will gain experience working on real-life\ncases to build up their competencies with guidance\nand technical support from the EETC’s staff.\nThe EE Upskilling Programme (EEUP) offered by the\nCentre will also provide engineering professionals\nwith practical hands-on training to complement\nclassroom-based theory, enabling them to obtain\nskills in energy management and in performing\nenergy assessments of industrial facilities.\nThe EETC completes the pathway for aspiring\nengineers and energy managers to become certified\nEnergy Efficiency Opportunity Assessors (EEOA) and\nChartered Engineers.\n“SMEs typically lack the capabilities and resources to\nidentify and implement energy efficiency improvement\nmeasures. As Singapore’s university of applied learning,\nSIT aims to build up expertise and capability to meet\nthe demand of SMEs for energy services, so as to\nimprove their business sustainability and lower energy\ncosts. Additionally, the energy assessments at SMEs will\nprovide valuable practical learning opportunities for SIT\nstudents to be future EE practitioners,” said Assoc Prof\nIvan Lee, Vice President (Industry & Community), SIT.relevant and competitive. He stressed that while growing key skill sets\nis vital, the characteristics, values and life lessons SITizens acquire from\ntheir learning journeys are important in motivating them to adapt to\nthe dynamic and competitive job market.\nNEA and SIT to Set Up an\nEnergy Efficiency Technology\nCentre at SIT\nSiTIZEN  |  05/20\nSIT Graduates Continue to\nbe in Demand by Industry\nMore than nine in 10 graduates continue to be employed six months after graduation\nGraduates from the Singapore Institute of Technology\n(SIT) continue to be well-received by the industry, with\nhigh overall employment and increased starting salaries.\nResults from the 2018 Joint Autonomous University\nGraduate Employment Survey (JAUGES) reveal that 92.5%\nof SIT graduates in the labour force who completed\ntheir studies between October 2017 and September\n2018 were employed, as compared to the 92.3% figure\nin 2017.\nThe proportion of graduates in the labour force who\nsecured full-time permanent (FTP) employment is the\nsame as last year’s at 82.9%. Beyond full-time permanent\nemployment, 7.0% and 2.6% of graduates in the labour\nforce were in part-time/temporary employment and\nfreelancing respectively in 2018, citing reasons such as\npursuing further studies, embarking on a business venture\nor a preference for shorter, or flexible working hours.\nThe mean gross monthly salary among fresh graduates\nemployed in FTP employment was also higher at $3,437,\ncompared to $3,350 in 2017. The median gross monthly\nsalary was $3,300 in 2018, higher than $3,200 in 2017.\nHigher overall employment was attained across the\ninaugural batch of graduates from three SIT-conferred\ndegree programmes. Among those in the labour force,\n96.6% of graduates from the Sustainable Infrastructure\nEngineering (Land) programme secured FTP\nemployment. 95.7% of graduates from the Information\nand Communications Technology (Software Engineering)\nprogramme and 100% of graduates from the Information\nand Communications Technology programme (Information\nSecurity) in the labour force found FTP employment.\nGraduates from SIT’s healthcare-related programmes\nalso continue to be well-sought after, with 95.7% of\nAllied Health (i.e. Physiotherapy, Occupational Therapy,\nDiagnostic Radiography and Radiation Therapy) graduates\nand 90.7% of the inaugural batch of Nursing graduates\nfrom the SIT-University of Glasgow joint programme in\nFTP employment.\nAssoc Prof Ivan Lee, Vice President (Industry & Community),\nSIT, was heartened that SIT students continue to enjoy high\nemployability and competitive salaries. “In line with our\napplied learning focus to nurture and develop graduates\nwho are industry-ready in the increasingly fast-evolving\nworld, our signature Integrated Work Study Programme\n(IWSP) aims to equip graduates with real work experience\nand exposure, which is much valued by employers.” A flagship programme of SIT, the IWSP provides students\nwith opportunities to integrate the knowledge they\nhave gained in the classroom with real-world industry\nexperience. Students from SIT-conferred degree\nprogrammes will be immersed in a real work environment\nfor eight to 12 months, longer than traditional internships.\nThe extended attachments allow employers to assign\nmeaningful and challenging tasks to students in order to\nassess their suitability as full-time hires. Since its inception\nin 2014, the IWSP has expanded to cover 16 SIT and\njoint degree programmes, with over 1,000 students going\nout into the industry for their work-study attachments in\nthe Academic Year 2018. 85.2% of the university’s cohort of 1,707 graduates from SIT and SIT’s nine\nOverseas University (OU) partners across 33 degree programmes participated in\nSIT’s fifth annual Graduate Employment Survey, which was conducted between\n1 March and 14 May 2019.\nAmong last year’s batch of\ngraduates from SIT-conferred\ndegree programmes, more than\n70% received job offers from\ntheir Integrated Work Study\nProgramme (IWSP) companies,\nattesting to the success of our\nindustry-focused approach.\n- Assoc Prof Ivan Lee, Vice President\n(Industry & Community), SIT\nSiTIZEN  |  06/20 SiTIZEN  |  07/20\nNow that they have graduated, it’s time to soar to greater heights! Graduates scribble commemorative messages as they celebrate a new milestone.Proud graduates from SIT-conferred and joint-degree programmes, ready to take\non the world!The Singapore Institute of Technology (SIT) celebrated the\nachievements of the Class of 2019 in graduation ceremonies held\nover three days, from 16 October to 18 October this year. The\nuniversity saw the graduation of pioneer cohorts from a record\nnumber of 13 degree programmes, including the Telematics,\nSustainable Infrastructure Engineering (SIE) (Building Services),\nSystems Engineering (ElectroMechanical Systems) (SEEMS) and\nPharmaceutical Engineering programmes. Pioneer Graduates in 13 SIT and\nSIT-OU Joint Degree Programmes\nThe main graduation ceremony was graced by the Guest of Honour, Mr Lawrence Wong (left),\nMinister for National Development and Second Minister for Finance, along with Prof Tan Thiam Soon\n(top right), President, SIT, and Prof Chua Kee Chaing (bottom right), Deputy President (Academic)\nand Provost, SIT.\nA record 1,868 graduates received their degree scrolls from SIT-conferred and SIT joint degree\nprogrammes this yearSIT Celebrates the Graduation of\nPioneer Cohorts in 13 ProgrammesMs Ng Xin Hui, a pioneer graduate of the Pharmaceutical\nEngineering programme, shared how her four years\nat SIT had been an enriching journey, and how she\nhad benefited immensely from her eight-month\nattachment at Pfizer Singapore as part of her Integrated\nWork Study Programme (IWSP). “It allowed me to\ngain first-hand insights into real work situations and\nexpectations, and I’m proud to have now joined them\nfull-time as an engineer,” she said.SIT-Conferred\nDegree Programmes No. of\nGraduates\nBachelor of Engineering (BEng) with\nHonours in Telematics (Intelligent\nTransportation Systems Engineering)41\nBachelor of Engineering (BEng) with\nHonours in Pharmaceutical Engineering77\nBachelor of Engineering (BEng) with\nHonours in Sustainable Infrastructure\nEngineering (SIE) (Building Services)63\nMaster of Engineering Technology\n(MEngTech) in Sustainable Infrastructure\nEngineering (SIE) (Building Services)17\nMaster of Engineering Technology\n(MEngTech) in Electrical and\nElectronic Engineering1\nSIT-Massey UniversityNo. of\nGraduates\nBachelor of Food Technology\nwith Honours49\nSIT-DigiPen Institute of TechnologyNo. of\nGraduates\nBachelor of Engineering (BEng)\nin Systems Engineering\n(ElectroMechanical Systems)22\nSIT-Newcastle UniversityNo. of\nGraduates\nBachelor of Engineering (BEng) with\nHonours in Chemical Engineering52\nBachelor of Engineering (BEng) with\nHonours in Electrical Power Engineering27\nBachelor of Engineering (BEng)\nwith Honours in Mechanical Design\nand Manufacturing Engineering15\nBachelor of Engineering (BEng)\nwith Honours in Marine Engineering11\nBachelor of Engineering (BEng)\nwith Honours in Naval Architecture6\nBachelor of Engineering (BEng)\nwith Honours in Offshore Engineering8The main ceremony was held on 17 October\n2019 at The Theatre at Mediacorp, with Guest\nof Honour Mr Lawrence Wong, Minister for\nNational Development and Second Minister\nfor Finance in attendance. He shared the\nGovernment’s hope for SIT to be one of the\nbest practice-oriented universities, producing\ngraduates with valuable industry skills.\nGuests of Honour for the ceremonies included\nMr Ng Cher Pong, Chief Executive, SkillsFuture\nSingapore (SSG), Mr Saw Ken Wye, CEO,\nCrimson Logic, Her Excellency Kara Own,\nBritish High Commissioner to Singapore, and\nMr Chee Hong Tat, Senior Minister of State,\nMinistry of Trade and Industry & Ministry of\nEducation.\nDuring the ceremony, Mr Loh Jun Han, who\ncompleted both the Bachelor of Engineering\nwith Honours and Master of Engineering\nTechnology in SIE (Building Services), was\nlauded as valedictorian. Mr Loh recalled\nhis first day at SIT and his excitement on\nembarking on the SIE programme. “I have\nnot looked back since and am now thrilled\nto be part of a burgeoning sector that allows\nme to play an impactful role for society,” he\nsaid. The SIE (Building Services) programme\nwas launched in 2015, and is the first of its\nkind in Singapore, offering highly-specialised\ntraining for the built environment sector.\nSiTIZEN  |  08/20 SiTIZEN  |  09/20\nMoving Onwards to\nthe Next Adventure\nGraduands from programmes offered by SIT‘s Overseas University partners received their\ndegree scrolls at ceremonies held in September to October this year\nThe Culinary Institute of America\nGraduation Ceremony\n18 September 2019\nThe Bachelor of Business Administration in Food Business\nManagement (Culinary Arts) degree offered by The\nCulinary Institute of America at SIT was presented to 39\ngraduands in the graduation ceremony held at Temasek\nPolytechnic Auditorium.\nThe Guest of Honour for the ceremony was Mr Peter Knipp,\nCEO of Peter Knipp Holdings Pte Ltd (PKH) and\nFoodservice Consultants Singapore (FSCS) Pte Ltd. Prof\nLoh Han Tong, Deputy President (Technical Development),\nSIT, and Assoc Prof Ivan Lee, Vice President (Industry &\nCommunity), SIT also joined in the processional walk at\nthe ceremony.\nMs Sabrina Chong was the recipient of the Frances Roth\nLeadership Award and Ms Chow Hui Jin received the\nCulinary Award. Ms Chong said that she was “a little\nsurprised and very honoured” to receive the award.\n“There are so many good memories from my university DigiPen Institute of Technology Singapore\nCommencement Ceremony\n5 October 2019\nAt a ceremony held at the Ho Bee Auditorium in SIT@\nDover, 89 students graduated from four programmes\nTrinity College Dublin Graduation Ceremony\n18 October 2019\nHeld at the MES Theatre at Mediacorp, 152 students\nreceived their degree for Bachelor of Science in Diagnostic\nRadiography, Occupational Therapy, Physiotherapy and\nRadiation Therapy programmes.\nThe graduation ceremony was attended by Guest of\nHonour, His Excellency Patrick Bourne, Ambassador of\nIreland to Singapore, Prof Tan Thiam Soon, President,\nSIT, Prof Chua Kee Chaing, Deputy President (Academic)\nand Provost, SIT and Assoc Prof Ivan Lee, Vice President\n(Industry & Community), SIT.\nMs Catherine Tan Wan Ting, graduated from the\nDiagnostic Radiography programme and also delivered\nthe valedictory speech. She shared that the graduation\nmarked the graduands’ entry into the working world and it\nis a transition point in their lifelong learning for knowledge\nas healthcare advances. “No matter which healthcare\nUniversity of Glasgow Graduation Ceremony\n18 October 2019\nThe University of Glasgow Graduation Ceremony at the\nMES Theatre at Mediacorp saw 330 students graduate\nfrom the Bachelor of Engineering (Hons) in Aeronautical\nEngineering, Bachelor of Engineering (Hons) in\nAerospace Systems, Bachelor of Engineering (Hons) in\nMechanical Design Engineering, Bachelor of Engineering\n(Hons) in Mechatronics and Bachelor of Science University of Liverpool Graduation Celebration\n19 October 2019\nThe graduation celebration at the Ho Bee Auditorium at\nSIT@Dover saw 99 students receiving their degree scrolls\nexperience that I want to hold on to, such as the challenge\nof executing a Charity Dinner for one of our modules\nand our compulsory Overseas Immersion Programme\nto California where I got to know my classmates better,”\nshe added.\nThe Julius Wile Academic Achievement Award was\npresented to Mr Jonathan Chang who was also the student\nspeaker at the ceremony.\n(Hons) in Computing Science degree programmes.\nMr Chee Hong Tat, Senior Minister of State, Ministry\nof Trade and Industry & Ministry for Education was the\nGuest of Honour.\nProf Tan Thiam Soon, President, SIT was conferred the\nhonorary degree of Doctor of Engineering by Professor\nSir Anton Muscatelli, Principal and Vice Chancellor,\nUniversity of Glasgow, at the ceremony. The award was in\nrecognition of Prof Tan’s achievement in Civil Engineering\nand his contribution to society, as well as his leadership\nin forging strong partnership between SIT and the\nUniversity of Glasgow.\nMs Wang Xin from the Mechanical Design Engineering\nprogramme was the recipient of the Professor Wu Dao\nQuan ( 吴道全教授 ) Outstanding Engineering Student\nAward while Mr Teo Wei Xuan Bryan from the Aerospace\nSystems programme was awarded the Top Project\nPrize for Engineering Student. The Secura Group Top\nStudent Award and the Secura Group Top Project Prize\nAward were presented to Computing Science students\nMr Toh Yu Heng and Mr Teoh Yan Jun John respectively.\nMs Noelle Hiu Tze Xun received the honours for the IGV\nGroup Top Computing Science Female Award.offered by DigiPen Institute of Technology: Bachelor\nof Fine Arts in Digital Art and Animation, Bachelor of\nArts in Game Design, Bachelor of Science in Computer\nScience and Game Design, and Bachelor of Science in\nComputer Science in Real-Time Interactive Simulation.\nThe Commencement Speaker for the ceremony was\nMr Saurabh Misra, Director of Engineering, Autodesk\nAsia Pte. Ltd.\nMr Sng Peng Hwee from the Computer Science and\nGame Design programme, and Mr Ang Qian Yong\nJoshua from the Digital Art and Animation programme\nboth spoke at the ceremony. Currently working as a\n2D/3D Games Generalist and Technical Artist at Yoozoo\nGames, Mr Ang said he chose his course because of its\ngood standing in Singapore’s game industry. He added\nthat “passion and hard work are a formidable couple”\nand urged his fellow graduands to improve themselves\nconstantly in the competitive digital media industry during\nhis address at the ceremony.\ndisciplines we are from, let us always act with the best\ninterests of our patients in mind,” she said.\nReceiving the Donal Hollywood Prize was Ms On Chin\nLeng, from the Radiation Therapy programme.\nfor the Bachelor of Arts with Honours in Criminology and\nSecurity from the University of Liverpool to resounding\ncheers from family and friends.\nValedictorian from the Class of 2019, Mr Muhammad\nHidayat Bin Hussain Ja'afar expressed his deepest\ngratitude to his peers, lecturers and loved ones for\nbeing an instrumental part of his journey. “While I am\ndeeply grateful and humbled to be the valedictorian,\nI am immensely thankful to those around me who\nmade it possible,” he said. He also shared that going\nfor the Overseas Immersion Programme (OIP) was the\nhighlight of the degree programme as he and his fellow\ncoursemates studied and bonded together during their\ntime in Liverpool.\nReceiving the award for exemplary dissertation project\nwas Ms Ho Xin Hua Sheila. Mr Chang Wei Leong\nColin received an award for exemplary work-based\nlearning project.\nSiTIZEN  |  10/20 SiTIZEN  |  11/20\nThis year’s Recognition of Excellence (ROE) presentation at\nthe Singapore Institute of Technology (SIT) on 30 October\n2019 was the university’s biggest yet. Held at the Sports Hall\nat SIT@Dover, it was attended by close to 800 attendees\nincluding SIT’s donors and friends, SIT senior management,\naward and scholarship recipients, together with their loved\nones as well as SIT faculty and staff.\nAn annual affair at SIT, ROE celebrates the achievements of\nSIT students, and also the donors who had made possible\nthe awards and scholarships presented on the day. More\nthan 160 non-bonded scholarships and 98 awards were\npresented to SIT students at the presentation, as well as at\nthe graduation ceremonies held earlier in October.\nIn his welcoming address, Prof Chua Kee Chaing,\nDeputy President (Academic) & Provost, highlighted the\nself-determination and tenacity that SIT students possess.\nHe said, “They know firsthand the value of staying relevant,\nplanning pragmatically for their future, and the joy of using\ntheir abilities to make a difference for their families and\ncommunity. This kind of excellence – something that goes\nbeyond oneself – is something that SIT will continue to\nnurture in all undergraduates, through our pedagogy that\nintegrates learning, industry and community.”\nAmong the SITizens who went on stage to talk about\nhow philanthropic support had made a difference in their\nlearning journey was alumnus James Fou, who received\nfour awards at the very first ROE in 2015. Mr Fou graduated Now in its fifth year, the Recognition of Excellence continues to be a lively celebration of\nthe impactful support from donors to nurture young talentsTotally Devoted … to Student Excellence\nA spirited performance by SIT’s Silat group marked the start of the\nfifth Recognition of Excellence at SIT.\nRecipients of the ON Semiconductor Scholarship together with\nrepresentatives from Fairchild Semiconductor: Ms Thng Shin Min, Director,\nRegional Counsel, Asia Pacific (extreme left) and Ms Jean Chong, VP ,\nGeneral Counsel, Asia Pacific (extreme right).From left: Mr Chew Ghim Bok, Past District Governor, Rotary Club of Bugis Junction;\nMr Tan Cheng Gay, Chairman, EnGro Corporation Limited; Mr Chia Mia Chiang,\nChairman, Scholarships & Bursaries Sub-Committee, The Ngee Ann Kongsi;\nMr Goh Kim Hock, Chairman, Education Sub-Committee, The Ngee Ann Kongsi;\nand Prof Tan Thiam Soon, President, SIT.Prof Chua Kee Chaing, Deputy President (Academic) & Provost, SIT (extreme\nleft), presented the certificates to the award recipients.\nRecipients of the Kewalram Chanrai Group Scholarship, together\nwith Prof Tan Thiam Soon, President, SIT (second from left).\n(From left) Undergraduates Low Qing En and Chiam Jia Ying, together with\nalumnus James Fou shared with the attendees just how grateful they were\nfor the awards and scholarships made possible by donors, which has allowed\nthem to pursue their dreams.\nClose to 800 attendees were present at the Recognition\nof Excellence.Massive grins from the scholarship recipients for the Academic Year 2019/20.\nin the same year from the Naval Architecture programme and is\ncurrently working as a Design Engineer in Sembcorp Marine.\n“I think it is very generous of our donors to lend their reputation to\nsupport students through performance awards and scholarships,”\nhe said, adding, “I am very thankful. They have inspired in me the\ndesire to give back to SIT when I can in the future.”\nHis fellow SITizens, Ms Chiam Jia Ying and Mr Low Qing En (from\nthe Hospitality Business and the Information and Communications\nTechnology (Software Engineering) programmes respectively)\nwere of similar minds.\nMs Chiam was thankful for the opportunities “to access new\nexperiences” that were made available to her at SIT. She said,\n“I was able to give back to the community and also focus on my\nstudies, thanks to The Ngee Ann Kongsi Scholarship that I have\nbeen receiving each year since I was a first-year student. This\nscholarship has inspired me to push on towards attaining my\ndegree in Hospitality Business, especially during this last lap of\nmy university education. It has boosted my confidence as I start to\nbuild the foundation for a career.”\nThanking everyone during his closing address, Prof Tan Thiam Soon,\nPresident, SIT, highlighted how this year has been full of milestones\nRecipients take the time to meet with and pose for a photo with the donors.\nfor the university, which celebrated its\nfifth anniversary as an Autonomous\nUniversity and the tenth year since\nits establishment. He said, “With the\nsupport from all of you, our partners\nand friends and students and alumni,\nwe are looking at the next 10 years with\ngreat excitement.”\nSiTIZEN  |  12/20\nHong Leong Foundation Bursary recipients present a tray of cupcakes to\n(second from right) Mr Quek Kon Hui, Governor, Hong Leong Foundation,\nas a token of appreciation, flanked by (extreme left) Prof Tan Thiam Soon,\nPresident, SIT and (extreme right) Prof Yaacob Ibrahim, Advisor, Office of\nthe President, SIT.\nFrom left: Ms Jazz Chong, Founder, Ode To Art gallery; Dr Low Lee Yong, Chairman and Founder,\nMHC Asia Group; and Mr Seah Kian Peng, MP for Marine Parade GRC; presenting a cheque for\nthe gift to Mr Alan Poh, Assistant Director, Advancement and Alumni Division, SIT.Enjoying Lots of Support\nand a Cup of Tea with the\nHong Leong Foundation\nMHC Asia Group Marks 25th Anniversary with New\nBursary at SIT and Support for Other Causes   On 6 September 2019, 10 SIT undergraduates made a special\ntrip led by Prof Tan Thiam Soon, President, SIT, to the heart of\nthe bustling Central Business District for a tea session hosted\nby the Hong Leong Foundation at the Tower Club. They were\naccompanied by Prof Yaacob Ibrahim, Advisor, Office of the\nPresident, SIT, Assoc Prof Lee Kwee Hiong, Cluster Director\n(Engineering), SIT, as well as Assoc Prof Forest Tan, Cluster\nDirector (Infocomm Technology), SIT.\nOver the tea session, the Bursary recipients had the\nopportunity to thank Mr Quek Kon Hui, one of the\nGovernors at the Hong Leong Foundation, and some of\nhis colleagues whose work made possible the Hong Leong\nFoundation Bursary. They took turns to share how the Hong\nLeong Foundation’s philanthropy had made a difference in\ntheir lives.\nAmong them was third-year Computer Science and Game\nDesign student, Mr Yeo Poh Seng, who has twice received the\nHong Leong Foundation Bursary. His initial financial concerns\nwere put to rest when he received the Bursary. It allowed him\nto focus on his studies and play an active role in SIT’s dragon\nboat team. “I can continue studying as a student, enjoyably\nlike my peers, continue working late nights and weekends,\nand still represent SIT in a sport,” said Mr Yeo.Fellow recipient Mr Leonard Goh, a first-year\nMechanical Engineering student, spoke of his\nmotivation to boost his overall understanding of\nproduct design through a university education and\nhis dreams of working on research and development\nin the biomedical engineering industry. “I want to\ntake this opportunity to thank the Hong Leong\nFoundation for empowering me to pursue my dreams,”\nsaid Mr Goh.\nThe Hong Leong Foundation first supported SIT\nundergraduates through the SIT Bursary in 2016. The\nHong Leong Foundation Bursary has been made\npossible since 2017 and a total of 20 Hong Leong\nFoundation Bursaries have been awarded since.SITizens thanked Hong Leong Foundation for\ntheir firm support since 2016\nThe Singapore Institute of Technology (SIT)\nrecently received generous support in the form\nof an endowed gift from MHC Asia Group. The\nMHC Asia Group – Ode To Art & Dr Ng Choon\nHee Bursary, made possible by the gift, will\noffer financial aid to Allied Health and Nursing\nstudents in perpetuity.\nMHC Asia Group, a leading medical benefits\nadministrator and health technology business,\ncelebrated its 25th Anniversary on 7 October\n2019. To mark the joyous milestone, Dr Low\nLee Yong, Chairman and Founder of MHC,\narranged for the company to give generously\nto local charities and universities, in particular\nthose related to the medical profession or\neducation. MHC supported the new Bursary\nat SIT by auctioning off a Chinese painting\nas part of its charitable initiative, as well as\nmaking a top-up donation to support the\nBursary. The artwork, created by local artist\nLim Tze Peng, was donated by Jazz Chong,\nFounder of the Ode To Art gallery for a charity\nauction by MHC.\nSiTIZEN  |  13/20\nThanks to the GIC Sparks & Smiles Award, Ms Vernice Seah not only\ngets support for her undergraduate studies at the Singapore Institute\nof Technology (SIT), but also an opportunity to mentor a primary school\nstudent in Mathematics. Even though she was in New Zealand for her\nOverseas Immersion Programme (OIP), she still keeps in touch with her\nmentee through Facebook. Outside of the Math tutorials, the 24-year-old\ntook her mentee out for lunch and outdoor activities. The experience of\nbeing a befriender has been a positive one for Ms Seah. She said, “Being\nentrusted as a mentor not only empowers me with the ability to make a\ndifference in the community, it has also allowed me to grow as a person\nthrough my interactions with my mentee.”\nMore than 70 runners, including SIT alumni and students, joined a Global\n5K run called “The Irish Run the World” on 7 September 2019, organised by\nThe Ireland Funds Young Leaders Society chapters from all across the world.\nStarting in Brisbane and ending in Belfast, this is the first time the run was\norganised in Singapore.\nJoining the SIT contingent in West Coast Park was Prof Alan Wong, Cluster\nDirector (Health and Social Sciences) SIT, as well as SIT faculty and staff.  Sparks, Smiles and Much More\nSITizens Also Run the World!The GIC Sparks & Smile Award encourages recipients to\nmake an impact in the lives of othersRecipients of the GIC Sparks & Smiles Award, together with representatives from GIC and Beyond Social\nServices, at a recent gathering for recipients held in October 2019.\nLike Ms Seah, Mr Yue Zhen Hao Brandon, a\nsecond-year Electrical Power Engineering\nstudent, is receiving the award for the\nsecond consecutive year. In addition to\nmentoring a child, Mr Yue helped Beyond\nSocial Services, a partner organisation\nin the programme, to conduct surveys\nin blocks made up of mostly rental flats.\nThrough that exposure, he gained a better\nunderstanding of community living in the\nneighbourhood. “Initially, I was a little\napprehensive as senior volunteers warned\nme that some of the residents can be quite\nunfriendly. Fortunately for me, even when\nthey were not willing to respond to the\nsurvey, they rejected me politely. I learnt\nto be more patient and understanding\nwith the families as I might have caught\nthem at a busy time. Families with children\nwere more willing to interact with me and\nI had a great time conversing with them,”\nhe added.\nThe award has been made possible by\nGIC for students at SIT since 2015. It\nprovides an opportunity for committed\nundergraduates like Ms Seah and\nMr Yue to make a difference in the lives of\nothers – children and youth in particular –\nthrough mentoring. Recipients get training\nfrom Beyond Social Services before being\nassigned to their mentees and starting\ntheir mentoring hours.\nGIC is a global long-term investor,\nestablished in 1981 to manage\nSingapore’s foreign reserves. It has well\nover US$100 billion in assets in over\n40 countries worldwide.\nHis Excellency Patrick Bourne,\nthe Ambassador of Ireland to\nSingapore, Ms Pamela Spreckley,\nExecutive Director, The Ireland Funds\nSingapore, along with representatives\nfrom other organisations supported\nby The Ireland Funds Singapore, also\ntook part in the run.\n“Although I had to wake up really early\nto travel across Singapore for the run,\nI quite enjoyed myself and made a\nnew friend during the run,” said Year 3\nPhysiotherapy student, Mr Ansel Teh.\nThe Ireland Funds Singapore, which\naims to further develop the long\nhistorical relationship between\nSingapore and Ireland, has made\npossible The Ireland Funds Singapore\nOverseas Immersion Programme\n(OIP) Grant at SIT. Established through\nan endowed gift in 2013, the grant is\napplicable to students going on an\nOIP in Ireland.\nSiTIZEN  |  14/20 SiTIZEN  |  15/20\nSITizens get great career advice from industry veterans at The SITuation Room: Dialogue with\nLeaders for Engineering Professionals\nOn 28 August 2019, The SITuation Room returned for its second run, this\ntime to spark a discussion between SITizens and Engineering professionals.\nAlumni and students from the Engineering cluster gathered at the SIT@Dover\ncampus for a networking and dialogue session, speaking on the topic “Trends\n& Challenges in Engineering.”\nThe main speakers for the evening were Mr Ivan Lim, General Manager\n(Specialised Vessels), Keppel Offshore & Marine and Dr Kelvin Lee, Senior\nTechnical Manager, Samwoh Innovation Centre Pte Ltd. Climate change and Engineering the SITuation\nBesides advice on working in the industry, the panellists for the evening (from right), Dr Kelvin Lee and Mr Ivan Lim,\nalso discussed issues such as climate change and sustainable construction. The dialogue was moderated by\nProf Ng Siu Choon, Associate Provost (Students), SIT (left).\nSITizens took turns interacting with industry mentors in small groups before the dialogue session.(From left) Dr Kelvin Goh, Deputy Director, Commuter & Road Infrastructure, Land Transport Authority; Mr Tung Kum Hon, CEO/Director, GEO Energy Group; Prof\nNg Siu Choon, Associate Provost (Students), SIT; Mr Ivan Lim, General Manager (Specialised Vessels), Keppel Offshore & Marine; Prof Chua Kee Chaing, Deputy President\n(Academic) & Provost, SIT; Mr Ivan Lim, Senior Director (Systems), Rohde & Schwarz Asia Pte Ltd; Mr Soo Ye Wah, Group Executive Chairman, Dou Yee International Pte Ltd;\nDr Kelvin Lee, Senior Technical Manager, Samwoh Innovation Centre Pte Ltd; Mr Koh Ming Sue, Managing Director, Engineering & Development, Changi Airport Group\n(Singapore) Pte Ltd; Ms Yvonne Lee, Senior Director, Global Manufacturing Operations, Applied Materials South East Asia Pte Ltd; Assoc Prof Lee Kwee Hiong, Cluster\nDirector (Engineering), SIT.\nParticipants asked the panel many questions about working in the industry, such as\nhow to stay relevant and keep the passion going throughout a long-term career.Alumni and students enjoyed fruitful follow-up sessions where mentors such as\nMr Ivan Lim (above photo, centre) and Er Wong Keam Tong (below photo, centre)\nshared their experiences and perspectives.\nsustainability in the Engineering\nindustry, and how to come up with\nsolutions that resonate with people in\nthe workplace were some of the issues\nthat were discussed by the panel,\nwith the other mentors also chiming\nin with their own perspectives.\nFor Year 2 Telematics (Intelligent\nTransportation Systems Engineering)\nstudent, Mr Soon Zeng Fu, a\nkey takeaway was having to find\nthe passion to keep you going\nthroughout your career and how to\nconstantly keep up with the times\nand skills to stay relevant. He said,\n“The discussion also made me think\nabout the kind of values I would want\nto look out for in a company so that I\ncan grow with the organisation.”\nThe participants also had the valuable\nopportunity of networking with\nindustry leaders and professionals\nfrom Applied Materials South East\nAsia Pte Ltd, CEI Limited, Changi\nAirport Group (Singapore) Pte Ltd,\nDou Yee International Pte Ltd, GEO\nEnergy Group, Land Transport\nAuthority, and Rohde & Schwarz\nAsia Pte Ltd. Ms Jasmine Wee, who is pursuing her Master of Engineering Technology in\nSustainable Infrastructure Engineering (Building Services),\nsaid, “It is comforting to be able to get career advice and\npose questions to experienced engineers that I would not\nbe able to ask my own bosses.” These seasoned industry\npractitioners are also part of a mentorship programme and\nthey continued to mentor SITizens in sessions that took\nplace in October and November. Mr Agus Tioman, Year\n3 Civil Engineering student, joined two groups, mentored\nby Dr Kelvin Goh, Deputy Director of Commuter & Road\nInfrastructure at Land Transport Authority, and Er Wong\nKeam Tong, Director of Engineering at Woh Hup (Private)\nLtd, respectively. “For undergraduates like me, there are a\nlot of concerns about job prospects and further education,”\nhe said. “Er Wong shared with us that there are still a lot\nof job opportunities out there, and as long as we have the\nright mindset, we don’t need to worry.”\nMr Malcom Kee, a Year 2 Systems Engineering\n(ElectroMechanical Systems) student, felt that the setting allowed them to have a genuine and insightful\nconversation with their mentor about their experiences\nin Engineering. He is part of a group mentored by\nMr Ivan Lim, Senior Director (Systems) at Rohde & Schwarz\nAsia Pte Ltd. “Mr Lim shared with us junior engineers his\ndiverse experience in multiple Engineering fields. His\nEngineering story was inspiring and enlightening for us,”\nhe said.\nSiTIZEN  |  16/20\nSIT alumni get together for\na casual game\nSITizens chill out over dinner with friends old and newEighteen alumni gathered at The Ark Futsal in Funan on 14 September\n2019 to play a friendly match of futsal. This is the second game in the series of\nsports sessions organised by the SIT Alumni Sports Network.\nThey split into four teams and played rounds of seven to 10 minutes each,\nfuelling up on isotonic drinks, bananas and granola bars for that extra\nboost of energy in between games. ”I usually play futsal with friends, so\nOn 29 August 2019, 62 alumni made their way down to the heart\nof Clarke Quay for SIT Alumni Leisure Network’s second edition\nof CheerS IT’s Thursday (CheerSIT). At Talay Thai, an urban\nwatering hole serving Thai influenced nosh where the event was\nheld, SITizens wasted no time in reconnecting with fellow alumni\nand broke the ice quickly with new friends through games. One\nof the games involved SITizens moving around the venue to find\ntheir partner who was holding the same number as them in order\nto win prizes.\nGraduate Mr Lee Jia Sheng from the Systems Engineering\n(ElectroMechnical Systems) programme wanted to take the\nopportunity to understand the career paths of fellow SITizens\nfrom other courses. He went alone to the event, but was pleasantly\nsurprised to see some old friends from his student days. “I also\nmade some awesome friends that night!” said Mr Lee.Time Out for Futsal\nAlways a Good Thai-ming for CheerSIT\nA player exhibits deft footwork as she attempts to dribble the ball away from members of the opposing team.\nThe tables were quickly filled up SITizens, all ready to unwind after a day's work. Alumni were treated to a sumptuous spread of authentic Thai food such as Thai\nfish cakes, green curry chicken, pineapple fried rice and more.\nCatching up with old friends over dinner and drinks is always a good idea.A group photo for keeps after a morning of futsal.I was excited when SIT organised one\nfor the alumni,” said Mr Mikhail Kho,\na Mechanical Design Engineering\nprogramme alumnus. Mr Kho had\nparticipated with fellow alumni and\nhe was impressed with the venue and\nrefreshments provided. “The games\nwere fun and not too competitive,”\nadded Mr Kho.\nMore such sports games are in the\npipeline, so keep a look out for the\nupcoming sessions organised by the\nSIT Alumni Sports Network!\nSiTIZEN  |  17/20\nThe Leather Craft Workshop, organised by the SIT Alumni Leisure Network, received such\nan enthusiastic response from SITizens that a second session was organised on the same day\nSIT alumni wasted no time in seizing their chance to join the\nLeather Craft Workshop, organised by the SIT Alumni Leisure\nNetwork. This was one of the most popular alumni workshops\nyet, being the first to be held over two sessions on Saturday,\n28 September 2019, in the morning and afternoon.\nAttended by a total of 60 alumni, the workshop was held at Bynd\nArtisan’s atelier at Holland Village. The participants were taught how\nto craft a leather cardholder from scratch under the guidance of\nthe experienced craftsmen. They began by tracing the outline of the\nproduct on their leather piece, then used a screw punch to punch\nholes and a skiving tool to score lines, which would make the leather\neasier to fold later on.\n“It was an eye-opening experience, trying out some of the tools\nthey commonly use,” said Mr Mah Boon Kin, who graduated from\nthe Computer Science and Game Design programme in 2013.\n“I certainly wouldn’t have guessed that they use a metal roller by\nhand to flatten out the lines for binding leather together.”\nMs Atiqah Binte Samsuri, a Radiation Therapy alumnus, found the\nprocess challenging but therapeutic. “It made me focus on the Crafting Quality Leather With Their HandsParticipants with their completed leather cardholders. They were also provided with bags from Bynd Artisan to take their products home.\nLeather craft requires painstaking precision and concentration while punching holes with a screw punch (left)\nand using a snap press to place buttons (right).The final touch – alumni meticulously sewing together their\ncardholders using wax thread.Participants chose leather pieces in a variety of colours, which would\nlater be cut and sewn.\ntask at hand rather than try to multitask or think\nabout other things like I normally tend to do,”\nshe said. The experience has taught her to view\nleather goods in a different light. “Rather than\njust looking at the price or the design, now I\nalso look at the quality and try to visualise how\nthe craftsmen would have constructed the item\nby hand.”\nSiTIZEN  |  18/20 SiTIZEN  |  19/20\nAfter a long year of hard work and sleepless nights, it was\nfinally time for the Class of 2019 to celebrate an important\nmilestone! On Friday, 1 November 2019, SITizens\nstreamed into Hard Rock Cafe Singapore at Orchard for a\ngood time at the New Alumni Welcome Party. This year,\nthe event was attended by over 280 alumni, SIT senior\nmanagement, faculty and staff, as well as representatives\nfrom SIT’s Overseas University Partners. Prof Tan Thiam\nSoon, President, SIT, made an appearance to welcome\nthe newly-minted alumni with a toast, leading everyone\nin a rousing chorus of “Yaaam Seng!”.\nAs the buffet lines opened at 8pm, the crowd was\nentertained with energetic performances by SIT’s\nstudent band, Muzeka, placing their own unique twist on\npopular hits such as “Senorita” by Shawn Mendes and\nCamilla Cabello, and “Feel It Still” by Portugal. The Man.\nBeatboxer, Charles ’Stitch’ Wong, also known as Stitch\nFM, also made an appearance, wowing the crowd with\nan impressive beatbox performance, even pulling up\nmembers of the audience to perform with him.\nThe audience had some fun with the emcee, who tested\ntheir memory skills and singing abilities with a game\nof “Don’t Forget The Lyrics”. He then provided much\nentertainment as he demonstrated the MTV Challenge, Yaaam Seng to the Class of 2019!SIT’s student band Muzeka rocking out to covers of popular hits. Beatboxer Charles “Stitch” Wong wowed the crowd with impressive beats and sounds\nproduced entirely from his own mouth.One of the games for the night had alumni acting out classic movie scenes from\nBollywood and romance movies, featuring emcee Joshua as the “coconut tree”.\nHungry alumni loaded up on burgers and other delicious food at the buffet. Catching up with their professors over drinks.Capturing some great memories. Alumni feeling the love and good vibes at the party.\nTime to let loose and belt it out to the feel-good hits performed\nby Jive Talking!SITizens had a rolling good time at the New Alumni Welcome Party 2019Prof Tan Thiam Soon, President, SIT (left) kicked off the night with a celebratory toast\nwith the alumni.\nThe big winners of the night: 1st prize (top left): Mr Tan Zhi Hao, winning an Apple Watch Nike+, Series\n5, 2nd prize (top right): Ms Tan Jacy, winning a Dyson Supersonic Hair Dryer, 3rd prize (bottom left):\nMr Lin Qi Miao, winning a DJI Osmo Pocket Camera, and 4th prize (bottom right): Mr Tan Kang Rui,\nwinning a Nintendo Switch Console.\nwhere four pairs of alumni each acted out a dramatic\nmovie scene. Mr Justin Lam, who graduated from the\nCriminology and Security degree programme (University\nof Liverpool), was one of the ’lucky’ participants. “Acting\nthe scene with my friend after getting ’sabo-ed’ was really\none of the moments of the night for me. I never thought\nI would be dancing with my friend like that,” he said.\n“It was a night to let loose and that was something that\nhelped a lot.”\nThe segment was also a favourite of the night for Ms\nTan Jacy, who graduated from the Aerospace Systems\ndegree programme. She was one of the big winners of\nthe lucky draw, winning not only food vouchers from\nOne Prawn Noodle but also walking away with a Dyson\nSupersonic Hair Dryer. “I was already in shock after\nwinning the vouchers because I’m not normally very lucky.\nWhen they announced that I had won, I was speechless,”\nshe said. “I feel blessed to not just have won so many\nprizes but also to be able to celebrate with my professors\nand classmates.”\nAs is party tradition, Hard Rock Cafe’s resident band\nJive Talking took to the stage to get the audience moving,\npumping up the crowd with a medley of songs by Queen\nand other rock classics. Mr Tan Hao Zhi, from the Marine Engineering programme, said, “The party\nwas really fun and the emcee was very\nengaging. I was also surprised and delighted\nthat my friends and I managed to win\nprizes! It was really great that we could all\ncelebrate together.”\nAlumni wondering what will the ending be like for the Avengers.SIT Alumni Card Benefits\nScan for the latest merchant\ndiscounts available!\nDate:\nTime:\nVenue:Thursday, 19 December  2019\n7pm to 9pm\nPicnic\nWisma Atria Shopping Centre\n#03-15\nSingapore 238877435 Orchard RoadWorkshopWorkshopPearlPearl\nDate:\nTime:\nVenue:Saturday, 14 December 2019\n4pm to 6pm\nThe Communal Bistro Delicacy\nThe Sail @ Marina Bay\nSingapore 018987Wine Appreciation\nWorkshop\nTEA\nAPPRECIATION\nWORKSHOP\nDate:Date:\nSaturday , 11 January 2020Saturday , 11 January 2020\nTime:Time:\n3pm to 5pm3pm to 5pm\nYixing Xuan TeahouseYixing Xuan Teahouse\n78 Tanjong Pagar Road78 Tanjong Pagar Road\nSingapore 088499Singapore 088499\nV enue:V enue:\nUPCOMING\nEVENTS\nFOR\nSIT ALUMNI!UPCOMING\nEVENTS\nFOR\nSIT ALUMNI!"
}