{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizen-buzz-issue-3-aug-2020.pdf",
  "type": "pdf",
  "content": "• I\n• S1T SINGAPOREINSTITUTE OF TECHNOLOGY\n1zen\n•\n• YOUR QUARTERLY E-N EWSLETTER\nAccess to More Complimentary CET\nModules for Class of 2020\nSIT offers 147 free CET courses stackable towards eight Specialist/Postgraduate Cer tificates, including three new\nones\nEl 07 August 2020\nSIT will introduce 30 new credit-bearing courses from September 2020, leading to three new Postgraduates Certificates in Design\nStrategy and Innovation, Future Hospitality Experience, and Data Engineering and Smart Factory. With these additions, SIT graduates will\nhave access to 147 Continuing Education and Training (CET) courses to choose from.\nSIT has been offering CET courses and Postgraduate Certificates since 2017 through SIT LEARN Professional Development, its lifelong\nlearning division. These courses and certifications are developed in line with industry needs and cater lo working adults keen lo upgrade\nand gain new skills transferrable to their profession. SITLEARN Professional Development currently offers a Specialist Certificate in\nProcess Safety, and four Postgraduate Certificates in Chemical Engineering, Electrical Power Engineering, Elder Health & Rehabilitation,\nand Sonography.\nThis is part of the Ministry of Education (MOE) and the Institutes of Higher Learning's (IHLs) continued support for the Class of 2020 in\nfurther deepening their skills amidst the uncertain economic outlook. MOE announced on 21 July 2020 that the IHLs are offering three­\nto six-month programmes which lead up lo micro-credentials, lo support Class of 2020 fresh graduates in broadening their skillsets and\naccessing more opportunities across sectors.\n\"We hope that our graduates can make use of the four complimentary CET modules to obtain additional skills and credentials for their\nprofessional growth. Lifelong learning is a key pillar of SIT's philosophy, and we are committed to do the best for our graduates during\nthese uncertain times,\" said Prof Ho Yew Kee, Associate Provost (Skills Future and Staff Development), SIT.\nRegistration for these modules is now open. More details on SITLEARN Professiona l Development's CET modules, micro-credentials and\nadditional support measures can be found hm,\n•\nSIT has been offering CET courses and Postgraduate Certificates that are developed in line with industry needs and cater to working adults keen to upgrade and\ngain new skills lransferrable to their profession."
}