{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-11.pdf",
  "type": "pdf",
  "content": "Once a SiTizen, Always a SiTizen ISSUE NO. 11   |  MAY 2016\nSIT, LEI and WDA Collaborate\non Lean Transformation Innovative Centre\nGraduating Students\nGet Head Start at Career Nexus 2016\nDPM Teo Chee Hean\nVisits SIT\nSIT’s Shining StarsUsing Solar Power to Keep\nPunggol Residents Safe\nFirst Bronze in Ultimate\nFrisbee at SUniG\nSwimming Towards\nSustainable Fishing\nSITizens Learn How to\ndo Business Overseas on Enterprise Immersion Programme\nXiaobai and Joey,\na Love Story\nSITizens’ Night Out\nat the Movies\nCooking in Wine CountryDear SIT Alumni,\nFor SITizens, a lifelong journey in\nlearning and sharing\nThis is the time of year when the Singapore Institute of Technology (SIT) looks forward to\nwelcoming new SITizens in the upcoming Academic Year (AY) 2016/17. The University has received close to 13,000 applications for our 42 degree programmes, or a 35% year-on-year\nincrease in the number of applications in previous years. Of the total, 2,500 are vying for the\n285 places in the ﬁ  ve new health science degree courses – in Physiotherapy, Occupational\nTherapy, Diagnostic Radiography, Radiation Therapy and Nursing, while a new joint degree\ncourse in food technology with Massey University of New Zealand has also drawn keen interest.\nThe new intake can look forward to a unique learning experience that SITizens enjoy:\nan applied learning, hands-on pedagogy, the uniquely structur ed Integrated W ork Study\nProgramme, and exciting overseas programmes such as the Enterprise Immersion Programme that allows them to learn ﬁ  rst-hand how business is done in an overseas setting,\nor externships, such as the one to California that Culinary Arts Management graduate\nMs Lynn Chia went to, which gave her an opportunity to learn all about wine harvests.\nSITizens believe in learning, unlearning and relearning for life and to facilitate\nthis process, SIT has recently set up its SkillsFuture unit called SITLEARN (Lifelong Education for Adaptability, Relevancy & Nimbleness). This unit provides an avenue for Singaporeans to enhance their employability through courses co-taught by SIT faculty and industry experts. It caters to mature, working adults who are keen to upgrade their skills, and this will of course include alumni like yourself.WHAT’S\nHAPPENING\naround our little\nbig campus\nSITizen is a publication by the\nSIT Advancement & Alumni Division.For enquiries, please e-mail us at Alumni@SingaporeTech.edu.sg© Singapore Institute of Technology 2016\nSITizens are good at sharing: they share the good times\nat exciting SIT Alumni Network events such as the recent SIT Alumni Movie Night, where the blockbuster “Captain America: Civil War” was screened. They are also keen to share their resources and a helping hand. Turn the pages and you will ﬁ  nd the story of Xiaobai the erstwhile\ncanine squatter at the SIT@Dover campus and its rescuer, first-year student Ms Joey Cheng.\nAlumni settling in with their popcorn\nand drinks, right before the movie.\nSITizens also share their know-how. SIT students have collaborated with industry\npartners on various projects, including the solar-powered AED stand and locker. Both are SIT’s contributions to Project Compass (Community Park Safety & Security), which was awarded the Sector Excellence Award when it was presented to the Commissioner of Singapore Civil Defence Force and Singapore Police Force during the Home Team Sector Steering-Comm Meeting on 11 April 2016.\nWe hope you will enjoy reading all this and more in this issue of SITizen. Should you wish\nto contribute a story, do drop us a line at Alumni@SingaporeTech.edu.sg\nSiTIZEN  |  02/12\nOn 10 March 2016, the Singapore Institute of Technology\n(SIT) signed a Memorandum of Understanding (MOU) with the Lean Enterprise Institute (LEI) and the Singapore Workforce Development Agency (WDA) to establish the Lean Transformation Innovative Centre (LTIC).\nCareer Nexus 2016 gave more than 500 graduating\nSingapore Institute of Technology (SIT) students a chance to meet with 100 companies, network with industry partners and get a head start in their careers.\nHeld on 2 March 2016 at the Suntec Singapore Convention\nand Exhibition Centre, the event featured a new segment called “Recruiters in Residence”, at which human resources personnel from companies like Unilever, Kellogg Asia Paciﬁ  c and Airbus Helicopters conducted mock\ninterview sessions with students. Said Mr Tan Jun Wen, a graduating student from the Bachelor of Science (Hons) in Food & Human Nutrition (Newcastle University), “The feedback given by the interviewers highlighted the areas I need to improve in when I go for a real job interview after graduation.”A ‘Lean’ Collaboration\nGraduating Students\nGet a Head Start(From left to right) Mr Lim Swee Say, Minister for Manpower, looks on as\nMr Ng Cher Pong, Chief Executive, WDA, Prof Tan Thiam Soon, President, SIT, and Dr James Womack, Founder and Senior Advisor, LEI, sign the MOU to establish the Lean Transformation Innovative Centre.\nCareer Nexus 2016 provides a platform for graduating students to scope out\navailable job opportunities.\nProf Tan Thiam Soon, President,\nSIT (left), and Prof Dim-Lee Kwong, Executive Director, Institute for Infocomm Research (right), after the MOU signing. At the same event, SIT also inked a landmark\nMemorandum of Understanding (MOU) with\nThe LTIC will be a one-stop centre for local companies,\nparticularly small and medium-sized enterprises (SMEs), to learn and adopt manpower-lean practices and thinking. The Centre, based in SIT, will work with LEI to build Lean Capability and share Lean Knowledge, whereas WDA will provide funding support for Singaporeans who want to deepen their skills through LTIC initiatives.\nFor SIT, this new centre will allow it to acquire lean\nk n o w - h o w  t h r o u g h  s t r a t e g i c  p a r t n e r s  s u c h  a s  L E I ,  a n d  facilitate SME’s adoption of lean practices by providing them with holistic solutions that address both technology and productivity issues.\nSaid Prof Tan Thiam Soon, President, SIT, “The launch of\nLTIC is a significant step in our evolution as a university of applied learning. As SIT continues to develop students who will be catalysts for transformation when they enter the workforce, we too are looking to transform the way companies approach their productivity and technology issues.”\nThe MOU signing took place during the CXO Lean\nS u m m i t  a t  S I T @ D o v e r ,  o r g a n i s e d  b y  W D A ,  S I T  a n d  LEI. Speaking at the summit was Dr James Womack, Founder and Senior Advisor, LEI, who spoke on “Lean Transformation for SMEs”. The Guest-of-Honour at the Summit was Mr Lim Swee Say, Minister for Manpower.\nAt the Career Nexus 2016,\nSITizens begin their job search, networking with big names in the industry even before graduationSIT, LEI and WDA collaborate on Lean Transformation\nInnovative Centre to drive manpower-lean practices among local companies, especially for SMEs\nStudents also participated in the “Voices of Experience”\ndialogue session where they learnt from experienced\nprofessionals and SIT alumni in the industry. Panellists\nfrom Gemalto, Google, PSA, STATS ChipPAC and GE\nAviation gave their take on how graduates can set\nthemselves up for success in the workplace. Ms Faezah Shahari, an alumnus from the Bachelor of Engineering\n(Hons) in Aerospace Systems (University of Glasgow),\nwas one of the panellists who was invited to provide the\nmillennial perspective. Said the Router Engineer who has\nbeen working with GE Aviation for slightly more than two\nyears, “I was beyond humbled to be part of the panel as\nI am still new in the industry and there is so much more\nthat I have yet to learn. Nonetheless, I appreciate the\nopportunity and it was an enriching experience personally.”\nSIT-I²R Research Collaboration\nthe Institute of\nInfocomm Research (I²R) to collaborate on applied research and innovation, including jointly developing proposals for external funding. SIT students can also stand to benefit from joint training programmes with I²R.\nSiTIZEN  |  03/12\nOn 28 March 2016, the Singapore Institute of Technology (SIT)’s second\nanniversary as an Autonomous University (AU), SIT welcomedMr Teo Chee Hean, Deputy Prime Minister & Co-ordinating Minister for National Security to the SIT@Dover campus. He was accompanied by a delegation from Pasir-Ris Punggol GRC comprising Mr Ng Chee Meng, Acting Minister for Education (Schools) & Senior Minister of State, Ministry of T ransport; Dr Janil Puthucheary, Minister of State (Education\nand Communications & Information) and Ms Sun Xue Ling, Member of Parliament, Pasir Ris-Punggol GRC.SIT Welcomes DPM Teo Chee Hean\non its 2nd Anniversary as an AU\nSIT’s Shining StarsDPM Teo and Pasir Ris-Punggol GRC MPs take a look at how SIT’s thinking tinkerers combine theorectical\nknowledge with practical skills to create real-world solutions for industry and community\nAnnual Reach for the Stars event recognises\nindustry partners who support students through sponsorships and bonded scholarships and celebrates achievements of SIT’s scholars“Once a SITizen, Always a SITizen” – Prof Tan Thiam Soon,\nPresident, SIT (left), presents a “SITizen” windbreaker to DPM Teo (right).Mr Jonathan Lim (first from right), a\ngraduating student, explains how his improved panel speakers work to the special guests.\nProf Loh Han Tong, Deputy President\n(Academic) & Provost, thanked industry partners for their continued support. Looking sharp – SIT’s scholars mingle with industry partners at Reach for the Stars,\nnow in its sixth year.\nReach for the Stars, an annual event to celebrate the\nachievements of scholars at the Singapore Institute of Technology (SIT) and to show appreciation to the University’s industry partners for their support, was held on 14 March 2016 at the Rafﬂ  es City Convention Centre.\nMore than 400 guests were present, including 301 scholars, SIT Senior Management, industry partners, polytechnic principals, and representatives from SIT’s Overseas University Partners.\nIn his opening address, Prof Loh Han Tong, Deputy\nPresident (Academic) & Provost, highlighted how SIT has continued to attract support from the industry for its\napplied learning programmes. Not only have organisations like the Land Transport Authority and MSIG come forward\nto offer bonded scholarship opportunities, students who have been working for a few years are also being sponsored by their employers to obtain a degree at SIT.\nOne such student is Mr Chester Liew, from the Bachelor\nof Engineering (Hons) in Naval Architecture (Newcastle University) degree programme, who received a Keppel\nFELS Limited Scholarship.\nHaving worked for Keppel FELS for almost three years, he can see how his programme equips him with the relevant skills and knowledge he needs. He said, “I’ll be able to better contribute to my industry by providing solutions to improve existing processes and systems.”Hosted by Mr Ng Yat Chung, Chairman,\nBoard of Trustees, SIT, and Prof Tan Thiam Soon, Pr esident, SIT, DPM\nTeo and the guests went on a 60-minute\ncampus tour, where students and faculty demonstrated how applied learning is integrated in SIT’s curriculum. Students also gave a presentation on the projects that they had worked on with industry and the community (see story “Using Solar Power to Keep Punggol Residents Safe” on Page 4 for some of these projects).\nMr Jonathan Lim, a graduating student\nfrom the Bachelor of Engineering (Hons) in Mechanical Design Engineering degree programme (University of Glasgow), worked on improving the sound quality of panel speakers with Clarisys Audio Pte Ltd. Said Mr Lim, “I feel honoured\nto have been given the opportunity to present my project to DPM Teo and the guests and recognised for the hard work I put into my ﬁ  nal year project.”\nSiTIZEN  |  04/12\nUsing Solar Power to Keep\nPunggol Residents Safe!\nSIT’s Ultimate\nFrisbee Team Wins its First Bronze at SUniG The Customised Free-Standing\nAutomated External Deﬁ  brillator\n(AED) Stand  allows AEDs to be\nplaced in remote, outdoor areas, and will be useful to park users in an emergency.What do you do when you want to play a game of basketball at the\nneighbourhood court, and don’t want to worry about your belongings going missing? Put them in the S.A.F.E. (Solar-Powered Anti-theft\nFree and Easy) Box, of course! Working with Sengkang Fire Station, Mr Kenny Kok, a graduating student\nfrom the Bachelor of Engineering (Hons) in Mechatronics degree programme (University of Glasgow), designed a free-standing solar-powered stand to mount an Automated External Deﬁ  brillator (AED). AED boxes are usually\nmounted on building walls for easy access during emergencies but in large outdoor areas and parks, there are no walls to mount the devices. The AEDs, which are expensive, will thus be open to tampering and theft.\nWith Mr Kok’s design, the AED can be placed in an open area such as a park,\nand is equipped with a CCTV camera to deter theft or misuse. The stand also has an alarm and wireless communications systems that will send instant messages and photographs to the Singapore Civil Defence Force (SCDF) team when the AED is used, allowing SCDF to send paramedics to the location. A prototype of the stand was piloted along Punggol Promenade Nature Walk.\nSaid Mr Kok, “This project has given me the opportunity to experience working\nwith a community organisation – the SCDF. It was a challenge to meet the deadline of the project during the school term, but in the end, it was satisfying.”Innovations a result of collaboration between SITizens and\norganisations serving the Punggol community\nThe S.A.F.E. Box was designed by students,\nMr Ang Guo Gen, Mr Christopher Wong, Mr Toh Yao Xiang, from SIT’s Bachelor of Engineering (Hons) in Information and Communications Technology (Information Security) degree programme, and Mr Sherman Hardie and Mr Dave Wang from the Bachelor of Engineering (Hons) in Mechatronics (University of Glasgow) degree programme. They collaborated with Punggol Neighbourhood Police Centre’s Community Policing Unit, Singapore Heart Foundation and Punggol Coral Residents’ Committee.\nInstalled near a basketball court,\nthe S.A.F.E. Box features storage compartments with a digital lock mechanism, which allows users to input their own password on a screen and is reset after every use. The other features of the Box include a compartment storing an AED and a CCTV camera for security purposes. These elements, along with the digital lock, are all solar-powered.\nBoth the AED stand and the S.A.F.E Box\nare equipped with photovoltaic cells to harvest solar energy. The energy stored in these cells would be enough to last through at least a few days of poor daylight conditions such as when it is raining, or during the night.\nBoth devices are SIT’s contribution\nto Project Compass (Community Park Safety & Security), which was presented to the Commissioner of SCDF and SPF during the Home Team Sector Steering-Comm Meeting on 11 April 2016. The project was awarded the Sector Excellence Award, beating all other entries in the Home Team Northern Sector.\nThe SIT Ultimate Frisbee Team made history when they\nbagged their ﬁ  rst bronze medal in Ultimate Frisbee at\nthe Singapore University Games (SUniG), beating the team from Singapore Management University in their ﬁ nal match with a score of 8-6. The team was also\nawarded the title of “Outstanding Sports Team” at SIT Sports Appreciation Night.\nTeam captain Pang Wen Jie, a graduating student\nfrom the Bachelor of Engineering (Hons) in Electrical Power Engineering degree programme (Newcastle University), said, “I am very honoured to be the captain\nof this wonderful and outstanding sports team. The\nteam has come a long way for SUniG – forking out at\nleast three days a week on top of our hectic school life for training and physical conditioning.\nMr Pang added, “We are considered relatively new as compared\nto other universities, but we managed to overcome odds to emerge as bronze medallists. We are all exhilarated with this achievement and will continue to work hard!”\nSiTIZEN  |  05/12 SiTIZEN  |  05/12\nTeam GTE (in black t-shirts) receiving their ﬁ  rst prize from one of the judges, Dr Cheng Wei, Expert Software\nEngineer from Garena (extreme left).\nMr Tan Jen How, graduating student, explains to visitors how his stair-climbing\nrobot works. SIT plays host to Singapore’s inaugural Fishackathon where Team GTE\ntook the top prize\nAt UofG’s Industry Day and Student Project Exhibition 2016, graduating students get a chance\nto present their projects to attract industry collaboration\nAt the University of Glasgow (UofG) Industry Day and Student\nProject Exhibition 2016, graduating students from the Aeronautical Engineering, Aerospace Systems, Mechanical Design Engineering, Mechatronics and Computing Science programmes had the opportunity to present their ﬁ  nal-year\nprojects to industry representatives and guests.\nMore than 130 ﬁ  nal-year projects were on display, including\nhardware prototypes and software demonstrations at the event which took place at the SIT@SP building on 24 March 2016. One of these projects was from Mr Tan Jen How from the Bachelor of Engineering (Hons) in Mechanical Design Engineering degree programme.\nIn his project, “Design and Implementation of a Stair-Climbing\nRobot”, Mr Tan developed a more efﬁ  cient design for a robot\nto be able to climb stairs more smoothly. He said, “This can be used in hospitals, where stairs are under-utilised especially during peak periods to transport medication or documents.”Swimming Towards\nSustainable Fishing\nInnovating Solutions for Everyday ProblemsMr Joe Lum, an alumnus from the Bachelor of Science (Hons) in Computing\nScience (University of Glasgow), ﬁ  rst took part in a hackathon organised by the\nGlasgow University Tech Society back when he was a student at the Singapore Institute of Technology (SIT). Now he is one of the members of Team GTE (which stands for Geospatial Technology Exploitation), who took the ﬁ  rst prize\nat Singapore’s inaugural Fishackathon 2016. The event was held over the Earth Day weekend from 22-24 April 2016 at SIT.\nFirst launched in 2014 by the US Department of State, Fishackathon is a global\ncoding competition that challenges its participants to create applications\nand systems to provide solutions for problems surrounding sustainable fishing. SIT hosted the inaugural Fishackathon in Singapore with help from the Information and Communications Technology students to ensure the event ran smoothly.\nFor their ﬁ  rst prize entry, Team GTE\n(made up of Mr Lum and his Infocomm\nDevelopment Authority of Singapore colleagues Mr Soh Ken Chen, Ms Lim Qi Hua, Mr Teo Lip Seng, and Mr Tan Chee Boon) developed a mobile application to help ﬁ  shermen\ncapture data on the global ﬁ  sh catch\nby taking a photo of the fish. The application is able to identify fish species and length, and the image is processed to extract details for further analysis. With this application, the ﬁ  sherman is able to identify the\nﬁ sh species and collect data without\nresorting to traditional methods which require ﬁ  shery experts or scientists to\nbe present.\nThe team took home $1,500 in cash,\n$250 Redmart Vouchers, US$120K IBM Bluemix Credits and a Sphero BB8. Said Mr Lum who also writes Android applications in his free time, “I am deﬁ  nitely happy for my team\nto be able to win the ﬁ  rst prize in\nthe Fishackathon 2016 in Singapore. This is also my ﬁ  rst time getting the\ntop prize in a hackathon. Through this event, it helps us to understand the strengths and weaknesses while working together.”\nSiTIZEN  |  06/12\nThe EIP took these SITizens to Suzhou in August 2015. Beijing is another EIP location and there\nare plans for students to visit Japan.\nAt the end of each trip, EIP participants will have to present their\nbusiness plan to the trainers, where they receive immediate\nfeedback on their ideas.\nMr Teo Yong Kia, a student from the Bachelor of Science in Electrical\nEngineering & Information Technology (Technical University of Munich), visited Beijing for the ﬁ  rst time in January 2016 – and this was no ordinary\ntrip. In fact, it was a special opportunity for an engineering student like him to learn more about business in an overseas setting, as a participant of the Enterprise Immersion Programme (EIP) at the Singapore Institute of Technology (SIT).\nLaunched in May 2015 by the Enterprise & Innovation Hub at SIT to\nnurture the entrepreneurial spirit among SITizens, the EIP is a seven-day overseas programme that gives students with a business idea a chance to learn to commercialise their projects, and to develop a business plan. At the same time, they are exposed to the business culture and philosophy of different overseas companies. At the end of their trip, they also get to pitch their business ideas to company representatives.\nUnlike the compulsory Overseas Immersion Programme for students\nenrolled in programmes offered by SIT’s Overseas University partners, the EIP is open to students from all degree programmes at SIT. Those who are interested will have to apply to participate in the programme and also be able to articulate their business ideas. Each EIP usually consists of between 20 and 25 students from different degree programmes, who will be immersed in the culture of their host country. For example, on the trips to Chinese cities like Suzhou and Beijing, the participants got to learn the principles of Sun Tzu’s Art of War and its applicability to the business world. The cost for each trip ranges from $650 to $1,050, depending on the location.\nThe first EIP took SIT students to Suzhou, China, in May 2015. There,\nthey visited companies like Alibaba and ASUS. In January 2016, students on the EIP headed to Beijing, where they were taught by faculty from The Enterprise Immersion Programme at SIT is giving\nthem insights into how to commercialise a business idea while they gain overseas exposureLearning How to Do\nBusiness OverseasBeihang University and also visited Hyundai\nMotors as well as Lightchaser Animation. Currently, there are plans for students on the EIP to go to Japan, where they will learn more about the Kaizen Model in Innovation Management. At least four EIP trips are planned for each year.\nFor Mr Lin Pei Kun, a graduating student\nfrom the Bachelor of Engineering (Hons) in Mechatronics (University of Glasgow) degree programme, visiting the Suzhou Industrial Park was a point of interest. He found the insight from Mr Kelvin Lee, Managing Director, Johnson Precision Engineering (Suzhou) Co. Ltd., to be especially valuable. Said Mr Lin, “My biggest learning point is that running a business is never an easy job, nor is it a one-man task as employees are the best assets in a company. As Mr Lee shared, he was able to grow and sustain his business around the world because of his employees. He recognised the contributions of his employees and entrusted them with responsibilities, and he still has the same batch of employees that he started his business with.”\nMs Soh Hwee Yee, from the Bachelor of\nAccountancy (Hons) degree programme, went on the same Suzhou trip as Mr Lin in August 2015. She said, “The visits to NetEase, Alibaba, Johnson Precision and Asus were really enriching. Through my interaction with the staff, director or founder of these companies, I gained a better understanding on how each company in the various industrial segments operates. The dialogue session with the staff at Suzhou Industrial Park deepened my understanding of the business environment of China and its rich Chinese culture.”\nShe added, “I deﬁ  nitely beneﬁ  ted from\nthe whole experience of the trip and the learning journey beyond the classroom was amazing. I believe this is one of the greatest takeaways during my journey at SIT.”\nSiTIZEN  |  07/12\nThis recognisable stray at the SIT@Dover campus did, when it met ﬁ  rst-year student Joey Cheng,\nwho needs some help fostering it for future adoption\nSITizens show how they are ‘Grounded in Community’\nat events organised by SCCCI and SFCCAEvery Dog has its Day…\nCommunity\nMinded SITizensIf you have ever visited the SIT@Dover\ncampus, you might have seen a stray roaming the grounds or taking a nap at the car porch. Known by many names including Patchy, Tom, Lucky and Xiaobai (as it is mostly called), it was a familiar sight on campus, and a favourite among some SIT staff and students who took it upon themselves to feed it.\nOne of them was Ms Joey Cheng, a\nﬁ rst-year student from SIT’s Bachelor\nof Engineering (Hons) in Sustainable Infrastructure Engineering (Building Services) degree programme. She recently made the brave and generous decision to foster Xiaobai, a female estimated to be about two years old, in her home. Ms Cheng hopes that Xiaobai will eventually h a v e  t h e  c h a n c e  t o  b e  a d o p t e d  b y  a family that loves her, instead of e n d i n g  u p  w i t h  t h e  f a t e  o f  s o  m a n y  other strays in Singapore.\n“I wanted to be able to get close to\nit, so I would leave chicken wings on the ground close to me and wait for it to approach. ” said Ms Cheng, who comes from a family of animal lovers. Even though Xiaobai looked forward t o  be i n g  f ed ,  it  w ou l d  j u mp  a wa y  or  even bark when anyone got too close. Catching Xiaobai was no easy feat. It took hired dog-catchers at least ﬁ ve attempts over a few months and various methods, before Xiaobai was\nsuccessfully captured so that it could be transported to Ms Cheng’s home.\nBefore she enrolled in SIT , Ms Cheng\nhad studied Veterinary Sciences at polytechnic where she started volunteering at Save Our Street Dogs (SOSD), a volunteer-run organisation dedicated to the welfare of stray dogs in Singapore. It was there that she learnt that it would be necessary for a dog to have a system and be disciplined, and this was what she did for Xiaobai, conﬁ  ning her to the\nkitchen when she is not at home.After two weeks, Ms Cheng introduced Xiaobai to Momo, her own dog, so that Xiaobai could learn how to live in a pack. Xiaobai learnt to wait patiently to be fed, and to express its happiness by wagging its tail. Said Ms Cheng, “It can be quite a terror but Xiaobai’s improvement was very fast – I only had to correct its behaviour a few times, and it would learn. I was quite impressed.”\nMs Cheng estimates that it would\ntake at least four more months before Xiaobai is ready for adoption through SOSD. Meanwhile, as she will be starting work, she hopes to get a partner in fostering Xiaobai in the months ahead.\nIf you would like to help foster this\ngentle canine, get in touch with us at Alumni@SingaporeTech.edu.sg\nMr Nicholas Au (extreme right in photo), a ﬁ  rst-year student\nfrom the Bachelor of Arts (Hons) in Criminology & Security (University of Liverpool), and the President of the SIT Community Service Club was one of the SITizens who volunteered their time as road marshals at “323: Walk the Talk: A Walk for Lee Kuan Yew”, organised by the Singapore Chinese Chamber of Commerce & Industry (SCCCI) on Wednesday, 23 March 2016.\nHe said, “More than just recognising Mr Lee for his\ncontributions to the nation, these events highlight the community spirit and social cohesiveness that Singaporeans have, even in this time and age. With a hectic lifestyle as norm, it is especially heartwarming to be able to see Singaporeans t a k i n g  a  s t e p  b a c k  f r o m  t h e i r  b u s y  s c h e d u l e  a n d  c o m i n g  together for a good cause.” Mr Au and other SITizens also attended “Remembering\nLee Kuan Yew: Coming Together, Achieving Together”, a remembrance ceremony on Sunday, 20 March 2016. This was jointly organised by the Singapore Federation of Chinese Clan Associations, Yayasan MENDAKI, Association of Muslim Professionals, Singapore Indian Association, Eurasian Association, SCCCI, Chinese Development Assistance Council, Business China and Singapore Chinese Cultural Centre.It took several tries to capture this photo of Ms Joey\nCheng and Xiaobai.\nXiaobai in her natural habitat at the SIT@Dover campus.\nSiTIZEN  |  08/12\nAt the SIT Alumni Movie Night, a signature event\nof the SIT Alumni Leisure Network, alumni and graduating students were treated to a screening of the latest superhero blockbuster SITizens’ Night Out\nat the Movies with Captain America\n“We’re Team Cap!”: These folks were the ﬁ  rst in the queue to get the best seats\nin the theatre.\nMr Chan Wing Leong, Deputy President (Administration) & Chief Financial Ofﬁ  cer,\nSIT, talks to Mr Timothy Lye, alumnus, during the dinner reception.\nFriendly student hosts handed out tickets and the popcorn and drink coupons at\nthe registration booth.Alumni also got to watch a short clip with some familiar faces on the big screen\n– a video of all the latest happenings at the SIT Alumni Network events!\nA chance to reconnect – alumni catch up with (1) Asst Prof Benjamin Soon, Deputy\nProgramme Director, SIT and (2) Assoc Prof Lee Kwee Hiong, Programme Director, SIT (second from left).SITizens were in for a blockbuster treat at the SIT Alumni\nMovie Night held on Thursday, 12 May 2016. More than 200 alumni and graduating students turned up to catch a screening of “Captain America: Civil War” at Filmgarde at Bugis+. Mr Chan Wing Leong, Deputy President (Administration) and Chief Financial Ofﬁ  cer, SIT, along with\nsome SIT faculty also attended the event.\nEven though registration began only at 7pm, alumni started\nshowing up as early as 6.30 pm, to get their tickets and to network with fellow alumni and SIT faculty over dinner. At the end of the movie, more than three quarters of the audience stayed behind to catch the post-credit scenes.\nAs at previous movie nights, there was also a namecard\ndrop lucky draw (see list of winners in box). Mr Shawn Chew, an alumnus from the Bachelor of Engineering (Hons) in Electrical Power Engineering (Newcastle University), was one of the lucky winners. He said, “I had a great time networking with other alumni from diverse sectors, especially because we can help each other in our careers.”\nMs Nurul Afifah, an alumnus from the Bachelor of Science (Hons) in Electrical Engineering & Information Technology said, “With the movie, buffet and snacks, it was a good deal!”\nNamecard Drop Lucky Draw Winners\nCongratulations to the following lucky winners who dropped their namecards at the SIT Alumni Movie Night! They get a $10 Books Kinokuniya voucher.\n• William Wong\n• Shawn Chew• Hannah Wong• Adeline Lim• Gordon Tan• Travis Lim\n• Fong Tze Chow Ernest• Owen Tan• Shawn Tan• Florence Lee1 2\nA l w a y s  a  k e e n  l e a r n e r ,  C u l i n a r y  A r t s  M a n a g e m e n t  g r a d u a t e\nLynn Chia was rewarded with a rare opportunity that allowed her to learn all about wine harvests during her externship in CaliforniaCooking in Wine Country\nAlumnus Lynn Chia is deﬁ  nitely not one of those people who is afraid to go\nwhere her interests take her. At 28, she chose to leave a management job at the Brewerkz Group, where she had been working for about 10 years, to pursue a Bachelor of Professional Studies in Culinary Arts Management (The Culinary Institute of America) degree at the Singapore Institute of Technology (SIT). For her externship in 2014, she chose to head to California where she was a line\ncook at Chalk Hill Estate in Sonoma County.\nWhen she met head winemaker, Mr Steve Nelson, she asked to be part of the\nwine harvest so that she could learn how wine is made. On her ﬁ  rst day, Ms Chia\ncame prepared with attire that was suitable for manual labour, thinking that she would be sent to the ﬁ  elds. Instead, she was sent to the lab where she learnt\nto run various tests such as testing the acidity of wine, and the brix levels which indicate the ripeness of the grapes.\n“Having no background in winemaking, or chemistry, I never thought that\nI would have this opportunity,” she said. When she asked Mr Nelson why he thought she would be suitable for the lab, he said he had seen her work the charcuterie station at an event for the estate, where she maintained her cool and speed when plating for more than 200 guests. He thought that her skills would translate well in the lab, where tests have to be run quickly, and with precision.\nWorking at a winery, Ms Chia also learnt to “truly appreciate the wine tasting\nprocess”. She said, “We started with wines from 2007 all the way to 2014 and I learnt to differentiate different vintages and different varietals, and came to understand how certain decisions made during harvesting actually affects the taste and quality of the wine.” She was also privy to challenges in winemaking. She recalled how even though the brix levels were not up to expectations, the winemaker and vineyard manager had to make the decision to pick the grapes because the weather forecast indicated rain which would affect the juice content of the grapes.\nAfter her externship, Ms Chia was hired as a sous chef at Pascaline Fine\nCatering, a company in California that was founded in 2015. She is working under Chef Didier Ageorges, whom\nshe met at Chalk Hill Estate, where he was the executive chef. When he shared that he wanted to set up a catering company, she got excited and wanted to be part of that. In fact, while she was still on her externship, on her two days off from the estate, Ms Chia would work at Pascaline to help design menus for clients, which include a number of wineries in the Napa Valley and Sonoma County area.\nDesigning menus to pair with\nwines is already a challenge, but Ms Chia also has to be more mindful of ingredients that she picks, especially because of the seasonal availability of ingredients in California, and the emphasis on using locally sourced ingredients. She said, “Once I was ﬁ  xing a menu towards the end\nof summer and wanted to get some heirloom tomatoes. When we went to the supermarket and couldn’t ﬁ nd any, I had to take the dish off the\nmenu.” Ms Chia also recalls a trade event which featured 27 different kinds of pinot noir from Sonoma County, to be paired with four food courses. “They had strict requirements and we had to submit the menu more than once,” she recalled.\nWhile she enjoys working in California,\nher ultimate stop would still be Singapore. “I just want to get as much exposure and experience that I can get and bring it back to Singapore, and hopefully share it with my future students. That’s the ultimate goal for me and to teach in CIA in Singapore is deﬁ  nitely one of my dreams,” said\nMs Chia.\nSo what would be her favourite wine?\nMs Chia smiled and said that it was a difﬁ  cult question to answer because\nfor her, drinking wine is an experience. “The experience is created only when you drink it at the right moment, and of course who you drink it with,” she said.\nMs Lynn Chia in a wine tank, helping with the crushing of the grapes at Chalk Hill Estate, where she spent six\nmonths being part of the wine harvest.\nThe grape sorting table at the estate, where workers\nremove leaves, twigs and non-usable grapes.\nSiTIZEN  |  09/12\nAn annual affair, the Volunteers Appreciation Dinner is SIT’S chance\nto say “thank you” to student hosts and alumni volunteers who have contributed to the success of its advancement and alumni events\nParticipants learn how to use MBTI\n® to\nimprove relationships and make more considered decisions at the Personality Application workshop organised by the SIT Alumni Career Network What Wonderful Hosts!\nOn Friday, 25 February 2016, 34 alumni and students came together for the\nVolunteers Appreciation Dinner at Black Tongue Bistro & Bar that was specially organised for them.\nThe annual dinner is a way for SIT to thank the student hosts – and some who\ncontinue to volunteer as hosts even after graduation – who had been instrumental at various alumni and advancement events such as the New Alumni Welcome Party, the Recognition of Excellence, and also the Alumni Network events and activities.\nSome like Ms Kelly Han, a student from the Bachelor of Science in Electrical\nEngineering & Information Technology degree programme (Technical University of Munich) and Ms Ong Wen Hui, an alumnus from the Bachelor of Science in Food & Human Nutrition degree programme (Newcastle University) have gone on to facilitate workshops for the SIT Alumni Leisure Network. Earlier this year, Ms Han had facilitated the Origami Workshop, and Ms Ong was the\nThe Personality Application Workshop, organised\nby the SIT Alumni Career Network, took place on Saturday, 5 March 2016, One Farrer Hotel & Spa. Attended by 23 alumni and graduating students, the participants spent the afternoon learning how to use the Myers-Briggs Type Indicator\n® (MBTI®)\nfor self-development. They were guided by Mr Charles Sng, a certiﬁ  ed MBTI\n® practitioner, to\nuse MBTI® to overcome challenges in relationships\nand develop a better decision-making process.\nMs Esther Lim, an alumnus from the Bachelor\nof Engineering (Hons) in Marine Engineering (Newcastle University) degree programme, ﬁ  nds it\nuseful to be able to learn something new in her free time. She said, “I attended this workshop because I Everyone’s full and happy after the three-course dinner! One for all, and all for one!\nCatching up with friends before the dinner began…Managed to sneak a ﬁ  nal weﬁ  e before calling it a night!\nParticipants at the workshop also presented\ntheir observations to the rest of the attendees.SiTIZEN  |  10/12\nLearning\nto See the Other Side\nfacilitator for Sweet Creations held in\nJune 2015, and will also lead a second workshop on 18 June 2016.\nMs Umamaheshweri D/O Aruchunan,\na student from the Bachelor of Science in Food & Human Nutrition (Newcastle University) degree programme, was one of the emcees at the Recognition of Excellence event in October 2015. She said, “I help at these events because it’s enriching and I get to widen my network of friends. The dinner was a good opportunity to meet other volunteers and I really enjoyed the food too!”\nwanted to not only understand what my personality type is, but to\nknow why that is my personality type.”\nSaid Mr T Dhanachandran, a graduating student from the\nBachelor of Engineering (Hons) in Aeronautical Engineering (University of Glasgow) degree programme, “I really enjoyed the Basic Personality Workshop, and decided to follow-up with the Personality Application Workshop. It is my interest to learn more about this, and going for these two workshops have helped me develop more self-awareness.”\nThis is the second in the series of Personality Application workshops\nthat the SIT Alumni Career\nNetwork has organised. Previously, the Network organised the Basic Personality Workshop, an activity-based foundational workshop that was held twice, once in September 2015 and subsequently in December 2015.\nSiTIZEN  |  11/12\nCharles & Keith\n• 10% off total bill• Valid at all outlets except Changi Airport\nTerminals 1, 2 & 3\n• Valid until 30 June 2016\nDojo\n• 15% off total bill\nEyecon Optical\n• $19.80 onwards for a pair of standard\nprescription lenses\n• Waiver of eye examination fees• Valid until 31 December 2016\nFloral Garage Singapore\n• 10% off total bill at www.ﬂ  oralgaragesg.com\n• Key in the code ‘SIT010’\nGiovanni L.\n• 10% off total bill• Valid until 31 December 2016\nKF1 Karting Circuit\n• Members’ price for karting• 30 kph karts: $22 (non-peak) or $28 (peak)• 50 kph karts: $28 (non-peak) or $35 (peak)\nKitchen Capers\n• 10% off bakeware tools/packaging needs/\nbooks/DVDs\n• 5% off food/ingredients\nMorganﬁ  eld’s\n• 10% off total bill• Participating outlets: The Star Vista, Suntec City• Valid until 31 December 2016SIT Alumni\nCard Beneﬁ  tsNanyang Optical\n• 40% off all regular-priced frames• 10% off all contact lenses with minimum\npurchase of 2 boxes\n• 30% off conventional contact lenses• Valid until 1 March 2017\nPezzo\n• 10% off total bill• Valid until 31 December 2016\nPlanet Popcorn\n• 10% off purchases using code ‘SIT2014’ during\ncheckout at www.planetpop.com\n• 15% off and free delivery for orders above $150.\nUse code ‘Corporate’\n• Valid until 1 March 2017\nQQ Rice\n• 10% off on Oat Rice, Rice Roll, Snack Roll,\nWholemeal Sandwich\n• $5 value set for rice roll/oat rice & standard drink• Valid until 31 December 2016\nSeasonal Salad Bar\n• 10% off all regular priced items• Participating outlet: One@KentRidge• Valid until 1 Apr 2017\nSeattle Pike Chowder\n• 10% off total bill• Valid until 31 December 2016\nSharetea\n• 10% off all regular priced items• Valid until 31 May 2016\nShopBack\n• $10 Beneﬁ  t\n• Up to 18.0% Cashback when shopping with\nselected partners\n• Visit www.shopback.sg  for more details\nSkinny Pizza\n• 10% off total bill at all Skinny Pizza outletsWe Hear You!\nAlumni Career\nNetwork i.e.\nPersonality\nWorkshops, Financial\nLiteracy WorkshopsAlumni Leisure\nNetwork i.e. Alumni\nMovie Night, Sweet\nCreationsAlumni Sports\nNetwork i.e.\nFrisbee, Floorball,\nFutsalOthersPreferred SIT Alumni Network activities:\nA majority of SITizens who responded would like to participate in Alumni Leisure Network activities such as the SIT Alumni Movie Night, or Sweet Creations.\nSolemates• 10% off sales items with every $200 spent in\na single receipt\n• Valid until 1 March 2017\nSunlife Durian Puffs & Pastries\n• 10% off total bill• Participating outlets: Causeway Point Shopping\nMall, 333 Coffee Shop (Blk 136 Bedok North Ave 3)\n• Valid until 31 July 2016\nTart & Co.\n• 10% off all items• Participating outlet: The Star Vista\nThe Braces Practice\n• Discounted rates for various braces options• Valid until 10 May 2016\nThe Ordinary Co.\n• 10% off all items at www.theordinary.co  with\na minimum spend of $10\n• Valid for one-time use for each customer\nTom’s Palette\n• 10% off selected ice-cream products\nTotally Hot Stuff\n• 10% off total bill• Valid until 30 April 2018\nUdders\n• Free scoop with any main course• Available Monday-Friday, 12-6pm only• Valid until 25 July 2016\nXorex Press Pte Ltd\n• $8 for A2 poster with mounting• $16 for A1 poster with mounting• Valid until 1 March 2018SITizens reveal what they liked in an ad hoc poll for alumni conducted earlier this year\n*Please present your SIT Alumni Card prior to making\npayment. Terms and conditions apply. Please refer tohttp://sl.singaporetech.edu.sg/Welfare/SITreats.aspx\nfor detailed terms and conditions.\nLUCKY DRAW WINNERS\nCongratulations to the following\nlucky winners who have won a $10 Candy Empire voucher each for sending in their survey responses!\n• Jacey Yong\n• Chong Xin Qian• Muhammad Haﬁ  z bin Osni\n• Marcus Chuang• James Lim• Tan Wei Lin• Mervin Tee• Lee Shu Lin• Gan Hian Jiun• John NgiamTheir top 3 reasons for taking part in SIT Alumni Network activities:\n• Keep in touch with classmates\n• For some fun outside of work• Network with fellow alumni and juniors7.20%\nType of Alumni events that you would like to participate inWhat SITizens like about SITizen:92.3%  of alumni who responded to the\npoll agreed that this newlsetter provided them useful and interesting information, while 87.7%  responded that SITizen\nkept them updated with the latest happenings in the SIT community.\nThe top 3 topics they are interested to\nread about in SITizen:\n• Alumni privileges and merchant discounts\nfor SIT alumni\n• General career tips• Alumni events and activities\n33.10%79.80%\n57.40%"
}