{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-18.pdf",
  "type": "pdf",
  "content": "SIT’s Future Campus in\nPunggol Digital District\nNew Offerings for\nAcademic Year 2018/19\nInaugural Applied\nLearning Conference\nMoU to Develop Allied\nHealth Professionals\nImagine! Inclusive Travel\nfor the Visually Impaired\nBursaries, Scholarship\nand Book Prize for Undergraduates, Thanks to Generous Donors\nJourney from ITE to SIT\nand Beyond\nThe SIT-CIA Alumni\nBehind Marble Bistro\nAlumni Take Part in\nInter-Cluster Games for the First TimeOnce a SiTizen, Always a SiTizen ISSUE NO. 18  |  FEBRUARY 2018\nWHAT’S\nHAPPENING\naround our little\nbig campus\nSITizen is a publication by the\nSIT Advancement & Alumni Division.\nFor enquiries, please e-mail us at\nAlumni@SingaporeTech.edu.sg© Singapore Institute of Technology 2018\nThe year 2018 is still young and already, SITizen has a host of exciting SIT news to report on.\nOn 21 January 2018, the masterplan for Punggol Digital District was jointly unveiled\nby IMDA, JTC Corporation, SIT and URA. The District will be home to SIT’s new and\npermanent campus and the first to integrate business and education. It will include a host\nof innovations to set a new standard for sustainability and liveability.\nAs Singapore’s university of applied learning, SIT is taking an active part in the evolving\ndiscourse surrounding applied learning. Singapore’s first Applied Learning Conference, organised by SIT, saw more than 50 international and local experts from academia and industry sharing their perspectives with over 300 attendees.\nSIT also announced its new offerings for the upcoming Academic Year 2018/19, which\nwill begin in September 2018. This includes the Bachelor of Engineering with Honours in\nAircraft Systems Engineering degree – developed in collaboration with SIA Engineering\nCompany and the first of its kind to be offered by an autonomous university in Singapore.\nSIT is also launching the Master of Engineering Technology in Electrical Power Engineering to equip graduates and professionals with a broad and robust training on modern electrical engineering technologies, with a strong focus on power and energy applications in an\nurban environment.\nThis year’s Inter-Cluster Games marks the first time alumni are taking part in friendly futsal\nmatches. Mr Karthigesan S/O Murukan, an alumnus who was a co-founder of SIT’s futsal team, was glad of the opportunity to catch up with his fellow alumni and juniors. He said, “They even asked for suggestions and guidance for current school work.”Dear SIT Alumni,\nAll Things New\nAlumni play for the very first time\nat the second Inter-Cluster Games.\nRead more on p.11! In this issue, we also catch up with alumni whose journey in\napplied learning took them from ITE to polytechnic to SIT – and now onto rewarding careers in different fields. We also talk to a pair of SIT-CIA alumni who are making their mark as the masterminds behind Marble Bistro.\nWe hope you will enjoy reading this issue of SITizen.\nShould you wish to contribute a story, do drop us a line at Alumni@SingaporeTech.edu.sg.\nSiTIZEN  |  02/12\nSIT’s New Offerings for\nAcademic Year 2018/19\nThese include the BEng (Hons) in Aircraft Systems\nEngineering and the MEngTech in Electrical Power Engineering\nThe Singapore Institute of Technology (SIT) has three new offerings for the\nupcoming Academic Year (AY) 2018/19: The new Bachelor of Engineering with Honours in Aircraft Systems Engineering degree programme; a Master of Engineering in Electrical Power Engineering degree programme and a new Baking and Pastry Arts specialisation for an existing programme, the Bachelor of Business Administration in Food Business Management degree offered by The Culinary Institute of America (CIA) at SIT.\nThe Aircraft Systems Engineering programme, developed in collaboration\nwith SIA Engineering Company (SIAEC), is the first such degree to be offered by\nan autonomous university in Singapore. Built on an interdisciplinary curriculum\nwhich utilises a practical hands-on approach and integrates engineering and\nscience, the programme aims to develop graduates for careers as licensed\naircraft engineers, project engineers, and technical service/repair development\nengineers. This is in line with the university’s mission to groom industry-ready students while providing well-equipped talent for the Aerospace and Maintenance, Repair and Overhaul (MRO) industries.\nDuring the three-year programme, students will be trained by both SIT faculty\nand Licensed Aircraft Engineers from SIAEC’s Training Academy. Students will also undergo an eight-month Integrated Work Study Programme (IWSP), a signature component of SIT-conferred degrees, at SIAEC in their third year to gain first-hand industry experience in aircraft maintenance. Around 48 students are expected to commence classes in September 2018 as part of the first intake of the students.\nUpon graduation, students will also be awarded a Certificate of Recognition\n(CoR) by SIAEC, a Civil Aviation Authority of Singapore (CAAS) SAR-147\napproved Maintenance Training Organisation. This CoR certifies that the holder has successfully completed a SAR-147 Approved Basic Course, which is one of the requirements for the award of an Aircraft Maintenance Licence (AML).\nClose to 5,000 visitors attended SIT's\nOpen House, held at Suntec Singapore Convention & Exhibition Centre on 13 and 14 January 2018.\nSeveral visitors expressed keen interest in\nSIT’s applied learning pathway and some of its defining aspects, such as real-world learning, internships and specialist skills. Nanyang Polytechnic graduate Ms Valda Ng said that SIT’s Hospitality Business programme was her preferred course: “I’m aiming to enter a business course and work in the MICE (meetings, incentives, conferences and exhibitions) industry after graduation, so I’ve made Hospitality Business my first choice. The course also has many internship opportunities available, such as the Integrated Work Study Programme that is at least eight months long. I find that quite attractive as a student.”“The air transport industry in Singapore\nand the Asia-Pacific region is undergoing\nrapid expansion and transformation, and\nthere is demand for skilled engineers and\ntechnicians to support this fast-growing sector,” said Prof Loh Han Tong, Deputy\nPresident (Academic) & Provost, SIT.\nSIT is also launching the Master of\nEngineering Technology in Electrical Power Engineering which will commence classes in September 2018. The programme is formulated to equip graduates and professionals with a broad and robust training on modern electrical engineering technologies, with a strong focus on power and energy applications in an urban environment. It is suitable for recent graduates who wish to develop the specialist knowledge and skills relevant to this industry. It is also suitable for mid-career professionals who wish to take advantage of current economic restructuring and industrial transformation to switch to electrical engineering careers in sectors including, but not limited to, power and  energy, transportation and connectivity, built environment and manufacturing.\nOffered for the first time in Singapore, the\nBaking and Pastry Arts specialisation, as part of the Food Business Management degree programme, will provide students with an in-depth understanding and command of bread, cake and pastry production; business skills; and the catering industry. The first intake of around 16 students for this specialisation will commence classes in August 2018.\nEnthusiastic Crowds at\nSIT Open House 2018\nWalkways and booths at the Open House\nwere tightly packed with visitors keen to\nknow more about SIT.\nStudent helpers wearing the white SIT Open\nHouse t-shirt were on standby to answer\nquestions from visitors.SIT Wushu Club wowed audiences with soaring kicks and other well-honed techniques at\nOpen House.\nAssistant Prof Eliver Lin, Programme Director,\nSIT giving a talk about the Hospitality\nBusiness programme.\nApplications to SIT for AY 2018/19 are open from 11 January to 19\nMarch 2018. For further details, visit www.SingaporeTech.edu.sg.\nSiTIZEN  |  03/12\nSIT is already collaborating with community groups and industry\npartners ahead of its move to Punggol in 2023. These include:\n• Working with SP Group to construct Southeast Asia’s first\nexperimental urban micro-grid which will provide power and serve as a teaching and applied research platform\n• Collaborating with JTC on projects related to Smart Facilities Management and Operations, enhancing facilities management through data analytics and machine learning, and strengthening cyber security of industrial control systems\n• Working with Punggol Grassroots to bring a MakerSpace to the community, bringing the learning-by-doing experience to youths and residents who are interested in science and technologyCreating the Future in Punggol Digital District\nHome to SIT’s future campus, the District is the first area in Singapore to integrate business\nand education, driven by technological, social and urban innovation\nThe Infocomm Media Development Authority (IMDA),\nJTC Corporation, Singapore Institute of Technology (SIT) and Urban Redevelopment Authority (URA) jointly unveiled the masterplan for the Punggol Digital District (PDD) on 21 January 2018. Deputy Prime Minister and Coordinating Minister for National Security Teo Chee Hean launched an exhibition showcasing the masterplan at Waterway Point, and invited the community to experience the exciting possibilities of a district driven by technology and innovation.\nSituated in Punggol North, PDD is planned as part of\nSingapore’s strategy to sustain long-term economic\ngrowth by creating new development areas island-wide,\nand bringing good jobs and social amenities closer to residents. It is envisioned to be vibrant and inclusive, underpinned by cutting-edge technology, as well as urban\nand social innovation which make everyday living more\nconvenient and sustainable. As Singapore’s first Enterprise\nDistrict, PDD will provide flexibility for the land use mix and scale to be curated at district-level, enabling deeper integration and synergy of different uses and spaces.\nJTC’s business park buildings in the area will house key\ngrowth sectors of the digital economy, such as cyber security and Internet of Things (IoT), which will in turn drive the wider transformation efforts for the Singapore economy. This move will bring approximately 28,000 jobs closer to residents in Punggol and the north-east region.\nThe District will also be home to SIT’s new campus. This\nco-location with JTC’s business park buildings will facilitate\nthe cross-fertilisation of knowledge and collaboration\nopportunities among students, faculty and industry professionals. SIT’s research labs and learning facilities could reside within the JTC buildings and similarly, JTC\ncould host industry research, development facilities\nand even create startup spaces within SIT’s campus.\nThis “exchange” of space creates greater synergies between academia and businesses to create and test-bed prototypes, new ideas and innovations.\nProf Tan Thiam Soon, President, SIT, says such collaborations\nwill enable SIT students to stay competitive in view of the fast-evolving skill sets required by the industry. “SIT students will especially benefit through these partnerships by leveraging the expertise of industry through ‘industry teaching laboratories’. This will allow SIT to pilot programmes to support research work and learning. Ultimately, the PDD presents a golden opportunity for us to showcase the benefits of close industry-academia partnerships where SIT students can be groomed to seamlessly transition into their chosen careers,” he added.\nIn addition, the District will also set a new standard for\nsustainability and liveability with innovations to optimise\nland use, as well as resources to enhance liveability and\nreduce carbon footprint. These include an integrated\nFacilities Management System, a Pneumatic Waste Conveyancing System as well as IoT systems built from the ground up. PDD is also planned to be an inclusive\narea for the community that is vibrant, car-lite and green.\nThe existing Punggol Road will be transformed into a\npedestrianised 1,300m “Heritage Trail” that provides a green link from Punggol Waterway Park to the Punggol Promenade Park Connector. An 800m Campus Boulevard will also be a key gathering space which provides a direct connection from various developments to the waterfront and the Punggol Coast MRT Station.\nThe masterplan and exhibition for the Punggol Digital District was launched at\nWaterway Point on 21 January 2018.\nThe Campus Boulevard connects SIT (right) to JTC’s buildings\nand provides easy access to the Punggol Coast MRT Station.SIT in Punggol\nSiTIZEN  |  04/12\nUndergraduates from the Health and Social Sciences\ncluster can look forward to an enhanced learning experience with the latest Memorandum of Understanding (MoU) signed between Singapore Institute of Technology (SIT) and NTUC Health Nursing Home. The MoU aims to develop a talent pool of allied health professionals in Singapore through knowledge and skills sharing and will provide SIT students with opportunities to gain hands-on experience and industry know-how.\nSaid Assoc Prof Ivan Lee, Vice President (Industry &\nCommunity), SIT, “It is vital for our students to stay ahead with evolving skill sets required by the industry. Our students will benefit as we leverage the expertise of NTUC Health and collaborate on pilot innovative activities to support research work and learning.”\nIn addition, this partnership, which was signed at the\nofficial opening of NTUC Health’s second nursing home at Chai Chee, will also allow NTUC Health employees to further their skills through SITLEARN Professional Development programmes.\n(Front, from left) Mr Chua Song Khim, CEO, NTUC Health, and Assoc Prof Ivan Lee,\nVice President (Industry & Community), SIT, at the MoU signing ceremony. They are\njoined by (back, from left) Ms Tan Hwee Bin, Chairman, NTUC Health, Mr Tan Chuan-\nJin, Speaker of Parliament, and Prof Tan Thiam Soon, President, SIT.More than 50 international and local experts from\nacademia and industry convened at Singapore’s first Applied Learning Conference (ALC) to participate in the evolving discourse on applied learning. Organised by Singapore Institute of Technology (SIT), the two-day conference was held on 25 and 26 January 2018 at Conrad Centennial Singapore. Prof Tan Thiam Soon, President, SIT, said it was an opportune\ntime to organise a conference dedicated to applied learning. He added, “Higher education has to evolve in response to the fast-changing industry cycle. The inaugural Applied\nLearning Conference is an excellent opportunity to share\nbest practices and ideas, and brings into focus SIT’s efforts in\ndefining its place as a university of applied learning.”\nWith the theme of “Applied Learning: Perspectives,\nPedagogy and Practice”, the conference explored topics\nsuch as the use of work-based learning, inquiry-based\nlearning and how universities can partner with industry to develop and conduct curricula that train graduates for\nfuture employment.\nDr Lim Boon Huat, Managing Director, Rohde & Schwarz\nAsia Pte Ltd, was one of the speakers at the conference. He said, “As we move into a more technology savvy world, applied learning has become increasingly important. This conference is timely to revisit our approach to education in the context of a rapidly changing and technologically disruptive landscape.”\nAlso attending the conference was Guest of Honour\nDr Janil Puthucheary, Senior Minister of State, Ministry of\nCommunications and Information & Ministry of Education.\nPanellists for \"Training for Today: Preparing Work-Ready Graduates\", (from left) Dr\nDiana Oblinger, President Emeritus, EDUCAUSE, Prof Tan Thiam Soon, President,\nSIT, and Prof Dr Georg Nagler, President, Duale Hochschule Baden-Württemberg\nMannheim, moderated by Assoc Prof May Lim, SIT.Catalysing Collaboration Between Academia\nand Industry for the Future Economy\nInaugural Applied Learning Conference brings together more than 300 attendees from\neducational institutions and industry\nMoU between SIT and NTUC Health Nursing Home will help develop allied health professionals for the industryReal-World Learning for Health and Social\nSciences Undergraduates\nSiTIZEN  |  05/12\nB.U.S.S. (Bus User Sound System)\nby Chen Yi Fang, Cheng Yi Zhen, Chia Yi Fang, Choong Pei Fang, Ignatia Chew\nBachelor of Engineering with Honours in Sustainable Infrastructure Engineering (Building Services)\nB.U.S.S. helps visually impaired individuals identify the correct bus service and locate the entrance doors on buses. Said\nMs Ignatia Chew, “We encountered a visually impaired person who was shouting at the bus stop to ask if his bus was here. There were helpful people around who spoke to him and they helped him get up the bus, but we wondered what would happen if the bus stop was empty.”\nVisually Impaired Passenger System (VIPS)\nby Muhammad Radhi, Nicholson Yeo Jia Hao, Sandra Poeschmann, Siok Xue Yuan, Siti Mardhiyyah\nBachelor of Engineering with Honours in Sustainable Infrastructure Engineering (Building Services)\nVIPS is a low-cost solution to help visually impaired passengers be independent when travelling by bus. It also helps\nbus drivers identify visually impaired passengers who are waiting at bus stops – especially when there are no other passengers around who can help to flag down the bus. Travel Made\nInclusive In the second part of this series, we look at ideas from\nSITizens of the Sustainable Infrastructure Engineering (Building Services) programme to make it easier for the visually impaired to use public transportation\nB.U.S.S. consists of a speaker of 112-120 decibels installed beside a bus’ entrance door to announce the service\nnumber. The pre-programmed audio includes an announcement tone to capture passengers’ attention before announcing the bus service number in intervals of two seconds.\nBus Driver’s\nPoint of ViewMaking use of pre-existing infrastructure, a snap-on seat connected to a pop-out sign will be installed at the bus stop. If there is a person sitting on it, the sign will pop out to alert bus drivers to stop for the visually impaired passenger. When implemented, the snap-on will be on the first seat at every bus stop and this will be communicated to the visually impaired passengers.\nMr Siok Xue Yuan said that the team worked with SG Enable and went to\nDialogue in the Dark to learn what it was like for a visually impaired person. He said, “Ms Cassandra Chiu, who is visually impaired, gave us many insights to the challenges she faces on a daily basis and even offered us some potential solutions.”IMAGINE!\nSiTIZEN  |  06/12\nAs a dedicated philanthropic leader for community\ndevelopment and education in Singapore, The Tan Chin Tuan Foundation has contributed significantly to the nation’s educational landscape. Recently, it once again made a commitment to nurture excellence among Singapore’s youth by establishing the Tan Sri (Dr) Tan Chin Tuan Scholarship at the Singapore Institute of Technology (SIT).\nFrom Academic Year (AY) 2017/18 onwards, five scholarships\n(valued at $8,000 each) will be awarded annually to academically promising and well-rounded students from SIT-conferred degree or joint degree programmes. The Tan Chin Tuan Foundation Makes\nPossible New Scholarship at SIT\nThe Tan Sri (Dr) Tan Chin Tuan Scholarship at SIT encourages\nacademic excellence and nurtures undergraduates who have made significant contributions to SIT or the communityBachelor of Hospitality Business with Honours students Mr Jonathan Lim and Ms Eunice Goh are among\nthe first Tan Sri (Dr) Tan Chin Tuan Scholars at SIT.\nMs Yap Su-Yin, Chief Executive Officer, The Tan Chin Tuan Foundation (second from left), together with SIT staff during a recent visit to SIT.\nAt the Tzu Chi Seeds of Hope Meritorious Awards cum\nUniversity Bursary Presentation Ceremony on 2 December 2017 at Jing Si Hall, seven SIT students not only received their bursaries – they were also inspired by the volunteers whom they met that day.\nAmong them is Ms Jasmine Wee, a third-year\nundergraduate from the Sustainable Infrastructure Engineering (Building Services) programme who received Tzu Chi’s Helping Hand\nSparks a Positive Difference\nSince 2016, 14 of the Buddhist Compassion\nRelief Tzu Chi Foundation Bursaries have been awarded to students at SIT\nSome of the recipients of the Buddhist Compassion Relief Tzu Chi Foundation\nBursary with Mr Tan Chai Hoon and Ms Lo-Hsu Hsueh Yu, both Deputy Chief Executive\nOfficers with the Buddhist Compassion Relief Tzu Chi Foundation (Singapore).the bursary for the second consecutive year. She said,\n“Being awarded this bursary means that I can pursue further studies in SIT, without having to worry about the price tag of an education. I considered myself lucky to receive this support and meeting so many inspiring volunteers who showed me wisdom and actively care for others without asking for returns. I came to understand that no contribution is too small to make a positive difference.”\nA first-year undergraduate from the Criminology and\nSecurity programme, Mr Goh Ying Jie said that the bursary would help cover his expenses for school and lessen the financial burden on his mother. He added, “During the ceremony, I felt welcomed by the volunteers from Tzu Chi and there were a lot of engaging activities done among the volunteers and the attendees.”\nThe Buddhist Compassion Relief Tzu Chi Foundation\nBursary at SIT was made possible by the Buddhist Compassion Relief Tzu Chi Foundation (Singapore). Part of Tzu Chi Singapore, the Foundation raises funds from the public to promote organised charity activities, medical services and humanistic education and culture in accordance to the needs of Singapore society. Since 2016, 14 Bursaries have been awarded to SIT undergraduates.\nThe first batch of Tan Sri (Dr) Tan Chin Tuan\nScholars at SIT was selected in February. Scholarship recipient and Hospitality Business student Ms Eunice Goh said she felt deeply grateful towards the Foundation, and also that the scholarship would help her to excel academically and lessen the financial burden on her family. “One day, I hope to work in a role where I can help children and senior citizens with their dietary needs. Receiving the scholarship has boosted my confidence that I can pursue my two passions of event management and nutrition and use them to impact society positively in future,” shared Eunice.\nThe Tan Chin Tuan Foundation was\nestablished by the late banker and philanthropist Tan Sri (Dr) Tan Chin Tuan to share with society the rewards of a highly illustrious career. Tan Sri (Dr) Tan, a respected community leader of his time, rendered assistance to the deserving and provided services that helped uplift the less fortunate.\nSiTIZEN  |  07/12\nNursing undergraduates at SIT can now look forward to vying\nfor the Rotary Club of Jurong Town Book Prize in Intermediate & Long Term Care. Thanks to the Rotary Club of Jurong Town, Singapore’s latest endowed gift, SIT will be able to award one book prize to the top student of the Intermediate & Long Term Care module each year, and in perpetuity. The module aims to prepare nursing students for the challenges that may arise from caring for individuals with multiple health care problems that may be managed and controlled but not cured, resulting in complex care needs over a protracted period.\nThis is not the first time that the Club has supported\nundergraduates pursuing a nursing degree at SIT. They have previously made possible the Rotary Club of Jurong Town Book Prize in Care Pathways for Long-Term Conditions in 2014, and in 2015, the Club made possible the endowed Rotary Club of Jurong Town Bursary. Four bursaries have been awarded so far to nurture financially disadvantaged nursing students.\nMr Muhammad Izzulwan, who graduated with a Bachelor\nof Science with Honours in Nursing Practice (University of Manchester) degree in 2014, was the first to receive the Rotary Club of Jurong Town Book Prize in Care Pathways for Long-A Shot in the Arm to Boost\nNursing Excellence\nA new endowed gift from the Rotary Club\nof Jurong Town, Singapore will allow SIT to recognise and encourage academic excellence among nursing students\n(From left) Ms Chew Jia Tian, Ms Evelyn Chua and Mr Muhammad Izzulwan\npresent a cake to Mr Stanley Teo, President of the Rotary Club of Jurong\nTown, Singapore, to express their appreciation.\nterm Conditions in the same year. He was happy that\nthe book prize will now be awarded each year and in perpetuity , recognising the efforts of students to achieve academic excellence.\nHe said, “Receiving the book prize certainly motivated\nme to aspire towards developing my career as a nurse working in Changi General Hospital's Acute Stroke Unit. The award also serves as a reminder for me to contribute what I have back to society and help those who are less fortunate.”\nThe Club was chartered in 1971 and is the fourth\nRotary Club in Singapore. Its primary focus is to provide service to community and encourage goodwill and peace. Nurturing Future Degreed Professionals for the Hospitality Industry\nThe S.S. Jhunjhnuwala-Naumi Hotel Bursary will support women undergraduates from\nthe Hospitality Business programme in perpetuity\nThe 73-room Naumi Hotel is part of Naumi Hospitality\nand is located on Seah Street.\nThe newly established S.S. Jhunjhnuwala\n– Naumi Hotel Bursary at the Singapore Institute of Technology (SIT) has a very specific purpose – it aims to nurture financially disadvantaged women undergraduates pursuing a Hospitality Business degree at SIT.Made possible through philanthropic support from Mr Surya Jhunjhnuwala and Mr Gaurang Jhunjhnuwala, one bursary (valued at $5,000 each) will be awarded each year and in perpetuity to a deserving student from this Academic Year 2017/18 onwards.\nWhen asked why they wanted to support this particular group of students, Mr\nGaurang Jhunjhnuwala, said, “My family has been in the hospitality industry in Singapore for more than 20 years, and we are proud to be able to encourage SIT undergraduates who will be the future of this industry with the S.S. Jhunjhnuwala-Naumi Hotel Bursary.”\n“The bursary is also partly named after my late grandfather, Shyam Sundar, who\nwas passionate about how children must have a proper education, especially girls. My family and I are happy to be able to further that cause and that’s why we are choosing to support women undergraduates at SIT,” he added.\nNaumi Hospitality, managed\nand owned by the Hind Group of Companies, serves to bridge the gap between\nresidence and hotel and\nensure that guests receive the best of home life in a boutique environment away from home. Some of its properties include Naumi Hotel in Singapore and in Auckland.\nThe bursary is also partly named after\nmy late grandfather, Shyam Sundar, who was passionate about how children must have a proper education, especially girls. My family and I are happy to be able to further that cause and that's why we are choosing to support women undergraduates at SIT.\n– Mr Gaurang Jhunjhnuwala\nSiTIZEN  |  08/12\nTwenty-one recipients of The Ngee Ann Kongsi Scholarship, along with their\nfriends and family, were among the 468 people who helped set a record for the most number of people making tang yuan (glutinous rice balls) in the Singapore Book of Records on Saturday, 16 December 2017. This attempt took place during the Winter Solstice Festival, organised by the Teochew Federation and the Ngee Ann Cultural Centre, a subsidiary of The Ngee Ann Kongsi. The Ngee Ann Kongsi\nScholars Help Set Record\n“Usually, I make tang yuan at home\nwith my family, but this time around, everyone at the venue participated together including the Minister for Education!” said Ms Chiam Jia Ying, a first-year undergraduate from the Hospitality Business programme. She also brought a friend to the event so that they both could learn more about the tradition and hopes to participate in more community events like this in the future.\nMs Gwee Gin Jen, from SIT's\nOccupational Therapy programme, also brought three of her friends to the event. She said, “Taking part in an event like this helped me to learn more about the diverse cultures in Singapore, and the differences among each dialect group.”\nThe guests were also treated to an\nevening of cultural delights which included a classic Teochew opera performance. Mr Ng Chee Meng, Minister for Education (Schools) & Second Minister for Transport, was the Guest-of-Honour at the event.\nEpic attempt took place\nduring celebrations for the winter solstice\nSome of The Ngee Ann Kongsi Scholars, together with their friends and family, all suited up and ready to make\ntang yuan.\nMore than 50 participants from 24 organisations\nattended a day-long workshop at SIT@Dover entitled, “A Collective Dialogue about the Transformation of Spaces – Eldercare in The New Age” on 17 November 2017. Facilitated by Asst Prof Agnes Xue, Deputy Programme Director, SIT, the workshop focused on the participatory design approach to transform eldercare spaces through workgroup activities and a panel session.\nOrganised by SIT LEARN Professional Development\nand SIT’s Design and Specialised Businesses Cluster,\nthe workshop featured speakers and panellists from organisations such as Changi General Hospital, Society of Interior Designers, National Council of Social Service as well as the Hong Kong Sheng Kung Hui Welfare Council.\nMs Amanda Tjoa, an Occupational Therapist from THK\nTherapy Services, said, “The course provided an insight Eldercare in the\nNew Age\nA multi-disciplinary approach to transform\ndesign spaces in healthcare\nParticipants of the workshop came from a wide range of organisations.\nto transforming spaces for eldercare, which should\nideally involve the elderly, healthcare professionals and architects and designers.”\nSITLEARN Professional Development is SIT’s unit\nfor continuing education and is committed to help working professionals in Singapore develop to their fullest potential.\nSiTIZEN  |  09/12\nIt’s a Brand New Beginning!\nFrom ITE to polytechnic to SIT, and now onto rewarding careers as degreed professionals –\nthree SITizens talk about their special journey in education and career(From left) Mr Muhammad Imran Bin Ismail, Ms Felicia Yeoh and Mr Muhammad Hafiz Bin Mohamed Nasir share the same grit and determination that have seen them\nthrough their journeys in applied learning from ITE to becoming degree-holding professionals.\nServing The Nation\nMr Muhammad Imran Bin Ismail, a\n2017 graduate from the Mechanical Design Engineering programme, has joined the Republic of Singapore Navy. Currently undergoing vocational training to be a Naval Warfare System Engineer, Imran will be responsible for coordinating maintenance and engineering work on the Navy’s vessels upon completion of his training.\nHe tells SITizen: “When I put on my\nNo.4 navy uniform and go to work, I feel proud. I love the job because it involves my two passions – marine engineering and serving the country.”\n\"During my National Service (NS) days,\nI managed to excel, even graduating with a Golden Bayonet during my Specialist Cadet Course. Those two years in NS strengthened my passion for serving the country. At SIT, I did a final-year project which grew my interest in marine engineering – it was a software programme done in collaboration with Sembcorp Marine, a global marine and offshore engineering company .”\nImran’s journey from the Institute\nof Technical Education (ITE) to university graduation lasted eight years. Looking back, he treasures the support he received at SIT: “I was fortunate to find help from others, as I received two scholarships: The KKH Scholarship from Mr Kuok Khoon Hong and the Safety Systems Engineering Scholarship. I am truly grateful to the donors who helped me get this far with their support.”\nA Career In Numbers\nAt a career fair in 2016, Ms Felicia\nYeoh was introduced to Ardent, an established accountancy firm in Singapore. The firm caught the eye of this SIT Accountancy graduate and she submitted her resume. “I was pleasantly surprised,” recounts Felicia, “The company called me for an interview pretty quickly. During the session, I told them that I used to be from ITE, and they mentioned that they were supportive towards people who come from that pathway. Ardent believes that what is most important is a good attitude and relevant skills.”\nToday, she is an Audit Associate\nat Ardent, in charge of performing financial audits on companies from a wide range of industries.\nSIT’s Integrated Work Study\nProgramme (IWSP) was, in Felicia’s\nopinion, beneficial in helping her adjust well to working life: “My eight-month work attachment through IWSP was what brought me my first\nreal taste of the working world, and\nit helped me discover my interest in auditing as well.”\nLifting People Up\nIf asked about his job, Mr Muhammad\nHafiz Bin Mohamed Nasir could reply, “I lift people up every day.”\nThe Class of 2017 Mechanical Design\nEngineering alumnus is in the Field Engineer Development Programme (FEDP) at Schindler Lifts (Singapore), a leader in Singapore’s elevator and escalator industry. The FEDP offers participants a full-time salary while grooming them for two years to become certified engineers who can construct and install lifts. The long training is necessary for participants to fully understand the all-important safety and technical aspects of the field. “The role is giving me valuable hands-on experience and helping me to get a better picture of the construction industry each day,” says Hafiz.\nHafiz fondly remembers life at SIT: “In\nuniversity, I liked how my classmates were not too competitive; they were friendly and we would help each other in studies. Even after we’ve graduated, we still visit each other’s houses on festive occasions and take road trips together.”\nSiTIZEN  |  10/12\nFor the Year 3 and 4 students from the\nCommunication Design programme at The Glasgow School of Art (GSA), Singapore, the unexpected opportunity to organise a pop-up exhibition in a condemned building presented new possibilities for staging the Year 3 ‘Book Show’ and the Year 4 ‘Work in Progress (WIP) Show.’\n“We are kind of lucky this year as we\nwere granted access to a four-storey building to curate exciting works and displays of experimentations of all kinds,” explained Mr Eddie Wah, a Year 3 student. “It was a creative expression Mr Brent Lim, 29, and Ms Goh Yi Ping,\n26, met as students in the Culinary Arts Management programme, offered by The Culinary Institute of America (CIA) at SIT. Together, they run Marble Bistro, a 28-seater café-bistro located in Everton Park. Opened in December 2016, their main offering is a $39 tasting menu, consisting of a seven-course meal which includes their signature Mushroom Macchiato.\nThe pair feel motivated to challenge the\ntrend of promoting “insta-worthy”, yet expensive food. “We are so sick and tired of a typical café outside charging twenty-something dollars for an Eggs Benedict and gimmicky food with unicorns and rainbows,” Brent stated. “The perception is that you will have to pay a lot of money for good food, but we want to do things differently because we believe that you can make something very tasty and unique out of something as simple as a potato.” Their philosophy is evident in dishes like their take on the Fish & Chip – a potato fritter,\nThe Silver Cloud – Art from Chaos\nCommunication Design students of The Glasgow School of\nArt showcase experimental art in pop-up exhibition\nBefore and after: Working together to transform the Rolls Royce before the show and the completed product\nwith the text “This is not a Rolls Royce” on one side and the name of the show on the other.\nSome of the murals that were hand drawn by the students on the walls. of art and design in our WIP show and\nhence, a celebration of ideas from chaos. It felt very surreal to me to be a part of this exhibition as this was an opportunity that is hard to come by.”\nThe show ran for two days, from 15\nto 16 December 2017. The students topped with a slice of unagi, tobiko,\nwasabi-furikake, and chives.\nAs a couple, both agree that there are\npros and cons when working together. Brent jokes that he has to see her everyday, but Yi Ping views this as a positive. “When you’re a chef, you don’t really have time to meet because your off days are usually different, especially if your partner is also a chef,” she says.\nChef Eve Felder, Managing Director, CIA\nSingapore, said that Brent and Yi Ping are among some of the CIA graduates\nwere also challenged by entrepreneur\nand building owner Mr Gary Hong to extend their concept for the show onto his partially restored 1958 Rolls Royce Silver Cloud.\n“We were surprised by GSA’s willingness\nto move quickly with the development of their concept, its unexpected approach and their confidence to pull it off in less than a month,” said Mr Hong.“And yes, it turned out to be pretty amazing.” Those who attended the exhibition were presented with a display of experimental art of all kinds, including projection mapping, interactive installations and elaborate murals drawn on the stairwell walls of the four-storey building.\nMs Nur Zafirah, a Year 3 student,\nfelt it was a pity that the show only\nlasted two days. “The Silver Cloud Exhibition was a fresh experience\nfor me because it was a month-\nlong preparation,” she said. “The\nfact that we were able to draw from the first three batches of students\nwho are starting their own businesses.\nEven though things were shaky in the beginning, Brent and Yi Ping feel fortunate as they had their CIA classmates to rely on for help. Since then, the pair have received a lot of positive feedback, including from local food bloggers. Despite how difficult it is to succeed in the food industry, knowing that they are able to make good food is what keeps them going. Yi Ping offered some advice for her juniors, “I think CIA is a very good community, so don’t be afraid to ask your seniors questions and learn from their mistakes.”\nover the walls and paint\non a Rolls Royce was something totally new, not just for me but also for the exhibitions the school has held so far.”Two Is Better\nThan OneWith the Chinese Valentine’s Day of Yuan Xiao just around\nthe corner, we talk to SIT-CIA alumni Brent Lim and Goh Yi Ping who are fulfilling their dreams as life and business partners behind Marble Bistro\nMs Goh Yi Ping (left) and Mr Brent Lim in front of Marble Bistro, which they are running together. For the pair,\nworking together in the kitchen was a partnership that came about naturally.\nAlumni, students and faculty bonded as they competed and indulged in\ntheir favourite sports at SIT's second Inter-Cluster Games at SIT@Dover on 27 January 2018. Among the 24 alumni who showed up to participate in friendly matches was Mr Karthigesan S/O Murukan, who graduated in 2016 from the Aeronautical Engineering programme (University of Glasgow). As co-founder of SIT’s futsal team, he was happy to help bring his fellow alumni together to form teams.\n“It’s been quite a while since the alumni have seen each other,” he said.\n“This event was a great way to catch up. On top of that we had a good time and found a way to stay ‘fit’.”\nMore than 300 students and faculty also joined in to compete across five\nsports – Basketball, Floorball, Futsal, Road Relay and Ultimate Frisbee. For the second time running, the Health and Social Sciences (HSS) cluster emerged victorious, claiming the Provost Cup and retaining their title from the previous year.\n“It was a good bonding experience especially since our campuses are all\nover Singapore,” said Mr Tai Yi Long, currently studying in the Aerospace Alumni take part in SIT's Inter-Cluster Games for the first\ntimeAlumni from the Engineering, Chemical Engineering & Food Technology and Health & Social Sciences\nclusters gather together for some futsal fun on a Saturday morning.\nThe competition heats up between Team ENG and Team HSS as CEFT cheers them on.\nA Better Florist• 20% off total bill at http://www.abetterflorist.com\n• Key in the code ‘ABFSIT20’ at checkout\n• Valid until 16 August 2018\nAngelFlorist\n• 10% off total bill with minimum purchase of $80\nat www.angelflorist.com\n• Key in the code ‘AngelSIT18’ at checkout\n• Valid until 31 August 2018\nBattlestrike• 10% discount\n• Additional 5% discount if the session is conducted\nwithin SIT permitted premises\n• Valid until 30 September 2018\nCrunchie Cookies• $2 off every $30 spent for cookies\n• Valid until 1 October 2018\nEthan Men• 20% off total bill for regular priced-items\n• Participating outlets: 333 Kreta Ayer Road #02-32\nS (080333)\n• Valid until 31 December 2019\nFloral Garage Singapore• 10% off total bill at www.floralgaragesg.com\n• Key in the code ‘SIT010’\nFoodline• $30 cash rewards w/min spending of $300 (All catering orders) with promo code “SITFL30”\n• $10 cash rewards on w/min spending of $500 (All cakes) with promo code “SITFLC10”SIT Alumni Card BenefitsPlaying for Friendship\n• Participating Outlets: 18 Howard Road #10-03 Novelty Bizcentre S(369585)\n• Order at www.foodline.sg\nGifts Less Ordinary• 5% off total bill at checkout with code ‘SITU’\n• Valid until 31 October 2018\nIntune Music• 10% off course fees for first 3 months\n• Waiver of administrative fees\n• Valid until 1 April 2018\nKitchen Capers\n• 10% off bakeware tools/packaging needs/books/\nDVDs\n• 5% off food/ingredients\nShopBack• $10 Benefit\n• Up to 18.0% Cashback when shopping with selected partners\n• Visit https://www.shopback.sg/ for more details\nSkin Basics by FIRMA• Student prices for nails, facials, and body contour and slimming\n• Bookings are subject to slot availability.  Call 9127 6466 for an appointment\nSingapore Hospitality Group Pte. Ltd.\n• 15% Off ‘All You Can Eat’ Buffet Special\n• Buffet Lunch: S$25++ per person\n(Mon-Sun: 12pm – 2.30pm)\n• Buffet Dinner: S$35++ per person\n(Mon-Sun: 6.30pm – 10.30pm) • Participating outlets: The Landmark @ Village Hotel\nBugis, Royal Palm @ Orchid Country Club\n• Valid until 31 May 2018\n• Table reservation via phone call to the restaurant\nis required\nTHE BRACES PRACTICE PTE LTD• Discounted rates for braces\n• Particpating Outlet: Holland Village\nTHEFACESHOP• 15% off total purchase for regular-priced items\n• Participating outlets: THEFACESHOP at Clementi Mall\n• Valid until 1 May 2018\nTHHG• 20% off across 3 THHG properties on all room types\n• Key in the discount code “SITreats20”\n• Valid until 20 March 2018\nTotally Hot Stuff• 10% off total bill\n• Valid until 30 April 2018\n• Participating outlets: Cathay, Orchard Central, Orchard Gatewat, Bugist+, One@KentRidge, Raffles\nCity & West Coast Plaza\nZen Rooms\n• 15% discount on hotel rooms\n• Valid until 1 March 2018\n*Please present your SIT Alumni Card prior to making\npayment. Terms and conditions apply. Please refer to\nhttp://sl.singaporetech.edu.sg/Welfare/SITreats.aspx\nfor detailed terms and conditions.SiTIZEN  |  11/12\nSystems programme (University of\nGlasgow). “I managed to make some new friends from my team and even meet some alumni and ask them questions about the workforce.”\nThe event also brought back alumni who\nwere not from the futsal team previously. Ms Kezia Yap, who graduated from University of Manchester’s Bachelor of Science with Honours in Nursing Practice programme in July last year said that she was approached by her friend to join in. “I thought, why not? It’s something we don’t get to do anymore since graduation,” she said. “Although I was the only new blood without soccer or futsal experience, the other players took care of me and guided me through.”\nThe alumni also seized the chance to\ncatch up with their juniors. “They came up to interact with us as well, updating us on how they are doing and how they are currently coping in school,” said Mr Karthigesan. “They even asked for suggestions and guidance for current school work.”"
}