{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-10.pdf",
  "type": "pdf",
  "content": "SIT Launches 7 New\nApplied Degree Programmes for\nAY 2016/17\nGot What it Takes\nto be a SITizen?‘Remembering Punggol,\nCelebrating Punggol’\nThe Winning Ways\nof SIT Students SIT Develops Heel\nRaise Device with\nKwong Wai Shiu Hospital Dou Yee Enterprises’\n‘Beneficial Path’\nGalloping to a Brighter\nFuture with the\nLim Siah Mong Scholarship\nCoffee is in Her Blood\nWhen Alumni Pursue\ntheir Passions …Once a SiTizen, Always a SiTizen ISSUE NO. 10  |  FEBRUARY 2016\nDear SIT Alumni,\nForging New Paths in the Community\nIt is the start of the year, when SITizens and would be SITizens are looking ahead to the\nnew calendar year as well as the new academic year – even as the annual SIT Open House unveils a slew of new undergraduate degree programmes that the Singapore Institute of Technology (SIT) will be offering in upcoming Academic Year of 2016/17.\nThese new offerings range from one in Telematics (Intelligent Transportation Systems\nEngineering), another in Food Technology, to four other programmes in Allied Health and one in Nursing. What is also new is that this marks the first time that SIT (or for that matter any Autonomous University in Singapore) is offering four-year Allied Health degree programmes. What is consistent is that SIT is continuing to tailor its degree programmes to meet the needs of both industry and community.\nIn fact, SITizens are already making a difference in the community, even before AY2016/17\nbegins in September. For example, a team from SIT (made up of faculty, students and an\nalumnus) is collaborating with Kwong Wai Shiu Hospital to develop a Heel Raise Device to help\nphysiotherapists determine more accurately if patients have done their exercises correctly.\n“Remembering Punggol, Celebrating Punggol”, a community project that SITizens embarked\non as part of Singapore’s Jubilee celebrations, has come to a completion and the materials it has collected will be sent to the National Archives and published in a coffee table book. WHAT’S\nHAPPENING\naround our little\nbig campus\nSITizen is a publication by the\nSIT Advancement & Alumni Division.\nFor enquiries, please e-mail us at\nAlumni@SingaporeTech.edu.sg© Singapore Institute of Technology 2016\nIn this issue, we also catch up with alumni who exemplify the SIT-\nDNA of being grounded in the community. Mr Owen Tan has been volunteering for various causes since he was 14, whereas Ms Sharlene Sou, who runs her own mobile coffee cart, made the generous decision to do her part for the SIT community by supplying complimentary coffee at the first roadshow to soft launch the SIT Faculty & Staff Giving initiative, which is in support of the SIT Bursary.\nIn so doing, she joins a community of friends who actively\nsupport SIT students in various ways, including donors\nwho nurture SITizens through endowed scholarships and bursaries such as the Lim Siah Mong Scholarship and Dou Yee Enterprises Bursary. “Without SIT, there would have been no place for students with a hospitality diploma like myself to study at a local university,” said Ms Sou. “It was very, very cool to be back.”\nWe hope you will enjoy reading all this and more in this issue\nof SITizen. Should you wish to contribute a story, do drop us a line at Alumni@SingaporeTech.edu.sgAlumnus Sharlene Sou (right)\nsupports the SIT Bursary by providing complimentary coffee.\nThe Origami Workshop was a chance\nfor alumni to get together to learn to make gifts for their loved ones.\nSiTIZEN  |  02/12\nWith the coming of the new year, the Singapore Institute\nof Technology (SIT) has added seven more applied degree programmes to its list of offerings.\nThese seven programmes are: Bachelor of Engineering\n(Honours) in Telematics (Intelligent Transportation Systems Engineering), Bachelor of Food Technology (Honours), a joint-degree with Massey University, Bachelor of Science (Honours) in Diagnostic Radiography, Bachelor of Science (Honours) in Occupational Therapy, Bachelor of Science (Honours) in Radiation Therapy, Honours Degree in Bachelor of Science in Physiotherapy, a joint-degree with Trinity College Dublin (TCD) and Bachelor of Science (Honours) in Nursing, a joint-degree with University of Glasgow (UofG).\nThe Telematics programme is the first of its kind to be\noffered in Singapore. It is also the first time that four-year degree programmes in Allied Health fields have SIT Launches 7 New Applied\nDegree Programmes\nNew offerings available for AY 2016/17 include Telematics, Food Technology and Allied Health\ndegree programmes\nNew Degree Programmes Offered at SIT\nNew Degree\nprogrammeCurriculumLength of\nprogrammeIWSP opportunities\nBEng (Hons) Telematics\n(Intelligent Transportation\nSystems Engineering)Supports Singapore’s goal to become the world’s first Smart Nation by producing graduates with deep specialist skills in\nvehicle communication and information processing.4 years Eight-month work study stint with established\norganisations such as LTA, ST Electronics, NCS,\nand MNCs like Continental Automotive Singapore.\nBSc (Hons)\nOccupational TherapyWill equip graduates with the knowledge, skills and attitude to support the contemporary development and delivery of\noccupational therapy, meeting the evolving needs of Singapore’s\npopulation.4 years More than 1,000 hours of clinical practice education across different settings and areas of practices in\ncommunity and acute hospitals.\nBSc (Hons)\nRadiation TherapyFocuses on applied learning and provides a high-quality, practice oriented education in the following areas: health and behavioural\nsciences, oncological and radiological science and technology\nand radiation therapy practice.4 years 36 weeks of clinical practice education, gaining experience in radiation therapy for various body\nregions and systems.\nBSc (Hons) Diagnostic RadiographyIncludes both general radiography and advanced modalities, including CT and ultrasound.4 years 40 weeks of clinical practice education across a wide variety of practice areas including general radiography,\nward, trauma and operating theatre radiography,\nfluoroscopy, angiography and CT.\nBSc (Hons)\nPhysiotherapyJoint-degree programme with TCD. Graduates will be theoretically-grounded and clinically-oriented to practise independently in different specialities of physiotherapy.4 years 30 weeks of clinical placement in various specialties of physiotherapy in different healthcare settings.\nBSc (Hons) Nursing Joint-degree programme with UofG, including a four-week Overseas Immersion Programme in Glasgow. Builds on the\nfoundation established through their diploma studies, and\ngraduates will be able to translate new nursing knowledge into\npractice by making evidence-based clinical decisions.2 years Six-week clinical practice education where they will\nintegrate their knowledge and practice in the delivery\nof patient care in the hospitals and community.\nBFoodTech (Hons) Joint-degree programme with Massey University. Focused\non Food Product Technology, combining food science, food\nengineering and food business. Equips graduates in the\nfundamentals of food science and applied food technology skills.4 years 28 continuous weeks of work placement in the food industry\nAs Singapore’s university of applied learning, SIT’s\ndegree programmes are industry-focused and tailored to meet manpower demands. Adopting the approach of integrating learning, industry and community to produce ‘best-in-class specialists’ who will be catalysts for transformation and also bring an innovative mind-set to the workplace, a key component of the SIT conferred degree programmes is the Integrated Work Study Programme (IWSP). Integrating Learning, Industry and Communitybeen offered at an autonomous university in Singapore.\nSIT was offering just the one-year Allied Health degree programmes in partnership with TCD until now.\nAll the programmes have been developed in close\nconsultation with industry. As with other SIT programmes, these new programmes will also feature an Integrated Work Study Programme (IWSP) as a core component of the curriculum where students will spend an extended period of time undertaking real work in the industry.\nThe first intake will begin classes in September 2016.\nWith the exception of the Nursing programme whose classes will take place at the SIT@NP Building, classes for the rest of the programmes will be located at SIT@Dover. Admission to these new programmes is now open, and will end on 18 March 2016. Interested applicants can apply via the SIT website at singaporetech.edu.sg.\nSaid Prof Loh Han Tong, Deputy President (Academic) &\nProvost, SIT, “With our IWSP , our students are continually learning on the job, consciously applying concepts to real work situations and thinking about improvements. I’m confident that with the IWSP embedded in the curriculum, students will have a better understanding of what full-time employees do and this will prepare them to take on the rigours and challenges of work in the various industries.”\nSiTIZEN  |  03/12\nHeld over two days at the Suntec Singapore\nConvention and Exhibition Centre on 16 &\n17 January 2016, the SIT Open House 2016 is a chance for potential students to find out more about the Singapore Institute of Technology (SIT) and the 42 degree programmes it has to offer for Academic Year 2016/17. More than 5,000 people attended the Open House this year.\nInformation talks on the Admission process, and\nthe programmes offered by SIT and its Overseas University partners were held throughout the two days. SITizens put on a show for the visitors in the main exhibition area – these ranged from martial arts displays, to dance, and musical performances. Faculty members and other SIT staff were also on hand at the booths to answer the various queries from interested students and their parents.\nMr Mohamed Asyraf Nassir, a polytechnic student\nwho was at the SIT Open House, would like to pursue a university education at SIT.\nHe said, “I love programming and really want to\npursue it as a career, and I believe SIT’s Software\nEngineering programme can help me with that. But\nsince I am currently studying computer engineering in polytechnic, I am also thinking of furthering my Got What it Takes\nto be a SITizen? The SIT Open House, a yearly affair, offers\npotential students a glimpse of life at SIT,\nfrom its unique applied degree programmes\nto the vibrant student life on campus\nClose to 500 people attended Information Talks on the Allied Health\nprogrammes at the SIT Open House 2016.\nArmed with brochures and the SIT Degree Programme Handbook, these\npotential SITizens check out what the University has to offer. Martial arts displays and musical performances were put up by SIT students in the main exhibition area.\nAsst. Prof Benjamin Soon, Programme Director (left), SIT, answers questions about the new Physiotherapy programme.\nVisitors throng the main exhibition area.\nskills through the Systems Engineering (ElectroMechanical\nSystems) programme, especially because of the Overseas Immersion Programme, at DigiPen’s US campus.\nHe added, “The main reason why I would choose to come to\nSIT is that it offers more industry based learning and more of a hands-on experience which is suited to my way of studying.”\nSiTIZEN  |  04/12\n‘Remembering Punggol,\nCelebrating Punggol’\nA response piece from Ms Adelene Chan, Bachelor\nof Arts (Hons) in Communication Design, based on\nthe interview with Mdm Koh Ngiam Keow.“My parents came from China\nand settled in Punggol, I was\nborn there. Punggol smelled\nfresh until pig farming came in the 1980s. My father worked as a butcher and I used to help\nhim slaughter pigs from 6am to\n11am in the morning.”\n– Mdm Koh Ngiam Keow, ex-Punggol resident\n“…if there was a python in\nyour house and you were afraid to handle it, the children next door would just go over to catch it. So you see, we helped one another; that’s what we called a kampong spirit”\n– Mr Lim Hock Chee, BBM, Chief Executive Officer & Executive Director, Sheng Siong Group, and ex-Punggol resident“We had 2 wells in our kampong, we called them the Japanese well. The wells collected rainwater and also water from underground. They never dried up.”\n– Mr Harun B Mohd Amin, ex-Punggol resident\nIn celebration of Singapore’s 50th\nanniversary in 2015, the Singapore Institute of Technology (SIT) embarked on the SG50 Punggol Project, “Remembering Punggol, Celebrating Punggol” to document and celebrate the past, present and future state of the area. This project is a starting point for SIT to better integrate with the community of Punggol, which will also\nbe home to SIT’s new centralised campus in a few years’ time.\nThrough oral history interviews, photographic and video narratives, the\nproject aims to capture a holistic portrait of Punggol. Students from the Communication Design and Interior Design programmes from The Glasgow School of Art (GSA) have also created original pieces in response to some of the oral history interviews.\nA roving exhibition of the collection\nis planned for 2016 and a coffee table book is also scheduled to be published in 2016. The collection will eventually be displayed at the Punggol campus, and the material gathered will be sent to the National Archives.\nHere are some of the material that SITizens\nhave gathered, including excerpts from oral interviews and the response pieces created by the students:SITizens gather oral history interviews, create artwork and capture photos and videos of Punggol for\nheritage project; materials to be published in a book and sent to National Archives\nA response piece from Ms Amanda Tan, Bachelor\nof Arts (Honours) in Interior Design based on the\ninterview with Mr Harun B Mohd Amin.Photographs donated by Mr Soh Yew Soon, an ex-Punggol\nresident, depicting his life as a child in Punggol.\nIf you were ever stuck in a\ndisaster zone, an emergency generator could prove to be a lifesaver. Made from simple household materials, it can be used to generate electricity for a signalling beacon, or to charge a lamp at a campsite. Mr Marcus Lim\nand Mr Delon Goh, final year students from the University\nof Glasgow, won the Special Mention and Social Media Champion prizes for their project “Frugal Thermoelectric Generators for Emergency Situations” in the #discoverHEart competition, organised to challenge students to apply engineering to solve humanitarian challenges.Mr Lim, from the Bachelor of Engineering (Honours) in\nMechatronics degree programme, and Mr Goh, from the Bachelor of Engineering (Honours) in Mechanical Design Engineering, designed two prototypes for the competition. The first used thermoelectric material that can be salvaged from computer parts or scrap materials such as pencil lead and copper.\nUsing the second prototype (pictured left) made from\naluminium and steel rods, a fire can be lit on one side of the generator, and the other side can be cooled by a constant running water source, generating a steady electrical power supply that arises from the large temperature difference. Said Mr Goh, “Through this, we want to show that electricity can be harnessed with the knowledge of materials, and by using materials that are easily found in a household, even in a disaster struck area.”SiTIZEN  |  05/12SiTIZEN  |  05/12\nSITizens Imagine\n‘The Future of Us’Mr Justin Seah photographed by his friend,\nMs Janice Goh, as he swam his way to a medal.\nEmergency Generator Prototypes Win Prizes\nat Humanitarian Engineering CompetitionPrize-winning projects from SITizens\nare among some of the works shown at “The Future of Us”. Organised by the Singapore Government, it is an immersive and multi-sensory experience that offers a glimpse into the possibilities of how Singaporeans can live, work and play in the future.\nOne of these projects is “Singapore’s\nKampongminium – Sea-ty” (pictured above) from Ms Maizurah Binte Hashim, Mr Khairulanwar Bin Ibrahim and Ms Jasmine Lim Jia Hui, who have graduated from the Bachelor of Arts (Honours) in Interior Design degree programme (The Glasgow School of Art). The design is an approach to house communities in surrounding water to deal with housing problems, while allowing residents to be self-sufficient through vertical gardening, aquaponics and fish farming.\nAnother work that is on display is the\n“Hybridised Energy Harvester” from Mr Ngo Qi Zhi and Mr Divakar Umesh from the Bachelor of Engineering (Honours) in Mechatronics (UofG) as well as Mr Jeremy Seah from the Bachelor of Engineering (Honours) in Mechanical Design Engineering (UofG). Unlike conventional power banks that contain a lithium battery, this device makes use of solar and electromagnetic energy to charge up devices.\n“The Future of Us” exhibition is\nheld to round up Singapore’s SG50 year of celebrations, and will run till 8 March 2016 at 30 Marina Boulevard (near Bayfront MRT). The SITizen who did SIT proud at the\nrecent Institute-Varsity-Polytechnic (IVP) Swimming Championships 2016 is Mr Justin Seah Kah Liang, a final year undergraduate. He won Bronze medals in both the 1,500m Freestyle and 400m Freestyle at the Championships which was held from 16 to 17 January 2016.\nAs SIT’s only representative in the\nswimming events, Mr Seah, who is from the Bachelor of Engineering (Honours) in Aeronautical Engineering (UofG) degree programme said, “I have trained to the best of my ability, knowing that I made the best of whatever time I had left after spending time on my studies and final year project. Of course, I would not have made it this far without a few good friends and the best parents that I could ever have to help me stay motivated while I’ve been swimming my own laps.”Student Wins\n2 Bronzes at Institute-Varsity-Polytechnic Swimming\nChampionships\n2016\nPhysiotherapists often recommend heel raise exercises as a part of balance\ntraining, especially for elderly patients. Usually, the extent of a heel raise is determined through visual inspection, which often leads to an inaccurate reading and subjective interpretation of the exercise. Now, a team from the Singapore Institute of Technology (SIT) is working with Kwong Wai Shiu Hospital (KWSH) to develop a heel raise device that will be able to provide more objective measurements and record data from the exercises. Physiotherapists using this device will be able to determine whether the heel raise has been done correctly and so be better able to help their patients.\nThis project marks the first collaboration between SIT and KWSH, and involves\nan alumnus, SIT faculty from both the Engineering and Infocomm Technology Clusters, as well as students.\nMr Tan Wei Siang, the participating SIT alumnus, is a graduate of the Bachelor\nof Engineering (Honours) in Mechatronics (University of Glasgow) programme\nwho first worked on this concept during his Final Year Project. He said, “As I was\nunfamiliar with the biomechanics of the human body, I had to read up. I also\nvisited the hospital a few times to understand what the problem is exactly, and\nsee who the targeted users are.”\nSaid Asst. Prof Indriyati Atmosukarto, one of the SIT faculty working on this device,\n“This project is a reflection of the SIT-DNA to become grounded in community, as the project would ultimately impact and benefit the community by improving the quality of life of the elderly and the overall community.”\nWitnessed by the Minister for Health, Mr Gan Kim Yong, SIT had signed a\nMemorandum of Understanding (MOU) with KWSH at KWSH’s 105th Anniversary Celebration and Community Care in November 2015. Under the MOU, interdisciplinary teams from SIT, comprising students and faculty from different programmes, will work alongside KWSH’s healthcare professionals on innovation projects to improve the quality of life for the elderly.\nCurrently, a prototype of the device is stationed at KWSH and some patients\nhave performed their heel raise exercises on the device. The next step in the SiTIZEN  |  06/12\nThe device will provide personalised feedback to users and help\nphysiotherapists determine whether patients have done their heel raise exercises correctlyIn Collaboration: SIT\nDevelops Heel Raise\nDevice with Kwong\nWai Shiu Hospital\nUsers are required to step on the device, while\nholding on to a weight-cross bar such as the back\nrest of a chair.\nThe prototype of the device, designed to be portable, non-invasive, and easy to use as target users are mostly the\nelderly who may not be comfortable using technology.How the\ndevice works\nPatients perform\ntheir heel raise exercises\non the device, at home or\nat a centre like KWSH.\nPatients’ exercise\ndata gets sent to a\nsecure cloud.\nResults are sent to\nmobile app, allowing\nphysiotherapists to\nmonitor patients’ progress\nremotely, or at the centre.Data is analysed\nby an algorithm.\nDevice will give patients\nsome feedback and feature\nsome element of interaction.project is to develop a\nmobile app, which will be able to communicate with the device, allowing physiotherapists to access to their patients’ exercise data remotely and to analyse this data. A strong data protection and privacy scheme is also being developed to support the device and ensure the integrity of the patient’s privacy. The project is expected to be completed at the end of 2016.\nSiTIZEN  |  07/12\nSITizens have a steadfast friend in Dou Yee Enterprises, the total\nindustrial solutions provider that has supported them through an endowed bursary since 2013 Dou Yee Enterprises’\nBeneficial Ways\n“Thank you, Mr Soo.” The recipients had a chance to personally Mr Soo Ye Wah, Executive Chairman,\nDou Yee International during his first visit to SIT.\nA special performance by Mr Lim Shi Jie (right), a final year student and bursary recipient, and\nMs Yong Jin Yu (left), a second-year student.\nMs Soo Simin (extreme right), Mr Soo Ye Wah’s daughter, was keen to find out more about the\nprogrammes SIT had to offer.\nBursary recipients Mr Tharamuttam Jerin Kuriakose\n(extreme left) and Ms Li Jinglin (second from left),\npresent Mr Soo Ye Wah (second from right) with a\ntoken of appreciation on behalf of SIT, as Prof\nTan Thiam Soon looks on.\nMr Soo Ye Wah, spoke about how he had come from humble beginnings, and encouraged the\nbursary recipients to strive for success.\nThe customary ‘lo hei’ to usher in good tidings for the Lunar New Year!On the corporate website of Dou Yee\nEnterprises (S) Pte Ltd can be found the meaning of its name. Dou (道 ) means\n“the right path”, and Yee (益 ), which\nmeans “beneficial”. It is a name that reflects the company’s principles in the way it conducts its business dealings – and clearly, in its philanthropic undertakings as well.\nOne of the most steadfast benefactors\nof students at the Singapore Institute of Technology (SIT), the Dou Yee Enterprises (S) Pte Ltd has nurtured them since 2013 by making possible a named bursary at SIT with an endowed gift. What is more, the company has renewed and increased its support for financially disadvantaged but deserving SITizens every year. The Dou Yee Enterprises Bursary has nurtured nine recipients so far, and will support even more students in the years to come.\nOn 3 February, 2016, recipients of the\nDou Yee Enterprises Bursary recipients finally had the opportunity to meet the representatives of the company, at a lunch held on the SIT@Dover campus to celebrate the upcoming Lunar New Year.\nAmong the guests from Dou Yee were\nMr Soo Ye Wah, Executive Chairman,\nDou Yee International, Mr Tan Kong Toh,\nGroup President, Dou Yee International,\nand Ms Soo Simin, Mr Soo’s daughter. Prof Tan Thiam Soon, President, SIT, SIT faculty and staff also attended\nthe lunch.\nMr Soo, who was visiting SIT for the first\ntime, shared with SITizens that he too had come from humble beginnings. He said he believed in providing a level playing field so that the younger generation can be “given a reasonable opportunity to move up through education and hard work”. He hoped that bursary recipients would strive for success as he had, and also give back to the community in future when they are able to, Mr Soo also said. Over lunch, the guests were treated to a\nsong performance by bursary recipient\nMr Lim Shi Jie, a final year student from\nthe Bachelor of Engineering (Honours)\nin Aerospace Systems (University of\nGlasgow), and Ms Yong Jin Yu, from\nthe Bachelor of Engineering (Honours)\nin Information and Communications Technology (Software Engineering) degree programme. Bursary recipients also presented Mr Soo with a token of appreciation on behalf of SIT.\nMs Lynn Chua, a first year student from\nthe Bachelor of Engineering (Honours) in Pharmaceutical Engineering who received the bursary, said the appreciation lunch was “an eye-opening experience”. “I was glad to be able to meet my donor face to face and express my heartfelt gratitude to him. I will continue to work hard for my studies so as not to disappoint him.”\nSiTIZEN  |  08/12\nAcademically talented SITizens get much-needed philanthropic support to realise their dreams, thanks\nto Mr Lim Siah Mong who has made possible an endowed Scholarship at SITGalloping to a Brighter Future\nThe three Lim Siah Mong Scholars received their scholarship certificates from Mr Lim Siah Mong: (From\nleft) Ms Koh Li Ting, Mr Lim Siah Mong, Managing Director, Lubritrade Trading Pte Ltd, Prof Tan Thiam Soon,\nPresident, SIT, Mr Kenney Boo and Ms Julaina Bte Jaffar.\nProf Tan Thiam Soon, President, SIT, thanks Mr Lim\nfor his generosity and belief in SIT. After lunch, Mr Lim Siah Mong and guests from Lubritrade Trading Pte Ltd, went on a short tour\nof the SIT@Dover Campus.Ms Koh Li Ting (middle) helps Mr Lim Siah Mong (right) unveil the painting, as Mr Kenny Boo (left)\nlooks on.\nMs Julaina Bte Jaffar (right), one of the Lim Siah Mong\nScholars, talks to Mr Jeffrey Soh, Legal Consultant,\nLubritrade Trading Pte Ltd, about her plans to\nvolunteer at an orphanage in Batam.A special memento presented to Mr Lim Siah Mong.During the lunch, Mr Kenney Boo (left) had the chance\nto thank Mr Lim Siah Mong (right) and speak to him about his plans for the future.\nA personal gift made by Mr Lim Siah Mong in May 2015 has enabled the Singapore\nInstitute of Technology (SIT) to establish one of its first endowed scholarships to nurture academically talented students who are in need of financial support. Thanks to Mr Lim’s generous gift, SIT is able to award the Lim Siah Mong Scholarship to at least three talented and deserving students, annually and in perpetuity.\nOn 9 December 2015, the very first recipients of the Lim Siah Mong Scholarship\nat SIT finally had the opportunity to meet their donor at an appreciation lunch held at the SIT@Dover campus in his honour.\nOver lunch, Mr Kenney Boo, Ms Julaina Bte Jaffar and Ms Koh Li Ting presented\nMr Lim, the Managing Director of Lubritrade Trading Pte Ltd, with a painting of three galloping horses to express their gratitude, after having learnt about his love of horses. Said Mr Boo, a final-year student from the Bachelor of Engineering (Honours) in Marine Engineering degree programme (Newcastle University), “We went to learn from an artist who loves to draw horses and worked with him to prepare a special memento for Mr Lim.”\nFor Ms Julaina, a first-year student from the Bachelor of Hospitality Business\n(Honours) programme (SIT) who had to leave before the appreciation event ended to sit for an examination, the lunch was a great opportunity for her to express her personal thanks to Mr Lim. She said, “As a recipient of the Lim Siah Mong Scholarship, I am grateful for his generosity. The guests from Lubritrade Trading Pte Ltd also shared valuable insights on having goals for the future and I am glad for this opportunity to have met them.”\nThe appreciation lunch hosted by Prof Tan Thiam Soon, President, SIT, was\nattended by guests from Lubritrade Trading Pte Ltd, as well as SIT faculty and\nstaff. In his speech, Prof Tan thanked Mr Lim for trusting SIT and its students\nto make the best and fullest use of his thoughtful gift. He said, “Mr Lim’ s\nimpactful philanthropy will be instrumental in transforming the future of\nthese students who received the Lim Siah Mong Scholarship.”Receiving the Lim Siah Mong\nScholarship has been a source of encouragement for Ms Koh, a first year student from the Bachelor of Arts (Honours) in Criminology & Security (University of Liverpool). “Knowing that someone believes in me and the path which I am passionate about, I am further motivated to excel not only to contribute back to society but also as an appreciation to Mr Lim,” she said.\nMs Sharlene Sou, SIT alumnus and founder of\nCoffeeSou, supports the SIT Bursary by sharing\nher passion for the drinkCoffee is in Her Blood\n“I started drinking coffee at a very young age, and I\nremember my mother ordering a kopi ‘c’ siew dai for me,”\nsaid Ms Sharlene Sou, 24, who graduated from the Bachelor of Science in Hotel Administration (University of Nevada, Las Vegas) in 2013.\nCoffee is not something new in her family – her late\ngrandmother owned a coffee shop and her father provides beverage solutions to offices. Now Ms Sou runs her own mobile coffee catering business, CoffeeSou (a pun on her surname, and kopi sou or coffee lady in Chinese dialect). While she only began in June 2015, Ms Sou has already worked with brands such as DirectAsia Insurance and Airbnb.\nShe got her start working at a café, Just Want Coffee, for\nabout two years. She said, “This was a good place for me to start because they were very willing to share their knowledge with me.”\nDespite her mobile coffee catering business being only a\nfew months old at that time, Ms Sou made the generous\nThe warm-hearted support that faculty and staff at the Singapore Institute of Technology (SIT) have been giving the\nSIT Bursary has made it possible for at least 17 more financially disadvantaged students to benefit from the Bursary in the upcoming Academic Year 2016/17.\nEstablished in 2014, the SIT Bursary is one of the most accessible forms of financial aid for deserving students at SIT.\nIt is being funded through collective giving from corporations, individuals, as well as SIT faculty and staff.\nThe Faculty & Staff Giving initiative was soft launched in November 2015, when two small roadshows were held at SIT@\nDover to raise awareness for the SIT Bursary. The first was held on 3 November at University Tower, where you tiao and\ncoffee (courtesy of alumnus Ms Sharlene Sou, see main story above were served. At the second roadshow at Academic Plaza on 24 November, staff, faculty and students alike were treated to tau huay and chin chow and they found out more about the SIT Bursary.decision to do her part for the SIT community by supplying\ncomplimentary coffee at the first roadshow to soft launch the\nSIT Faculty & Staff Giving initiative for the SIT Bursary (see story below).\nShe said, “I think this is a good initiative, to help the not\nso privileged SIT students. Without SIT, there would have been no place for students with a hospitality diploma like\nmyself to study Hospitality at a local university, so I have no\nhesitation in giving back.”\nThe roadshow was the first time that Ms Sou had visited\nthe SIT@Dover campus or any SIT building, and she was pleasantly surprised to see familiar faces who still\nrecognised her. When she was enrolled at SIT, the SIT@\nPoly buildings were not yet completed, and her classes\nwere held at the National Library Building.\nAs she puts it, “It was very, very cool to be back.” As a result\nof her involvement with the roadshow, Ms Sou managed to get in touch with one of her former lecturers and this led to a happy reunion with her former classmates.\nMs Sou is concerned about the sustainability issues\nsurrounding coffee. She is passionate about coffee farmers getting proper remuneration, especially when cafes sell coffees at exorbitant prices. She wants to experience picking coffee beans for herself so she is better able to appreciate the hard work of coffee farmers and learn more about the entire coffee process.\nWhile Ms Sou enjoys being out at events and the interaction\nthat comes from serving a cup of coffee, she also hopes to be able to one day, get a café to call her own.\nMs Sharlene Sou (right), and fellow barista, Ms Sam Lai, with her coffee cart at SIT@\nDover during the Faculty & Staff Giving roadshow. For over two hours, they prepared\nas many cups of coffee SIT staff and faculty could drink, complete with latte art!\nFaculty & Staff Give SIT Bursary Their Warm Support!\nForms for giving to the SIT Bursary are available\nat the reception desk at University Tower, SIT@Dover.\nTo find out more about the SIT Bursary, do email us at\nAdvancement@SingaporeTech.edu.sg or call us at 6592 2007 / 6592 1137.Valued at $3,000 each, the SIT Bursary can help financially needy students\ncover some of their academic expenses. In the current Academic Year of 2015/16, about 51% of SIT students require financial aid. The support shown for Faculty & Staff Giving will do more than help these disadvantaged students. It will also send a positive message to them, as well as the community at large, about the passion and commitment of SIT Faculty & Staff in nurturing students at SIT.SiTIZEN  |  09/12\nStaff finding out more about the SIT Bursary at the first soft\nlaunch of Faculty & Staff Giving.\nFor Mr Owen Tan, alumnus from SIT-NU, this is\nwhat motivates him to work with the elderly and continue volunteering for various causes\nAlumnus Georgina Tan pursues her passion for design, and looks for ways to express her creativity ‘It’s Good to See\nOthers Smile’\nEven before he graduated, Mr Owen Tan, from the Bachelor\nof Science (Honours) in Food & Human Nutrition (Newcastle University), had already secured a job at Health Food Matters, a company focused on making food palatable to patients who have difficulty swallowing. The start-up was looking for someone who was passionate about helping the elderly, and who had some prior experience working with them. Mr Tan, who had been volunteering for various causes since he was 14, fitted the bill and was hired as a food technologist.\nIn his work, he believes in innovating and finding ways to\nmake food appetising. He said, “Patients who suffer from dysphagia are often put on a soft food diet, which looks unappetising and puts them off food which leads to weight loss and further health problems.” Part of his duties are to conduct outreach talks with his colleagues at nursing homes and hospitals. He also develops recipes which are “easy-to do and taste delicious” from the products sold by his company which include thickeners, staples like porridge, and condiments, all of which are nutrient dense.\nOne of the things that alumnus, Ms Georgina Tan, enjoys about her\njob is that she is able to learn about things that are outside of her job function. As an in-house designer for Naiise, a concept lifestyle shop that specialises in original, well-designed products, she creates collaterals including emailers and campaign banners for the store’s special occasions. As a food technologist, one of Mr Owen\nTan’s duties is to create recipes using the\nproducts imported by his company. This\nSalmon Aburi is just one of the dishes that he has devised a recipe for.\nMs Georgina Tan, at one of the retail outlets where she works.\nOne of the pieces from Wonderwall, Ms Georgina Tan’s entry for the Crowbar Awards\n2015 which won the Gold award.Mr Owen Tan (sixth from left) at a school in Cambodia, during a volunteer trip,\nwhere they built a recycled wall using plastic bags and bottles.SiTIZEN  |  10/12\nAs an undergraduate,\nMr Tan sat on the Student Management Committee and organised community service events for students. One such project was “Let’s Fold and Makan”, an origami workshop for the elderly at a nursing home that was followed by a meal at a hawker centre nearby. When Mr Tan\nrealised that since most volunteers would be too shy to\ninitiate interaction with the nursing home residents, he included the origami component so that they would be required to have some interaction before the meal.\nHe now volunteers with Youth Corps Singapore, and\nhas just concluded a trip to Cambodia where he helped educate villagers on sustainable practices. Mr Tan also trained volunteers on how to advise the elderly to make better choices when it comes to food preparation. His future volunteering plans are to organise a small talent competition at a home for the intellectually disabled. When asked about his motivation for helping others, he simply said, “It’s good to see others smile.”\nExperimenting Through Design\nThe graduate from the Bachelor of Arts (Honours) in Communication Design (The Glasgow School of Art) programme is also being given the chance to plan and design a pop-up store at SingaPlural, a showcase of the best design elements from various sectors in Singapore organised by the Singapore Furniture Industries Council. Having only been part of the execution of previous pop-up stores, she said, “I’m excited to be put in-charge of a team of interns and designing the pop-up store from scratch.”\nMs Tan is no stranger to experimenting\nwith things that are outside of her comfort zone. She took part in the Crowbar Awards 2015, an annual platform for young creatives in Singapore to showcase their work, as a final year student. For her entry “Wonderwall”, Ms Tan explored the idea of\nsynaesthesia, or joint-sensory experience.\nShe combined both photography –a medium\nshe is very comfortable with having majored\nin it, and illustration, an area that she says she\nis not good in. She was awarded Gold after\nher graduation.\nAs she puts it, “It’s a little clichéd, but creativity\nis everywhere and you just have to be open to seeing these little hints.”\nSiTIZEN  |  11/12\nDancepointe Academy\n• One-time free dance trial\n(appointment required)\n• 10% off at Jurong East, Jurong West,\nChoa Chu Kang, Yio Chu Kang,\nTaman Jurong CC, Serangoon\nGardens branches\n• 50% off at Bukit Timah and\nSembawang branches for pairs\n• Free Dance Factory Uniform Tee when you sign up for your first full termSIT\nAlumni Card\nBenefitsPies & Coffee\n• 10% off total bill; 15% off whole cakes;\n50% off on slice cakes/tarts with\n2 gourmet pies/brunch purchased\n• Valid until 31 Mar 2016\nSeasonal Salad Bar\n• 10% off all regular priced items\n• Participating Outlet: One@KentRidge\n• Valid until 1 Apr 2017\nSharetea\n• 10% off all regular priced items\n• Valid until 31 May 2016\nShopBack\n• $10 Benefit\n• Up to 18% Cashback when\nshopping with selected partners\n• Visit https://www.shopback.sg/\nfor more detailsFolding Their Way to\na Valentine’s Heart\nMs Kelly Han, a graduating student from the Bachelor\nof Science in Electrical Engineering & Information Technology at the Technical University of Munich (TUM), may be in the last stretch of completing her degree. Yet, amidst completing her final-year project, she still found the time to facilitate the very first Origami Workshop for the SIT Alumni Leisure Network.\nHer interest in Origami was sparked in secondary school,\nand since then she has always been crafting personalised gifts for her friends. Having helped out at Sweet Creations (an SIT Alumni Leisure Network event in June 2015) and other Alumni Network events, Ms Han wanted to share her love of origami with her fellow SITizens. She said, “Since this was my first time conducting an Origami Workshop, I was very nervous but was delighted at how the event turned out. I really appreciate the alumni and graduating students who took the time to attend this event. Personally, I felt that that they all did a great job!”\nPhones out, and ready to snap a photo of their handiwork – a bouquet of paper flowers!Ms Kelly Han gives an introduction at the start of\nthe workshop.All the folds start to make sense when you start putting everything together.\nSome of the colourful creations from the Origami\nWorkshop.\nSunlife Durian Puffs & Pastries\n• 10% off total bill\n• Participating outlets: Causeway Point\nShopping Mall, 333 Coffee Shop\n(Blk 136 Bedok North Avenue 3)\n• Valid until 31 July 2016\nThe Braces Practice\n• Discounted rates for various braces options\n• Valid until 10 May 2016\nTom’s Palette\n• 10% off selected ice-cream products\n*Please present your SIT Alumni Card prior to\nmaking payment. Terms and conditions apply.\nPlease refer to\nhttp://sl.singaporetech.edu.sg/Welfare/SITreats.aspx for detailed terms and conditions.SITizens learn how to make paper gifts for their\nValentine at a fun-filled Origami Workshop\norganised by the SIT Alumni Leisure Network\nThe four-hour session was held at One Farrer Hotel & Spa on Saturday, 23 January 2016. In the spirit of the upcoming\nValentine’s Day, Ms Han and her co-facilitators, including an alumnus and graduating students, showed participants how to make gifts for their Valentines, and these included a gift box, a rose, as well as a pop-up card.\nMs Neo En Xin, an alumnus from the Bachelor of Science in Chemical Engineering (TUM) and Mr Moh Swee Liang,\na graduating student from the Bachelor of Engineering (Honours) in Mechatronics (University of Glasgow), were among those who enjoyed the workshop.\nSaid Ms Neo, “It was interesting to learn to make something for Valentine’s Day. I enjoyed learning to make the envelope\nthe most as it’s useful to make for friends and my boyfriend.”Quipped Mr Moh, “I hope to be able to make the paper rose for my future girlfriend!”"
}