{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-24.pdf",
  "type": "pdf",
  "content": "Awards at BES 13th\nScientific Meeting\nSIT’s New Through-Train\nInitiative for Polytechnic\nStudents\nDragonboat Team Makes\nSIT Proud at the Prime\nMinister’s Cup\nClass of 2019 Graduates\nfrom GSofA and TUM\nEncouraging STEM Interest\nthrough YouthMaker\nProgramme\nHands-On Learning with\nHands-Free Vehicle\nFirst Gift for SIT’s Future\nPunggol Campus\nThomson Shin Min\nFoundation’s Steadfast\nSupport for SIT Students\nSITizens Journey with\nRotary Club of Jurong Town\nFaculty and Staff Change\nLives with Giving\nAlumni Pursue Passions\nwith Support from SIT\nAlumni Get Together at\nCheerS IT’s Thursday… and\nJump for the Captain’s Ball ISSUE NO. 24  |  AUGUST 2019\nWHAT’S\nHAPPENING\naround our little\nbig campus\nDear SIT Alumni,\nOnwards and Upwards!\nSince our last issue, there has been a number of exciting updates at SIT. The university\nhas received the very first gift in support of its new campus in Punggol, thanks to Ho Bee\nLand. In recognition of this philanthropic commitment, SIT has named its auditorium in\nPunggol (and at its interim campus in SIT@Dover) the Ho Bee Auditorium, which was\nunveiled in a naming ceremony on 1 July 2019.\nSuch acts of giving are helping to write the SIT story and shape the lives of its students.\nSIT’s very own faculty and staff too are steadfastly supporting the SIT Bursary through the\nFaculty & Staff Giving (FSG) initiative. For the first time this year, FSG is also providing\nfaculty and staff donors with a second option of supporting AdventureLearn, a holistic\nlearning platform for students that is being developed.\nIn the meantime, SIT alumni are staying connected with one another and their alma mater, in\na variety of settings – from making their own lip balm and scrubs in a workshop led by fellow\nSITizen Ms Chew Jia Tian, to coming back to campus to play captain’s ball, to kicking back\nand making new friends at CheerS IT’s Thursday!\nWith a little support from SIT, alumni are also pursuing their passions. Ms Joey Lee\npresented her paper at the APacCHRIE & EuroCHRIE Joint Conference in Hong Kong.\nTogether with some SIT students, two pairs of alumni did SIT proud at the Singapore\nNational Tertiary Dance Championship and the World Inter-University Dance Challenge.\nAlso flying the SIT flag high are undergraduates who bagged five awards between them\nat the Biomedical Engineering Society 13th Scientific Meeting.\nStudents from the Sustainable Infrastructure\nEngineering (Land) programme explaining how\ntheir Light Track Inspection Vehicle works to\nPresident Halimah Yacob (extreme right) and Prof\nTan Thiam Soon, President, SIT (second from right).\n(Photo credit: Ministry of Communications and\nInformation)SITizen is a publication by the\nSIT Advancement & Alumni Division.\nFor enquiries, please e-mail us at\nAlumni@SingaporeTech.edu.sg\n© Singapore Institute of Technology 2019All of these add to what is a very special year\nfor SIT, which was honoured with a visit from\nPresident Halimah Yacob on 28 June 2019. She\nsaid in a Facebook post, “The students were\nmotivated and enthusiastic, driven by their\ndesire to create something that can improve\npeople’s lives. I am glad that the curriculum\nin SIT has enabled them to translate their\nknowledge and skills into tangible solutions to\nhelp our society and industries.”\nWe hope you will enjoy reading this issue of\nSITizen and do look out for the next issue, for\nreports on SIT’s “5+5”celebrations. Should you\nwish to contribute a story, please drop us a line at\nAlumni@SingaporeTech.edu.sg.\nOnce a SiTizen, Always a SiTizen\nSiTIZEN  |  03/16 SiTIZEN  |  02/16\nSITizens Make their Mark at Biomedical Engineering\nSociety 13th Scientific Meeting with Wins\nSIT’s New Through-Train Initiative with\nTemasek PolytechnicSIT students bag the Gold Award and Merit\nAward wins in the undergraduate category,\nalong with the Silver and Bronze Awards for the\nIES Innovation Challenge for the Community\nThe new integrated SkillsFuture Work-Study Degree pathway reflect SIT‘s commitment to\nnurture and develop industry-ready graduates\nAnnounced by Minister for Education Ong Ye Kung at\na work-learn carnival at Nanyang Polytechnic on 12 July\n2019, this new pathway is the first such programme that\ngives diploma students a guaranteed route to a degree,\nallowing them to achieve both their diploma and degree\nin a shorter time.\nThis tie-up by Temasek Polytechnic with the Singapore\nInstitute of Technology (SIT) and Singapore University\nof Social Sciences aims to provide polytechnic students\nwith an early exposure to university curriculum. Students\nwill also embark on a longer period of engagement with\ncompanies, allowing them to contribute more effectively Gold for Bee Glue\nSustainable Innovation Wins SilverA natural resinous mixture produced by honey bees, bee propolis acts\nas a sealant for the beehive, and functions as a protective barrier against\nexternal invaders, weathering threats, as well as viral and bacterial infection.\nMs Esther Ong’s curiosity about the antimicrobial capability of propolis led\nher to test out her hypothesis on a final-year project that aims to address\nthe problem caused by rapid emergence of antibiotic resistant bacteria.\nShe screened a variety of commercial propolis from different geographical\norigins for their functionalities, and lab test results showed that\nall propolis samples possess antimicrobial potency. Ms Ong also\ndiscovered that Brazil propolis has the potential to complement or even\nreplace conventional gold-standard antibiotics, paving the way for the\napplication of propolis as a natural antibacterial agent.\n“The BES competition was an eye-opening experience as I had no biomedical\nbackground. It made me realise the importance of biomedical engineering\nin our lives and it should not stop here. We should look at leveraging natural\nresources such as propolis as healthcare remedies,” she said.\nFinal-year Mechanical Design Engineering student Ms Isabel Ang impressed the judges with her purposeful and\ncost-effective solution to the challenges faced by a physiotherapy clinic serving children with cerebral palsy in a\nremote Cambodian village, due to a lack of funding and difficulty in acquiring high-tech treatment machines.\nDevoid of motorised gadgetry, Ms Isabel Ang’s tilt\ntable is made with sustainable resources and aids\nblood circulation and improves overall bone density\nin cerebral palsy patients.\nWith guidance from Asst Prof Lim Kaiyang, SIT\n(left), Ms Esther Ong won the Gold Award and\n$150 cash prize for the undergraduate category at\nthe BES 13th Scientific Meeting.\nMs Ang herself had seen how cerebral palsy patients struggle with\neveryday motor skills. “That spurred me on to find a potential solution\nthat is accessible to remote villages in developing countries,” she said.\nShe devised a tilt table design utilising sustainable resources like wood\nand bamboo poles to help blood circulation and improve overall bone\ndensity in cerebral palsy patients. She was guided by her Engineering\nprofessor and faculty from the Health and Social Sciences cluster, who\nshared with her valuable expertise on treatment and care pathways for\ncerebral palsy patients.\nDespite the absence of motorised framework gadgetry usually found in\ntilt tables, her design does not compromise on the therapy required by\ncerebral palsy patients. Instead, it features a rotational crank which rotates\nthe tilt table upright from a horizontal plane with the patient in a supine\nposition, an additional set of structure to prevent overturning when a\npatient is placed on it, and a pulley system as a counterweight to prevent\nthe machine from toppling over.\nSaid Assoc Prof Alfred Tan, Programme Director, SIT, “We are currently\nassessing if Isabel’s prototype can be further refined and potentially\nreplicated for implementation in Cambodia.”to their workplace, and gain deeper industry knowledge in\ntheir chosen specialisations.\nThe pilot roll-out of this initiative in April 2020 will open\nto existing students of Temasek Polytechnic’s Diploma\nin Mechatronics, who are keen to pursue the joint SIT-\nNewcastle University BEng (Hons) in Mechanical Design\nand Manufacturing Engineering programme.\nStudents will be selected for this scheme based on their\nacademic performance and through interviews with\nthe respective university and employer.   They must also\nmaintain an academic grade point average during their\nstudies, to continue in the programme.For their final-year Product Development project,\na team of Food Technology undergraduates, Ms\nLoh Hui Lin, Ms Seah Xin Hui, Ms Tan Kai Chin, Ms\nCassandra Toh and Ms Vivian Chua came up with the\nidea to 3D print pureed chicken rice to improve the\nmeal experience of seniors with chewing difficulties\nor dysphagia. With this, they hope to address\ncomplications that arise from dysphagia such as\nreduced food intake and lack of food variety and\nnutrients leading to loss of bone and muscle mass.\nThe project gave the students the experience of a\ncomprehensive food product design process from\nsurveying the needs of the elderly to generating\nproduct design as well as special packaging for\nthe product. The purees and condiment are stored\nin a single perforated packaging which can be\nused as a refillable piping bag for the 3D printer\ncartridges. They even conducted sensory testing\nwith the elderly in Fei Yue Retirees Centre to better\nunderstand their acceptance of this new idea.\nMs Loh said that the team is happy that their 3D\nprinted chicken rice received positive feedback,\n3D Printed Chicken Rice, Anyone?SITizens received the Merit award in the undergraduate category and the Bronze\nAward for the IES Innovation Challenge for the Community with their 3D Food\nPrinting for the Elderly project.\nespecially when elderly with dysphagia do not experience\nthe same joy that eating fundamentally brings to most\npeople. “While we are excited to have come up with\nan innovative solution, what really matters is that we\nare potentially improving the nutrition and the eating\nexperience for our seniors,” she added. On 18 May 2019, the Biomedical Engineering Society (BES) 13th Scientific Meeting was held in conjunction with IES\nInnovation Challenge for the Community at the Singapore Institute of Technology (SIT). Facilitating the sharing of\nbiomedical engineering knowledge, the BES Scientific Meeting provides a platform for tertiary students to interact\nand learn from professionals and academics in the biomedical engineering industry.\nYear 4 Food Technology undergraduate Ms Esther Ong clinched the Gold Award in the undergraduate category, while Ms Isabel Ang from the Mechanical Design Engineering programme received the Silver Award in the IES\nInnovation Challenge for the Community, as well as a Merit award in the undergraduate category.\nReceiving the Merit award in the undergraduate category as well as a Bronze in the IES Innovation Challenge for the\nCommunity is the team consisting of Ms Loh Hui Lin, Ms Seah Xin Hui, Ms Tan Kai Chin, Ms Cassandra Toh, and Ms\nVivian Chua, all from the Food Technology programme.\nSiTIZEN  |  04/16\nCongratulations to Team SIT for achieving third place in the PM Cup!\nThe proud guys and gals of SIT Dragonboat plan to come back stronger\nand faster for the next race. Besides the PM Cup 22-crew race, the women’s team also participated in\nthe Singapore Dragon Boat Festival’s 12-crew women’s race and managed\nto clinch third place.The Singapore Dragon Boat Festival (SDBF) was held on 13 and\n14 July this year, where SIT’s Dragonboat team participated\nin the Prime Minister’s (PM) Cup 2019. This is the second year\nthat SIT Dragonboat has participated in the PM Cup, and the\nMen’s and Women’s team managed to clinch 3rd and 5th place\nrespectively.\nThe PM Cup pits university teams against each other in a 1,000m\nrace to the finish line, with this year’s race being held at Bedok\nReservoir. The team prepared for the race through land trainings\nat the Dover campus and Nanyang Polytechnic stadium, along\nwith water trainings at Bedok Reservoir over the weekend. They\nalternated their trainings timeslots between morning and night.\nWomen’s team captain Ms Rebecca Lee felt that the journey\nwas made easier thanks to the dedication of the team. “We\nhad an awesome group of ladies willing to sacrifice personal\ntime, school work and family commitments to come down every\ntraining. It was an assurance to know that many of us are so\nmotivated to fight in this team,” she said. The women’s team\nalso participated in the SDBF 500m race and managed to\nclinch 3rd place, which has motivated them to work harder to\nachieve a podium finish for the PM Cup next year.\nThe men’s team hit a milestone with their third place finish.\n“The feeling was so surreal, finally being on the podium able\nFighting To The Finish Line\nDragonboat athletes make SIT proud at the Prime\nMinister’s Cup, held in conjunction with the Singapore\nDragon Boat Festival\nto hold our school flag up high, making a name\nfor ourselves,” said men’s team captain Mr Avery\nJoseph Goh. “It was a bittersweet moment knowing\nthat we did it, but it was only third. But knowing that\nevery individual in my team did their very best, that\nwas enough for me.”\nSiTIZEN  |  05/16\nReady For The Next Chapter\nFrom June to July 2019, 216 students at SIT received their degrees in Communication Design,\nInterior Design, Chemical Engineering and Electrical Engineering & Information Technology\nTwo years of hard work culminate in this moment for the graduates, as\nthey walk across the stage to be doffed by the cap and presented with\nthe hood.\nValedictorian and Best Student Mr Sean Han Siwen, from the Chemical\nEngineering programme takes the stage to share how with perseverance,\nhe and his university mates overcame the troubles faced during the course\nof their studies.\nTUM graduates gather for a photo to commemorate this moment.Waving their degree scrolls in the air, these graduates are pumped\nto celebrate!The Glasgow School of Art Graduation\nCeremony\n24 June 2019Technical University of Munich Graduation\n16 July 2019\nSixty-eight Communication Design and 37 Interior\nDesign students were presented with their degrees\nfrom The Glasgow School of Art (GSofA) in true\nGlaswegian tradition, complete with a ceremonial\nprocession of academics to the dais led by Dr\nMatthias Hillner, Director of Programmes, GSofA\nSingapore, who was also the ceremonial mace-bearer.\nHeld at SIT@Dover, the ceremony was attended by\nMr Tsoi Mun Heng, Vice President (Planning), SIT.\nMr Tan Norman received the Best Overall Academic\nAchievement for Communication Design and Mr\nMarcus Choo Jun Fei was pleasantly surprised to\nhear that he had received the same award for the\nInterior Design Programme. “I only knew about it\nduring the announcement of the award. Knowing\nthat all my hard work and effort had finally paid off felt\ngreat, I hoped to make my family and friends proud.\nMore importantly, I hope to prove that hard work and\ndetermination are the keys to success and I believe\nthat my award is a testament to that,” said Mr Choo.\nThe Leap Award went to Mr Don Anthony Torres and\nMr Kingsley Koh Hao Jun from the Communication\nDesign and Interior Design programme respectively.\nMr Yeo Yu Xin (Communication Design) and Ms Chia\nShu Hui Ferlyna (Interior Design) both received the\nOutstanding Contribution to Student Life Award.The Technical University of Munich Graduation\nCeremony 2019 took place at The Star Theatre,\nThe Star Performing Arts Centre, marking the end\nof a chapter for 111 graduands from the Chemical\nEngineering (CE) and Electrical Engineering &\nInformation Technology (EEIT) degree programmes.\nThe Guest of Honour for the ceremony was Prof\nWolfgang A. Herrmann, President of Technical\nUniversity of Munich (TUM). Prof Tan Thiam Soon,\nPresident, SIT, and Prof Loh Han Tong, Deputy\nPresident (Academic) & Provost, SIT, along with other\nSIT senior management also attended the ceremony.\nMr Sean Han Siwen was lauded as the valedictorian\nof the graduating class and was also the Best Student\nfrom the Chemical Engineering programme. “I’m\nelated that the effort placed on my studies has\nborne fruit, and I would like to thank my lecturers\nand fellow coursemates for making the journey a\ndelightful one,” he said.\nAlso receiving awards at the ceremony were Mr\nNg Kai Xuan for the Best Student Award from\nthe EEIT programme, and Mr Chua Wei Jun and\nMr Nagamuthu Vignesh for Best Thesis Award from\nthe CE and EEIT degree programmes respectively.\nSiTIZEN  |  06/16\nBringing Out the\nMaker in a Student\nAs part of SIT’s Punggol community outreach initiative, SIT\nhas developed an eight-week long Youthmaker Programme in\ncollaboration with Greendale Secondary School. The programme\naims to engage and provide youth with the know-how to design\nand build prototypes of their designs at SIT’s makerspace,\nSkillsCraft, located at Punggol 21 Community Club.\nSince its inaugural workshop in April 2018, SkillsCraft has been\na popular gathering place for Punggol residents to get creative\nby turning their ideas into reality, through tinkering and building\ntools that fulfil their specific needs.\nThe YouthMaker Programme leverages on SkillsCraft and\nis designed for aspiring youths who see themselves as\nchange-makers with a sense of community purpose. In February\n2019, 16 students from Greendale Secondary School attended\nthe pilot programme that comprised workshops on 3D printing Student participants from Greendale Secondary School receiving their YouthMaker certificates from SIT.\nThe participants learn about 3D modelling at SkillsCraft, SIT’s makerspace located at\nPunggol 21 Community Club.The “Shuffle Puzzle” is a functional and decorative three-tier modular\npenholder, redesigned from an ordinary stationery holder by the Greendale\nSecondary student team.SIT’s collaborative efforts with Greendale\nSecondary School encourage interest in\nSTEM through the Youthmaker Programme\nand design thinking. Conducted by SIT faculty and\nmentored by SIT undergraduates, the secondary\nschool students learnt new skills that enabled them\nto redesign everyday items.\nThese students were able to pitch the results of\ntheir learnings to the 7th International 3D Printing\nCompetition organised by the Singapore Centre for\n3D Printing (SC3DP). The student team redesigned\nan ordinary stationery holder and transformed it into\na unique puzzle.\n“Even though our submissions did not end up with\nany wins, the applied learning journey gave us an\nopportunity to explore and further our interest in\nscience, technology, engineering and mathematics\nin a fun and engaging way beyond classroom\nsettings,” said Secondary Four student participant,\nMr Javier Lee. “It allows me to work with different\npeople who I don’t usually work with.”\nSiTIZEN  |  07/16\nHands-On Learning with a Hands-Free Vehicle\nStudents from the Telematics (Intelligent\nTransportation Systems Engineering) programme\ncan now take advantage of a hands-on learning\ntechnology with the deployment of The SIT\nElectronic Autonomous Driving Car (or The\nS.E.A.D. Car in short) in the SIT@Dover campus\nfrom May 2019. This is the first such electronic\nautonomous vehicle (EAV) to be developed by SIT,\nin collaboration with SingPilot, a start-up focusing\non autonomous driving system development.\nWhat makes The S.E.A.D. Car especially\nunique is that SIT students also contributed\nto its development. Among these were Mr\nAlvin Lim, from the Systems Engineering\n(ElectroMechanical Systems) programme and\nMr Boris Khoo from the Telematics programme\nwho joined SingPilot during their Integrated\nWork Study Programme (IWSP). Both students\nhelped to create a modular design for the\nEAV’s vehicular controls. In addition, Ms Wang\nXin from the Mechanical Design Engineering\nprogramme and Mr Benjamin Chu from the\nMechatronics programme also worked with\nSingPilot for their Final Year Projects.\nMr Lim, who will graduate this year, even took\nthe initiative to extend his time at SingPilot\nfor another month because of his interest in\nthe project. Joining the team as an Associate\nEngineer during his IWSP , Mr Lim helped to\ndevelop the prototype for vehicular controls\nand brake functions that was eventually  Mr Dan Chia, Senior Lecturer, SIT, gives a briefing to Telematics students about the EAV functions.The S.E.A.D. car in action at the SIT@Dover campus.\nused in the actual design. “Instead of being treated like a normal\nstudent, I was viewed as an important team member, who was\ngiven the important responsibility of making a decisions in some of\nthe design and technology selection for the prototype. This was a\nchallenging yet inspiring experience for me,” he said.\nThe S.E.A.D. Car is used in modules which focus on system and\nsoftware, sensors and control, inter-car connectivity, automotive\nelectronics, and other intelligent automotive systems-related\nsubjects, thus enhancing students’ understanding and capabilities\nin the autonomous driving domain. The SIT Electronic Autonomous Driving (S.E.A.D.) Car is now used in lab sessions for Telematics\n(ITS Engineering) programme students\nSiTIZEN  |  08/16 SiTIZEN  |  09/16\nSIT’s Future Punggol Campus Gets its First GiftGenerous giving from Ho Bee\nLand also supports a scholarship\nHo Bee Land has made endowed gifts of\n$3.25 million to the Singapore Institute of\nTechnology (SIT), marking the very first time\nthe University has received philanthropic\nsupport for its future campus in Punggol.\nIn recognition of this commitment, SIT has\nnamed the auditorium at its future campus\nin Punggol, as well as its interim campus in\nSIT@Dover, the Ho Bee Auditorium.\nThe Ho Bee Auditorium at SIT@Dover was\nunveiled at a naming ceremony for the\nauditorium and appreciation lunch for\nHo Bee Land. Held on 1 July 2019, it was\nattended by Dr Chua Thian Poh, Chairman\nand Chief Executive Officer of Ho Bee Land,\nand Guest-of-Honour, Mr Ong Ye Kung,\nMinister for Education.\nExpressing his appreciation, Prof Tan Thiam\nSoon, President, SIT, said, “SIT is honoured\nby the firm support from Ho Bee Land – a\nSingaporean company with a global outlook,\nand a name that is associated with both\nquality and sustainability – the very same\noutcomes that we are also keen to achieve.\nThank you for taking the lead to support SIT\nand our students at this point of our journey,\nas our young university leaps forward into its\nsecond decade.”\nHeadquartered in Singapore, Ho Bee\nLand is a real estate development and\ninvestment company with a portfolio that\ncovers many quality residential, commercial\nand high-tech industrial projects since its\nestablishment in 1987.\nIn his remarks, Dr Chua said that the approach\ntaken by SIT as Singapore’s university of\napplied learning resonates with Ho Bee Land.\nHe added, “We believe a good education\nhelps open doors to many opportunities. It\nhelps nurture the next generation of leaders\nand professionals. We also hope that it will\nhelp impart to them the good values of\ngiving back to the community.”\nHo Bee Land’s philanthropy has also made\npossible the Ho Bee Scholarship to nurture\nacademically promising undergraduates\nfrom nine degree programmes at SIT\n(ranging from Engineering to Information\nand Communications Technology to Interior\nDesign).\nMr Tan Kah Wei is one of the first to receive\nthe Ho Bee Scholarship at SIT. The second-\nyear student from the Information and\nCommunications Technology (Information\nSecurity) programme said the Ho Bee\nScholarship has allowed him to better\nenvision his future. He added, “I hope to be\nable to use my professional IT knowledge\nto mentor the young as well as help the\nelderly who are less tech-savvy, so that they\nknow how to protect themselves from data\nbreaches and security threats.”\nLocated in a standalone building by the\nwaterfront, the Ho Bee Auditorium will be Dr Chua Thian Poh, Chairman & CEO, Ho Bee Land, (third from right) mingles with guests before\nthe ceremony begins.\nThe event took place at the foyer of the auditorium at SIT@Dover.\nHo Bee Scholarship recipients, Mr Tan Kah Wei (left) and Ms Lau En Bei, who was on her compulsory\nOverseas Immersion Programme in Glasgow, expressed their thanks to Ho Bee Land in their own\nspecial way. Ms Lau sketched and built a model of the future auditorium whereas Mr Tan designed an\ninteractive platform which can be displayed at the future auditorium. Mr Ng Yat Chung, Chairman, Board of Trustees, SIT, (left) presents a token of\nappreciation from SIT to Dr Chua Thian Poh, Chairman & CEO, Ho Bee Land. Speaking off the cuff, Mr Ong Ye Kung, Minister for Education, thanked Dr Chua Thian Poh and Ho\nBee Land for this leadership gift that supports SIT’s future campus in Punggol and its students. He\nmade a light-hearted appeal to guests at the appreciation lunch to also support SIT.\nHo Bee Land’s Board of Directors together with (second from left) Senior Parliamentary Secretary\nLow Yen Ling, Prof Tan Thiam Soon, Mrs Doris Chua, Dr Chua Thian Poh, Minister Ong Ye Kung,\nMr Ng Yat Chung and Minister of State Sam Tan.(From left) Ms Low Yen Ling, Senior Parliamentary Secretary, Ministry of Education & Ministry\nof Manpower; Dr Chua Thian Poh, Chairman & CEO, Ho Bee Land; Prof Tan Thiam Soon,\nPresident, SIT; Mr Sam Tan, Minister of State, Ministry of Foreign Affairs & Ministry of Social and\nFamily Development; Mr Nicholas Chua, Deputy CEO, Ho Bee Land; Mr Seow Choke Meng,\nIndependent Director, Ho Bee Land; and Mr Ng Yat Chung, Chairman, Board of Trustees, SIT.\nAn energetic performance from SIT’s Wushu Club greeted\nguests at the start of the ceremony.\npart of the teaching facilities in the Punggol campus, with function\nareas that enjoy unobstructed views of Serangoon Reservoir and\nConey Island. It will also have the capacity to host key national and\nuniversity events. SIT’s Punggol campus will be part of the nation’s\nnew Punggol Digital District.\nSiTIZEN  |  10/16\nDr Leong Horn Kee (right), Advisor, Thomson Shin Min Foundation, presenting a cheque for\nthe gift to Ms Soh Pe Wen, Assistant Manager, Advancement and Alumni, SIT. Behind them\nare Mr Lim Lam Heng, Director, (left) and Mr Philip Tan, Executive Director, Thomson Shin\nMin Foundation.\nSIT staff and SITizens with members of the Rotary Club of Jurong Town, Singapore.\nSITizens Journeying Together with RCJTSteadfast Philanthropic Support from the Thomson\nShin Min Foundation\nSince 2015, the Thomson Shin Min Foundation\nhas been supporting students at SIT with annual\ndonations to build up an endowed bursary fund.\nThis year, the Foundation made an additional\nendowed gift, which will allow a greater number of\nstudents to be empowered by the Thomson Shin\nMin Foundation Bursary in the years ahead and in\nperpetuity.\nOne of the first-ever recipients of the Bursary is\nAcademic Year 2018/19 recipient Mr Chua Chiang\nYuen, a Bachelor of Accountancy with Honours\nstudent. Mr Chua feels grateful that the Bursary\nhas helped lift his financial burden. “I am honoured\nto have received the Bursary as it has lessened my\ndifficulties in paying for my tuition fees,” he said,\nadding that it also gave him more time to focus on\nstudies and participate in co-curricular activities.\nFellow recipient and Bachelor of Engineering with\nHonours in Telematics (Intelligent Transportation\nSystems Engineering) student Ms Nurhidayah Bte\nAbdul Rashid said, “Being awarded this Bursary\nOn 23 July 2019, two alumni and a graduand from SIT’s nursing degree\nprogrammes met with members of the Rotary Club of Jurong Town,\nSingapore (RCJT) for a lunch and catch-up session. RCJT has strongly\nsupported nursing programmes in SIT since 2014, first with a term gift for\nthe Rotary Club of Jurong Town Book Prize in Care Pathways for Long-Term\nConditions, and later with the endowed Rotary Club of Jurong Town Book\nPrize in Intermediate & Long Term Care and the endowed Rotary Club of\nJurong Town Bursary.\nThe award recipients each shared how RCJT’s philanthropy had positively\nimpacted their lives over the years. Mr Muhd Izzulwan Bin Ahmad Salleh,\nwho received an RCJT book prize in Academic Year (AY) 2014/15, spoke\nhas allowed me to pursue my education in SIT with ease. I\nconsider myself lucky as it alleviates my financial worries and\nallows me to fully focus on my academics.”\nof his work in Changi General Hospital’s\nhigh dependency and acute stroke\nunit, and how he was now getting more\ninvolved in meaningful projects at the\nhospital. AY 2017/18 Bursary recipient,\nMs Evelyn Chua, talked about her recently\ncompleted graduation thesis on burnout\nand compassion fatigue among nurses.\nMs An Xin Yun, an AY 2018/19 Bursary\nrecipient and graduate, recounted her\ntough start at SIT. “I’m actually working as\na nurse and I’m proud to say that it’s been\nmy dream job since I was young. During\nmy days in SIT Nursing, I actually had to\nwork three part-time jobs to pay for my\nschool fees. Although I did work for a year\nin a government hospital to save funds,\nit still wasn’t enough,” she said, sharing\nthat she had to give up CCAs, community\nservice and personal time in order to cope.\nReceiving the Bursary however, helped her\nto find balance in her life. “It lessened my\nload in the sense that I didn’t have to focus\non financial issues and could continue to\ndo what I like, and on top of that, striving\nand helping others meet their needs.” She\nconcluded by thanking RCJT for enabling\nher to make a difference in others’ lives\nthrough her dream job today.\nSiTIZEN  |  11/16\nSIT Bursary recipients came down to thank faculty and staff and share how the bursary has\nhelped them in their academic journey in SIT.\nFaculty and staff from across SIT gave a strong show of support at the Faculty & Staff Giving\nroadshow. Left photo: SIT staff getting to know the SIT Bursary recipients.Assoc Prof Ivan Lee (far left), Vice President (Industry & Community),\nSIT; Assoc Prof May Lim (first row, second from right), Director,\nCoLEAD, SIT; and staff from CoLEAD. The CoLEAD team spent the\nafternoon spreading the word about AdventureLearn, a new holistic\nstudent development platform that is attracting support from SIT’s\nfaculty and staff.\nThe CoLEAD team explains the features of AdventureLearn to faculty\nand staff.Participants were treated to coconut ice cream, as well as Ramly burgers\nand iced coffee.\nChanging Lives with\nthe Act of Giving\nLast year, employees at the Singapore Institute of Technology\n(SIT) raised more than $73,000 through the Faculty & Staff Giving\n(FSG) initiative, which allows faculty and staff to offer financial\nsupport to students and student-centric initiatives at SIT.\nTogether, their collective giving made possible 24 SIT Bursaries\nfor Academic Year 2018/19, which were awarded to financially\ndisadvantaged students at SIT.\nTo celebrate the impact of this giving, the FSG Roadshow\nwas held on 20 June 2019 at SIT@Dover campus. Participants\nenjoyed a light lunch of Ramly burgers, coconut ice cream and\niced coffee. They also had a chance to chat with SIT Bursary\nrecipients, who were there to share more on what receiving the\nBursary meant to them.\nThis year, SIT employees have a new option to direct their\ncontributions to the AdventureLearn development fund. Introduced\nat the FSG Roadshow, AdventureLearn is a new holistic student\ndevelopment platform that, once completed, will enable students\nto learn better by helping them understand their personal learning\nstyle and characteristics.\nMr Lim Shao Ming from SIT’s Human Resources Division gave to\nboth the SIT Bursary and AdventureLearn. He hopes his gift will\nplay a small part in aiding the development of students. “Having\nbeen a full-time student myself, I know the tremendous pressure\nstudents can feel from examinations or project deadlines.\nThe last thing they would want is to add on to their stress with\nfinancial worries. I hope the SIT Bursary and AdventureLearn\nwould seamlessly complement each other in helping to provide\na supportive, fun-filled learning environment for our students.”SIT employees come together at the\nFaculty & Staff Giving Roadshow to\ncelebrate the value of giving, and support\nthe new AdventureLearn programme\nSIT Bursary recipient and Food Technology\nstudent, Mr Quek Xing Yu said the bursary is “a\ngreat blessing” as his father is suffering from\nmultiple myeloma and cannot work for extended\nperiods. ”The bursary helps greatly in allowing me\nto focus on taking care of my father and finishing\nmy assignments. I am truly grateful to those who\nhave contributed, and have helped change my\nlife with that act of giving,” he said.\nSiTIZEN  |  12/16\nThe saying ‘Once a SITizen, Always a SITizen’ holds true. Alumni pursue their interests with\na bit of help from their alma mater\nMs Joey Lee presented her capstone topic “Millenial Retention in MICE\nCompanies” under the Employee Retention; Hospitality Internship segment\nat the 2019 APacCHRIE & EuroCHRIE Joint Conference.Ms Joey Lee (right) and fellow Hospitality Business alumnus, Ms Eon Yang,\nwere both representing SIT at The Hong Kong Polytechnic University, where\nthe conference was held.\n(From left) Ms Joanne Teh and Mr Skye Tan\nrepresented SIT in individual couple categories, team\nmatch as well as show dance, making the finals in\ntwo out of three events at SNTDC and WIUDC 2019.Fellow alumni dance couple Mr Han Myo Thaw\n(left) and Ms Chong Qi also represented SIT\nBallroom in the Open One Dance category for\nwaltz and tango.\nA Little Support Goes a Long Way\nRepresenting SIT Beyond Our Shores\nWhen Ms Joey Lee, a Hospitality Business alumnus,\nheard about the 2019 APacCHRIE & EuroCHRIE Joint\nConference happening in Hong Kong in May 2019,\nher interest was piqued. Ms Lee hungered to learn\nfrom educators and industry practitioners from the\nhospitality, food service and tourism fields in Asia\nPacific, and she wanted to attend the conference to\ngain exposure and meet new people in the process.\nDancing as One SIT\nBallroom\nAs a student, Hospitality Business\nalumnus Mr Skye Tan was a founder\nof the student club SIT Ballroom,\nand he also lent a hand at alumni\nevents. These two passions came\ntogether when he decided to take\npart in the Singapore National\nTertiary Dance Championship\n(SNTDC) and World Inter-University\nDance Challenge (WIUDC) 2019\nthat took place in April 2019 as an\nalumnus. Having been motivated\nby the camaraderie he experienced\nat SIT Ballroom as a student, he\nwanted to continue being a part\nof SIT Ballroom and – together\nwith students and other alumni\n– improve SIT’s overall ranking in\nthe competition to bring home the\nchampionship title.\nHe then recalled SIT’s Advancement\n& Alumni Division’s initiatives\nto keep alumni connected, and\nreached out to SIT through the\ndivision for assistance to help cover\nthe competition fees for two alumni\ndance couples in the competitions. Alumni participation gave SIT Ballroom equal footing against the alumni\nteams of other institutes. With the financial strain reduced, the dancers could\nfocus on training sessions and classes that they had further invested on.\n“Facilitating our entries for the alumni team to compete made us feel that\nour efforts to represent the Institute was valued, even after graduation,” said\nMr Tan.\nSIT Ballroom emerged overall as 1st Runner Up, a step above from last year’s\nstanding as 2nd Runner Up.“My professor told me to reach out to SIT‘s\nAdvancement & Alumni Division for funding, so I\nthought I would try to get some assistance,” said Ms\nLee. With SIT supporting her trip, she submitted her\npaper for the conference and she was both happy and\nexcited when she found out that her paper on “Millenial\nRetention in MICE Companies” was selected for the\nstand-up presentation. She even managed to squeeze\nin a spot of sight-seeing at Victoria Harbour!\nSiTIZEN  |  13/16\nOn 30 May 2019, 52 alumni turned up for Alumni Leisure Network’s very\nfirst CheerS IT’s Thursday (CheerSIT) gathering at Japanese gastrobar\nKuro Izakaya. It provided them with the opportunity to reconnect with\nfellow alumni and to get to know new friends from different clusters\nover a buffet dinner and drinks in a cosy environment.\nMs Jolene Tan, who graduated from the Physiotherapy programme\n(Trinity College Dublin), came together with her university friend and\nnow colleague after work. They took the opportunity to catch up as\nthey seldom meet during work. When asked what was the highlight\nof the evening was, Ms Tan said, “Getting to know other people\nwith unique careers and interests! I found out how a game designer\nhas to do physics one day and work on animations the next.” For\nHospitality Business alum Mr Roy Lim, the key takeaway from the\nnight was “Food, drinks and people – the only three things you need\nfor a great event!”CheerS IT’s Thursday!\nSITizens gather for a social event for a relaxing evening, sans the pressures of formal networkingSITizens registering their attendance for SIT Alumni Leisure Network’s CheerS IT’s Thursday and\nready to unwind after a hard day’s work.\nEarly birds settle down and pore over courses available via SITLearn that they can utilise their\nSITizens Learning Credits on.Alumni gleefully dishing delectable portions onto their plates.\n(From left) Pioneer batchmates of SIT’s Hospitality Business\nprogramme Mr Roy Lim, Ms Denise Lim and Mr Keith Tan huddle\ntogether for a quick photo.\nHaving a good time with old friends and new over a good meal.\nSiTIZEN  |  14/16\nSITizens learn how to treat their skin right with natural ingredients at the Lip Balm & Salt\nScrub Workshop organised by the SIT Alumni Leisure Network\nOn Saturday, 29 July 2019, room2F at\nEsplanade Mall was filled with strong\ncitrusy scents as SIT alumni chose from\na range of essential oils to customise\ntheir own personalised products at\nthe Lip Balm & Salt Scrub Workshop.\nThe workshop was led by Ms Chew Jia\nTian, a Nursing Practice programme\nalumnus and founder of Rough\nBeauty, which produces handcrafted\nbath and body products. She had\nalso previously led a soap-crafting\nworkshop for alumni in June 2017.\nThe participants began making their\nown lip balm by melting cocoa butter\nand beeswax in a pot, then added a\nfew drops of olive oil infused with\nalkanet root for some natural red\ncolouring. They could also take their\npick from a variety of essential oils\nto produce scents such as lavender,\npeppermint and grapefruit.\nNext, they mixed Australian sea\nsalt with a variety of ingredients to\nproduce a natural salt scrub, which can\nbe used for exfoliation of your skin on\nyour face and body. These included\nnatural additives such as charcoal\npowder, French green clay, spirulina,\nand even turmeric powder.\nMr Jason Chan, who graduated from\nUniversity of Glasgow’s Aerospace\nEngineering programme, has been\nusing the lip balm he made himself.\n“I enjoyed the hands-on experience\nof making lip balm. It’s not something\nI would normally use or purchase, but\nI feel it helps with dry or cracked lips,”\nhe said.\nMs Zoey Tan, who graduated with a\nBachelor of Science in Early Childhood\nEducation and now works as a\nchildcare teacher, intends to share the\nexperience together with her students.\n“Our school has a charity carnival\nwhere the children sell items they have\nmade to guests, and the profits will go\nto an elderly home,” she explained. “I\nwill be making lip balms and bath salts\nwith them to sell at the carnival.”Hydrate & Exfoliate The Natural Way\nMelt down the ingredients before pouring them into small containers to form the lip balms!\nChoose from a variety of natural ingredients and additives to concoct your personalised products. Some of\nthe ingredients seen here are turmeric powder, mint leaves, and oats.\nCustomise your packaging with brightly-patterned strings and washi tape to make it look cute and pretty!\nStep 2\nStep 3Step 1\nSiTIZEN  |  15/16\nAlumni wondering what will the ending be like for the Avengers.Alumni let off some steam with a fun and friendly game, the first of many sports sessions to come\nSIT Alumni Card Benefits\nScan for the latest merchant\ndiscounts available!\nTwenty-one alumni gathered at the Sports Hall at the\nSIT@Dover campus on Saturday, 1 June, splitting into\nteams of eight to play a friendly game of Captain’s Ball.\nThis was the first of a series of upcoming sports sessions,\norganised by the SIT Alumni Sports Network.\nMs Evania Wong, an alumnus from the Food and Human\nNutrition programme felt the session was the perfect\nopportunity to play a sport she has loved since young. “It\nwas fun and engaging, and brought back memories from\nwhen I used to play,” she said. “It was also a chance for a\ngood workout, and we got to meet with other SIT alumni.”\nMr Lionel Ng, who graduated from the Mechanical Design\nand Manufacturing Engineering programme, is looking\nforward to more sessions in the future. “I definitely won’t\nmind sports like bowling or rock climbing,” he said.\nThe SIT Alumni Sports Network will be organising more of\nsuch games of various sports, so keep your eyes peeled\nfor upcoming sessions!Jump to the Captain’s Ball!\nThe players pause in anticipation as they watch a crucial moment between catcher\nand defender.Energies are on high as the game gets into full swing.\nHappy alumni after a fun and exhilarating game, together with SIT staff."
}