{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-15.pdf",
  "type": "pdf",
  "content": "82 Accountancy Graduands\nthe First to Receive\nSIT-Conferred Degrees\nAiming for the\nStars and Beyond\nNew Industry Partnerships:\nDSM, Kiso-Jiban, LTA &\nINCOSE, PSA, Siemens\nHealth and Social Sciences\nCluster Triumphs at\nFirst Inter-Cluster Games\nNew Perspectives and\nDeeper Understanding,\nthanks to The Singapore\nIreland Fund OIP Grant\nSITizens Find Love at SIT’s\nNew Alumni Welcome Party\nUndergraduates Enjoy\nWarm Friendships with\nSIT’s Philanthropic Partners\nRave Reviews for\nAlumni Movie NightsOnce a SiTizen, Always a SiTizen ISSUE NO. 15   |  MAY  2017\nAs we head into the middle of 2017, there is much to be excited about at the Singapore\nInstitute of Technology (SIT). On campus, celebrations are underway for our very first\nbatch of 82 graduates from the Accountancy degree programme – they are also the first\nto receive an SIT conferred degree. What’s more, 84% of them have already secured\npriority offers from local accounting firms!\nOn another very happy note, love is in the air for SIT alumni. In this issue of SITizen , we\nspeak to some SITizens who have found their life partners through SIT. Among them\nare Mr Tan Juan Hui, a Hotel Administration graduate and Ms Dephne Chea, a Marine\nEngineering graduate, who were married in 2015 and are now the proud parents of a\none-year-old baby boy. Another couple, Mr Gary Wong and Ms Tui Sze Sze, who also\ngraduated from different degree programmes, said they actually had the annual New\nAlumni Welcome Party in 2013 to thank for their first meeting. They are now preparing\nfor their wedding banquet in August.\nSIT alumni are certainly keeping in touch with one another and with their university\nthrough a range of alumni activities and events. These include the ever popular\nAlumni Movie Nights organised by the SIT Alumni Leisure Network. Two screenings WHAT’S\nHAPPENING\naround our little\nbig campus\nSITizen is a publication by the\nSIT Advancement & Alumni Division.\nFor enquiries, please e-mail us at\nAlumni@SingaporeTech.edu.sg\n© Singapore Institute of Technology 2017\nDear SIT Alumni,\nWhen Love is in the Air …\nhave been held in March and May, with a third being\nplanned for later this year. SITizens are also playing\nfutsal together at the SIT@Dover Campus and learning\nhow to cope with stress at the Personality Application\nWorkshop: Optimising Stress.\nIn the meantime, undergraduates at SIT are enjoying firm\nfriendships with the university’s philanthropic partners\nsuch as Mapletree Investments, Baker Tilly TFW LLP and\nSamwoh Corporation. SITizens are also making it a point\nto pay it forward, as they did when they helped Madam\nWong Mah Jia Lan – whose generous giving has made\npossible the Wong Kwok Leong Bursary at SIT – auction\noff her artworks to raise funds for charities in April.\nRead about all this and more in this issue of SITizen.\nShould you wish to contribute a story, do drop us a line at\nAlumni@SingaporeTech.edu.sgMr Gary Wong and Ms Tui Sze Sze,\nwho first found each other at the 2013\nNew Alumni Welcome Party. They are\nnow married.\nSiTIZEN  |  03/16 SiTIZEN  |  02/16\nLike many of her peers, Ms Hilary Lim Yi Jun took pride in being among the first\ncohort of 82 students to receive an SIT-conferred degree at the SIT Graduation\nCeremony held on 24 February, 2017. She said, “I felt honoured and special to\nbe part of the pioneer batch of SIT Accountancy graduates, leaving a legacy for\nour juniors to follow.”\nShe said it turned rather emotional for her during the ceremony, especially when\nMr Shaun Ang Yongxiang, the valedictorian, asked his fellow graduates to bow\nand thank their parents and loved ones in the auditorium for supporting them as\nthey completed their Bachelor of Accountancy with Honours programme. It was\nindeed a touching scene.\nAs early as 12:30 pm on 24 February, the graduands from the Bachelor of\nAccountancy with Honours degree programme were streaming in for a celebratory\ntea session held at the Student Activities Centre, some with parents and family\nmembers in tow. The joyful mood was infectious as the soon-to-be graduates\nchatted with their lecturers, who were already decked out in academic gowns\nand mortarboards.\nThere were plenty of hugs and handshakes and much picture taking. Then at\n3 pm, it was time for the formal event and the graduates trooped off to the\nauditorium.Proud Day for SIT’s First\nAccountancy Graduates84% of pioneer\ngraduating cohort land\npriority offers from\nlocal accounting firms\nKEPPEL GOLD MEDAL\nAloysia Han Ming Xuan\nBachelor of Engineering with Honours in\nMechanical Design and Manufacturing\nEngineering\nNewcastle University\nAng Chong Xian\nBachelor of Engineering with Honours in\nMechatronics\nUniversity of Glasgow\nBoo Kenney\nBachelor of Engineering with Honours in\nMarine Engineering\nNewcastle University\nChang Ze Hao\nBachelor of Engineering with Honours in\nMechanical Design Engineering\nUniversity of Glasgow\nKhoo Peng Ying Pauline\nBachelor of Arts with Honours in Interior Design\nThe Glasgow School of Art\nSEMBCORP MARINE GOLD MEDAL\nChit Ye Bo\nBachelor of Engineering with Honours in\nOffshore Engineering\nNewcastle University\nST ENGINEERING GOLD MEDAL\nLiu Yongsheng\nBachelor of Engineering with Honours in\nNaval Architecture\nNewcastle University\nCEI OUTSTANDING STUDENT AWARD\nIN MECHANICAL DESIGN AND\nMANUFACTURING ENGINEERING\nAloysia Han Ming Xuan\nBachelor of Engineering with Honours in\nMechanical Design and Manufacturing\nEngineering\nNewcastle UniversityMr Ong Ye Kung, Minister for Education (Higher Education and Skills) &\nSecond Minister for Defence, also announced the launch of the SkillsFuture\nWork-Study Degree Programmes (in Information Security, Software Engineering,\nHospitality Business, Electrical Power Engineering and Civil Engineering) at SIT.\nThese programmes will involve cooperation between SIT and industry including\nMNCs, and government organisations.\nThese partner organisations will jointly assess the placement of potential\ncandidates into these undergraduate programmes and work with SIT to develop\nthe curriculum in line with industry needs. They will also mentor and guide student-\ntrainees in the workplace through a structured on-the-job training curriculum,\nsome of which are credit-bearing portions of the undergraduate programme. SkillsFuture Work-Study Degree ProgrammesAward Recipients\nMany penned well wishes for their fellow graduates\nduring the pre-graduation ceremony celebratory\ntea session.\nAll ready to make their mark in the corporate world.\nSome made it a bigger celebration by also bringing\nalong friends, relatives as well as family members.Snapping wefies in their graduation robes was\nthe craze.\nThis was how jubilant some graduates were.\n82 students received their SIT-conferred Bachelor of Accountancy with Honours degree at the ceremony. A father’s pride in his daughter’s accomplishment.\nJoy showed in nearly every face at the graduation\nceremony.New graduates picking up their SIT Alumni Cards.In his speech, Guest of Honour\nMr Ong Ye Kung, Minister for Education\n(Higher Education and Skills) & Second\nMinister for Defence, said that as\nthe fifth Autonomous University for\nSingaporeans, SIT and the applied\ndegree pathway it pioneers is becoming\na significant pillar of the nation’s higher\neducation landscape.\nHe highlighted that SIT’s distinctive\nIntegrated Work Study Programme\n(IWSP) had resulted in 84 per cent\nof the present batch of graduates\nreceiving job offers from the same\naccountancy firms they worked with\nduring their IWSP .\nProf Tan Thiam Soon, President, SIT,\nadded that many of the graduates\nhad earned recognition and praise\nfrom employers for their excellent\nstandards and work ethic during their\nIWSP stints.\nIn his valedictory address, Mr Ang\nreflected on how graduation is both a\ntime to reminisce about “the great but\nsimple experiences” of university life\nand also a time to “focus on the next\nstage…and charge forward to achieve”\ntheir dreams. He added that with the\nSIT-DNA instilled in himself and fellow\ngraduates, they are “backed by a\npositive desire to make the community\nthat we live in a better place”.\nAt the ceremony, gold medals,\noutstanding student awards, and book\nprizes were presented to Accountancy\ngraduates as well as students from\nother degree programmes. (Please\nsee “Award Recipients” for details.)\nMinister Ong Ye Kung reminded the graduates that\nthe key purpose of SIT was to enable more young\nSingaporeans to fulfil their goals and aspirations.CHOO CHIAU BENG OUTSTANDING\nSTUDENT AWARD IN NAVAL\nARCHITECTURE\nLiu Yongsheng\nBachelor of Engineering with Honours in\nNaval Architecture\nNewcastle University\nZICOM GROUP OUTSTANDING\nSTUDENT AWARD IN MECHATRONICS\nKwong Wai Keat\nBachelor of Engineering with Honours in\nMechatronics\nUniversity of Glasgow\nCA TRUST PAC BOOK PRIZE IN\nTAXATION\nLim Hui Min\nBachelor of Accountancy with Honours\nSingapore Institute of Technology\nDELOITTE & TOUCHE BOOK PRIZE IN\nAUDIT PROCESS\nLau Chee Guan\nBachelor of Accountancy with Honours\nSingapore Institute of Technology\nPKF BOOK PRIZE IN CHANGE\nMANAGEMENT\nTeo Jia Yi\nBachelor of Accountancy with Honours\nSingapore Institute of TechnologyARDENT BOOK PRIZE IN BUSINESS\nVALUATION AND ANALYSIS\nMok Swee Jin Jasper\nBachelor of Accountancy with Honours\nSingapore Institute of Technology\nDELOITTE & TOUCHE BOOK PRIZE\nIN FINANCIAL ACCOUNTING\nLee Jing Shi\nBachelor of Accountancy with Honours\nSingapore Institute of Technology\nPwC’s FINAL YEAR ACCOUNTANCY\nSTUDENT AWARD\nSean Ooi Cheng’en\nBachelor of Accountancy with Honours\nSingapore Institute of Technology\nLOH CHIA HENG\nACCOUNTANCY AWARD\nMok Swee Jin Jasper\nBachelor of Accountancy with Honours\nSingapore Institute of Technology\nBAKER TILLY TFW OUTSTANDING\nSTUDENT AWARD IN ACCOUNTANCY\nSean Ooi Cheng’en\nBachelor of Accountancy with Honours\nSingapore Institute of Technology\nPSA Corporation Limited (PSA) and Singapore Institute of Technology (SIT) signed\na Memorandum of Understanding (MoU) in March to collaborate on strengthening\nsystems engineering expertise and knowledge for PSA employees, and for SIT\nstudents to gain exposure to automation and other advanced port technologies.\nSIT’s continuing education unit, SITLEARN, will also offer a 16-month part-time training\nprogramme to equip PSA engineers and Infocomm Technology (ICT) professionals\nwith the competencies to design, develop and maintain complex integrated systems\nwhich are vital for PSA’s new generation of intelligent container terminals.\nAs part of the MoU, PSA specialists will also deliver guest lectures at SIT on port\ntechnology and operations. In addition, PSA will offer scholarships to students and\nprovide Integrated Work Study Programme (IWSP) positions to students in selected\nEngineering and ICT programmes at SIT.\nThe MoU was signed on 10 March at this year’s Career Nexus – a platform for\nSIT students to get information about career opportunities from prospective\nemployers. At the event held at Suntec Singapore Convention & Exhibition\nCentre, selected alumni shared career experiences and industry professionals\nspoke on career-related topics that included the concern on many a student’s\nmind: ‘Will Machines Take Over My Job?’\nIn his talk, Mr P . Mukkesh Kumar, who graduated in 2015 with a Bachelor of Engineering with Honours in Chemical\nEngineering (Newcastle University) degree, shared how he applies the SIT-DNA in his learning journey as a Clinical Data\nReviewer at A*STAR. He said, “In the spirit of being able to learn, unlearn and relearn, I dug in, embraced the new and the\nunfamiliar, and mastered the basics of analysing clinical data.”\nHe also talked about his hopes of contributing to Singapore’s advancement of science and innovative technology and to\nact as a catalyst for transformation in making insightful research analysis.SiTIZEN  |  04/16\nPSA and SIT Sign MoU to Strengthen Systems\nEngineering Expertise at SIT’s Career Nexus\nCollaboration to build knowledge in advanced port technologies and\ndevelop manpower for engineering and infocomm technology disciplinesGuests were entertained by student performers from SIT\nDancesport (above) and Muzeka.\nStudents had the opportunity to mingle with faculty and also\nthank their sponsors who were present at the event.\nFrom left: Prof Loh Han Tong, Deputy President\n(Academic) & Provost, and Prof Ho Yew Kee, Assoc\nProvost (SkillsFuture & Staff Development), SIT;\nMr Ng Kok Cheong, Head of Human Resource, PSA\nCorporation; and Mr Ong Kim Pong, Regional CEO,\nSoutheast Asia, PSA International.\nAltogether, 486 SIT students and 95 companies took\npart in this year’s Career Nexus.\nClose to 500 scholars, guests, SIT Senior Management, faculty and\nstaff attended Reach for the Stars on 8 March 2017 at the Raffles City\nConvention Centre. An annual event, it serves as a platform to celebrate\nthe achievements of SIT’s scholars and show appreciation for industry\npartners who have provided sponsorships and bonded scholarships for\nour students.\nThe evening kicked off with a welcome address from Prof Loh Han Tong,\nDeputy President (Academic) & Provost, SIT. He thanked SIT’s industry\npartners for their support and endorsement of SIT’s focus on applied Aiming for the Stars and Beyond\nThe annual Reach for the Stars celebrates achievements of\nSIT’s scholars and acknowledges the sponsorships and bonded\nscholarships provided by industry partners\npedagogy, demonstrated strongly through the Integrated Work Study\nProgramme (IWSP). He said that “the support leaves lasting marks on our\n… students, in their pursuit of becoming the experts in their respective\nprofessional fields.” He also reminded the scholars that despite coming\nfrom different backgrounds, they all have one thing in common – they are\nall SITizens who have been imbued with the SIT-DNA.\nMr Tengku Muhammad Khalaf bin Tengku Zainal Shah, from the Bachelor\nof Engineering with Honours in Sustainable Infrastructure Engineering\n(Land) degree programme, was awarded the Public Transport Scholarship\nfrom the Land Transport Authority and Singapore’s public transport\noperators and will be graduating this year. The 27-year-old who is currently\non his IWSP with SMRT managed to meet with colleagues from SMRT who\nwere also present at the event. He said, “I am thankful for this scholarship\nas I was set on securing a career with SMRT. I’m glad that I’ve managed to\nsecure a job prior to graduating”.\nSiTIZEN  |  05/12\nA series of MoUs and Collaboration Agreements in early 2017 brings SIT and its students closer to industrySIT’s New Partnerships with IndustrySiTIZEN  |  05/16\nRoyal DSM, a global science-based company active in health, nutrition and materials,\nsigned a Collaboration Agreement with the Singapore Institute of Technology\n(SIT) to develop commercial and scientific opportunities for students in the food\ntechnology sector.\nThis three-year collaboration will grant SIT’s Food Technology undergraduates and staff\naccess to DSM’s expertise as well as its state-of-the-art Nutrition Innovation Centre (NIC)\nin Singapore. The establishment of an Industry Lab will also expose students to the\nprototyping and product development process. This includes time at a UHT pilot plant for\nfood fortification, a sensory lab to create desired flavour profiles, and climate-controlled\nchambers to establish stability under different environments.\nBy developing the next generation of food technologists, DSM is also supporting the\ngovernment’s drive to develop Singapore into the leading food and nutrition hub in Asia.DSM Collaborates with SIT to Support Next Generation of Food Technologists\n16 February 2017\nFrom left: Assoc Prof Susanna Leong, Cluster Director\n(Chemical Engineering & Food Technology) and\nProf Loh Han Tong, Deputy President (Academic)\n& Provost, SIT, with Mr Pieter Nuboer, Vice President,\nHuman Nutrition and Health, and Mr Gerald Ng,\nRegional Finance Director Control, Asia Pacific, DSM.\nFrom left: Assoc Prof Ivan Lee, Vice President (Industry &\nCommunity), and Prof Tan Thiam Soon, President, SIT, with\nDr K. Iwasaki, President, and Mr K. Orihara, Managing\nDirector, Kiso-Jiban Consultants Co., Ltd\nProf Loh Han Tong, Deputy President (Academic) &\nProvost, SIT, and Dr Armin Bruck, President and CEO\nof Siemens Pte Ltd sign the MoU which will see both\norganisations working closely to train engineers for\nSingapore’s future economy.Transport Minister Khaw Boon Wan (centre) interacting\nwith students while touring the labs at SIT.\nA Collaboration Agreement (CA) signed in February between SIT and\nJapanese engineering consulting firm Kiso-Jiban Consultants Co., Ltd will see\nundergraduates from the university’s newly launched Civil Engineering degree\nprogramme benefit from an applied learning platform and early industry\nexposure, through the establishment of an Industry Lab (I-Lab).\nLeveraging off the Soil and Rock Laboratory situated at Kiso-Jiban Singapore’s\npremises at Kallang Pudding Road, the I-Lab will support SIT’s teaching and\nresearch in soil investigation, geotechnical instrumentation and laboratory\ntesting. The CA was signed at the ‘Recent Developments in Geotechnical Site\nInvestigation’ technical seminar, jointly organised by SIT and Kiso-Jiban.SIT and Kiso-Jiban Establish an Industry Lab\n21 February 2017\nSiemens and SIT recently signed a Memorandum of Understanding (MoU) to train\nfuture engineers and strengthen collaboration between industry and SIT in the areas of\ndigitalisation and advanced manufacturing.\nThe MoU will ensure that SIT’s academics and/or professional officers will undergo the\nSiemens Mechatronic Systems Certification Programme (SMSCP) Level 3 instructor\ncertification course in Germany. SIT instructors will be the first in Southeast Asia to\nreceive such a certification. The SMSCP is a comprehensive training programme in which\nstudents learn about the complexities of the mechatronic system in a holistic fashion.\nUnder the MoU, Siemens will also provide 70 licensed software and maintenance of\nthese software to SIT, for use in relevant degree programmes such as the Mechanical\nDesign and Manufacturing Engineering, and Systems Engineering degree programmes,\nexposing students to the concept of Advanced Manufacturing and experience in using\nthe same software utilised by leading manufacturers. Siemens will also offer one\nmid-term scholarship to an SIT student in a relevant degree programme. Siemens Partners SIT for Training in Digitalisation and\nAdvanced Manufacturing\n13 April 2017SIT, LTA and INCOSE to Build Railway Engineering Capabilities\n23 February 2017\nSIT, Land Transport Authority (LTA), and International Council on Systems Engineering\n(INCOSE) signed a Memorandum of Understanding (MoU) to develop skilled manpower\nin Systems Engineering to support local public transport manpower requirements.\nThe three parties will develop applied learning curricula to prepare Systems\nEngineering graduates to be industry-ready.\nLTA will share its expertise and work with SIT on rail systems research and development\nand SIT will plan and deliver Systems Engineering training to professionals from LTA\nand other organisations.\nThe signing of the MoU took place at the launch of Singapore Rail Academy (SGRA) at\nSIT@Dover, and the opening of the Transportation Systems Lab and Systems Engineering\nLab which will be used by students from the Sustainable Infrastructure Engineering\n(Land), Systems Engineering (ElectroMechanical Systems) and Telematics (Intelligent\nTransportation Systems Engineering) programmes. The Railway Engineering Simulator\nsoftware from the London Underground at the Transportation Systems Lab will enable\nstudents to design rail networks and be\nexposed to various signalling operations\nand simulations.\nSiTIZEN  |  06/16\nMore than 300 SIT students and faculty members gathered at SIT@Dover on\n4 March 2017 to pit their skills in five sports in the inaugural SIT Inter-Cluster\nGames (ICG). The Health & Social Sciences (HSS) team came out tops to win\nthe Provost Cup, beating the Chemical Engineering & Food Technology (CEFT),\nDesign and Specialised Businesses (DSB), Engineering (ENG) and Infocomm\nTechnology (ICT). The weather could have been better but everybody had a\ngreat time.\nAs the DSB Cluster Sports Manager, Ms Lydia Tan Xiao Xian, from the Early\nChildhood Education programme (Wheelock College), had much to do and\nwas unable to compete in the games. She said, “Seeing my cluster participants\nhaving loads of fun and making new friends was very heartwarming.”\nAssoc Prof Alfred Tan Cheng Hock, a member of the ENG Futsal team, believes\nthat ICG also allows faculty and students to get to know each other better\nthrough sports. He added, “I never knew some of my students are so good in\nrunning and I bet they also didn’t know I can only dribble the ball like I’ve two\nleft legs. I had lots of fun training and competing with them. They really sprang\naround like rabbits!”\nPhotos courtesy of Ms Goh Qian Hui and Ms Nur Syathirah binte Adi Sunaryo from the\nBachelor in Science (Physiotherapy) degree programme (Trinity College Dublin), and\nMr Xavier Chen Lingqing from the Bachelor of Engineering with Honours in Electrical\nPower Engineering degree programme (Newcastle University)They kept on dribbling even while it was drizzling.\nAfter a fiercely fought game, handshakes to thank each\nother for a good match.\nNon-stop action kept the floorball players on\ntheir toes.\nRacing to the finish line. Teams went all out and showed great determination.\nHSS Triumphs in First\nInter-Cluster Games\nSpirits were high despite the rain; champion HSS will enjoy bragging rights till next\nyear’s ICG\nMs Sharifah Rawiah binte Matnor, 24, has fond memories\nof weekend travels around Ireland when she was on her\nOverseas Immersion Programme (OIP) as a student from\nthe Bachelor in Science (Occupational Therapy) degree\nprogramme. But more than that, the holistic nature of\nrehabilitation programmes in Ireland has provided her\nwith new perspectives that remain beneficial even after\ngraduation.\n“When I started work, I was able to share about the various\nprogrammes that I saw in Ireland and provide suggestions\nto improve on our current programme structure,”\nsaid Ms Sharifah, who is now working as an Occupational\nTherapist at SPD to help rehabilitate adults who have\nsuffered a stroke or spinal cord injuries, so as to reintegrate\nthem back into the mainstream workforce.\nShe added, “My knowledge with regard to the theoretical\naspects of occupational therapy has improved, and I am\nable to better explain concepts or ideas to my colleagues.\nWith the OIP experience of seeing how some theories have\nbeen applied to programmes that have been running for\nsome time, I have gotten a better picture on how to improve\nmy own interventions with my clients.”\nMs Sharifah was able to benefit from these experiences after\nreceiving The Singapore Ireland Fund Overseas Immersion\nProgramme Grant, which provides support to academically\npromising but financially disadvantaged undergraduates for\ntheir OIP in Ireland.\nThe Grant was established at SIT in 2013 with an endowed\ngift from The Ireland Funds Singapore. Valued at $6,000\neach, it has been awarded to 10 deserving students since\nAcademic Year 2014/15.\nOn 28 February 2017, five of these recipients including\nMs Sharifah were able to express their personal appreciation\nto Dr Stanley Quek, Chairman of The Ireland Funds Singapore. SiTIZEN  |  07/16\nRecipients of The Singapore Ireland Fund Overseas Immersion Programme Grant enjoyed tea with Dr Stanley Quek, Chairman, The Ireland Funds Singapore (back\nrow, middle), along with Prof Tan Thiam Soon, President, SIT (back row, extreme left) and Assoc Prof May Lim, Programme Director, SIT.\nMs Sharifah Rawiah (first row, extreme left), who received The Singapore Ireland\nFund Overseas Immersion Programme Grant, with her classmates at the Trinity\nCollege Dublin campus.Not Just a Change of Scene\nRecipients of The Singapore Ireland Fund Overseas Immersion Programme Grant gain new\nperspectives and deeper understanding on how to apply the knowledge they’ve learnt\nDr Quek was invited to tea at the SIT@Dover campus with the\ngrant recipients alongside Prof Tan Thiam Soon, President,\nSIT, as well as SIT faculty and staff.\nMs Shilin Lim, another grant recipient, said getting to chat\nwith Dr Quek was a great experience. “I don’t come from\na well-to-do family and the Grant has helped to alleviate\nsome of the financial burden my family faced,” she said,\nadding, “I felt fortunate to be able to get the grant and\nI really appreciate the motivation for The Ireland Funds\nSingapore for establishing the OIP Grant.”\nCurrently still on her OIP , Ms Lim is scheduled to return\nto Singapore only in early June. In the meantime, SITizen\nreceived a text message from her, in which she shared the\nexcitement of her learning journey. “During the attachment,\nwe had the chance to see surgery performed in the operating\ntheatres – something that we don’t get to do in Singapore!”\nSiTIZEN  |  08/16 SiTIZEN  |  09/16\nIt turns out that SITizens are getting more than just an\neducation and a degree at the Singapore Institute of\nTechnology (SIT) these days – they’re also finding their life\npartners!\nMr Tan Juan Hui, 29, who graduated from the Hotel\nAdministration programme and Ms Dephne Chea, 29, a\ngraduate of the Marine Engineering programme, are just\none of these couples. Having first met at orientation, they\nwent on to their first date at a Thai restaurant. He liked it\nthat they shared the same vision in life and she liked the\nfamily man she saw in him. One thing led to another, and\nfinally he took the initiative to pop the question. “I invited\nher and her close friends to a KTV room, and I proposed to\nher there, with a guitar,” said Mr Tan. They were married in\n2015 and the happy couple are now the proud parents of\na one-year-old son. SIT Plays Cupid for SITizens  Whether it’s meeting for the first time at alumni events, or\nworking on a group project together, more and more SITizens\nare finding love with their fellow alumni and undergraduates\nSaid Mr Gary Wong, who graduated from the Offshore\nEngineering programme, “We talked to our friends and\nrealised more and more of our schoolmates are getting\ntogether with each other.” He is, in fact, a part of this trend\n– he and fellow SITizen Tui Sze Sze are preparing for their\nwedding banquet later this year (see story below).\nAssoc Prof May Lim, Programme Director, SIT who\nfirst alerted this newsletter to the fact that SITizens are\npairing up to get married, is simply delighted with this new\ndevelopment.\nShe said, “University is an exciting time for young people, for\nthem to learn, to grow, to have fun and to build relationships.\nFor some students who find their lifelong partners at SIT,\nI feel heartened and happy that they meet the right SITizen\nthat they like to spend the rest of their lives with.”\nHow did you meet?\nG: At the 2013 New Alumni Welcome Party at Aquanova. She was\nat the next table with the rest of her Occupational Therapy\nclassmates. We studied at different campuses, and I didn’t\nusually attend events outside of class.\nS: If not for this event, I would have never met him.\nWhat was your initial impression of each other?\nG:  When a lot of people were on the dancefloor, I saw Sze at her\ntable moving to the music so I went to talk to her group.\nI thought she was the decent type.\nS: He asked for my number and I thought that he must be a\nplayer. I gave him my Facebook contact instead so I could\nblock him in case. He was a complete stranger, so who knows?\nWhat did you do on your first date?\nG:  We went to a Mexican place in Holland Village.\nS:  That night we talked about our Overseas Immersion\nProgramme. He laughed at his own jokes and I didn’t really\nget his jokes. When the bill came, I asked whether he wanted\nto split the bill and he said, “Yes!” I took that as a signal that\nhe didn’t really want to meet again.\nG:  I wanted to try a different approach and see what Sze was like.\nS:  We were judging each other on these small things.\nHow did things progress?\nG:  In my case, it was a gut feel that she could be someone I\ncould have a long-term relationship with. I wrote her a long\npassage explaining why I liked her. I had started working, Mr Trevor Jow (T), 28 & Ms Chalene Goh (C), 26\nBoth Ms Chalene Goh and Mr Trevor Jow graduated from the Bachelor in Science\n(Occupational Therapy) degree programme in 2013. They held their wedding on\n18 February 2017 at Orchard Hotel. They had just returned from their two-week\nhoneymoon in Japan to catch the Sakura season when SITizen met with them:\nHow did you meet?\nT: We actually met through the Occupational Therapy course\nin Nanyang Polytechnic. Even though we were classmates\nduring the four years, we never really spoke.\nC:  He hung out with his clique, and I had my own clique so we\ndidn’t really mingle. Then at SIT, we were in the same group\nfor our last module so we got to work closely with each other.\nWhat was your impression of each other?\nC: My impression of him when we were in polytechnic was that\nhe was a playboy, always flirting with girls.\nT: I thought she was nerdy because of her thick, frameless\nspectacles and she looked as though she didn’t like to have fun.\nWhat did you do on your first date?\nT: We had lunch at Sakae Sushi since we both needed to cool\noff after a group meeting about our project. We were all\nreally stressed at that point.\nC: He had a motive!\nT: After the lunch, I thought I wanted to go out with her some\nmore. So instead of being direct, I said, “I’ll pay for this time,\nand next time you pay.”\nC: When I was on the train home, he texted me and sent me\nsome music that he likes.\nHow did things progress?\nT: I had already planned to ask her to be my girlfriend six weeks\nafter we had first gone out. But before I could do it after our\ndate to the Night Safari, she had already asked me in the car\non the way there “Where do you see this going?”. My reply\nwas, “All the way, lah!” It was super awkward for me. Mr Gary Wong (G), 34 & Ms Tui Sze Sze (S), 30\nSharing a love of the outdoors, water sports like snorkelling and kayaking\nand seafood, Mr Gary Wong, from the Bachelor of Engineering with Honours\nin Offshore Engineering (Newcastle University) and Ms Tui Sze Sze, Bachelor\nin Science (Occupational Therapy) registered their marriage in September\n2016, and will be holding their wedding banquet in August this year:\nI would have to reschedule after arranging to meet, often\nat the last minute. Initially, she was understanding but after\nawhile it does take a toll.\nS:  We had a lot of discussions 2-3 months in, really getting to\nknow each other. I spoke to my family about this, and my\nfamily pointed out that he’s straightforward and honest to me.\nThey said that it takes courage for him to tell me about his\nissues, and to want to solve problems in the relationship.\nHow did you propose?\nG: I collected the ring the day before we flew off to Tasmania\nwhere I planned to propose. There, I had identified a nice little\ncove in our earlier days. When we reached there, I realised\nthat the ring was still back at the lodge. It was only the next\nevening after dinner – and I told her I had a surprise for her.\nS: I thought it was something that I hadn’t bought. And I was\nsurprised he had proposed – in beautiful Tasmania. He did it\nin bed, right before we went to sleep. He didn’t even kneel!\nWhat do you think the other brings to the relationship?\nS: I feel very safe when I’m travelling with him. Last year, one day\nafter our ROM in September, we wanted to get our diving\ncertificate. We were trying to get out of the water as a storm\nwas coming. He had a huge wound and wasn’t aware of it until\nI told him. His Scout instincts kicked in and he asked me to\nplace a pair of goggles over the wound to stop the bleeding.\nHe is very quick to use anything to problem solve.\nG: She is caring – I think she represents the heart. She’s quite\nindependent and has a wide range of skill sets which will be\nuseful when we start a family. I know that we can work together\nto manage the household.C: I’m a bit impatient and I don’t like to be coy about things\n– I needed to be sure of his direction since we had been\ndating for six weeks. I was wondering if he had just been\ntoying with me. That’s why I asked.\nHow did you propose?\nT: I planned a trip to Boracay – the ultimate romantic destination\nwith white sands and clear blue waters. I thought about a\nhelicopter ride but in the end booked a sunset cruise on a\nyacht which came with wine and canapes. I told Chalene that\nwe were going snorkelling. When the operator arrived, it was\non a rubber dinghy and I got quite scared.\nC: I didn’t know where we were going exactly, and on the rubber\ndinghy, I was holding on for my life. I was a little seasick on\nthe day – and I thought it was the worst experience until I saw\nthe yacht and went “Wow.” He tried to kneel down but he\ncouldn’t do it as the boat was shaking.\nT: I was a bit scared that I would drop the ring.\nC: With us, it seems that anything romantic will become quite\ncomical.\nWhat does the other bring to the relationship?\nC: He’s able to tolerate my short temper, and that also\nmakes me want to change and be more patient. He\nmakes life more interesting. And he’s also a joker so life\nis not that boring.\nT: I’m very forgetful, and she helps me get my life in order. With\nher, I see a purpose to carry on and start a family. She makes\nme want to be a better person, to her and to others.\nC: So we make each other change, for the better. Mr Gary Wong (middle in back row) and his friends photobombed Ms Tui Sze Sze (front row, fourth from right), her friends and TCD faculty at the 2013 New Alumni Welcome\nParty at AQUANOVA. Prof Tan Thiam Soon, President, SIT (second from left) got to witness this by-now historic moment in the couple’s life.\nSiTIZEN  |  10/16\nAt one point during her undergraduate studies, Ms Ailin Ng had contemplated\nleaving school altogether to take up a full-time job so that she could support her\nfamily. But thanks to the Mapletree Bursary, which she received in both Academic\nYears 2015/16 and 2016/17, Ms Ng can now persevere with her university education.\n“I no longer think about dropping out of school,” said Ms Ng, who is now in her final\nyear in the Accountancy programme.\nMs Ng was one of the recipients who were invited by Mapletree Investments to a\ntea session at their corporate headquarters in Pasir Panjang on 29 March 2017. The A group of undergraduates and alumni from the Singapore\nInstitute of Technology (SIT) recently volunteered at a charity\nexhibition opening and dinner, which were organised by\nthe Nanyang Confucian Association and The Kongzi Culture\nFund Ltd on 20 April 2017 and 22 April 2017 respectively.\nBoth were held in honour of notable philanthropist\nMdm Wong Mah Jia Lan’s 80th birthday.\nMdm Wong had in 2014 made possible the endowed\nWong Kwok Leong Bursary to nurture financially\ndisadvantaged students at SIT in perpetuity. A total of\nseven Wong Kwok Leong Bursaries have been awarded\nsince it was established.\nBoth events were held at the Singapore Chinese Cultural\nCentre and included the sale and auction of finger painting\nand various artwork and items from Madam Wong’s private\ncollection to raise funds for various charitable causes. SIT\nMapletree’s Firm Friendship\nEmpowers Young Talents  When Support\nComes Full Circle\nThank you, Mapletree! Prof Ng Siu Choon, Assoc Provost (Students),\nSIT (extreme right), and the recipients of the Mapletree Bursary\npresent a sweet treat to Mr Hiew Yoon Khong, Group CEO,\nMapletree Investments (second from right).Mdm Wong Mah Jia Lan (fourth from right) and Prof Tan Thiam Soon, President,\nSIT, (fourth from left) with several SIT students and alumni during the Charity Dinner.SIT students, Ms Dhyllis Lim (left) and Ms Lovevin Chia (right) with Mdm Wong\nMah Jia Lan at the opening of the Charity Exhibition.\nThe visitors from SIT also toured Mapletree\nInvestments corporate headquarters.\nCorporate donor’s forward-thinking philanthropy makes it possible for its\nbursary recipients at SIT to flourish and achieve their dreamsPhilanthropist Mdm Wong Mah Jia Lan auctions off\nher artworks to raise funds for charities – with some\nassistance from SITizens whom she has helped\nstudents and alumni, some of whom were recipients of the\nWong Kwok Leong Bursary, assisted with the exhibition\nopening, helped welcome guests and supported the stage\nceremonies during the dinner.\nThe guest of honour for the exhibition was Ms Sim Ann,\nSenior Minister of State, Ministry of Culture, Community\nand Youth & Ministry of Trade and Industry whereas Mr\nHeng Chee How, Senior Minister of State, Prime Minister’s\nOffice was the guest of honour at the dinner. Prof Tan Thiam\nSoon, President, SIT, also attended the charity dinner.\n“Helping out at these events was especially meaningful for\nme. It was inspiring to see how Mdm Wong’s philanthropy\nseemed to know no bounds as she donated all the red\npackets she received from the dinner guests to charity,” said\nMr Jeremy Wong, an alumnus from the Marine Engineering\nprogramme and a recipient of the Wong Kwok Leong Bursary.\ncompany had made possible the\nendowed Mapletree Bursary in\n2014, and to date a total of 22\nMapletree Bursaries have been\nawarded to 15 recipients.\nProf Ng Siu Choon, Associate\nProvost (Students), SIT, who\naccompanied the students\non their visit along with SIT\nfaculty and staff, remarked\nthat Mapletree’s willingness to\nsupport financially disadvantaged\nundergraduates from all fields of\nstudy and to continue nurturing\ndeserving students for more than\none academic year is “especially\nwonderful and far-sighted”.\nPursuing a degree in Game Design,\nMr Chua Kok Tung, another bursary\nrecipient, said that it has always\nbeen his dream to work in the\ngame industry or even start up his\nown studio as games had inspired\nhim when he was young.\n“The Mapletree Bursary has\nallowed me to spend more time\nworking on my game project that\nwill one day be a crucial part of\nmy portfolio when I enter the\nworkforce,” added Mr Chua.\nSiTIZEN  |  11/16\nStudents from SIT’s Sustainable Infrastructure Engineering programme learn more about sustainable construction\nat the Centre\nBaker Tilly TFW treats SIT’s Accountancy undergraduates\nto a visit to the firm, a delicious lunch, and nutritious insights\ninto the Accounting industryOn 14 March 2017, a group of 11 SIT students from the Sustainable Infrastructure Engineering (SIE) programmes,\naccompanied by SIT faculty and staff, visited the Samwoh Innovation Centre in Kranji Crescent. Mr Eric Soh, CEO, Samwoh\nCorporation, had invited the group, giving them the opportunity to tour the company’s facilities where new construction\nrecycling technology is tested and researched.\nThe group included the four recipients of the Samwoh Bursary, which is open to students from the SIE (Land) programme.\nThe Bursary was made possible by a gift from Samwoh Corporation in 2014.\nMr Lee Xiang Han, a Bursary recipient who is from the SIE (Land) programme, had never been to a Research & Development\nfacility and found the visit to be “an eye opener”. Said Mr Lee, “I learnt that it is important to innovate and find creative\nnew ways to keep ourselves sustainable in the field of civil\nengineering and construction. One interesting thing was\nlearning about the recycled rubber material they used to\nconstruct the floor of playgrounds now.”\nMr Nathaniel Soh, a student from the SIE (Building Services)\nprogramme echoed this sentiment. He said, “It was inspiring\nto learn about the innovations by Samwoh. Learning how\nSamwoh recycles and reuses demolished construction\nmaterials has broadened my view of recycling techniques and\navailable materials.”\nEarlier this year, Samwoh decided to nurture even more\nstudents at SIT by making a new gift to support the Samwoh\nCorporation Global Immersion Study Grant and the Samwoh\nCorporation Outstanding Student Award in Civil Engineering.\nSamwoh has also deepened its relationship with SIT through\na Collaboration on Agreement to establish an Industry Lab.\nOn 16 March 2017, Baker Tilly TFW hosted a small group from\nthe Singapore Institute of Technology (SIT) to a small ceremony\nat their office and a sumptuous lunch at a Chinese restaurant\nat the Intercontinental Hotel, which included its scholarship\nand award recipients for Academic Year (AY) 2016/17 as well\nas Prof Tan Thiam Soon, President, SIT.\nThe firm has been a strong supporter of SIT’s Accountancy\nstudents since 2015 when it made gifts to establish the Baker\nTilly TFW Scholarship and the Baker Tilly TFW Outstanding\nAward in Accountancy. Six Scholarships have been awarded\nsince AY 2014/15 to academically promising Accountancy\nstudents and the very first Baker Tilly TFW Outstanding\nAward in Accountancy was presented to Mr Sean Ooi in\nFebruary 2017 at the SIT Graduation Ceremony (see pages 2-3 for more on the Graduation Ceremony).\nMr Ooi, who was present at the lunch, said he was “definitely honoured and humbled beyond words” to have been awarded\nthis accolade. The 24-year old, who will start work as an Audit Associate at a Big Four firm in June 2017, added, “I am\ngrateful to Baker Tilly TFW for this award and hope that it too can be an inspiration for my juniors to strive for excellence.”\nMs Ng Kai Lin, who received the Baker Tilly TFW Scholarship this year and  is expected to graduate in December 2018,\nsaid, “I used to work part-time in my polytechnic days but since university started I couldn’t find the time to work, as the\nworkload was quite heavy. Therefore, with this scholarship I was able to focus more on my studies.”\nShe also found the lunch fruitful as the partners from Baker Tilly were very generous in sharing more about the firm and\nother issues surrounding the accounting industry with the undergraduates. She said, “The different conversation topics\nduring lunch such as quality assurance in educational institutions really helped widen my view about how encompassing\nthis field is.”SIE Students Tour Samwoh Innovation Centre\nMeeting of MindsSIT students get a hands-on learning experience at the Samwoh Innovation\nCentre where they had the opportunity to study recycled materials that can be\nused for construction projects.\n(From left) Partners from Baker Tilly TFW, Ms Susan Foong and Mr Khor Boon\nHong; Baker Tilly TFW Scholarship Recipients, Ms Ng Kai Lin and Ms Jasmine\nChiang; Mr Sean Ooi, recipient of the Baker Tilly TFW Outstanding Student\nAward and Mr Sim Guan Seng, Managing Partner, Baker Tilly TFW.\nSiTIZEN  |  12/16 SiTIZEN  |  13/16\nOn 9 March 2017, SIT alumni were treated to the blockbuster movie, Logan.\nThen on 9 May 2017, they got to enjoy the superhero sequel Guardians of the\nGalaxy Vol. 2. Alumnus Evania Wong Shu Fang, a graduate from the Bachelor\nof Science with Honours in Food and Human Nutrition programme (Newcastle\nUniversity), attended both screenings.\nShe liked that there was a buffet spread, then a drink and popcorn for the\nmovie, as well as a lucky draw. “Overall, the movie night is also a fun way to\nconnect to SIT and my former classmates. I hope that there will be more of\nsuch events in the future,” she said.\nAt the May event, alumnus Wesley Yeo had the opportunity to chat with\nProf Loh Han Tong, Deputy President (Academic) and Provost, about SIT’s\nmove to Punggol. Mr Yeo, who graduated from the Real-time Interactive\nSimulation programme (DigiPen Institute of Technology), said, “I found\nmyself feeling a lot closer to SIT.”\nStress is commonly perceived as debilitating but there are ways to turn it\ninto a positive force by understanding what the stressors are for various\nMyers-Briggs Type Indicator (MBTI) preferences and how each “type”\ncan cope with stress. Mr Charles Sng, who is a certified MBTI practitioner,\nadvised participants to view stressful events as challenging opportunities\nrather than as threats at the Personality Application Workshop: Optimising\nStress on 18 February 2017.\nMr Nur Hidayat bin Tajap, an alumnus from the Bachelor of Engineering\n(Hons) in Naval Architecture (Newcastle University) programme, was\namong the 20-odd alumni and graduating students at the session. He said\nhe will adopt the strategy of “turning to friends and colleagues to come\nup with new solutions” when faced with stress.\nAt the end of the 4-hour session, Mr Chng Bing Han, a graduate from Lean on me – these alumni figure out a way to balance with\ntheir eyes closed, which was one of the activities Mr Charles Sng\nhad them do to find out how they cope with stress. Alumni Movie Nights are just too good to miss.A feast before enjoying Hollywood’s latest hit with popcorn\nand a drink.Ample time to bond as they queue to enter the cinema hall.Mr Chan Wing Leong, Deputy President (Administration)\n& Chief Financial Officer, SIT, (left) in conversation with an\nalumnus.\nAsst Prof Benjamin Soon (extreme right) catches up with\nsome of his ex-students.\nWhile waiting for the movie to start, eager attendees\nfilled up their feedback forms.Collecting movie tickets at the registration counter and dropping off their namecards for a chance to win at\nthe lucky draw.\nCollecting popcorn and drinks for the entire gang!Friendly student hosts ever ready to keep alumni up to\ndate on the latest happenings.\nAll eyes on the big screen as alumni follow Logan’s adventures. Thumbs up for a fruitful afternoon!\nMaking good use of stressRave Reviews for Alumni Movie Nights\nDifferent optimising strategies for various personality typesAudiences give thumbs up for signature events of the SIT Alumni Leisure Network\nAlumni Movie Night: Logan\nFor Ms Theodora Hui Wai Ching, a\ngraduate from the Bachelor of Fine Arts\nin Digital Art and Animation (DigiPen)\nprogramme, Guardians of the Galaxy\nwas her first alumni movie treat. She said,\n“The whole evening was very enjoyable.\nThe movie also involved animation and\nthat is related to my work as a free lance\nartist. If my schedule permits, I’ll be there\nat the next Alumni Movie Night.”\nThe next screening is being planned for\nNovember.\nAlumni Movie Night: Guardians of the Galaxy Vol. 2\nthe Bachelor of Engineering (Hons) in Chemical\nEngineering (Newcastle University) programme,\nrealised the benefits of not “erupting like a\nvolcano” when confronted with a problem. He said\nthat the workshop taught him “how to react to\nstress appropriately”.\nOrganised by the SIT Alumni Career Network in\nMarina Mandarin Singapore, this was the second\nPersonality Application Workshop to take place in\na series of personality workshops that kicked off\nin 2015.\nSiTIZEN  |  14/16\nStudent hosts treated to appreciation brunchThanks for the Support!\nMaking the ‘V’ sign – for ‘volunteering’ perhaps.\nMore than 20 students turned up for a brunch on 25 February 2017 hosted\nby SIT’s Advancement & Alumni Division to thank them for helping to\norganise SIT events – such as the New Alumni Welcome Party in November\nlast year and the Recognition of Excellence held last October.\nAmong those present at Caffe Pralet in trendy Tiong Bahru was Ms Hazel Lim,\na Year 2 student in SIT’s Bachelor of Hospitality Business with Honours\nprogramme. “Being a student host for alumni events has been very beneficial\nand enriching, providing a versatile platform for me to contribute back to\nSIT in different ways,” she said, adding, “Also, it enabled me to expand my network of connections, and foster new\nfriendships.”\nMr Chad Lester Chen Xuan, a Year 3 student\nfrom SIT’s Bachelor of Accountancy with\nHonours programme, helped out at the\nNew Alumni Welcome Party in November\nlast year.\nHe said, “It’s amazing to be able\nto reconnect with friends who have\ngraduated and celebrate with them as\nthey start the next stage of their lives.”\nGood company, good food – all that’s needed for a\nmemorable brunch.\nSiTIZEN  |  15/16\nA Better Florist\n• 20%  off total bill at www.abetterflorist.com\n• Key in the code ‘ABFSIT20’  at checkout\n• Valid until 16 Aug 2018\nAngelFlorist Services\n• 10%  discount with a minimum purchase of $80\n• Key in the code ‘SIT2016’  at\nwww.angelflorist.com\n• Valid until 31 July 2017\nBi Bing Korean Dessert Café\n• 10%  off total bill\n• Valid until 1 June 2017\nCharles & Keith\n• 10%  off regular items\n• Use code: SIT10OFF2017  at checkout\n• Participating outlets: All except Changi Airport\nTerminals 1, 2 & 3\n• Valid until 31 December 2017\nCity Music\n• 15%  off all regular priced items\n• Valid until 9 October 2017\nClubvivre\n• $50 off on all online bookings\n• Key in the code ‘CVSIT2016’  at\nwww.clubvivre.com\n• Valid until 15 July 2017\nContactLens.sg\n• 15%  off all contact lens with\na minimum of $40 spent\n• Use code: SingTech2017  at checkout\n• Valid until 31 December 2017\nContiki Holidays\n• Additional 5% off to be used with standard\nContiki brochure discounts\n• Use code: UNISIT5\n• Valid until 30 June 2017\nCrunchie Cookies\n• $2 off every $30 spent for cookies\n• Valid until 1 October 2018\nDOJO\n• 50%  off second burger set\n• Valid until 31 December 2017SIT Alumni Card Benefits\nDr. Chen’s Tea Products\n• 10%  off all Dr. Chen’s products\n• Free delivery to designated places for\npurchases above $100\n• Valid until 7 December 2017\nEye Look Good\n• 10%  off total bill with no minimum spending\nat www.eyelookgood.com\n• Valid until 31 October 2017\nFloral Garage Singapore\n• 10%  off total bill at www.floralgaragesg.com\n• Key in the code ‘SIT010’\nGifts Less Ordinary\n• 5% off any purchase at http://giftslessordinary.com\n• Valid until 1 June 2017\nGlacier Frozen Yogurt Café\n• 10%  off on all food products\n• Valid until 1 June 2017\nHipVan\n• 10%  off bill at www.hipvan.com\n• Use code ‘10SIT’  at checkout\n• Valid until 1 June 2017\nIntune Music\n• 10% off course fees for first 3 months\n• Waiver of administrative fees\n• Valid until 1 April 2018\nKF1 Karting Circuit\n• $22 (non-peak)/ $28 (peak) for 30kph\n• $28 (non-peak)/ $35 (peak) for 50 kph\n• Book at http://kf1karting.com/kf1-events/\n• Valid until 31 December 2017\nKitchen Capers\n• 10% off bakeware tools/packaging\nneeds/books/DVDs\n• 5% off food/ingredients\nKK Day\n• 5% off KKDay travel experiences\n• Use code: KKDAY SIT 5 prior to checkout\n• Valid until 31 December 2017\nMad About Comedy\n• $10 per entry for monthly events• Location: 69 Circular Road\n• Valid until 31 December 2017\nQQ Rice\n• 10%  off on Oat Rice, Rice Roll, Snack Rolls,\nWholemeal Sandwich, Bento Box\n• $5 Value Set for Oat Rice/Rice Roll + Standard Drink\n• $6 Value Set for Bento Box + Standard Drink\n• Valid until 31 December 2017\nSharetea\n• 10%  off all regular priced items\n• Valid until 15 June 2017\nShopBack\n• $10 Benefit\n• Up to 18%  Cashback when shopping\nwith selected partners\n• Visit www.shopback.sg/  for more details\nSunlife Durian Puffs & Pastries\n• 10%  off total bill\n• Participating outlets: Causeway Point\nShopping Mall, 333 Coffee Shop\n(Blk 136 Bedok North Avenue 3)\n• Valid until 31 July 2017\nThe Braces Practice\n• Discounted rates for various braces options\n• Valid until 14 June 2017\nTHHG\n• 20%  off across 3 THHG properties on\nall room types\n• Key in the discount code “SITreats20”\nTotally Hot Stuff\n• 10% off total bill\n• Valid until 30 April 2018\nXorex Press Pte Ltd\n• $8 for A2 poster with mounting\n• $16 for A1 poster with mounting\n• Valid until 1 March 2018\n*Please present your SIT Alumni Card prior to making\npayment. Terms and conditions apply. Please refer to\nhttp://sl.singaporetech.edu.sg/Welfare/SITreats.aspx\nfor detailed terms and conditions.She is in an excellent position to score and her opponents know it. Alumni and students got to ‘rock and roll’ on the futsal pitch.\nThankfully, the rain stopped and about 50 alumni and\ncurrent students took to the pitch at SIT@Dover to show\noff their futsal skills on 25 March 2017. From about 4 pm\nto 5:30 pm, the teams tried their best to outdo their\nopponents. Goals were celebrated with high fives. Near-\nmisses were agonised over.\nMr Muhammad Naim bin Manan, who graduated last\nyear with a degree from the Bachelor of Engineering\nwith Honours in Mechanical Design and Manufacturing\nEngineering programme (Newcastle University) came to Futsal Fun  Alumni and students got together on a Saturday\nafternoon for some friendly dribbling\nmeet former classmates. He said, “Since the futsal session\nwas organised by SIT, it made it easier for us to get together\nas we all knew about it in advance.”\nLike many, Mr Loh Chee Oon came to the Alumni Futsal\nSession to make new friends and to get some much-needed\nexercise. When asked if the 2016 graduate of Newcastle\nUniversity’s Bachelor of Engineering with Honours in\nMechanical Design and Manufacturing Engineering\nprogramme is looking forward to the next alumni event,\nhe said, “Yes, because I’m sure it will be fun!”"
}