{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-12.pdf",
  "type": "pdf",
  "content": "SIT Hosts SAF Day\nHats off to the Class\nof 2016!\nBuilding Friendships\nat SIT Student Orientation\nCommitted Donors\nTake Initiative to Engage SIT Students\nFaculty & Staff Get\nto Meet SIT Bursary Recipients\nLearning to be\nFinancially Literate\nSITizen Wins\nSingapore’s First Ever Gold at Cannes Young Lions\nLet Them Eat (And\nBake) Cakes\nFloored by FunOnce a SiTizen, Always a SiTizen ISSUE NO. 12   |  AUGUST 2016\nDear SIT Alumni,\nWhen SITizens come together…\nHappy things happen when SITizens come together, and they are continuing to do so,\nthough not just at the important rites of passage such as the graduation ceremonies (Wheelock College, The Glasgow School of Art and Technical University of Munich), or the fun-ﬁ  lled SIT Student Orientation.\nIn June, Ms Ong Wen Hui, an alumnus from the Bachelor of Science (Hons) in Food & Human\nNutrition (Newcastle University) degree programme, once again led the SIT Alumni Leisure Network’s Sweet Creations baking workshop. Thanks to her, 22 alumni were able to create their very own Chocolate Arc-En-Ciel cakes and Maple Walnut Cheesecakes.\nThen, on a beautiful Thursday in July, SIT Faculty and Staff gathered for the third SIT Faculty\n& Staff Giving roadshow in support of the SIT Bursary. Thanks to faculty and staff donors, 18 SIT Bursaries had already been made possible for ﬁ  nancially disadvantaged students in\nAcademic Year 2015/16. At the third roadshow, the donors were ﬁ  nally able to meet some of\nthe bursary recipients over a light breakfast. Said Assoc Prof Malcolm Low Yoke Hean, who is also Programme Director, Infocomm Technology, “I am glad that these bursaries are helping our needy students to continue their studies without which they may have to work part-time or quit school altogether.”\nSIT students are also getting tender loving care from the external community of donors who\nsupport non-bonded scholarships and bursaries at SIT. Some of these thoughtful donors have been taking the initiative to organise gatherings to engage the scholarship and bursary recipients and other SIT students. At these events, the students ﬁ  nd valuable industry and\ncareer insights, and perhaps even a door open to internships and job opportunities. Said Mr Ko Oen Tjiang, Chairman, Singapore Leong Khay Huay Kuan, “We want to do more for needy students at SIT and want to ﬁ  nd out from the students how else we can help them.”WHAT’S\nHAPPENING\naround our little\nbig campus\nSITizen is a publication by the\nSIT Advancement & Alumni Division.For enquiries, please e-mail us at Alumni@SingaporeTech.edu.sg© Singapore Institute of Technology 2016\n© Singapore Institute o f Technolo gy 2016SIT Bursary recipient Victoria Goh explaining to a\nstaff member how the bursary has helped her.\nWe are extremely delighted to note that SITizens\nhave not been left behind in this season for winning gold. The Olympics aside, Ms Christine Lim, alumnus from the Bachelor of Arts (Honours) in Communication Design (The Glasgow School of Art) degree programme, bagged Singapore’s ﬁ rst Gold at the Cannes Young Lions in June 2016.\nA Junior Art Director at advertising ﬁ  rm DDB,\nshe and a colleague created a cyber campaign entitled “Break the Silence” so as to mobilise and empower women to report sexual violence. Turn the pages, and you will ﬁ  nd more details of her\ngolden achievement inside.\nWe hope you will enjoy reading this issue of SITizen. Should you wish to contribute a story, do drop us a line at Alumni@SingaporeTech.edu.sg\nSiTIZEN  |  02/12\nParticipants reaffirming their commitment to the defence of the nation at the\nSAF Day Combined Rededication Ceremony (West Zone) at the Singapore Institute of Technology.On 1 July, more than 400 guests, including 240 NSmen\nfrom 31 participating companies and organisations, joined SIT staff and students for this year’s SAF Day Combined Rededication Ceremony (West Zone). The Singapore Institute of Technology (SIT) organised and hosted this year’s ceremony, and once again welcomed guests to SIT@Dover, where the 2015 ceremony was co-organised with ST Marine.\nOfficiated by Ms Grace Fu, Minister for Culture, Community\nand Youth, the event was supported by the Naval Diving Unit, Republic of Singapore Navy and Ministry of Defence (MINDEF). In her opening address, she connected with the audience, especially NSmen, by showing slides of her personal experiences with the army – including her camp visits during her son’s national service stint.\nMs Fu also awarded tokens of appreciation to participating\ncompanies before the recitation of the SAF Pledge, which was led by MAJ(NS) Kelly Koh (789th Battalion, Singapore Infantry Regiment), who is also Director, Admissions, at SIT.\nThe ceremony provided an excellent opportunity for\nNSmen to reaffirm their commitment to the defence of the nation, as well as for civilians to express their support for the SAF.For Mr Muhammad Hanzalah bin Mazlan, his Systems\nEngineering (ElectroMechanical Systems) course at SIT was among the ﬁ  rst to commence in the 2016 Academic\nYear, so he was one of the 175 freshmen at the SIT Student Orientation held on 25-26 June 2016. With him, were ‘Freshies’ from The Culinary Institute of America, SIT-DigiPen Systems Engineering (ElectroMechanical Systems) degree programme, Technical University of Munich and Wheelock College. Then there were 50 student organisers and 43 student facilitators, and what a great time they all had.\nNetworking was Mr Muhammad Hanzalah’s main objective.\nHe said, “Orientation camps such as this allow me to make friends from those in my faculty as well as those studying other disciplines.”\nHe planned to build a network and he achieved it. Now\nhe and his new buddies are messaging each other on WhatsApp all the time. He said, “We’re also doing BBQs and other bonding sessions. If given the opportunity,\nI would like to know the rest of the campers at the Orientation Camp as well.”\nAs in the past SIT Orientation Camps, participants were\ndivided into four groups bearing the names of mythical creatures: Gryphon, Hydra, Pegasus and Phoenix. Members of the groups then went through several activity stations around the SIT@Dover campus that allowed them to learn about SIT-DNA, the importance of teamwork, communication, and strategic planning, with the assistance of the student facilitators.\nMr Muhammad Hanzalah does not know how he ended up\nwith the Best Camper Award. He said, “I’m not really sure, but I did my best at everything. Literally, at everything.”\nHe was won over by the concept of the SIT-DNA and said\nhe would love to learn more about it and go through it as well. “Whoever invented it is a genius,” he said.\nSIT Hosts SAF\nDay Ceremony\nGood teamwork will ensure a good catch every time.\nGryphon won the coveted Winning Empire award.\nCreating windows of opportunity for friendship at\nthe 2016 SIT Student Orientation.\nGetting to Know\nEach OtherNew students from CIA, SEEMS, TUM, and\nWheelock strike up friendships at the SIT Student Orientation\nSiTIZEN  |  03/12\nDr Markus Waechter, Managing Director, TUM\nAsia (left-foreground) and Prof Loh Han Tong, Deputy President (Academic) & Provost, SIT (right-foreground) at the MOU signing, witnessed by Prof Wolfgang A. Hermann, President of the Technical University of Munich (left-background) and Dr Michael Witter, Ambassador of the Federal Republic of Germany (right-background).International automotive supplier and technology company Continental\nsigned a Memorandum of Understanding (MOU) with the Singapore Institute of Technology (SIT) on 26 July 2016 to support the latter’s Bachelor of Engineering with Honours degree programme in Telematics (Intelligent Transportation Systems Engineering). This new degree programme, which starts in August 2016, is the ﬁ  rst of its kind offered in Singapore and the\ncollaboration with a local university is also Continental’s ﬁ  rst.\nStudents in SIT’s Telematics degree programme will gain intimate knowledge\nof operational working conditions in leading-edge and telematics-driven c o m p a n i e s  s u c h  a s  C o n t i n e n t a l ,  a n d  w i l l  a l s o  b e  b e t t e r  a b l e  t o  r e s p o n d  a n d  d e a l  w i t h  c h a l l e n g e s  i n  d e v e l o p i n g  n e w  ca p a b i l i t i e s  i n  m o r e  e fﬁ  cient\ntransport systems, vehicular communications technologies, smart mobility and connectivity devices.\nContinental Automotive Singapore is one of the contributors for the\ndevelopment of the programme’s curriculum and Continental will also assist SIT’s teaching staff in the course instruction as adjunct lecturers.\nMr Lo Kien Foh, Managing Director of Continental Automotive Singapore,\nand also one of the Industry Advisory Committee members at SIT, said, “I am sure the programme will give both Continental and SIT an excellent platform to cross-fertilise and exchange ideas, knowledge, innovations, ITS operational concepts and best in industry practices in telematics technologies. I am conﬁ dent the course will equip graduates with a well-rounded engineering\ncapability and much needed hands-on experience to make them industry-ready for the Smart Nation.”\nProf Loh Han Tong, Deputy President (Academic) & Provost, SIT said, “As\na university of applied learning, we ensure that our degree programmes are i n d u s t r y - f o c u s e d  a s  w e l l  a s  t a i l o r e d  t o  m e e t  c r i t i c a l  m a n p o w e r  d e m a n d s  i n  Singapore. With the launch of Smart Nation and Smart Mobility 2030 initiatives, together with the successful bid for ITS World Congress 2019, the ﬁ  eld of\ntelematics and ITS in Singapore is expected to accelerate in the coming years.”\nHe said that the Telematics programme will pave the way for students to\nbecome deep specialists in the relevant areas of vehicle communication and information processing. “Students will go through rigorous academic training while having an eight-month Integrated Work Study Programme (IWSP) with MNCs such as Continental,” he added.\nIn addition to signing the MOU, Continental together with its Intelligent\nTransportation Systems (ITS) Lab partners, A*STAR’s Institute for Infocomm Research (I²R) and Technische Universität München (Technical University of Munich, TUM CREATE), also launched the new Park&Go @SG iOS parking app and the enhanced Android version.\nJoint Lab to Promote\nEntrepreneurship in Telematics\n(From left) Prof Loh Han Tong, Deputy President (Academic) & Provost, SIT; Mr Ralf Lenninger, Senior Vice\nPresident of Interior Electronics Solution, Continental; and Mr Lo Kien Foh, Managing Director of Continental Automotive Singapore at the MOU signing.\nThe Singapore Institute of\nTechnology (SIT) has also signed a Memorandum of Understanding (MOU) with TUM Asia on 22 June 2016, to work towards setting up a joint laboratory for the BEng (Hons) in Telematics (Intelligent Transportation Systems Engineering) degree programme and to garner support from the industry.\nOfficiated at the residence of\nthe Ambassador of the Federal R e p u b l i c  o f  G e r m a n y ,  t h e  M O U  inks SIT and TUM Asia’s intention to work together in promoting entrepreneurship in the field of telematics, as well as offer training, mentorship, incubation and funding support for aspiring entrepreneurs and startups.\nWith the announcement of\nSingapore’s goal to become the world’s first Smart Nation, this three-year-eight-month degree programme will pave the way for students to become deep specialists in the relevant areas of vehicle communication and information processing that are much needed in the industry to support this vision. Students will go through rigorous academic training by highly qualiﬁ  ed professors, while\nhaving an eight-month work study stint with established organisations such as Land Transport Authority,ST Electronics, NCS and MNCs like Continental Automotive Singapore.New collaborations to prepare students of this programme, the first of its kind in Singapore, for future\ndemands of a Smart Nation SIT’s New Telematics Programme Gets Support\nfrom Continental, Joint Lab with TUM Asia\nThe graduation ceremony for the Bachelor of Arts (Hons)\nin Communication Design and Bachelor of Arts (Hons) in\nInterior Design programmes of The Glasgow School of Art\n(GSA) was naturally designed to impress, and it surely did\nwith bagpipes and the Scottish flair for celebrations.\nThe 117 graduands had eagerly gathered at the Temasek\nPolytechnic Auditorium on the auspicious day of 12 July\n2016. Their graduation ceremony followed a week-long\nexhibition of their final-year works at The GSA Degree\nShow 2016 at DECK.\nWhen it came to time to hand out the commendations, the\naward for the Highest Academic Achievement in Studio\nfor Communication Design was won by Mr Muhammad\nFariz Bin Junaidi, while the Communication Design Prize\nfor Sustainability went to Ms Abigail Lim Chia Khim Hoon.\nWinner of the award for Outstanding Contribution to\nStudent Life for Communication Design was Ms Crystal\nTeo Min Yi.\nFor the Interior Design cohort, the award for the Highest\nAcademic Achievement in Studio for Interior Design was\nwon by Ms Pauline Khoo Peng Ying; the Interior Design\nPrize for Sustainability was awarded to Mr Chang Yuhui,\nand the award for Outstanding Contribution to Student\nLife for Interior Design went to Mr Jonas Liang Qing’An.Thoughts on their future were on the minds of many of\nthe graduands. Asked about the best design advice she\nhad received, Ms Abigail Lim had quoted philosopher\nHenry David Thoreau’s famous line, “Go confidently in the\ndirection of your dreams, live the life you have imagined.”\nAs part of the ceremony, Mr Graham Berry, former Chief\nExecutive Officer of the Scottish Arts Council, was made\nan Honorary Graduate. Also attending the ceremony were\nAssoc Prof Ivan Lee, Vice President (Industry & Community),\nSIT and Mr Tsoi Mun Heng, Vice President (Planning), SIT.It was a joyous occasion for all at the Technical University\nof Munich (TUM) Graduation Ceremony, especially for\nthe 48 graduates of the Bachelor of Science in Chemical\nEngineering programme, and the 30 who obtained their\nBachelor of Science in Electrical Engineering & Information\nTechnology (EE&IT) degrees.\nFor the EE&IT cohort, the Best Student Award went to Mr Lim\nZi Hui, the Best Thesis Award to Mr Tan Hong Yong, and the\nfirst-ever Rohde & Schwarz Award to Ms Jolie Lim Yanting.\nMs Rosmalinda Tay Yan Ting won the Best Student Award\nin Chemical Engineering while Mr Lee Yongqing was\nrecognised for writing the best thesis.\nMs Tay, the Valedictorian, had found her degree programme\nto be very challenging.\nIn her speech she recalled, “Heading back to school after\nbeing in the working industry for approximately four years\ncan be rather intimidating. I have to admit, having a schedule\nof 9 to 6 on a daily basis for the first few weeks of the course\nwas very intense. Just five weeks into our first semester, we\nhad our very first examination. Trust me, dark circles under\nthe eyes were a fashion statement then.“\nShe added, “Due to the fast-paced and intensive block\nteaching style that we underwent for the past two and a\nSiTIZEN  |  05/12 SiTIZEN  |  04/12 SiTIZEN  |  05/12\nHats off to the Class of 2016\nThe Glasgow School of Art Graduation\n12 July 2016A total of 63 students graduated with a Bachelor of\nScience (Hons) in Early Childhood Education degree from\nthe Wheelock College programme at SIT in June. This was\na massive increase from the 37 graduates last year.\nTaking the honours for 2016 were Ms Roxanne Theng, who\nreceived the award for the Most Significant Contributions\nto the Programme, while Ms Angela Rose Castenada\nclinched the Academic Achievement Award.Wheelock College Commencement Ceremony\n15 June 2016Technical University of Munich Graduation Ceremony\n22 July 2016New cohorts of graduates celebrate their success with eyes\nfirmly on the future and bursting with determination to make\ntheir mark in fields ranging from art to early childhood education\nto engineering.\nNew TUM graduates are determined to excel.\nArmed with their degrees, these GSA graduates are ready to prove their worth.Wheelock College’s new graduates are all ready to make a difference in early\nchildhood education.\nhalf years, we toughened up, adapted and mastered the\nart of absorbing knowledge in a short amount of time.\nPersonally, these are a set of skills that I know will be useful\nin the future.”\nShe is now planning a career in lab work in the personal care\nsector, and hoping to create skin lotions and hygiene products.\nGuest of honour at the ceremony was Dr Michael\nWitter, Ambassador of the Federal Republic of Germany\nto Singapore. Prof Loh Han Tong, Deputy President\n(Academic) & Provost, SIT and Mr Tsoi Mun Heng, Vice\nPresident (Planning), SIT, also attended the ceremony.In her valedictory speech, Ms Castenada told her peers:\n“We can leave this hall and have a chance to do something\ngreater in our lives.“\n“We can do so many things, you guys. We can advocate for\nthe rights of preschool teachers. We can expel curriculums\nthat promote worksheets and only worksheets. We can\nexcel at pushing writing workshops to all kindergartens in\nSingapore. We can be the factor, the undeniably powerful\nmissing piece that can finally change the entire prospect of\nour local early childhood sector.”\nShe ended her address on a resounding note with this\ndeclaration: “Receiving our degrees is not the end of our\njourney, in fact – it has only just begun.”\nGracing the event held at SIT@Dover were Prof Tan\nThiam Soon, President, SIT; Ms Jackie Jenkins-Scott,\nPresident, Wheelock College; and Ms Linda Davis, Dean\nfor International Programs and Partnerships at Wheelock\nCollege, together with other faculty members, and families\nand friends of the graduating students.\nIt was the last commencement ceremony President\nJenkins-Scott would preside over. She was retiring at the\nend of June. In a special tribute, students carrying rainbow-\ncoloured balloons sang “Somewhere Over the Rainbow”\naccompanied by four students playing the ukulele.\nOver the past week, I’ve\nhad many conversations\nwith our friends from\nclass. Their future plans\nranged from teaching in\na special needs school,\nto doing research work\non pre-school education,\nto even working in\nschools in low-income\nneighbourhoods. While\nour interests are pretty\ndiverse; there’s a central\ntheme in their plans –\nthat is to mould the lives\nof children.\n– Ms Angela Rose Castenada,\nValedictorian, BSc (Hons) in Early\nChildhood Education (Wheelock College)I would like my\nfuture designs to\nbe able to have\na positive impact\non the community,\nand I also intend\nto further my\neducation with a\nMasters.\n– Ms Pauline Khoo,\nHighest Achievement\nin Studio for Interior Design,\nBA (Hons) in Interior Design\n(The Glasgow School of Art)As you prepare\nto enter the next\nphase of your life,\nremember that as\ngraduates of TUM,\nwhat makes us stand\nout is our ability\nto adapt and excel\nregardless of the\nenvironment we find\nourselves in.\n– Ms Rosmalinda Tay Yan Ting,\nValedictorian,\nBSc in Chemical Engineering\n(Technical University of Munich)\nSiTIZEN  |  06/12\nFor some committed donors of bond-\nfree scholarships, philanthropy does not stop with making a gift to support a bursary or scholarship at the Singapore Institute of Technology (SIT). In recent months, these thoughtful donors have taken it upon themselves to hosting lunches and gatherings to further engage SIT undergraduates.\nThe Singapore Leong Khay Huay Kuan,\nwhich made a gift to establish the Singapore Leong Khay Huay\nKuan Bursary  at SIT in 2015, held a\ngathering for its leaders and bursary recipients on 14 May 2016. The clan association also invited its bursary recipients from various institutions (including SIT students) to its Double Celebration dinner on 18 June 2016.\nMr Ko Oen Tjiang, Chairman, Singapore\nLeong Khay Huay Kuan, said he was touched by the thoughtfulness of the gesture from SIT students when they presented him with a handwritten thank-you card at the May gathering. He added, “We want to do more for needy students at SIT and want to ﬁ nd out from the students how else\nwe can help them.”\nSaid Ms Neo Miao Lin, a recipient of\nthe Singapore Leong Khay Huay Kuan Bursary, who attended both events and even performed at the dinner with Thoughtful donors are taking the initiative to engage bursary and\nscholarship recipients at SITPartners in\nPhilanthropy\nher fellow SITizens, “It was a good\nopportunity to get to know the other bursary recipients and work together as a team to put up the performance.”\nSimilarly, Baker Tilly TFW LLP held a\nscholarship ceremony and lunch on 22 June 2016 for the three recipients (for Academic Year 2015/16) of the Baker\nTilly TFW Scholarship , which was\nestablished to support Accountancy students at SIT. Mr Sim Guan Seng, Managing Partner, Baker Tilly TFW LLP , said, “We are very glad to be able to share our industry experience with the Scholarship recipients and also provide advice on how they can develop their future careers in the Accountancy ﬁ  eld.”\nRecipients of The Applied Materials\nBursary  were invited to the ofﬁ  ces\nof Applied Materials South East Asia Pte Ltd to have tea where Mr Russell Tham, President, Applied Materials (South East Asia), shared with them his experiences of the high-tech industry. “Our hope is for the bursary recipients to use their learnings to contribute to the society by solving real-world problems in creative ways through engineering,” said Mr Tham.\nAnother SIT donor, Mr Kelvin Wong,\nSales Director, McLink Asia Pte Ltd,thought it important that he encourage (From left) Partners at Baker Tilly: Mr Khor Boon Hong,\nMr Joshua Ong; scholarship recipients Mr Tan Yi Ming, Ms Levina Aw, and Ms Joanne Tang; Mr Sim Guan Seng, Managing Partner, Baker Tilly and Mr Joseph Toh, Partner, Baker Tilly.\nMr Kelvin Wong (third from left), Sales Director, McLink Asia Pte Ltd, together with SIT students: Mr Christopher Wong, Ms Chiam Hui Cheang, Mr Kelvin Wong, Mr Law Kiang Hong, Mr Han Wei Chou and Mr Teo Poh Seng.SIT students seized the opportunity to put on a\nperformance at the Singapore Leong Khay Huay Kuan Double Celebration on 18 June 2016.\nnot only the selected McLink\nScholarship  recipient, but also the\nother four shortlisted applicants. He hosted the students to dinner on 17 May 2016 and said, “It must be challenging to manage school, family and ﬁ  nancial difﬁ  culties and I wanted\nthem to persevere. It was an awesome experience speaking to them and I learnt a lot from their sharing.”\nFor the students, these get-togethers\nare providing them with valuable career and industry insights.\nMs Chiam Hui Cheang from the\nBEng (Hons) in Information and Communications Technology (Software Engineering) degree programme (SIT), said she was inspired by the conversation during the dinner with McLink’s Sales Director.  “Mr Wong shared that having a disadvantage at the starting line does not equate to losing the race,” the McLink Scholarship recipient recalled. “It is up to us to ﬁ  ght against the storm, turning\nadversities into opportunities.”\nMs Yvonne Lee, Senior Director at Applied Materials\n(second from left), and bursary recipient Mr Jonathan Lim (second from right) accompanied by SIT staff.\nSiTIZEN  |  07/12\nSIT faculty and staff taking time off their busy schedules to support the SIT Bursary.\nSITizens going for the special otak otak-youtiao sandwich,\nwhich was created just for the SIT Bursary roadshow.\nSIT Bursary recipients get a chance to interact with\nProf Tan Thiam Soon, President, SIT (fourth from right).\nSITizens making full use of the opportunity to mingle.\nBrewing support for the SIT Bursary programme.It was a meeting of hearts – and a generous sharing of ﬁ  nancial resources –\nas faculty members and staff of the Singapore Institute of Technology (SIT) gathered on a beautiful Thursday morning at SIT@Dover to mingle with SIT Bursary recipients.\nThey had turned up at the University Tower foyer at SIT@Dover for the third\nFaculty & Staff Giving roadshow, which was held on 28 July 2016 in support of the SIT Bursary. And as they met, it was evident that faculty and staff attendees were very pleased at how these bursaries were helping to nurture the bursary recipients.\n“I am glad that these bursaries are helping our needy students to continue\ntheir studies without which they may have to work part-time or quit school altogether,” said Assoc Prof Malcolm Low Yoke Hean, who is also Programme Director, Infocomm Technology.\nIntroduced in November 2015, the Faculty & Staff Giving initiative provides\nan opportunity for SIT faculty and staff to invest in the future of ﬁ  nancially\ndisadvantaged students by supporting the SIT Bursary – in other words, it is an initiative that is for SITizens, by SITizens.\nLast year, thanks to collective gifts made by SIT faculty and staff (and many\nof these were made as recurrent gifts through monthly payroll deductions), the University was able to award an additional 18 SIT Bursaries for deserving students in Academic Year 2015/16. Valued at $3,000 each, this is a bursary that is applicable to students (Singapore Citizens and Permanent Residents) who come from households with a per capita income of no more than $850.\nOne of the most accessible student ﬁ  nancial aid instruments made available at\nSIT, the SIT Bursary can help cover some of the recipient’s academic expenses, which range from $13,380 to $28,250 (taking the example of a Singaporean student paying subsidised fees) in the current Academic Year of 2016/17. Every gift is invaluable, as the latest statistics for AY 2016/17 show that 47% of students at SIT would require ﬁ  nancial aid.\nMr Khaleef Mun Seng, a second-year student from the Information and\nCommunications Technology (Software Engineering) programme, received the SIT Bursary in AY 2015/16. He said, “The bursary allowed me to focus on my studies without having to worry about school fees and daily expenses. It was a great help.”\nAlso supporting the initiative was alumnus Ms Sharlene Sou, a graduate of\nthe Bachelor of Science degree in Hotel Administration (University of Nevada, Las Vegas) in 2013. She runs the CoffeeSou coffee catering business and as in the ﬁ  rst roadshow, was on hand\nto provide a steady ﬂ  ow of piping-\nhot coffee and tea that went down well with the youtiao and otak-otak “sandwich” that was specially created for the roadshow.\nThe bursary recipients were touched\nby the friendliness and generosity of the faculty and staff at the Roadshow. Ms Victoria Goh, who is in her second year in the Bachelor of Accountancy (Hons) programme, said, “They were really concerned about my welfare and even provided advice on how I could manage my studies. They were also most willing to share their learning experiences and provided me with much encouragement.”\nFaculty and staff gather to support SIT Bursary over a light breakfast shared with bursary recipientsFor SITizens, by SITizens!\nMs Christine Lim, alumnus from the Bachelor of Arts (Hons) in Communication Design (The Glasgow School of Art)\ndegree programme, bagged Singapore’s ﬁ  rst Gold at the Cannes Young Lions in June 2016. A Junior Art Director at DDB,\nshe worked with her colleague, Ms Joanna Ortega, to develop a cyber campaign entitled “Break the Silence” in response to a brief to mobilise and empower women to report sexual violence throughout the world.\nWith only 12 hours to work on the brief\nand based on the insight that most victims actually know their perpetrator, the pair created a safe and anonymous way for women to report sexual violence and receive specialised help by riding on the “Report a Problem” button found in most social media platforms.\n“We were quite anxious as we don’t know\nwhat to expect. Despite the pressure at that point of time, I enjoyed the friendships forged from the competition,” said Ms Lim about her experience in Cannes.\nShe added, “Winning the Gold is an\nencouragement and recognition of the effort we put in this competition. It has also given us the chance to meet and receive advice from some of the industry’s most recognised. Most importantly, I think it has given us a platform to do greater works in future.”\nA screenshot from the campaign – breaking the silence, with a touch of a button.SiTIZEN  |  08/12\nAlumnus Christine Lim helps women “Break the Silence” on sexual violenceSingapore’s First Ever Gold at\nCannes Young Lions\nFirst gold for Singapore at the Cannes Young Lions. From left: Ms Frances Koh, Vice President of Trade Marketing and Communicat ions, Mediacorp; Ms Joanna Ortega,\nJunior Copywriter, Ms Christine Lim, Junior Art Director, and Mr Joji Jacob, Group Executive Creative Director, all from DDB Gr oup Singapore.\nA fun but also painful lesson learnt at the Financial\nLiteracy workshop organised by the SIT Alumni Career Network in July 2016.\nManaging money matters in today’s\ncontext can be a perplexing task, so 22 alumni attended the Financial Literacy Workshop to get to know the ropes for good ﬁ  nancial management.\nOrganised by the SIT Alumni Career\nNetwork at M Hotel on 30 July 2016, the workshop covered topics ranging from personal ﬁ  nance and\ndebt management to investment strategies. Participants learnt about the importance of budgeting and distinguishing ‘needs’ from ‘wants’, sound retirement planning, buying the right insurance policies, and how to cope with the rising cost of healthcare.\nIn addition, they were taught how to\ncalculate the true cost of credit card interest charges and hire purchase plans, as well as the measures to adopt to protect online ﬁ  nancial transactions.Then it was time for the Praxis\nFinancial Board Game which provided a simulation of the ﬁ  nancial world\nwhere they had to make decisions and manage their ﬁ  nances to survive the\nups and downs of the economy.\nParticipants also took part in role play\nexercises that demonstrated the wisdom of ‘Save First, Then Spend’, and the dangers of borrowing from loan sharks.\nMs Afroseparveen Abdul Salam,\nwho graduated in June 2016 with a Bachelor of Science degree in Food & Human Nutrition (Newcastle University), said that the workshop, made her realise that she had to think long term. She said, “I intendto plan a budget to manage my daily expenditure so I can start setting money aside every month to ﬁ  nance\nplans in the future.”Money, Money, Money, it’s a Financially Literate Man’s World\nMs Crystal Teo who graduated recently from the Bachelor of Arts (Hons) in\nCommunication Design (The Glasgow School of Art) has always been fascinated with maps. “My father is an architect and I would see his drawing plans lying around at home. My grandfather also had a map of 1954 Singapore and this looked completely different from the map of Singapore you would see today.”\nIt is no surprise then that both her 10,000 word dissertation and submission for her\nﬁ nal year project focused on maps and what they signify. Both were on display at\nThe Glasgow School of Art (GSA) Singapore Degree Show which ran from 8 to 15 July at DECK.\nMs Teo had chanced upon a series of Singapore maps at an exhibition at the\nNational Library and this prompted her to research further on the effects that these maps, designed by the British colonial powers, had on Singapore society even after independence.\n“To help us with our essays, my lecturer actually arranged for a consultation session\nwith the Centre for Communication Skills. They helped me by going through my paper and making the introduction stronger,” said Ms Teo. “My classmates and I deﬁ  nitely beneﬁ  tted from this\nsession with CCS. It might even be useful to have a writing module.”SiTIZEN  |  09/12\nA few tips from SIT’s Centre for Communication Skills did a lot of good for\nrecent graduate Ms Crystal Teo in her dissertation on colonial mapsPutting the Subjectivity of Maps into Words\nCentre for\nCommunication Skills Survey\nThe Centre for Communication\nSkills (CCS) at SIT wants to hear from alumni like you regarding your communication needs in the workplace.\nGet a chance to win $10 Starbucks\ngift cards when you take part in a survey for CCS .\nCCS offers services to help\nstudents at SIT develop their English\nlanguage and communication skills to meet the demands of their University studies and professional work. It offers one-to-one consultations for all students who need assistance with their assignments.\nThe survey results will be used\nto create a proﬁ  le characterising\nworkplace communication needs and associated barriers facing new graduates at the industry-entry level within the Singapore context in the 21st century.\nRespond to this survey now (it\nshould take less than ten minutes to complete):\nhttp://goo.gl/forms/JDJGmuU0dtHqGMwk2Alumni get together at the Financial Literacy Workshop and learn to avoid pitfalls when managing their money\n“It might be play money but we’re feeling rich!”\n“Of Real and Imagined Places” – Ms Crystal Teo’s\nsubmission for her ﬁ  nal project played on the\nthemes of disorientation and conﬂ  icting views of the\nSingaporean identity.\nThe 22-year old is currently working for\nWY-TO Architects in Singapore and is hoping to pursue her part-time Masters programme with GSA where she hopes to continue her research on print culture in Singapore. “I realised when I was writing my dissertation that I am really into research on material culture like maps and map design. So I hope to look at print culture in Singapore in the colonial period,” she said.\nAt the fully subscribed Sweet Creations II, alumni learn to bake\ntwo new cakes from alumnus Ms Ong Wen Hui, who also facilitated the ﬁ rst Sweet Creations WorkshopLet Them Eat Cake\nThe ﬁ  rst Sweet Creations workshop held in June 2015 proved to be such a hit\namong alumni that a second baking workshop – Sweet Creations II – was held on 18 June 2016 at Creative Culinaire, a baking school in the Tiong Bahru area. Twenty-two alumni attended the workshop organised by the SIT Alumni Leisure Network, including 15 attendees who were taking part at their ﬁ  rst SIT Alumni\nNetwork event.\nThe workshop was led once again by Ms Ong Wen Hui, an alumnus from the\nBachelor of Science (Hons) in Food & Human Nutrition (Newcastle University) degree programme who had recently completed a Professional Bakery Course. She is currently pursuing a postgraduate diploma in education.Thumbs up for a job well done and yummy treats to look forward to!SiTIZEN  |  10/12\nLook, it came out perfectly! For the Chocolate Arc-\nEn-Ciel cake, participants learnt to assemble the chocolate sponge base together with the dark and white chocolate mousse and chocolate ganache.At the baking sessions, the alumni\nbaking enthusiasts had a chance to learn two recipes – a Chocolate Arc-En-Ciel Cake and a Maple Walnut Cheesecake, which were more advanced recipes than those that had been taught in the previous Sweet Creations workshop.\nSaid Ms Ong, “Even though there\nwas an increase in the number of participants from the ﬁ  rst workshop,\nI had a great time sharing the joy of baking with my fellow alumni. It was deﬁ  nitely heartening to see the\nparticipants enjoying themselves!”\nOne of the ﬁ  rst time attendees was\nMr Ho Wei Jian, an alumnus from the Bachelor of Engineering (Hons) in Chemical Engineering (NU) degree programme who graduated in 2014. He said that even though he did not bake in his spare time, he was looking forward to learning to bake the Maple Walnut Cheesecake. He said, “It’ll be interesting to learn to bake bread at the next Sweet Creations!”\nDon’t let the plain exterior fool you –\nunderneath lies a rich and tasty cheesecake!Bake a\nMaple Walnut Cheesecake\nInstructions\n• Pre-heat oven to 160°C\n• Line the bottom of a square cake mould with\ntwo layers of aluminium foil\n• Prepare the cookie base:\no Melt butter in a saucepan over the stove,\nor microwave in a bowl and set aside.\no Manually mix digestive biscuits, walnuts and\nmelted butter until well-combined.\no Press mixture into the base of the cake mould\nto form the cookie base and refrigerate for  at least 30 minutes until ﬁ  rm.Cookie Base\n130g crushed digestive biscuits\n20g crushed toasted walnuts80g butter\nCheesecake Layer\n750g cream cheese190g sugar50g maple syrup3 large eggs100g chopped toasted walnuts\nIngredients(Makes one 7-inch cake)\n• Prepare the cheesecake layer:\no Cream the sugar and cream cheese until smooth with  an electric mixer. Add in maple syrup and mix well.\no Lightly beat eggs together with a fork. o Add in eggs a little at a time to the cheese mixture,\nensuring that mixture is smooth before adding in more eggs.\no Add chopped walnuts to mixture. o Pour over the chilled cookie base and bake in a water bath\nin the pre-heated oven for 1 hour or until golden-brown.\no Remove from oven, and chill completely before serving.\nAlumni and current students have a ball of a time at\nthe ﬁ rst Alumni Floorball SessionSiTIZEN  |  11/12\nAtlas Eye Specialist Centre\n• Discounted consultation rates• $250 off any refractive surgery• Valid until 31 Dec 2016\nBattlestrike\n• 10% off total bill• Book sessions at http://www.battlestrike.com.sg\n• Valid until 30 April 2017\nBenjamin Barker\n• 50% off suits • 25% off regular-priced shirts (Use code SITXSHIRTS) • 10% off accessories (Use code SITXACC)• Valid until 31 Dec 2016\nBi Bing Korean Dessert Café\n• 10% off total bill\nContactLens.sg\n• 15% off all contact lenses with a minimum of $40 spent• Use code “SingTech2016” at checkout• Valid until 31 Dec 2016\nDojo\n• 15% off total bill\nEyecon Optical\n• $19.80 onwards for a pair of standard prescription lenses• Waiver of eye examination fees• Valid until 31 Dec 2016\nFloral Garage Singapore\n• 10% off total bill at www.ﬂ  oralgaragesg.com\n• Key in the code ‘SIT010’\nGifts Less Ordinary\n• 5% off any purchase at http://giftslessordinary.com\n• Valid until 1 June 2017SIT Alumni Card Beneﬁ  tsThe ﬁ  rst Alumni Floorball Session, held on 7 May 2016 at the\nSIT@Dover campus, drew not just the alumni and student members of SIT’s Floorball team, but also other alumni who wanted a chance to play the game.\nThe 42 attendees were divided into mixed teams and they\nplayed a total of four 15-minute matches. “The game was quite intense,” said Ms Quan Yuan Ling, who was asked to the session by fellow alumnus Ms Teng Mei Ling. Both are graduates of the Bachelor in Science (Occupational Therapy) Some of the attendees at the Alumni Floorball Session at the end of the matches.\nThe Alumni Floorball Session, held at the SIT@Dover campus, was organised\nby the SIT Alumni Sports Network.Floored by Fun!\ndegree programme (Trinity College Dublin). Added\nMs Quan, “It was a good opportunity to catch up with friends I made during orientation.”\nMr Ronald Ng got to know about the game through the\nSIT Floorball team’s chat group.  The alumnus from the Bachelor of Engineering (Hons) in Naval Architecture degree programme (Newcastle University) said, “It was enjoyable to be able to meet with old friends and new ones, especially the ﬁ  rst year students.”\nFor Ms Sharlene Sim, a founding member of the\nWomen’s ﬂ  oorball team at SIT, it was so much fun that\nshe stayed back with many others after the session had ended to continue playing.\nGiovanni L.\n• 10% off total bill• Valid until 31 Dec 2016\nHipVan\n• 10% off bill at www.hipvan.com\n• Use code 10SIT at checkout• Valid until 1 June 2017\nKF1 Karting Circuit\n• Entitled to members’ rates• Valid until 31 Dec 2016\nKitchen Capers\n• 10% off bakeware tools/packaging needs/books/DVDs• 5% off food/ingredients\nMorganﬁ  eld’s\n• 10% off total bill• Participating outlets: The Star Vista, Suntec City• Valid until 31 Dec 2016\nNanyang Optical\n• 40% off all regular-priced frames• 10% off all contact lenses with minimum purchase of 2 boxes• 30% off conventional contact lenses• Valid until 1 March 2017\nNational Geographic\n• 20% off the subscription of the following: National Geographic Magazine, National Geographic  Kids, National Geographic Little Kids, National Geographic Traveler• Valid until 31 Dec 2016\nOppa Chicken\n• 1 for 1 Oppa Chicken from 3 – 5.30 pm• Free sour plum soju shot with any OPPA Chicken order during Happy Hour (3-8pm)• Valid until 31 Dec 2016Pezzo• 10% off total bill• Valid until 31 Dec 2016\nPies & Coffee\n• 10% off total bill• 50% off slice cakes with 2 gourmet pies/brunch purchased• 15% off whole cakes\nPlanet Popcorn\n• 10% off purchases using code ‘SIT2014’ during checkout at www.planetpop.com\n• 15% off and free delivery for orders above $150. Use code ‘Corporate’• Valid until 1 March 2017\nQQ Rice\n• 10% off on Oat Rice, Rice Roll, Snack Roll, Wholemeal Sandwich• $5 value set for rice roll/oat rice & standard drink• Valid until 31 Dec 2016\nSeasonal Salad Bar\n• 10% off all regular priced items• Participating Outlet: One@KentRidge• Valid until 1 Apr 2017\nSeattle Pike Chowder\n• 10% off total bill• Valid until 31 Dec 2016\nSharetea\n• 10% off all regular priced items• Valid until 15 June 2017\nShopBack\n• $10 Beneﬁ  t\n• Up to 18.0% Cashback when shopping with selected partners• Visit https://www.shopback.sg/\nfor more detailsSolemates• 10% off sales items with every $200 spent in a single receipt• Valid until 1 March 2017\nSpectacle Hut\n• 20% off on frames & sunglasses; 15% off on lenses• 3% off on contact lenses• Participating outlet: Jurong Point• Valid until 30 April 2017\nSunlife Durian Puffs & Pastries\n• 10% off total bill• Participating outlets: Causeway Point Shopping Mall, 333 Coffee Shop (Blk 136 Bedok North Avenue 3)• Valid until 31 July 2017\nThe Assembly Ground\n• 10% off menu items• Valid until 31 Dec 2016\nThe Braces Practice\n• Discounted rates for various braces options• Valid until 14 June 2017\nTotally Hot Stuff\n• 10% off purchases• Valid until 30 April 2018\nXorex Press Pte Ltd\n• $8 for A2 poster with mounting• $16 for A1 poster with mounting• Valid until 1 March 2018\n*Please present your SIT Alumni Card\nprior to making payment. Terms and conditions apply. Please refer tohttp://sl.singaporetech.edu.sg/Welfare/SITreats.aspx  for detailed\nterms and conditions.\nContact Us:\nSIT Advancement & Alumni Division\n6592 2013 / 6592 1137 • Alumni@SingaporeTech.edu.sg"
}