{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-16.pdf",
  "type": "pdf",
  "content": "Nurturing Interest in STEM\nAmong Secondary School Students\nHosting Primary School\nStudents from the Punggol Coast Area\nCelebrating Class of 2017\nfrom…Wheelock, GSofA, TUM & UoM\nPioneer Accountancy\nAlumni Get Together\nat Beers with PeersSIT Staff and Faculty Support\nStudents Through the\nSIT Bursary\nSCCCF Paves the Way\nfor SITizen EntrepreneursEngineering Students\nDesign Award-Winning Rehabilitation Devices\nAlumni Lather Up Some\nFun & Accelerate Their\nCareers with UPSTARTSOnce a SiTizen, Always a SiTizenISSUE NO. 16  |  AUGUST 2017\nThese past months, SIT has been a hive of learning opportunities, for its own students as well\nas  those from other institutions – from opening our SIT@Dover campus to primary school students from the Punggol Coast area (as part of a three-day Punggol Coast Fun Science Camp), to nurturing interest in STEM subjects among secondary school students through the www.hardwareonline.com.sg Young Engineers Space (YES!) Programme that has been made possible by a gift to SIT.\nThe secondary school students are coming to SIT@Dover for weekly lessons in robotics, which\nare followed by mentoring sessions by SIT undergraduates from the Sustainable Infrastructure Engineering (Building Services) programme as part of the pilot run for the YES! Programme.\nAs SIT opens its doors to the primary and secondary school students, its own undergraduates\nare being welcomed to exciting opportunities in the community. The Singapore Chinese Chamber of Commerce & Industry, for example, has made possible a scholarship for promising undergraduates at SIT through its Foundation. In addition to receiving financial support, the scholarship recipients will get a year-long membership with the Chamber that allows them to interact with local business leaders.\nStudent SITizens are also firmly supported by SIT’s faculty and staff, who are not shying away\nfrom showing their commitment to SIT students by giving to the SIT Bursary, with more than 300 of them turning up at the fourth Faculty & Staff Giving roadshow held in July.\nSIT’s students are themselves making good contributions to society. Ms Arisha Melati bte\nAbdulah and Mr Pang Yao Yi, two of SIT’s Engineering students have designed low-cost rehabilitative devices that can help improve life for patients, and their devices have won prizes at the Biomedical Engineering Society (Singapore) – Society of Engineers for the Community Students’ Design Competition held at the BES 11th Scientific Meeting.\nAnd SIT’s new Accountancy alumni, the Class of\n2017, are discovering a trove of opportunities in industry networking and lifelong learning made available by their alma mater and specially designed for them – starting with Beers with Peers: SIT Pioneer Accountancy Alumni Beanfeast.  At the celebratory event, a distinguished panel of industry practitioners shared with them the importance of acquiring soft skills such as good communication and networking skills, and how new possibilities can present themselves as one keeps abreast with game changing technologies.\nRead about all this and more in this issue of SITizen.\nShould you wish to contribute a story, do drop us a line at Alumni@SingaporeTech.edu.sg.WHAT’S\nHAPPENING\naround our little\nbig campus\nSITizen is a publication by the\nSIT Advancement & Alumni Division.For enquiries, please e-mail us at  Alumni@SingaporeTech.edu.sg© Singapore Institute of Technology 2017Dear SIT Alumni,\nPlanting Seeds for the Future\nProf Tan Thiam Soon, President, SIT, showing the\nplanned site of the SIT campus in Punggol to\nMr Roland Ng, President of the 59th Council, SCCCI, and Mr Adrian Peh, Chairman of the Culture, Education & Community Affairs Committee, SCCCI.\nGetting ‘Schooled’ at SIT A range of educational initiatives by SIT are reaching\nout to welcome primary, secondary and poly students in the community\nNurturing Interest Early for STEM\nSubjects\nSIT student Serene Tan spends close to two hours each week\nas an “older sister” of sorts to Ms Nur Adibah Kasmani, a secondary three student from Tanglin Secondary School. During this time, she gives Adibah some light tuition on STEM (science, technology, engineering, mathematics) subjects, and shares her personal experiences and advice on school life with her as well.\nAsked why she became a mentor, Serene replied: “I find\nit’s very meaningful to help students with subjects that they have difficulty with, or perhaps don’t naturally enjoy. I experienced it myself when I was young. I didn’t do very well in math and I felt discouraged by my bad grades, but I had no one to look to for help. During my time, there wasn’t any mentoring programme at my secondary school.  So now that I have a chance to help, I thought to myself, why not?”\nShe and 11 of her fellow Year 2 students from the Bachelor\nof Engineering with Honours in Sustainable Infrastructure Engineering (SIE) (Building Services) programme are part of the www.hardwareonline.com.sg Young Engineers Space (YES!) Programme. One component of YES! is a pilot programme in conjunction with Tanglin Secondary School, where 20 secondary three students come down to SIT@Dover for weekly lessons in robotics topics like basic programming and sensor technology. After each lesson, they spend time with SIT student mentors like Serene who hang out with them as friends and help them with their STEM subject studies.\n“I joined this programme because I’m into things like\ntechnology”, said Adibah, who enjoys the weekly lessons. “I like to build things and programme them. Although some people say that it’s very boring, to me it’s very fun.\nPrimary school students from\nPunggol Coast area visit SIT@Dover\nOn 31 May 2017, SIT hosted 80 primary school students\nfrom the Punggol Coast area as part of its community outreach efforts. The visit was organised in collaboration with the People’s Association (PA) and was part of a 3-day Punggol Coast Fun Science Camp, which aims to inspire children from disadvantaged backgrounds to aspire towards a university education.\nThe students spent the afternoon here satisfying their\ncuriosity about aviation and robotics-related projects. Ranging from primary three to primary six, the participants had the opportunity to attend workshops and participate in fun-filled educational activities involving robotics and drones.\nSIT and the Singapore University of Social Sciences (SUSS) signed a Collaboration Agreement with Temasek Polytechnic (TP) to offer relevant skills-based undergraduate modules to polytechnic graduates embarking on the SkillsFuture Earn and Learn Programme (ELP).\nUnder the agreement, ELP participants will be able to\ntake modules alongside existing undergraduates from the relevant degree programmes offered by both universities. Upon completion of the ELP , they may apply to enrol in the corresponding degree programmes at SUSS or SIT, with due credit recognition given. This will enable ELP participants to continue deepening their skills and knowledge in a related field, and enhance the pathway for further education with SIT and SUSS. Pursuing structured learning combined with work experience will allow ELP participants to build on the skills and knowledge acquired in school and bring them closer to achieving their career goals.\nSIT student Terence Boo catching up with the Tanglin Secondary students.\nThe robotics lessons are hands-on, with students assembling the sensors and other\nkey parts of their robots.\nStudents tuning into the class lesson for the day: basic programming to make a robot react with specific movements when sensing different types of colours.Twinning with pooh bears! Mentor and SIT student Ms Serene Tan with her mentee from Tanglin Secondary School, Ms Nur Adibah Bte Kasmani.Brimming with confidence after a session of immersing in science, technology, engineering and math (STEM)!\nSIT student volunteers had their hands full taking care of the energetic primary school students!From left: Prof Tan Thiam Soon, President, SIT; Mr Ng Cher Pong, Chief Executive, SkillsFuture Singapore; Mr Ong Ye Kung, Minister for Education (Higher Education & Skills) and Second Minister for Defence; Mr Peter Lam, Principal & CEO, TP; and Prof Cheong Hee Kiat, President, SUSS. I like programming the robots to move by themselves or\nstop when they detect obstacles in front of them.”\nYES! was made possible by a philanthropic gift from\nwww.hardwareonline.com.sg. The main purpose of the programme is to nurture innovation related to STEM among SIT students, as well as provide a platform for the students to contribute back to their community. Asst Prof Cheong Kang Hao, Engineering, SIT, is one of the committee members of the YES! Programme. He said: “We believe that the best way to trigger students’ interest in STEM is to let them know a good STEM foundation will lead to skills for many exciting innovations. Our aim is to inspire them on the need for a strong STEM foundation by exciting them with hands-on projects.”\nWe believe that the best way\nto trigger students’ interest in STEM\nis to let them know a good STEM\nfoundation will lead to skills for many\nexciting innovations. Our aim is to\ninspire them on the need for a strong\nSTEM foundation by exciting them\nwith hands-on projects.\n– Asst Prof Cheong Kang Hao, Engineering, SIT, is one\nof the committee members of the YES! Programme\nSiTIZEN  |  03/12 SiTIZEN  |  02/12\nSIT-Temasek Polytechnic\nCollaboration Agreement\nSiTIZEN  |  04/12\nOn 24 July 2017, potential industry partners visited the SIT@Dover campus to learn\nmore about the Integrated Work Study Programme (IWSP), a unique feature of the SIT-conferred degree programmes that allows students to undertake eight to\n12 months of relevant work within the course of their studies.\nMore than 80 companies attended the IWSP Industry Day to find out more about\nproviding opportunities from the SIT-NU joint degree programmes.\nProf Tan Thiam Soon, President, SIT welcomed the guests at the event with Prof\nLoh Han Tong, Deputy President (Academic) & Provost, SIT, giving an overview of the IWSP. This was followed by a discussion panel which featured industry partners who have partnered with SIT to take in students through IWSP. The panellists  for the day, who provided different perspectives of the IWSP, were: Mr Tan Yong Juay, General Manager, Meiden Singapore Pte Ltd; Mr Ian Tan, Senior Manager (Talent Acquisition), SMRT Corporation Ltd; Mr Lee Xiang Han, an undergraduate from the First-Ever IWSP Industry Day at SIT\nAssoc Prof Kenneth Low, Deputy Programme Director,\nEngineering, SIT (right) explaining more about the Engineering degree programmes at SIT during an Industry Coffee Chat breakoutMore than 300 freshmen attended the SIT Student Orientation\ncamp held on 22-23 July 2017 at the SIT@Dover campus with the theme “Rise of the Legacy”. Accompanying them were 56 current undergraduates who comprised the organising committee and student facilitators. This 2-day camp was held specially for this group of freshmen (from the Systems Engineering [ElectroMechanical Systems], Allied Health, The Culinary Institute of America and Technical University of Munich programmes at SIT) whose academic calendars start earlier than the rest of the incoming freshmen.\n“One of the most memorable activities for me is the ‘Limbo\nChallenge.’ The skills that were needed like teamwork and communication are something that I can use in my daily life,” said Mr Muhammad Luqmanul-Hakim bin Homaili, a freshman from the Systems Engineering (ElectroMechanical Systems) programme.Freshmen Fun\nat the SIT Student Orientation\nAn annual affair, the 2-day camp gives incoming\nundergraduates a chance to connect with new friends and learn a little bit about the SIT-DNA\nCampers were divided into four groups – or empires.While this activity was named “A\nPerilous Journey”, it was made less so with the help of new friends. A newspaper sash and a massive water gun are must-have accessories at the SIT Student Orientation.Steady now – freshmen learn to listen to each other and work with their team mates, while blindfolded.\nIndustry partners with SIT shared their experiences of engaging with SIT students through the IWSP programme.Sustainable Infrastructure Engineering\n(Land) programme who is doing his IWSP at SBS Transit; Assoc Prof Susanna Leong, Asst Provost (Applied Research) and Cluster Director, Chemical Engineering and Food Technology, SIT, and Assoc Prof Lee Kwee Hiong, Cluster Director, Engineering, SIT.\nAfter that, attendees proceeded to a\nbreakout session where companies were able to find out more about their programmes of choice from the respective programme directors. A highlight of the camp was the “Legacy Celebration” on the second day, where the four empires (Hydra, Gryphon, Phoenix and Pegasus) showed off their talents with a performance and their empire cheer. Pegasus ended up clinching their first-ever best Empire award.\nSaid Ms Amelia New, from the Occupational Therapy\nprogramme, “I think it was fun because I got to know more people and interact with people from different backgrounds. Even before school starts, I get to make friends.\nFor the 101 graduands from Technical University of Munich, all\ntheir hard work was worth it when they received their degree scrolls for the Bachelor of Science in Electrical Engineering & Information Technology and the Bachelor of Science in Chemical Engineering. Mr Chan Wing Leong, Deputy President (Administration) & Chief Financial Officer, SIT also attended the ceremony.\nMr Teo Yong Kia from the Electrical Engineering & Information\nTechnology (EE&IT) programme and Mr Chen Jun Guang from the Chemical Engineering programme received the Best Student Award and were the valedictorians for their respective programmes.\nReceiving the Best Thesis Award for the EE&IT programme was\nMr Ernest Pwi Yaoxuan, and the same award for the Chemical Engineering programme was presented to Mr Muhammad Ariff bin Horlis.\nSaid Mr Chen, “As clichéd\nas it might sound, the time I spent in SIT reaffirmed my understanding that possessing relentless dedication and the right attitude are values that stand you in good stead to accomplish anything – be it studies, sports or even working on business opportunities.”SiTIZEN  |  05/12\nAt The University of Manchester Degree Congregation ceremony held at the Grand Copthorne Waterfront Hotel, 71 graduands received their Bachelor of Science with Honours in Nursing Practice degree. Prof Tan Thiam Soon, President, SIT, along with SIT Senior Management and faculty also attended the ceremony.\nMs Amanda Ong Jingyi received the Outstanding Achievement\nDissertation and the Outstanding Achievement Improvement from Year 1 to Year 2. “It was a huge honour and I was surprised as it came unexpectedly. I am thankful for my study buddies as the lessons learnt, moral support given to each other and also knowledge shared among us was part of the reason I could achieve the awards. If I could, I would like to share these awards with them,” said Ms Ong, who is currently working at the Singapore General Hospital.\nOther award winners from the same programme include Ms\nVannea Balachandran for the Outstanding Achievement in Service and Leadership and Mr Ang Wei Jie for the Outstanding Achievement Highest Grade Point Average in Cohort. Class of 2017 Celebrates\nAs the academic year comes to a close, SIT graduates students from Wheelock College, The Glasgow\nSchool of Art, Technical University of Munich and The University of Manchester\nThe Wheelock College Commencement Ceremony on\n14 June saw 66 graduands receive their Bachelor of Science\nin Early Childhood degree. This was the graduation of the fourth batch of students of Wheelock College at SIT. Prof Tan Thiam Soon, President, SITand Dr David J. Chard, President, Wheelock College were among the guests at the ceremony.\nThe Library Research Award was presented to Ms Chia\nMing Xiu Eileen, Ms Anne Chua An Yuan, Ms Tan Xin Yi and\nMs Zoey Tan Hui Yi. Ms Joey Lim Xiuwei received the Most Significant Contribution to the Program Award. The winner of the Academic Achievement Award and the valedictorian was Ms Denise Pun Jie Zhen.\nSaid Ms Pun who will be an educator in an MOE Kindergarten,\n“Children love and learn so freely and it will always be my aspiration to be an inspiration to them.The graduation ceremony, which took place at SIT@Dover, for the 114 graduands of The Glasgow School of Art (GSofA)was full of tradition. Prof Loh Han Tong, Deputy President (Academic) & Provost, SIT, and SIT Senior Management were also there to give their well wishes to the graduands. Prior to the ceremony, the graduands from the Bachelor of Arts with Honours in Communication Design and Bachelor of Arts with Honours in Interior Design programmes held a week-long show from 17 – 23 June, showcasing works from their final year.\nMs Maggie Ng, who was awarded the Interior Design Prize\nfor Sustainability said that attending the programme “was the best choice I have made in my life.” She added, “There is the constant push from the GSofA lecturers to help me uncover my potential and gain a deeper understanding of design work.”\nOther prize winners from the Interior Design programme were\nMs Geraldine Neo Shi Lei who received the Highest Academic Achievement in Studio for Interior Design, and Mr Lim Kar Kwang who was awarded the Outstanding Contribution to Student Life Award. For the Communication Design programme, the Communication Design Prize for Sustainability was awarded to Mr Tan Jian Ye, the Highest Academic Achievement in\nStudio for Communication Design went to Ms Tan Ming Li, and Ms Adelene Chan\nYu Ling received the\nOutstanding Contribution to Student Life Award.\n19 July     Technical University of Munich Graduation 14 June    Wheelock College Commencement Ceremony  27 June    The Glasgow School of Art Graduation\n20 July     The University of Manchester Degree CongregationGraduands of Wheelock College performed Ed Sheeran’s “All of the Stars”,\ncomplete with actions in sign language.\nFruits of their labour – Mr Teo Yong Kia (left) and Mr Chen Jun Guang pose with their awards after the ceremony. The doffing of the cap and the presentation of the hood adds to the sense of ceremony on the day.\nThis ceremony marked the graduation of the last batch of students from The University of Manchester.\nSiTIZEN  |  06/12\nPioneer Accountancy\nAlumni Get Together at the Very First Beers with PeersSiTIZEN  |  07/12\nA panel discussion featuring top professionals from the industry, networking\nsessions were all part of the inaugural celebration for SIT’s very first graduates\nThe first gathering of the SIT Pioneer Accountancy cohort\nwas presented as a beanfeast, which is an old British term for a happy celebration or party. It was all of that and more.\nGraduates came straight from the office and wasted no\ntime swapping “war stories” of working life with former classmates at the ballroom at Marina Mandarin on\n28 July 2017. They were joined by professionals from the Accountancy industry, their former professors and current Accountancy undergraduates, as well as SIT Senior Management, which made for a 130-strong crowd.\nThe highlight for many that evening was a panel discussion\nentitled “Ensuring Your Future Readiness.” The speakers were Ms Rachel Eng, Deputy Chairman, WongPartnership LLP and member of SIT Board of Trustees, Ms Pearlyn Lo Wei Min, Managing Director, Lo Hock Ling & Co., Mrs Deborah Ong, Partner, PwC Singapore, and Mr Philip Yuen, Chief Executive Officer, Singapore and Southeast Asia, Deloitte & Touche LLP .and graduands to mingle with the invited professionals from the various accountancy firms. She noted, “It shows that they are probably quite concerned with the future and also with their career development to come to listen to experienced professionals and get some tips on how to succeed in the industry.”\nMs Orlena Yew, who is joining Baker Tilly TFW as a tax\nassociate upon graduation this October, said, “The panel discussion was an extremely illuminating session. The insights should serve as a preemptive guide for us to recalibrate our expectations and to explore areas we could improve as well as to value add to organisations and society at large.”\nShe is looking forward to the next Beers with Peers.\nModerated by (from left) Assoc Prof Koh Sze Kee, Programme Director, Accountancy, SIT, the panel was made up of Ms Rachel Eng, Deputy Chairman, WongPartnership\nLLP , and Member, SIT’s Board of Trustees, Ms Pearlyn Lo, Managing Director, Lo Hock Ling & Co., Mrs Deborah Ong, Partner, PwC Singapore and Mr Philip Yuen, CEO, Singapore and Southeast Asia, Deloitte & Touche LLP .\nSpotting familiar faces in the specially produced momento for the Accountancy Class of 2017.The panel discussion gave plenty of food for thought for these Accountancy students.Panelists received a wooden abacus as a token of appreciation. (From left)\nMr Chan Wing Leong, Deputy President (Administration) & CFO, Prof Loh Han Tong, Deputy President (Academic) & Provost, Prof Tan Thiam Soon, President,\nSIT, Ms Rachel Eng, Deputy Chairman, WongPartnership LLP & Member, SIT’s, Board of Trustees, Ms Pearlyn Lo, Managing Director, Lo Hock Ling & Co.,\nMr Ng Yat Chung, Chairman, Board of Trustees, SIT, Mrs Deborah Ong, Partner, PwC Singapore, Mr Philip Yuen, CEO, Singapore & Southeast Asia, Deloitte\n& Touche LLP , Prof Ng Siu Choon, Associate Provost (Students) and Prof Ho Yew Kee, Associate Provost (SkillsFuture & Staff Development), SIT.\nHow many people can we squeeze into this photo booth?Enjoying a well-deserved night off.\nAlumni were excited to continue speaking to Mr Philip Yuen, CEO, Singapore &\nSoutheast Asia, Deloitte & Touche LLP (first from left), who stayed long after the panel discussion to answer their burning questions.\nAssoc Prof Jeanette Ng, Cluster Director, SIT (right), thanks Mrs Deborah Ong, Partner, PwC Singapore for being part of the panel.Assoc Prof Lim Chu Yeong (right), Deputy Programme Director for Accountancy, SIT, speaks to the first batch of Accountancy graduates. Ms Ailin Ng (left), who will graduate in October 2017, had a moment to catch-up with Ms Pearlyn Lo, Managing Director, Lo Hock Ling & Co.Huddling together to enjoy some light bites as they share their new experiences. Alumni had the chance to rub shoulders with Accountancy professionals during the networking sessions.\nThis is the very first event of its kind at our\nuniversity, and tonight we are holding it as\na celebration for SIT’s very first Accountancy\ngraduates – who will also be the very first SIT\ndegree holders to go out into the industry.\n- Prof Tan Thiam Soon, President, SITSiTIZEN  |  07/12\nWhile planning for the future was a good thing, Ms Eng\nwarned that 60 per cent of jobs in the years ahead have not been invented yet. She added, “It is now said that there is no future in any job. The future is in the person doing the job.”\nShe and the other panelists also stressed the importance\nof acquiring soft skills such as good communication, networking and keeping abreast of emerging technologies.\nCommenting on the event later, Ms Lo said Beers with\nPeers was a very good opportunity for the new graduates\nSiTIZEN  |  08/12\nOver 300 SITizens turn up to support the fourth Faculty & Staff Giving Roadshow – and to celebrate\nthe generous giving towards the SIT Bursary by SIT employees A Spicy Treat for the Stomach…\nthat Comes Straight from the Heart\nOn 14 July 2017, more than 300 SIT\nfaculty and staff gathered at the University Tower at the SIT@Dover campus in support of a special occasion – the fourth Faculty & Staff Giving Roadshow, where they were treated to a delicious local breakfast and were hosted by some of the students who received SIT Bursaries, thanks to  their generous giving.\nSince its launch in November 2015,\nthe Faculty & Staff Giving initiative\nin support of the SIT Bursary has raised more than $112,800, and these gifts have made possible 37 SIT Bursaries for financially disadvantaged students at SIT. It is a unique initiative that signals to the university community that SIT faculty and staff are committed to supporting students at SIT. Savoury nasi lemak, fragrant otak-otak and steaming hot teh tarik and kopi tarik were served at the event and among those who enjoyed bonding with fellow SITizens over breakfast was Assoc Prof Indriyati Atmosukarto, Deputy Programme Director for Telematics, who thought the nasi lemak was “really good”.\n“But more importantly, we got a\nchance to chat with some of the bursary recipients at the event,” she pointed out, adding, “It was nice to hear how useful the bursaries are to the students. The students are now able to fully focus on their studies after receiving the bursaries as they don’t have to worry about finding part-time jobs.”\nAlso at the roadshow was Ms Li Jinglin\nwho used her SIT Bursary to pay the school fees for her final year in the Accountancy programme. She said, “Now, I can graduate on time this coming October and I want to thank everyone that made it possible.”Mr Tan Xingjie, another bursary recipient who was present, saw the Roadshow as a “perfect opportunity” to express his gratitude. The first-year student from the Bachelor of Arts (Hons) in Criminology and Security (University of Liverpool) said it gave him a better picture of the support shown by faculty and staff for the SIT Bursary.\nHe added, “I was very touched that\nSIT faculty and staff seemed to care deeply that I have the means to study and to graduate and go on to contribute to the community and nation. They encouraged me to make full use of the opportunity that SIT is offering me.”\nSIT staff showing their support for the Faculty\n& Staff Giving initiative. Steaming hot cups of teh tarik were served.\nSITizens thanking SITizens – SIT Bursary recipients had the chance to say thank you to SIT faculty and staff who have supported them. Staff and faculty forming a long line at the University Tower lobby.Faculty from the Chemical Engineering and Food Technology cluster turned up to show their support.Assoc Prof Indriyati Atmosukarto, Deputy Programme Director, Telematics and Assoc Prof Malcolm Low, Programme Director, Computing Science speak to the recipients who are from the Infocomm Technology programmes.\nSavoury nasi lemak and fragrant otak-otak were also on the menu.\nSiTIZEN  |  09/12\nFuture recipients of the Singapore\nChinese Chamber of Commerce Foundation (SCCCF) Scholarship will not only be getting financial support for their studies at the Singapore Institute of Technology (SIT) – the SCCCF Scholarship also comes with a complimentary year-long membership with the Singapore Chinese Chamber of Commerce & Industry (SCCCI), giving them the opportunity to rub shoulders with local business leaders.\nThis is one of the more unique features\nof the SCCCF Scholarship, which was made possible with an endowed gift from SCCCF in September 2016. Beginning in Academic Year (AY) 2017/18 onwards, two scholarships will be awarded each academic year, and will be tenable for up to three years.\nTo thank them for this gift, Prof Tan\nThiam Soon, President, SIT, hosted Mr Roland Ng, President of the 59th Council, SCCCI, and Mr Adrian Peh, Chairman of the Culture, Education & Community Affairs Committee, SCCCI for a lunch at the SIT@Dover campus on 12 July 2017. Also present for the lunch was Prof Loh Han Tong, Deputy President (Academic) & Provost, and SIT faculty, staff and students. Paving the Way for SITizen Entrepreneurs\nAn endowed gift from the SCCCF allows SIT to establish a scholarship to inspire student excellence and it\ncomes with the opportunity to interact with SCCCI members\nSIT students Ms Arisha Melati bte\nAbdulah and Mr Pang Yao Yi, took part in the Biomedical Engineering Society (Singapore) – Society of Engineers for the Community Students’ Design Competition held at the BES 11th Scientific Meeting, were both rewarded for their efforts to design a low cost and Engineering Students\nDesign Award-Winning\nRehabilitation DevicesSIT students win prizes at the Biomedical\nEngineering Society (Singapore) – Society of Engineers for the Community Students’ Design Competition held at the BES 11th Scientific Meeting\nAt the lunch, Prof Tan said that “the Singapore Chinese Chamber of Commerce Foundation under SCCCI has been very impactful in its work in supporting the Singapore community through education, and SIT is truly honoured to count the Foundation as one of our key philanthropic partners.”\nEstablished in 1966, the SCCCF\ncontributes to the community development of Singapore by promoting educational, cultural, community and charitable activities.\nMs Arisha Melati binte Abdulah (left) and Mr Pang\nYao Yi, with their prizes at the Biomedical Engineering Society (Singapore) 11th Scientific Meeting.Mr Adrian Peh, Chairman of the Culture, Education & Community Affairs Committee, SCCCI (left), is greeted by SIT student, Mr Raymond Lim, from the Sustainable Infrastructure Engineering (Building Services) programme.(from left) SIT students, Ms Cheng Wei Bin, Mr Raymond Lim; Prof Loh Han Tong, Deputy President (Academic) & Provost, SIT, Mr Roland Ng, President of the 59th Council, SCCCI, Prof Tan Thiam Soon, President, SIT,\nMr Adrian Peh, Chairman of the Culture, Education & Community Affairs Committee, SCCCI, SIT student\nMr Derrick Teo and Prof Chiew Sing Ping, Programme Director (Civil Engineering), SIT\nMr Roland Ng, President, SCCCI (left) receives a token of appreciation from Prof Tan Thiam Soon, President, SIT.\neasily deployable device. The former\nreceived a Best Poster Award, and the latter was presented with a Gold Award.\nWorking with the Singapore General\nHospital, Ms Arisha, who is from the Mechatronics programme, designed a wearable device to measure posture deviation in patients with Parkinson’s disease. This will help physiotherapists better monitor and assess the improvements made by their patients. She spent some time observing the physiotherapists at work in the Parkinson’s disease clinic who currently use measuring tapes to estimate the angle of deviation. She said, “This project has sparked a newfound interest in the biomedical engineering industry for me.”\nMr Pang, who is from the Mechanical\nDesign Engineering and worked with Kwong Wai Shiu Hospital to develop a device to strengthen the hip abductor muscle, said what really motivated him was “the fact that a patient could benefit directly” from his hard work. “It gave me a great sense of responsibility – students have a big part to play in shaping the communities around us and I am grateful to have been able to do my part,” he added.\nAsst Prof Desmond Chong, Engineering,\nSIT, who supervised the two students, said, “The scientific meeting is a good platform for our students to learn from their peers and to showcase their projects to a larger audience.”\nAltogether, 10 teams including\nthose from the National University of Singapore, Nanyang Technological University and SIT were shortlisted to present their projects at the competition.\nSiTIZEN  |  10/12\nThirty SIT alumni made their own botanical soaps with\npersonalised shapes and scents at the inaugural Soap-Crafting Lab held by the SIT Alumni Leisure Network at Ramada Singapore at Zhongshan Park in June.\nParticipants were given soap bases which they melted down\ninside tiny pots. They then added essential plants oils, herbs and spices for scents and colours, creating “handcrafted botanical soaps”. The participants were guided by instructor Ms Chew Jia Tian, a fellow SITizen who graduated from the Bachelor of Science (Honours) in Nursing Practice programme in 2016.\nJia Tian, the founder of Rough Beauty, the company\nresponsible for the workshop, explained her interest in natural ingredients: “Over the years, I’ve slowly learnt more about natural products and the harmful effects of certain ingredients on our bodies and the environment. This made me want to explore more sustainable options for creating products we apply on ourselves in daily life.”\nAttending the workshop was alumnus Mr Muhd Hafiz Bin\nOsni and his wife and fellow alumnus, Ms Farzana Afiqah Bte Roslee. Hafiz said: “I signed up as I thought it would be a great idea for a date with my wife, and we weren’t disappointed! I enjoyed moulding various designs of soap, and my wife and I had a mini-competition to see who would make the best design. We got our families to vote on whose soap they preferred. The poll was a draw… but I think to myself that I won!” Hafiz and Farzana graduated with a Bachelor of Engineering (Honours) in Mechanical Design and Manufacturing Engineering and a Bachelor of Science (Honours) in Food & Human Nutrition, respectively.\nTo learn more about such workshops, visit www.rough-beauty.com.The participants had an enriching time with the two instructors, Mr Kau Yi Ming\nand alumnus Ms Chew Jia Tian (second and first from right).\nNothing They Would ‘Lather’ Do…\nSIT’s first-ever soap-crafting workshop for alumni\nSoap bases have to be melted in pots before being poured into moulds.\nSIT alumni Mr Muhd Hafiz bin Osni and Ms Farzana bte Roslee holding their prized handcrafted soaps. Everyone was all smiles after the crafting session.\nSiTIZEN  |  11/12\nNothing They Would ‘Lather’ Do…\nA Better Florist\n•\n20\n% off total bill at http://www.abetterflorist.com\n•\nKey in the code\n‘ABFSIT20’ at checkout\n•\nValid until 16 August 2018\nCharles & Keith•\n10\n% off regular items\n•\nUse code:\nSIT10OFF2017  at checkout\n•\nParticipating outlets: All except Changi Airport\nTerminals 1, 2 & 3\n•\nValid until 31 December 2017\nCity Music•\n15\n% off all regular priced items\n•\nValid until 9 October 2017\nContactLens.sg•\n15\n% off total bill with a minimum of $40 spent\n•\nUse code:\nSingTech2017  at checkout\n•\nValid until 31 December 2017\nCrunchie Cookies•\n$2 off every $30 spent for cookies\n•\nValid until 1 October 2018\nDOJO•\n50\n% off second burger set\n•\nValid until 31 December 2017\nDr. Chen’s Tea Products•\n10\n% off all Dr. Chen’s products\n•\nFree delivery to designated places for purchases\nabove $100\n•\nValid until 7 December 2017\nEye Look Good•\n10\n% off total bill\n•\nUse code “SIT10” at www.eyelookgood.com\n•\nValid until 31 October 2017SIT Alumni Card Benefits\nFloral Garage Singapore•\n10\n% off total bill at www.floralgaragesg.com\n•\nKey in the code ‘SIT010’\nFoodline•\nEnjoy $30 cash rewards with min. spending of\n$300 with code ‘SITFL30’ (all catering orders)\n•\nEnjoy $10 cash rewards with min. spending of\n$500 with code ‘SITFLC10’ (all cakes)\n•\nEnter codes at checkout on www.foodline.sg\n•\nValid until 30 June 2018\nIntune Music•\n10\n% off course fees for first 3 months\n•\nWaiver of administrative fees\n•\nValid until 1 April 2018\nKF1 Karting Circuit•\n$\n22 (non-peak)/$28 (peak) for 30kph\n•\n$\n28 (non-peak)/$35  (peak) for 50 kph\n•\nBook at http://kf1karting.com/kf1-events/\n•\nValid until 31 December 2017\nKitchen Capers•\n10\n% off bakeware tools/packaging needs/\nbooks/DVDs\n•\n5% off food/ingredients\nKK Day•\n5% off KKDay travel experiences\n•\nUse code: KKDAY SIT 5 prior to checkout\n•\nValid until 31 December 2017\nMad About Comedy•\n$\n10 per entry for monthly events\n•\nLocation: 69 Circular Road\n•\nValid until 31 December 2017QQ Rice•\n10\n% off on Oat Rice, Rice Roll, Snack Rolls,\nWholemeal Sandwich\n•\n$5 Value Set for Oat Rice/Rice Roll + Standard\nDrink\n•\n$6 Value Set for Bento Box + Standard Drink\n•\nValid until 31 December 2017\nShopBack•\n$\n10 Benefit\n•\nUp to\n18.0%  Cashback when shopping with\nselected partners\n•\nVisit https://www.shopback.sg/ for more details\nTHHG•\n20\n% off across 3 THHG properties on all room\ntypes\n•\nKey in the discount code\n“SITreats20”\n•\nValid until 20 March 2018\nTotally Hot Stuff•\n10\n% off total bill\n•\nValid until 30 April 2018\nXorex Press Pte Ltd•\n$8 for A2 poster with mounting\n•\n$16 for A1 poster with mounting\n•\nValid until 1 March 2018\n*Please present your SIT Alumni Card\nprior to making payment.\nTerms and conditions apply. Please refer to\nhttp://sl.singaporetech.edu.sg/Welfare/SITreats.aspx\nfor detailed terms and conditions.Two SIT alumni, Ms Chynna Ang and Mr Abdul Rahman bin Abdul Rashid, who graduated recently from the Bachelor of Arts in Communication Design (The Glasgow School of Art) have been selected to be part of UPSTARTS, a 12-month graduate placement programme, designed by the Institute of Advertising Singapore (IAS) in conjunction with the Economic Development Board (EDB). The programme provides an opportunity for fresh graduates to accelerate their career growth potential in the advertising world through a structured training programme with top media, creative, digital and PR agencies in Singapore.\nMs Ang’s placement is at Dentsu,\nwhereas Mr Abdul Rahman’s placement is at Ogilvy & Mather. They both started in July.\nMr Abdul Rahman, who is copywriting\nfor Ogilvy & Mather, said, “My two years at GSofA have trained me to focus more on thinking than doing, and to develop ideas that are unique and marketable – which is what matters in this time and age.”\nFor Ms Ang, she has always found\nadvertising to be interesting and that being selected for UPSTARTS was a “huge opportunity” for her. She said, “It was an honour to be selected, and something no sane person would GSofA Alumni Accelerate\nTheir Careers with UPSTARTS\nTwo GSofA alumni are selected for a graduate placement programme\nwhich aims to accelerate their careers in the advertising industry\nrefuse as it would be a stepping stone\nto anyone’s career.”\nAdded Ms Ang who has spent her\nfirst month at Dentsu in the creative team and was given the chance to work on print ads as well as in brand campaigns, “With this exposure, I am developing my conceptual thinking and honing my eye for detail.”GSofA alumnus Ms Chynna Ang says that her\nexperience in advertising has been “great, but the pace is extremely fast.”At the GSofA Degree show, Mr Abdul Rahman presented his project entitled, “Vol:1 What’s Wrong with Black Sheep?”, a publication featuring original counterculture artworks."
}