{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-14.pdf",
  "type": "pdf",
  "content": "New Joint Degrees for AY\n2017/18 Showcased at SIT\nOpen House\nAccountancy Programme\nGets SAC Accreditation\nThe Silent Foundation:\nSupporting the Minority\nA New Bursary, Thanks to\nthe Lions Community\nService Foundation\nSamwoh Ups its Support for\nEngineering Students\nSITizens Spread Joy in\nCambodia and Vietnam\nGSA Students Explore How\na Design Becomes a Home\nOur Very Own National\nFloorball Players\nAlumni Dedicate Themselves\nto a Good CauseOnce a SiTizen, Always a SiTizen ISSUE NO. 14   |  FEBRUARY  2017\nIt’s only two months into 2017 and already we have some good news to report. Aspiring SITizens\ncan now look forward to the 41 programmes that the Singapore Institute of Technology (SIT) is\noffering for the new Academic Year 2017/18, including a new joint degree programme in Civil\nEngineering with the University of Glasgow.  In a move that is a strategic milestone with our\nOverseas University partners, SIT will also convert six of the degrees previously offered solely by\nNewcastle University (NU) to joint degrees. Applications will close 19 March.\nThere is also happy news for the first batch of graduates from SIT’s Accountancy programme.\nWith the programme receiving accreditation from the Singapore Accountancy Commission,\nthese graduates can enrol directly in the Singapore Qualification programme. This allows them\nto skip foundation papers when pursuing their Chartered Accountant certification.\nThe new Civil Engineering programme has already attracted interest from industry players like\nSamwoh Corporation. Samwoh has made a new endowed gift to nurture the incoming Civil\nEngineering students, and also signed a Collaborative Agreement with SIT on an Industry Lab\nthat will provide industry exposure to these students.\nProf Tan Thiam Soon, President, SIT, said that he was heartened and appreciative of the strong\nsupport from an organisation like Samwoh Corporation, which is at the forefront of the industry.\nHe added, “Our students will benefit from the resources, talent and opportunities Samwoh\nCorporation have made available to us and their generous contribution will assist SIT in our\nambition to produce highly-skilled and work-ready civil engineering graduates.”\nUndergraduates at SIT are also getting renewed support from The Silent Foundation and\nthe Lions Community Service Foundation. These foundations, which have been supporting\nstudents at SIT for several years through bursaries and emergency grants, made new\nphilanthropic commitments to support financial aid for deserving students who need it most.\nIn the meantime, our students and alumni are stepping\nout to engage the community – from helping the\nunderprivileged in Singapore and overseas, to\naddressing food wastage and disaster relief efforts,\nto taking part in the recent Lunar New Year festivities\nheld by the Singapore Federation of Chinese Clan\nAssociations.\nOur alumni SITizens are also not forgetting how to\nbond over some fun and games at the Alumni Futsal\nand Floorball sessions. (There’s an exciting array of SIT\nAlumni Network activities lined up, so turn the pages\nto find out more!)\nWe hope you will enjoy reading this issue of SITizen.\nShould you wish to contribute a story, do drop us a line\nat Alumni@SingaporeTech.edu.sgWHAT’S\nHAPPENING\naround our little\nbig campus\nSITizen is a publication by the\nSIT Advancement & Alumni Division.\nFor enquiries, please e-mail us at\nAlumni@SingaporeTech.edu.sg\n© Singapore Institute of Technology 2017\nDear SIT Alumni,\nNew Year, New Degree Programmes…\nand Renewed Support for SITizens!\nAlumnus Varun Kumar tells us about his good causes,\nwhich include volunteering with organisations like\nAnimal Allies, the Rotary Club of Bugis Junction\nSatellite Club and the Hindu Centre (see Page 11).\nSiTIZEN  |  02/12\nThe vibrance of the Singapore Institute of Technology (SIT) was on full display\nat the Suntec Singapore Convention & Exhibition Centre, where the University\nheld its Open House over the weekend of 14 & 15 January 2017.\nPotential students and their family members had the opportunity to attend\ntalks given by SIT faculty, staff and representatives from SIT’s Overseas\nUniversity partners.\nAmong those who were at the Open House was Ms Valarie Yeo, who graduated\nfrom Republic Polytechnic in 2015 and was interested in the Criminology and\nSecurity programme. She said, “I have always been curious about why people\nwould commit crimes and how individuals and the community can control\ncrime better.” She added, “I hope to learn more as I aspire to be a police\nofficer in the future.”\nMs Trixie How was another potential student interested in finding her place\nat SIT in the Occupational Therapy programme. Currently interning at KK\nHospital under the supervision of Occupational Therapists there, she said,\n“I’ve discovered that this is not an easy job, but I think this course will provide\nme with the capability to pursue this profession while taking into account the\ncomplexities and challenges of the healthcare and community services industry.”\nVisitors were also treated to student performances as they visited the various\nbooths in the main exhibition area, where faculty and staff were on hand to\nanswer their questions.\nApplications to SIT for the new academic year opened on 11 January and will\nclose on 19 March.\nFor further details, please visit SingaporeTech.edu.sg .Finding Their Place at SIT\nMore than 5,000 people attended the SIT Open House to learn more about the 41 programmes SIT is offering\nfor the Academic Year 2017/18\nProf David Jones, Programme Director, SIT, answers\nqueries from those interested in the Hospitality\nBusiness Programme at SIT.Potential students snap photos of themselves with\ncurrent SITizens to redeem an exclusive gift.\nProf Chiew Sing Ping, Programme Director, SIT, speaks\nabout the new Civil Engineering programme during one\nof the many talks of the day.\nMembers of the SIT Wushu Club strike a pose – they\nwere one of the many student clubs who put on a\nshow for the visitors.This robot, from the Systems Engineering (Electromechanical\nSystems) programme, was a draw for younger and\nolder visitors alike.\nSAC Accreditation Allows SIT\nAccountancy Graduates Direct\nEnrolment in Singapore QP\nSIT’s Accountancy degree programme has been accredited\nby the Singapore Accountancy Commission (SAC). The\naccreditation will permit SIT accountancy graduates to\nenrol directly in the Singapore Qualification Programme\n(Singapore QP), effectively allowing them to skip the\nfoundation papers.\nAssoc Prof Koh Sze Kee, Programme Director, Accountancy,\nSIT, said the accreditation is “very timely” as it paves the\ndirect route for SIT’s first batch of accountancy graduates from August 2016, plus students who had graduated in\nDecember last year, to enrol in the Singapore QP at the\nprofessional level programme in January 2017.\nThe Accountancy programme has previously been accredited\nby CPA Australia, ICAEW, CAANZ and CIMA. It has also\nbeen accepted into the CFA Institute University Recognition\nProgramme. This status is granted to institutions whose\ndegree programmes incorporate at least 70% of the\nChartered Financial Analyst Programme Candidate Body\nof Knowledge (CBOK), which provide students with a solid\ngrounding in the CBOK and positions them well to sit for\nCFA exams.\nSiTIZEN  |  03/12\nSingapore Institute of Technology (SIT) is offering new\njoint degrees for the upcoming Academic Year 2017/18.\nIt recently launched the Bachelor of Engineering with\nHonours in Civil Engineering, a three-year joint degree\nprogramme with the University of Glasgow (UofG). Six\nprogrammes which were previously offered by Overseas\nUniversity partner Newcastle University (NU) at SIT, will now\nbe offered as joint degree programmes by SIT and NU.\nThe six programmes are for the Electrical Power Engineering,\nMarine Engineering, Naval Architecture, Offshore Engineering,\nMechanical Design & Manufacturing Engineering and\nChemical Engineering degrees. SIT and NU will both be\nco-developing and co-teaching the curriculum.\nStudents enrolled in these joint degree programmes from\nAY 2017/18 onwards will also undergo the Integrated\nWork Study Programme (IWSP), a unique feature of SIT’s\ncurriculum. Working for an extended period of time at\na host company, the IWSP provides an opportunity for\nstudents to integrate theory and practice and develop deep\nspecialist skills. Together with the existing joint degrees\nthat SIT is offering with UofG, Trinity College Dublin and\nDigiPen Institute of Technology, this will increase the total\nnumber of joint degrees to 11.\nCongratulations to all our new SIT graduates!\nParticipate in the Graduate Employment Survey (GES) in March 2017.\nThe GES iscommissioned bythe Ministry ofEducation and\ninvolves graduates from thefive Autonomous Universities .Inthe\nsurvey, you will beasked about your job search process and\nemployment .\nYour feedback makes adifference because thesurvey results for\neach University will bepublished inthe media .This gives the\npublic insights into theemployability ofSITgraduates .\nSo,look out fortheinvite on1March 2017 inyour SITFree -for-\nLife Email and participate inthe survey! Attractive lucky draw\nprizes tobewon!\nSIT Offers New Joint\nDegrees for AY2017/18\nSix existing programmes with NU converted to joint\ndegrees plus a new Civil Engineering programme with UofG\n– all part of SIT’s mission to produce ‘work-ready’ graduates Prof Loh Han Tong, Deputy President (Academic) & Provost,\nsaid, “This is a strategic milestone in our collaborations with\nour OU partners.These joint degrees will allow students and\nindustry to benefit from the expertise of the faculty from both\nuniversities.”\nThe new Civil Engineering programme, offered in\npartnership with UofG, aims to address the lack of local\ngraduate manpower with the necessary professional\nqualifications in light of sustained building and\ninfrastructure development. The curriculum will equip\nstudents with the practical knowledge and skills to plan,\ndesign, construct, maintain and operate infrastructures\nsuch as roads, rail, bridges, buildings, and underground\nstructures as well as to rehabilitate ageing critical\ninfrastructures in service. Students will also spend three\nweeks at the UofG campus for the compulsory Overseas\nImmersion Programme and have the option of pursuing\nthe one-year Master of Engineering Technology in Civil\nEngineering. This programme has already attracted support\nfrom industry players like Samwoh Corporation (see story on\nPage 5 for more on this) .\n“Civil Engineering is one of the top ten PMET professions\nmost in demand in Singapore. There is a strong need\nfor local manpower with the necessary civil engineering\nprofessional qualifications to strengthen Singapore’s\nbuilding and construction industry,” said Prof Tan Thiam\nSoon, President, SIT.\nThanks to the Lions Community Service Foundation (LCSF), there is a new\nbursary at SIT to help financially disadvantaged Singaporean students\nfrom any degree programme. Three Lions Community Service Foundation\nBursaries will be awarded annually.\nLCSF’s support for SIT began in 2014 with the Lions Community Service\nFoundation Emergency Grants. These provide financial assistance for\nstudents to continue their education when faced with loss or reduction of\nhousehold income because of unforeseen circumstances. Ten students have\nbenefited so far and last December, the Foundation renewed its funding for\nthe Emergency Grants.SiTIZEN  |  04/12\nNew Bursary for SIT Students\nMade possible by Lions Community Service Foundation, it will support\nthree undergraduates annuallyThe Singapore Institute of Technology (SIT) welcomed some special visitors to\nits SIT@Dover campus on 16 February 2017. The board members of The Silent\nFoundation, including its Founder & Executive Chairman, Mr Teng Ngiek Lian,\nheld a meeting on campus before they were hosted to lunch by Prof Tan Thiam\nSoon, President, SIT. Also attending the appreciation lunch were recipients of\nthe Silent Minority Compassionate Bursary, as well as SIT faculty and staff.\nFor the Foundation’s board members, this was their first visit to SIT since they\nbegan supporting SIT students with a term gift of $30,000 in 2015. This first gift\nfrom the Foundation allowed SIT to award six Silent Minority Compassionate\nBursaries to minority students in need of financial assistance.\nMore recently, in August 2016, the Foundation decided to render permanent\nits philanthropic commitment to deserving SITizens. It gave the University an\nendowed gift of $200,000 to make possible a new bursary – called the Silent\nMinority Bursary – for minority Singaporean undergraduates in times of need.\nThanks to this gift, at least three bursaries will be awarded annually from\nAY2019/20,  when the fund reaches steady state.\nThe Silent Foundation was founded in 2010 by Mr Teng who felt that he\nhad benefited tremendously from society all these years. The Foundation is\ndedicated to assisting the ‘silent sufferers’ – those who have been overlooked\nby society and tend to be voiceless.Board members from The Silent Foundation with their bursary recipients as well as SIT faculty and staff.\n(From left) Vice-Chairman Anthony Tay and Chairman\nEric Ng of Lions Community Service Foundation, and\nMs Joan Toh of SIT’s Advancement & Alumni Division.\nBursary recipient, Mr Muhammad Muhaimin bin Othman (right)\nthanking Mr Teng Ngiek Lian. He was grateful for the help he\nreceived, saying that there is “someone out there who wants me\nto succeed.”\nTouching the Lives\nof SITizens in need\nBoard members of The Silent Foundation met with recipients\nof the Silent Minority Compassionate Bursary during a lunch\nreception at the SIT@Dover campusMs Nurul Atiqa binte Mohd Tahir, a bursary\nrecipient and final year student from\nthe Bachelor of Science (Hons) in Nursing\nPractice degree programme (The University\nof Manchester) was initially nervous to meet\nMr Teng and the board members from the\nFoundation. She was pleasantly surprised to find\nout how approachable Mr Teng is. She said,\n“He shared with us about how he did not come\nfrom a well-off family and that he had gone\nthrough hardship to get to where he is today.”\nSeated next to Mr Teng at the lunch, she also\nreceived an important life lesson from him. “I\nlearnt that one should be humble no matter\nwhere you are in life,” she added.\n“We hope to be able to help as many deserving students as we can, in their journey and aspiration to complete their\nuniversity studies,” said Mr Eric Ng, Chairman, Lions Community Service Foundation.\nLCSF was formally registered as a charity in 2003 and is the leading source of philanthropic giving for humanitarian\nservices conducted in Singapore using funds raised by the Lions Clubs. Its current Institute of Public Character (IPC)\nstatus enables it to support the relief work and community service projects and activities carried out by the Lions Clubs in\nSingapore. These include bursaries and study awards to deserving and needy students, financial assistance to destitute\nindividuals or families, non-governmental voluntary organisations in need of funding for specific projects or recurring\nprogrammes, and administering of funds raised by Lions Clubs.Prof Tan Thiam Soon, President, SIT (left), gives a small memento\nto Mr Teng Ngiek Lian, Founder & Executive Chairman, The\nSilent Foundation.\nSiTIZEN  |  05/12\nSamwoh Corporation makes an endowed gift and signs a Collaborative Agreement to nurture\nstudents from SIT’s new Civil Engineering programmeSamwoh Ups its Support for SIT Students\nSamwoh Corporation Pte Ltd recently\nmade a new endowed gift of $500,000 to\nthe Singapore Institute of Technology\n(SIT), in support of students from SIT’s\nnew Civil Engineering programme, a\njoint degree with the University of\nGlasgow (UofG).\nThe company had made its first\ngift to SIT in 2014 to establish a\nBursary for needy students and this\nlatest gift will now make possible, in\nperpetuity, the Samwoh Corporation\nGlobal Immersion Study Grant and the\nSamwoh Corporation Outstanding\nStudent Award in Civil Engineering.\nThe Samwoh Corporation Global\nImmersion Study Grant will provide\nsupport for academically promising\nstudents from the Civil Engineering\nprogramme who need financial\nhelp for the compulsory Overseas\nImmersion Programme (OIP) that is\npart of their degree requirements. The\nStudy Grant, valued at $5,000 each, will\ncover expenses for this programme,\nand at steady state, will benefit at\nleast six undergraduates from the Civil\nEngineering programme annually. The\nOIP , which lasts for three weeks at the\nUofG campus and takes place in the\nsecond year of study, costs between\n$4,500 and $5,000.\nTo encourage excellence among\nstudents from the Civil Engineering\nprogramme, Samwoh Corporation’s\ngift will also make possible the\nSamwoh Corporation Outstanding\nStudent Award in Civil Engineering.\nThis will be awarded each Academic\nYear to a graduating student who has\nnot only excelled academically, but also\nmade contributions beyond academic\nstudies to SIT or the community.In 2014, the company had made possible\nthe Samwoh Corporation Bursary with\nan endowed gift of $200,000. The\nBursary is awarded to three students\nfrom the Sustainable Infrastructure\nEngineering programme, annually and\nin perpetuity, and has benefited four\nstudents so far.\nIn addition to these gifts, Samwoh has\nalso deepened its relationship with SIT\nthrough a Collaborative Agreement\nto establish an Industry Lab (I-Lab),\nwhich leverages off the Samwoh\nInnovation Centre in Kranji. Equipped\nwith state-of-the-art facilities for testing\nand evaluation of civil engineering\nmaterials, the Centre will provide early\nindustry exposure to the incoming\nCivil Engineering undergraduates and\nallow them to deepen their skillsets in\npreparation for employment.Said Mr Eric Soh, CEO of Samwoh\nCorporation, “I strongly believe that\nwe must continue to develop and\nnurture talents, especially the future\ngeneration of engineers if we are to\nmeet the demands of the construction\nindustry and beyond. Through these\nendowments, availing our expertise\nand resources and many more\nemerging collaborations, Samwoh\nhopes to pass on our industry know-\nhow, create a stronger link with the\nacademia and ultimately to inspire and\ngroom a new crop of civil engineers\nwho are passionate, progressive and\nprofessional.”\nThe cheque presentation and the signing\nof the Collaborative Agreement took\nplace at a Civil Engineering Technical\nSeminar on 10 January 2017, which\nwas jointly organised by SIT and\nSamwoh Corporation. The recipients of the Samwoh Corporation Bursary, together with Prof Tan Thiam Soon, President, SIT (fifth from\nleft) and senior representatives from Samwoh Corporation Pte Ltd: Mr Poh Teck Chuan, Executive Director (first\nfrom left), Dr Joshua VM Kuma, Advisor (third from left), Mr Eric Soh, Chief Executive Officer, (fourth from left),\nDr Ho Nyok Yong, Chief Operating Officer (fifth from right), and Mdm Pang Kok Lian, Executive Director & Chief\nFinancial Officer (third from right).\nProf Tan Thiam Soon, President, SIT (left) receives the cheque from Mr Eric\nSoh, Chief Executive Officer, Samwoh Corporation Ltd.\n(Front row, from left) Prof Ng Siu Choon, Associate Provost, SIT, and Dr\nHo Nyok Yong, Chief Operating Officer, Samwoh Corporation Pte Ltd sign\nthe Collaborative Agreement as (back row, from left) Prof Tan Thiam Soon,\nPresident, SIT, and Mr Eric Soh, CEO, Samwoh Corporation Pte Ltd look on.\nSiTIZEN  |  05/12\nSiTIZEN  |  06/12\nProject Cambodia and Project Vietnam are student-led initiatives at the Singapore Institute of Technology (SIT) to\nalleviate poverty and create sustainable livelihoods for needy communities in these countries. The students draw up the\nplans and then raise the funds needed through activities, such as staging a concert as well as sales of sport drinks and\nT-shirts at SIT events. In many instances, they go overseas and personally get things done as in Project Cambodia 2K16\nand Project Vietnam 5.0:\nThe children at PKH Trang\nCentre were very happy\nto have us around. We\nplayed many games\nand danced with\nthem.\nIt was difficult when it was time to bid\nfarewell. The children had won our\nhearts. On our part, the experiences we\ngained were enriching and memorable.\nProject Cambodia has broadened\nour horizons and nurtured our own\npersonal development. We look\nforward to doing more for PKH Trang\nCentre in the future.One of the projects for\n2016 involved renovating\nthe centre’s kitchen. We\nalso expanded the kitchen\narea. This was not easy as\nwe had to lay a foundation\nof stones and sand before\ncementing the floor.SITizens Spread Joy in Cambodia and Vietnam\nFor its second project, the\nProject Cambodia 2K16 team\nerected a fence around a\nschool for safety purposes as it\nwas close to a busy road.SiTIZEN  |  07/12\nThis resident was disabled during\nthe Vietnam War and earns US$2\na day weaving baskets so as to pay\nfor his and his spouse’s medical\nbills. We got together to clean\ntheir hut as well as the village\nand in return, he gladly taught us\nhow to weave a basket. Till now, I\nstill cannot forget how warm and\ngenerous they were even when\nthey only had the basics. In the\nyears ahead, the Project Vietnam\nclub hopes to improve the\nbusiness and entrepreneur skills of\nCambodians.\nWe cleared a strip of land about 25\nmetres by 5 metres for the children\nof Quang Phuoc Kindergarten to\ngrow their own vegetables. The\nharvest would be much healthier\nbeing pesticide-free. Additionally,\nwe added fresh coats of paint on\nthe walls of the kindergarten.With the help of a Vietnamese interpreter,\nsome members conducted English lessons\nfor the village children as well as for about\n100 students of a neighbouring secondary\nschool. We would have two sessions of\nan hour each in the morning and in the\nafternoon. Seeing the kids trying to pick\nup English words made our day.SIT students venture out every year for community\nservice projects in two neighbouring countries\nA generous sponsor from\nSingapore had provided\ncolour pencils and colouring\nbooks and these were\nmuch appreciated by the\nchildren. We also had\nthis arts and craft session\nfor them. These budding\nartists had so much fun!\nThe Project Vietnam club is five years old and\nfor the past two years it has worked with Hearts\nfor Hue, a non-governmental organisation in\nVietnam, to improve the lives of underprivileged\nchildren there. From 17 – 28 December last\nyear, 16 students and an SIT staff member\nwere in the Quang Dien district, near Hue, to\ncarry out several projects. Of course, it was\nnot all work and no play. The team took some\ntime off to celebrate Christmas and spread\ncheer especially to the children of the district.\nProject Vietnam president Norazirah\nbinte Selamat, from the Bachelor of\nHospitality Business with Honours\nprogramme (SIT), reveals what\nthe team accomplished on\na budget of about $15,000\nand the memories she\nand her team members\nbrought back.\nSet up in 2015, the Project Cambodia club works with Project\nKhmer H.O.P .E. (PKH), a St Andrew’s Cathedral community\nservice initiative to help Cambodians. In 2015, SIT students\nraised funds for the construction of a multi-purpose hall at PKH\nTrang Centre. Then in 2016, the club led by President Suhaila\nbinte Zainal Shah, who is doing the Bachelor of Arts with\nHonours in Criminology and Security programme (University\nof Liverpool), raised $25,000. Sixteen students and two staff\nmembers were there from 19 December 2016 to 1 January\n2017 for Project Cambodia 2K16 (a name coined by the team\nmembers). Here is what they did in the words\nof Vice-President Gary Ong, who is in SIT’s\nBachelor of Engineering with Honours\nin Information and Communications\nTechnology (Information Security)\nprogramme.\nTen SIT students tackled\nfood wastage issues in the\nFood Bank’s Project X-pired\nlll on 23-24 October 2016 at\nTampines 1 Atrium. They even\nconverted expired foodstuffs\ninto art pieces to be auctioned\noff to raise funds for the Food\nBank. Ms Serene Tan from\nthe Food & Human Nutrition\nprogramme was one of the\nstudents who volunteered\nfor this project through\nSIT’s Enterprise & Innovation\nHub’ s Community Innovation\nProgramme. She found it a\n“fruitful experience.”SiTIZEN  |  08/12\nSIT undergraduates invited to the annual Spring Reception get a taste of\ntraditional culture and a chance to interact with Chinese community leaders Savouring Spring\nSIT students and Mr Patrick Lee (Front row: third from right) exchanged well-wishes at the Spring Reception,\nwhich was also attended by dignitaries of close to 10 countries and student representatives from the other\nuniversities in Singapore.\nRaising awareness of\n– and reducing - food wastage\nFashion creations made from\nexpired foodstuffs were auctioned\noff to raise funds.\nThree SIT students helped\ntribal communities in\nnorthern Thailand brace\nfor the chilly winter season\nby giving the Project Lives\nRelief Programme a hand\nfrom 21-23 October. The\ntrio helped to sort and\npack donated clothes and\nother items in cartons for Warm Offerings\nfor Thai tribes\n(From right) SIT students, Ms Mui Meng Yin,\nMs Meta Wong and Mr Chua Hong Sheng\nworked with another volunteer to sort and pack\ndonated items in cartons.\nshipment. Mr Chua Hong Sheng, who is enrolled in the Marine\nEngineering programme, even brought food items and clothing\nfor the children. Project Lives is an annual project undertaken\nby non-profit organisation Radion International. For 18 SITizens, the Rooster’s crow heralded not just the start of the Lunar\nNew Year, but also a special opportunity to get to know Singapore’s Chinese\ncommunity and find out more about traditional Chinese culture.\nThe group of undergraduates – comprising two Yangzheng Foundation Bursary\nrecipients and 16 student leaders – was invited to the annual Spring Reception\nby Mr Patrick Lee, the Secretary-General of the Singapore Federation of Chinese\nClan Associations (SFCCA) who is also President of the Yangzheng Foundation.\nAn annual event to spread festive cheer and promote traditional values and\ncultural appreciation, this year’s reception was held on 30 January 2017. It was\njointly organised by the Singapore Chinese Cultural Centre (SCCC), SFCCA,\nand Business China.The Guest of Honour was Mr K. Shanmugam,\nMinister for Home Affairs and Minister\nfor Law, who spoke about how a\nsense of rootedness through culture\nwill help Singapore anchor itself amid\nglobal headwinds.\nSaid Mr Muhammad Imran bin Ismail, a\nYangzheng Foundation Bursary recipient\nfrom the Bachelor of Engineering\nwith Honours in Mechanical Design\nEngineering (University of Glasgow)\ndegree programme: “I’m grateful to\nMr Lee for giving me, a non-Chinese\nstudent, this opportunity to witness a\nlively celebration of Chinese culture.\nSingapore is built up by not one, but\nall races. I believe that it is a must to\nunderstand and appreciate all other\ncultures that Singapore is made of.”\nFor Ms Chung Ka Yan from the Bachelor\nof Arts with Honours in Interior\nDesign programme (The Glasgow\nSchool of Art), the event offered up\nanother precious opportunity. She\nsaid, “Attending this gathering gave\nme a valuable taste of the importance\nof networking. I met several ministers\nand spoke to businessmen who\nshared their experiences in engaging\ngrowing industries in China.”\nThis year’s Spring Reception attracted\nmore than 800 guests and was the first\nto be held at the new Shenton Way\npremises of the SCCC. Mr Chua Thian\nPoh, the chairman of the Centre and\npresident of the Federation, said the\nCentre will have its official opening\nand will also announce the recipients\nof its inaugural Singapore Chinese\nCultural Contribution Award in May.\nThe photos above and bottom left were among the many displayed at the ways we live  – a photo exhibition held by 47\nstudents from the Bachelor of Arts with Honours in Interior Design degree programme (The Glasgow School of Art).\nOne issue it examined was the ways in which people customise, modify and “declare” their living spaces, as they take\nownership of housing envisioned and planned by interior designers. This investigation of how interior designs are used,\nas well as other topics, was explored through photographic study of Singapore’s HDB houses, as well as Glasgow, UK’s\n“tenement” style of housing.\nSays SIT scholar and student, Mr Indra Syafiq bin Samad, “A house is a house, but it’s the individual that creates a home.\nThe project helped me to observe small details to see how people transform a designer’s work into a place that they call\ntheir own.”\nThe exhibit was held in December at the Singapore City Gallery. To view more of their work, visit thewayswelive.com .SiTIZEN  |  09/12\nThis photo by student Er Chen Wei aims to capture the essence of the household that he studied, as well as the family’s aspirations and hopes for good fortune.\nFrosted windows allow you to know if anyone is outside your house, and prevent the\nperson from getting a clear look inside your room. Photo by student Chua Rong Heng.Mr Indra Syafiq bin Samad (top left) with fellow Interior Design students at the ways\nwe live exhibition held at the Singapore City Gallery.\nHow a Design Becomes a Home\nFirst-year students from the Interior Design programme at SIT-GSA photographed home interiors, bringing attention\nto domestic arrangements which are otherwise taken for granted\nSiTIZEN  |  10/12\nAlumnus R. Suria and current student Yeung Chun Yin both represented Singapore in the 2016 Men’s World Floorball\nChampionships held in Latvia, from 3-11 December. It was the first world championships for half of the team so it was\nnot surprising Singapore was outplayed by many of the more experienced teams.\nMr Suria was in the thick of the action at the recent Alumni Floorball Session. He said, “SIT floorball had helped improve\nmy playing skills. So I wanted to give back to the school by sharing my knowledge of floorball.”\nMr Yeung missed the session as he had a semi-final game for the Singapore Floorball League Division 1\nchampionship that day. He is a first-year student of the Bachelor of Engineering with Honours in Mechanical Design\nand Manufacturing Engineering (Newcastle University) programme. Coincidentally, Mr Suria graduated from the very\nsame programme last year.There were no prizes for victory but the teams tried their very best to win.\nAlumnus R. Suria in action at the 2016 World Floorball Championships in Latvia.Our Very Own National Players\nThe weather looked doubtful at first but the drizzle tapered off and the Alumni\nFutsal Session kicked off on schedule at 9am on 19 November 2016. Alumni\nand current students came together to make four mixed teams. Played on the\nfutsal pitch at SIT@Dover, there were shouts of joy when goals were scored.\nOver at the Sports Hall at the same time, there were also four teams of\nalumni and undergraduates taking part in the second Alumni Floorball\nSession of the year. Enthusiasm was high as each team pooled their skills\nto guide the ball with their floorball sticks into their opponents’ nets.\nWhen the sessions came to a close at 12pm, many of the 45 participants\nagreed that it was loads of fun. Ms Ng Hui Xian had found out about the Game to Win\nAlumni and students take time out for some competitive fun at\nthe Alumni Futsal and Floorball Sessionsfloorball session from varsity friends. The\ngraduate of the Bachelor of Engineering\nwith Honours in Chemical Engineering\nprogramme (Newcastle University) said,\n“The event was a great opportunity to\nbond with alumni with similar interests.”\nTired but happy, Mr Hussairi bin Hussin, a\ngraduate from the Bachelor of Engineering\nwith Honours in Mechanical Design and\nManufacturing Engineering programme\n(Newcastle University), said he enjoyed\nthe futsal as well as the networking and\nmingling that went with it. He added, “I like\nto join in alumni activities because I get to\nknow more people and at the same time\nstay connected with SIT.”\nLook out for the next Futsal Session in March\n2017 and Floorball Session in May 2017!\nA participant displaying ball control in one of the floorball\ngames.\nFrom left: Alumnus R. Suria and student Yeung Chun Yin at the airport heading to\nLatvia for the Men’s World Floorball Championships.\nSiTIZEN  |  11/12\nA Better Florist\n• 20%  off total bill at http://www.abetterflorist.com\n• Key in the code ‘ABFSIT20’  at checkout\n• Valid until 16 Aug 2018\nAFFINITEA\n• 10%  off all AFFINITEA beverages\n• Valid until 22 Aug 2017\nAngelFlorist Services\n• 10%  discount with a minimum purchase of $80\n• Key in the code ‘SIT2016’  at\nhttp://www.angelflorist.com\n• Valid until 31 July 2017\nBattlestrike\n• 10%  off total bill\n• Book sessions at http://www.battlestrike.com.sg\n• Valid until 30 April 2017\nBi Bing Korean Dessert Café\n• 10%  off total bill\n• Valid until 1 June 2017\nClubvivre\n• $50 off on all online bookings\n• Key in the code ‘CVSIT2016’  at\nhttp://www.clubvivre.com\n• Valid until 15 July 2017\nDancepointe Academy\n• Free first trial and 10%  off first term\n• Valid until 1 Mar 2017\nFloral Garage Singapore\n• 10%  off total bill at www.floralgaragesg.com\n• Key in the code ‘SIT010’ at checkout\nGifts Less Ordinary\n• 5% off any purchase at\nhttp://giftslessordinary.com\n• Valid until 1 June 2017\n• Key in the code ‘SITU’  at checkout\nGlacier Frozen Yogurt Café\n• 10%  off on all food products\n• Valid until 1 June 2017SIT Alumni Card Benefits\nHipVan\n• 10% off bill at www.hipvan.com\n• Use code ‘10SIT’  at checkout\n• Valid until 1 June 2017\nIntune Music\n• 10%  off on course fees for first 3 months;\nWaiver of administrative fees\n• Valid until 1 March 2017\nKitchen Capers\n• 10%  off bakeware tools/\npackaging needs/books/DVDs\n• 5% off food/ingredients\nNanyang Optical\n• 40%  off all regular-priced frames\n• 10%  off all contact lenses with\nminimum purchase of 2 boxes\n• 30% off conventional contact lenses\n• Valid until 1 March 2017\nPies & Coffee\n• 10%  off total bill\n• 50% off slice cakes/tarts with 2 gourmet\npies/brunch purchased\n• 15%  off whole cakes\n• Valid until 31 May 2017\nPlanet Popcorn\n• 10%  off purchases using code ‘SIT2014’\nduring checkout at www.sgplanetpop.com\n• 15%  off and free delivery for orders\nabove $150. Use code ‘Corporate’\n• Valid until 1 March 2017\nSeasonal Salad Bar\n• 10%  off all regular priced items\n• Participating Outlet: One@KentRidge\n• Valid until 1 Apr 2017\nSharetea\n• 10%  off all regular priced items\n• Valid until 15 June 2017ShopBack\n• $10 Benefit\n• Up to  18.0%  Cashback when shopping\nwith selected partners\n• Visit https://www.shopback.sg/\nfor more details\nSolemates\n• 10% off sales items with every $200\nspent in a single receipt\n• Valid until 1 March 2017\nSpectacle Hut\n• 20%  off on frames & sunglasses;\n15%  off on lenses\n• 3% off on contact lenses\n• Participating Outlet: Jurong Point\n• Valid until 30 April 2017\nSunlife Durian Puffs & Pastries\n• 10%  off total bill\n• Participating outlets: Causeway Point\nShopping Mall, 333 Coffee Shop\n(Blk 136 Bedok North Avenue 3)\n• Valid until 31 July 2017\nThe Braces Practice\n• Discounted rates for various braces options\n• Valid until 14 June 2017\nTotally Hot Stuff\n• 10%  off total bill\n• Valid until 30 April 2018\nXorex Press Pte Ltd\n• $8 for A2 poster with mounting\n• $16 for A1 poster with mounting\n• Valid until 1 March 2018\n*Please present your SIT Alumni Card\nprior to making payment.\nTerms and conditions apply. Please refer to\nhttp://sl.singaporetech.edu.sg/Welfare/SITreats.aspx\nfor detailed terms and conditions.All for a Good Cause\nEven after graduation, these passionate alumni are staying grounded in the\ncommunity, actively dedicating time and effort in caring for the underserved\n(Front row, from left) Ms Lim Si Yin and Ms Eileen\nChew during their Overseas Immersion Programme in\nGlasgow in 2015 before they graduated.\nVolunteering twice a week at various\norganisations including the Rotary Club of\nBugis Junction Satellite Club and Animal\nAllies is Mr Varun Kumar, 30, a graduate\nfrom the Bachelor of Engineering with\nHonours in Aeronautical Engineering\ndegree programme (University of\nGlasgow).\nHe is the Chairman of the Satellite Club,\nwhere youths like himself organise\nservice projects which include home\nrefurbishments for the underprivileged.\nIn addition, he has undergone training\nto be a counsellor for Mitra – a religious\ncounselling programme run by the\nHindu Centre for prison inmates to help\nturn their lives around. He says that\nhe continues serving the community\nbecause it’s fun and gives him a “sense\nof happiness and satisfaction”.\nMr Kumar is not alone in helping out\nthose who face stigma within society. Ms\nEileen Chew, another SITizen, is currently\nundergoing an orientation to volunteer\nat the Institute of Mental Health. An\nemployee of SBS Transit, the alumnus\nfrom the Bachelor of Engineering with Honours in Mechatronics (University\nof Glasgow) says she is interested in\nworking with these patients “because\nthere is a lack of awareness on how\ndeadly illness health can be”.\n“Sometimes these patients are dismissed\nbecause they are thought to be\npossessed or wanting attention, when\nit really is difficult for them to have a\nconstant battle waging in the mind,”\nshe says.\nHaving witnessed how her efforts\ncan benefit the lives of the elderly, Ms\nLim Si Yin, who graduated in 2016 from\nthe Mechanical Design Engineering\nprogramme (University of Glasgow), is\nnow keen to pursue a career in social\nservices.  Ms Lim, Ms Chew and another\nschoolmate were founding members\nof Project Shine in 2015, where\nthey enlisted volunteers among the\nstudent body at SIT to help the elderly\nin lower income neighbourhoods clean\ntheir homes.\nThe 26-year-old Ms Lim has recently\nhelped at an activity day for seniors at the Fei Yue Senior Activity Centre in\nBukit Batok. She says, “We shouldn’t\nforget the elderly and they must still be\nrespected.”\nAs someone who is just starting out in his\ncareer as an engineer in the aerospace\nindustry, Mr Kumar admits that it can be\na challenge to juggle a job, personal\ncommitments and the desire to give\nback especially when he has to attend\nmeetings to plan his service projects\nafter work. He suggests putting aside\na day for family and loved ones, and to\ninvite friends along when volunteering.\n“Ensuring that you get adequate sleep\neveryday helps too!” he quipped."
}