{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizen-buzz-issue-25-June-2022.pdf",
  "type": "pdf",
  "content": "Strategise, Support and Shoot!\nSITizen Ambassadors get to know one another better over an exciting game of laser tag\nEl 03 June 2022\nSITizen Ambassadors fuelling up before the game.\nS!Tizen Ambassadors (SAms) have played an important role in supporting SIT's Advancement and Alumni Division (A&A) events,\nespecially so in the last two years where they facilitated virtual meetings between Alumni mentors and Student mentees in various\ncycles of the SIT Alumni Mentoring Programme.\nOn Saturday 14 May 2022, 14 SAms finally met up offline for the first time amid the pandemic. At the event hosted by A&A, they first\nenjoyed a hearty lunch at Nando's before getting their adrenaline pumping in a fast-paced game of laser tag at Laser Quest@ Tampines\nHomeTeamNS. During the afternoon, they got to know one another better and gain a deeper understanding of the twin functions of A&A­\nwhich is to encourage and secure philanthropic giving in support of SIT and its students, while also serving as SIT's main point of contact\nfor all alumni to connect back with their alma mater and with one another.\nAll smiles around che cable!\nThe SAms had a blast, firing and dodging shots while supporting their teammates and attempting to complete their mission in the black­\nlit arena. Year 2 Hospitality Business student Mr Mohamad Irfan Bin Roslee said, \"Echoing Barney Stinson from the well-known sitcom\n'How I Met Your Mother', laser tag is awesome! The activity really allowed everyone from SAms to the A&A team to let loose for a\nmoment and just enjoy themselves.\"\nYear 2 Accountancy student Mr Melvin Tan shared the same thoughts. \"I enjoyed competing and teasing the lowest scorers on their\nquestionable strategy during the games. I also got to know all of the members on a personal level, and it was an enjoyable experience\nexpanding and strengthening our relationships with one another,\" he said.\nAll decked out and ready to have fun!"
}