{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenbi-annualjuly-2021.pdf",
  "type": "pdf",
  "content": "SIT’S 4 Strategic Thrusts in an Era of Disruption\nNew Robotics Systems Degree Programme to Meet Techno Shifts\nSITizens at the Frontline\n4 Angels and a New BursaryOnce a SiTizen, Always a SiTizenBi-Annual\nJuly 2021\nTHRIVING\nIN ADVERSITY\nVirtual Success\nSITizens press ahead as key university\nevents go swiftly online amid the pandemic\nCelebrating the Class of 2020\nAmong those receiving their degree scrolls are the pioneer cohorts of Allied Health and Civil Engineering\nSIT Launches Robotics Systems Degree Programme for AY 2021/22\nNew degree will position students to handle automation needs and\ntechnological shifts\nDeepening Applied Learning\nfor an Era of Disruption\nProf Chua Kee Chaing, Deputy President (Academic) & Provost on how four strategic thrusts are propelling SIT on its trajectory to be Singapore’s premier university of applied learning\nStroke Survivors’ Inactivity Not Just Due to Lack of Motivation\nSurvey by SIT students shows many\nother hindrances to physical activity\n– barriers that organisations and the\npublic can help to reduce\nContribute!\nWe want to hear from you! Should you\nlike to contribute a story to share with the SITizen community, please contact us at\nAlumni@SingaporeTech.edu.sg\nSITizen Bi-Annual is a publication\nby the SIT Advancement & Alumni\nDivision.\nFor enquiries, please e-mail us at\nAlumni@SingaporeTech.edu.sg\n(C) Singapore Institute of\nTechnology 2021Contact Us:\nSIT Advancement & Alumni Division\nSingapore Institute of Technology\nSIT@Dover\n10 Dover Drive\nSingapore 138683\n6592 3314 / 6592 2129\nAlumni@SingaporeTech.edu.sg\nwww.singaporetech.edu.sg/alumni\n@sitalumni4\n6\n8\n10\n1213\n14\n15\n16\n1718\n19\n20\n22\n24\n26\n28\n303\nReimagining Sustainability with\nThe Mapletree Challenge\nPlatform allows some 750 students to learn job interview and presentation skills, pitch entrepreneurial ideas\nIt Takes a ‘Kongsi’\nSince 2017, The Ngee Ann Kongsi has made an indelible impact on the lives of SIT students through its wide-ranging\nphilanthropic support\nEmpowering Future Leaders\nfor the Community\nGenerous gifts from Mr Patrick Lee and the Yangzheng Foundation enable SIT to establish a new Scholarship, Bursary, and a Community Leadership and Social Innovation Grant\nA Glittering Gift from Prima Group\nTo commemorate its Diamond Anniversary, the Prima Group makes an endowed gift to support an applied research grant and a scholarship at SIT\nThe Masonic Charitable Fund’s First Endowed Gift to an IHL Goes to SIT\nA bursary from the Fund to nurture financially needy undergraduates from all disciplinesNew Bursary Uplifts Future Healthcare Professionals\nPermanent support for Nursing and\nAllied Health undergraduates at SIT –\nthanks to a new endowed gift made by the Ti Sui Tsu Memorial Fund\nNurturing Talent,Inspiring Service\nWith an eye to community development, OUE Limited makes possible an endowed scholarship at SIT\nMaking an Impact, the SITizen Way\nAmid the pandemic, alumni Krithi Pushpanathan and Ang Xu Kai spend countless hours at the frontlines to assist migrant workers, suspected COVID-19 cases, and other groups in need\nA Therapeutic Match\nA trio of participants from the Health & Social Sciences cluster talk about their learning journey through the inaugural cycle of The SIT Alumni Mentoring Programme\nTheir Very First Time!\nDebuting as a competing Cluster at SIT ICG 2021, SIT alumni bag 1 Gold, 3 Silvers, and a Bronze\nStaying Safe, Connected – and Delighted\nFun online workshops keep alumni\ntogether, while the Class of 2020 gets a\nspecial delivery\nCelebrating SITizen Volunteers\nIn appreciation of SIT’s Student Hosts\nand SITizen Ambassadors\n‘4 Angels’ to the Rescue\nA little help from SITizens births new\nbursary for occupational therapy studentsDEAR READERS\nSITizens Still Rise!\nIn the face of adversity, SITizens and their alma mater find new ways to thrive. The new SITizen Bi-Annual is just one example. Published every July and January, it looks at our university through a wider lens. This print publication complements SITizen Buzz – the monthly e-newsletter\nthat was launched amid last year’s safe-distancing measures to reach our alumni and friends with timely and byte-size updates on the Singapore Institute of Technology (SIT).\nIn this inaugural issue, you will find an interview with Prof Chua Kee Chaing,\nDeputy President (Academic) and Provost, on SIT’s strategic thrusts to deepen applied learning and strengthen applied research in an era of disruption.\nWe also look back at how key university events such as the Student\nOrientation, SIT Open House and Career Nexus pivoted online in the past year, and how SIT went on to hold a physical graduation ceremony for the Class of 2020, being the first Autonomous University to do so since the outbreak. And how, as they stayed safely home, our alumni continued to enjoy and learn from interacting with their fellow SITizens, via a range of online workshops and webinars organised by the SIT Alumni Networks.\nIt is in these hard times that SIT’s philanthropic partners are coming\nforward to nurture and support SIT students. Our SITizens, too, are stepping up and out to make their impact on the community. In the following pages, meet Ms Krithi Pushpanathan and Mr Ang Xu Kai, two SIT alumni at the frontlines who are helping migrant workers, suspected COVID-19 cases and others in need.\nWe hope you will enjoy reading these stories. In the meantime, do\nkeep safe and healthy. Should you have any feedback, please drop us a line at Alumni@SingaporeTech.edu.sg!\nSIT Advancement & Alumni Division3 2\nVirtual Success\nSITizens continue to press ahead as key university events\ngo swiftly online amid the pandemic\nAn Innovative Orientation for New Students\nRestrictions imposed on physical events due to COVID-19 led the Singapore Institute of Technology (SIT) to innovate the SIT Student Orientation experience for incoming freshmen for Academic Year 2020. Conceptualised by Information and Communications Technology (ICT) cluster students and special interest student group SIT Geeks together with the Student Life Division (SLD), the E-Orientation website was a one-stop portal that allowed seamless and convenient access to Club Fair, Day Zero and Orientation at any time. It featured a virtual tour of all six SIT campuses. The new students SIT’s First Virtual Open House\nIn January 2021, prospective students and parents gained exclusive insights into the various programmes available for the upcoming Academic Year 2021 at SIT’s first virtual Open House. A series of 30 talks was put together by various academic clusters, as well as the Admissions and Student Life Divisions. The event also featured a virtual campus tour.\nOne of the dialogue sessions titled\n“The Value of An Applied Learning Degree in this Disruptive World” delved into a deep discourse on how SIT prepares its students for the future workplace. Moderated by Mr Kelly Koh,Director of Admissions, the panel featured Prof Chua Kee Chaing, Deputy President (Academic) & Provost, Mr Skye Tan Zhikai, Hospitality Business graduate (Class of 2018) and Marketing Manager, Intercontinental Singapore, as well as Ms Devanshi Patidar, a Year 4 Diagnostic Radiography student.SIT and its partners such as Far East Hospitality set up virtual booths which participants could visit and interact with at the online SIT Career Nexus.\ncould also discover on it interesting facts about the university.\nZoom and YouTube Livestreams\nprovided interaction and buzz for students during the Club Fair. Some student clubs hosted Zoom rooms to interest the freshmen. Others chose to stream their activities and lessons online for the new students to get a feel of the clubs’ activities. Over 1,700 students attended these online events.\nDuring the Orientation Week, the\nwebsite saw over 2,150 students logging in, garnering over 117,000 pageviews and 85% attendance for Day Zero.Said Prof Chua, “It is important in today’s world to practise lifelong learning because, as you know, technology changes very rapidly. For the current generation, you will have multiple careers in a lifetime, so you will have a lifetime of careers, rather than a career of lifetime, as was the case for earlier generations. It is therefore extremely important that we prepare you to be a lifelong learner.”\nSIT Career Nexus 2021:\nNetworking in the New\nNormal\nSIT Career Nexus went online on 27\nJanuary 2021. At the time, it was the largest-scale career event for the University. About 2,050 students from 23 degree programmes and over 160 companies (from both the private and public sectors) participated in the event. This annual platform enables employers to meet and hire the right talent, and at the same time allows SITizens to search for job opportunities or Integrated Work Study Programme (IWSP) positions.Chemical Engineering student Kester Leung said he found the platform to be effective and user-friendly. “The resource panel has a display of all available job openings, and I can search for what I want easily. I am also able to discover more about lesser-known companies which are relevant to my degree programme,” he said.\nJFD Singapore Pte Ltd, one of the\nworld’s leading subsea operations and manufacturing companies and industry partner of SIT, views the IWSP as a good talent pipeline for both the university and industry. It also appreciates the fresh perspective that SITizens bring with them to the workplace. “We are offered bright, young and enthusiastic talents, who are willing to learn and contribute and bring with them fresh ideas,” said Human Resource Manager, Ms Rusiatie Suryadi. “Conversely, we also learn from the students and faculty. This helps us stay relevant in our dynamic industry.”\nStudent guides taking the\nuser on a virtual tour around SIT@Dover campus on the e-orientation website.\nA dialogue session on ‘The Value of An Applied Learning Degree in\nthis Disrupted World’ during the SIT Virtual Open House 2021.\nLoved the\npersonalised feel of the website!\nEverything was very well-connected.\nE-Orientation was really helpful.\nWebpage was designed to give freshmen an enhanced experience, as well as a better understanding of the different campuses and the culture here at SIT...Fresh Bouquets from Freshmen\n5 4\nExceptional Support for\nExceptional Students\nIn Academic Year 2020/21, 13 new performance awards were presented for the very first time at SIT to recognise student excellence. Most of these awards were established in 2020 – amid the pandemic – with the support of corporate and industry donors:\n• AbbVie Outstanding Student\nAward in Pharmaceutical\nEngineering\n• Amoy Street Dental Book Prize\nin Individual and Environmental\nInfluences on Eating Behaviours\n• Canon Medical Systems Asia Outstanding Student Award in\nDiagnostic Radiography\n• Chong Yook Yin Book Prize\nin Principles and Practice of Population Health\n• FARM Book Prize in Communication Design – Studio 4\n• FARM Book Prize in Interior Design – Studio 4\n• ISCA Book Prize in Business Capstone\n• Kreston Ardent CAtrust PAC Book Prize in Accounting Information Systems\n• Kreston Ardent CAtrust PAC Book Prize in Business Valuation and Analysis\n• PARKROYAL on Beach Road Book Prize in Service Quality Management\n• Rotary Club of Bugis Junction Commendation Award\n• Samwoh Corporation\nOutstanding Student Award in\nCivil Engineering\n• Taylor & Francis Asia Pacific Book\nPrize in Exercise Physiology\nThe Singapore Institute of\nTechnology (SIT) hosted its\nGraduation Ceremony from 23 to 27 February 2021, in celebration of the achievements of the university’s Class of 2020. The main session, held at The Theatre at Mediacorp, was graced by Mr Ong Ye Kung, then Minister for Transport. SIT was the first Autonomous University to resume physical graduation ceremonies in more than a year.\nClose to 2,200 graduates from 47\nundergraduate and postgraduate programmes received their degree scrolls. This includes 783 graduates from SIT-conferred programmes, 524 graduates from SIT-overseas university (OU) joint programmes, and 882 graduates from degrees conferred by SIT’s OU partners.\nFor Physiotherapy graduate\nMr Gabriel Ou and his course mates, this was a happy reunion. “Most of us had not seen each other since our last class together. The graduation ceremony gives us the opportunity to recognise how we are Taking a socially distanced photo with fellow\ngraduates.\nParents of graduates were able to attend the\nceremony to witness the joyous moment.Then Minister for Transport, Mr Ong Ye Kung graced the main session of SIT’s series of Graduation Ceremonies, held at The Theatre at Mediacorp.\nCelebrating the Class of 2020\nAmong those receiving their degree scrolls are the pioneer cohorts of Allied Health and Civil Engineering\nno longer students – but practicing physiotherapists now – and we get to celebrate our dream coming true together,” he said.\nSingapore’s First Locally Trained Allied Health\nProfessionals to Meet\nDemands of Healthcare\nSector\nThe occasion marked the graduation\nof the first batches of Allied Health students from SIT’s Diagnostic Radiography, Occupational Therapy, Radiation Therapy and SIT-Trinity College Dublin Physiotherapy programmes. A preliminary employment survey conducted by SIT found that 97% of the 211 graduates from these programmes were working as frontline healthcare workers and helping to meet the needs of Singapore’s rapidly silvering population.\nAll of SIT’s Allied Health students\nundergo curricula that were developed in consultation with Singapore’s public and private healthcare institutions. The Diagnostic Radiography, Radiation Therapy, Occupational Therapy, Physiotherapy as well as Speech and Language Therapy programmes are recognised by the Allied Health Professions Council (AHPC). Students are required to fulfil a 30- to 40-week Clinical Practice Education during their course of studies, where they are placed in a variety of clinical settings to hone their clinical skills.\nPioneer Batch of Graduates with Deep Technical Expertise in Civil Engineering\nSIT also graduated its first cohort of students from the SIT-University of Glasgow Civil Engineering degree programme, which has strong relevance to the Built Environment and Construction Industry Transformation Map (ITM), one of the 23 ITMs identified by the Future Economy Council (FEC). Launched in 2016, this programme aims to address the sustained need for local Civil Engineers with the necessary professional qualifications. The Civil Engineering degree programme had equipped all 48 of its graduates with the practical knowledge and skills to plan, design, construct, maintain and operate infrastructure such as roads, rail, buildings, and underground structures, as well as to rehabilitate ageing critical infrastructure in service. The graduates had also gone through an eight-month work attachment as part of SIT’s signature Integrated Work Study Programme (IWSP).\nSIT Graduates Highly Employable Amid Challenging Economic Climate\nBased on SIT’s preliminary employment survey, 91% of the respondents from the Class of 2020 had secured employment since the completion of their studies. Graduates from the Information and Communications Technology (Software Engineering), Sustainable Infrastructure Engineering (Land) and Marine Engineering programmes obtained a 100% employment rate.\nProf Tan Thiam Soon, President,\nSIT, believes that this is a result of SIT’s industry-focused curriculum, as well as the success of its IWSP , which is mandatory for all students of SIT-conferred and SIT-OU joint programmes. He said, “We are thankful to have received strong support from our industry partners, allowing SIT to maintain high relevance of its programmes through continual consultation, adoption of best practices, applied research projects and IWSP . With the duration of IWSP lasting between eight to 12 months with well-defined learning outcomes, students are assigned projects with a longer timeframe, and thus are able to learn more from this attachment and also make more significant contributions to the company.”\nSupport Measures for Class of 2020\nIn line with its commitment to encourage lifelong learning, SIT has been offering its alumni, including the Class of 2020, $2,000 worth of SITizens Learning Credits since 2019. The credits can be used for Continuing Education and Training modules offered by SITLEARN Professional Development, SIT’s lifelong learning division. Some of these modules can be stacked into Postgraduate Certificates.\nMade possible through the\ngenerosity of various donors, the Student Relief Fund at SIT (COVID-19) has been established to assist students at SIT who are facing financial hardship due to the pandemic. Eligible students may receive up to $2,000 each to help them with their daily living and education expenses. More than $2.2 million have been donated towards the Fund, benefitting 690 SIT students thus far.\nAs a host company of the\nSGUnited\nTraineeships (SGUT) programme,\nSIT has 17 of its divisions offering traineeship positions for graduates. SIT graduates have also taken up SGUT opportunities in various other companies, including the university’s industry partners.\n7 6\nNew degree will position students to handle automation\nneeds and technological shifts in the years aheadSIT Launches Robotics Systems Degree\nProgramme for AY 2021/22\nAdding to its suite of specialised\ndegree programmes, the Singapore Institute of Technology (SIT) has introduced a new programme, the Bachelor of Engineering in Robotics Systems (RSE), for the upcoming Academic Year (AY) 2021/22. Commencing in September 2021 with an initial intake of 40 students, the four-year programme focuses on the design and development of Service/Field Robotics Systems, with an emphasis on Systems Engineering.\nMeeting Industry Demand\nfor Talents in Robotics Development\nAs demand for automation goes\nbeyond the confines of factories, field robots – mobile robots that operate in dynamic, unstructured environments – are sought after to perform tasks that are too laborious or dangerous for humans. Robots and automation are solutions that help improve productivity and efficiency amidst mounting pressures on Singapore’s population growth and labour supply. According to the Ministry of Trade and Industry Singapore (MTI), over 4,400 industrial robots were installed in 2017, representing an increase of 72% from 2016, a testament to the increasing demand for automation.\nDesigned in consultation with\nkey partners such as the National Robotics Programme (NRP) and Economic Development Board (EDB), the RSE programme aims to train engineers who are capable of developing, deploying and maintaining field robots, thus fulfilling the anticipated demand for robotics engineers.\nSaid Prof Quek Tong Boon, Chief\nExecutive, NRP , “Robotics is already widely used in manufacturing and we expect to see even greater adoption of industrial robots in the coming years. With advances in technology that enable robots to interact more naturally, intelligently and safely with humans in people-centric environments, there will be more robots expected in our service sectors and public spaces. We need to nurture more roboticists to support such increased adoptions, and NRP welcomes the setting up of the RSE programme to help grow our robotics talent pool.”\nMs Fong Pin Fen, Vice President\nand Head, Advanced Manufacturing Strategy Group, EDB, said, “Robotics and automation are key focus areas for Singapore, creating new growth opportunities and enabling the transformation of our industries. Singapore has a growing base of robotics companies, system integrators and research institutes to design, develop and enable adoption of robotics solutions in the manufacturing and service sectors. The RSE programme will equip students with the right skillsets to tap into these opportunities, and develop new capabilities to enhance Singapore’s competitiveness.”\nThe programme focuses on the\ndesign and development of service/\nDesigned in consultation with key partners such as the National Robotics Programme (NRP) and Economic Development Board (EDB), the RSE\nprogramme aims to train engineers who are capable of developing, deploying and maintaining field robots.\nNew SIT-conferred Degree Programmes Previously Offered As:\nBachelor of Engineering in Robotics Systems N.A.\nBachelor of Science in Physiotherapy Bachelor of Science with Honours in Physiotherapy – joint\ndegree programme offered by SIT and Trinity College\nDublin\nChange in Degree Programme Names Previously Offered As:\nBachelor of Engineering in Computer Engineering (Intelligent Transportation)Bachelor of Engineering with Honours in Telematics (Intelligent Transportation Systems Engineering)\nBachelor of Engineering in Mechatronics Systems –\njoint degree programme offered by SIT and\nDigiPen Institute of Technology SingaporeBachelor of Engineering in Systems Engineering (ElectroMechanical Systems) –\njoint degree programme\noffered by SIT and DigiPen Institute of Technology\nSingapore\nMaster of Science in Chemical Engineering Master of Engineering Technology in Chemical Engineering\nMaster of Science in Civil Engineering Master of Engineering Technology in Civil Engineering\nMaster of Science in Electrical and Electronic EngineeringMaster of Engineering Technology in Electrical and Electronic Engineeringfield robotics systems, with an\nemphasis on the integration of multiple engineering disciplines via Systems Engineering. Students will be trained to deploy integrative elements, such as Software Engineering and Artificial Intelligence (AI), to connect multiple mechatronics elements together to form a complete robotics system.\nStructured on a project-based and\napplied learning pedagogy, the programme incorporates a significant amount of learning activities that allow students to simultaneously experience Systems and Software Engineering, Project Management, as well as integration of knowledge from multiple disciplines. Students will go through a 12-month work attachment as part of their Integrated Work Study Programme (IWSP), a distinctive feature of all SIT programmes.\nProf Chua Kee Chaing, Deputy\nPresident (Academic) & Provost, SIT, commented: “SIT is constantly growing its suite of programme offerings that are targeted at growth sectors of the economy. Robots are no longer just operating in the factory shop floor, but are also required to work for, and alongside humans in various field applications. Through this new Robotics Systems degree programme, SIT will nurture talents who will make robots operate safely and effectively in the field to benefit industry sectors such as built environment, hospitality and healthcare.”\nNew Offerings and New Names for the New AY\nAdditionally, the new Academic Year will see the joint programme in Bachelor of Science with Honours in Physiotherapy, offered by SIT and Trinity College Dublin, converted to a four-year SIT-conferred programme. Name changes for the following degree programmes will also take effect in AY 2021.\n9 8\nProf Chua Kee Chaing,  Deputy President (Academic)\n& Provost on how four strategic thrusts are propelling SIT on its trajectory to be Singapore’s premier university of applied learningDeepening Applied\nLearning for an\nEra of Disruption\nSince 2020, the Singapore Institute of Technology (SIT) has\nbeen working on four strategic thrusts to strengthen its applied learning pedagogies. Prof Chua Kee Chaing, Deputy President (Academic) & Provost, SIT, says the move is in line with SIT’s mission to nurture work-ready professionals and lifelong learners through the applied learning pathway. The four strategic thrusts are:\n• Deepening Applied Learning:  SIT has embarked on a programme harmonisation effort to introduce transferable skills and weave inter-disciplinary learning into the curriculum. These components are crucial in moulding highly employable and adaptable SITizens who are equipped with skills to work in adjacent sectors when necessary.\n• Pioneering Workplace Learning: SIT will pioneer a competency-based workplace learning pathway and will pilot new degrees to admit professionals based on the competencies they have built during their course of work. These degree programmes will further equip them with knowledge and skills and enhance their career prospects.\n• Strengthening Applied Research: SIT is pursuing applied research projects to address the needs of small and medium-sized enterprises (SMEs) and help them in their transformations. A plan is being mapped out where SIT can conduct applied research for SMEs, and identify partners and funding to leverage on.\n• Leveraging Living Lab: SIT is developing a virtual SIT and a digital twin to support applied learning, applied research, as well as provide selected end-user services. These efforts will bring SIT closer to realising a campus that can inspire students and faculty to innovate and transform industry and the community. To make the Living Lab operational by 2024, plans in testing the operating model, curating inventory of applications and use cases, as well as developing the technology architecture are underway.\nIn the following Q&A, Prof Chua elaborates on how these efforts will differentiate SIT from other universities:\nQ: How important are\ninterdisciplinary learning and transferable skills in ensuring that our students are employable and future-ready?\nA: Ensuring that our students\nhave mastery of their disciplinary\nknowledge is extremely important as we are training them to be professionals. In fact, companies tell me that this is a given when they shortlist candidates for job interviews. Graduates who exhibit strong transferable skills will stand out as they will be more effective in working with others and more agile in handling different tasks.\nIssues and problems at work\nare becoming increasingly more complex. Solutions to complex problems are never mono-disciplinary in nature, so the sooner our students get exposed to inter-disciplinary learning, the better they will be prepared for the real world. Inter-disciplinarity is not about opening up many modules from different disciplines for students to read, and leaving it to them to connect the dots. It is about curating relevant modules from adjacent disciplines that are (or will be) impacting the industry considerably. What we want is for our students to learn more deeply the adjacent disciplinary knowledge that might be needed at work later. We also want them to be comfortable working in multi-disciplinary teams. For this, we will create whitespace opportunities for them to work in teams of students from different programmes.\nQ: How will the competency-based\nworkplace learning pathway impact the way degree programmes are delivered?\nA: It is an important initiative, given\nthe drive for lifelong learning and the aspiration to gain a university degree. Both universities and companies must strongly believe that it is better for someone in full-time employment to upskill, compared to the employee pursuing a part-time degree while working or doing a full-time degree. The university and company would need to work very closely to design and implement the programme to meet the needs of the company – without affecting the learning outcomes of the programme that define its quality, insofar as professional recognition is concerned. It is quite tailored, but scaling up is possible if we work with a trade association or chamber to cover an entire industry sector.\nWe are moving forward with this\nby leveraging our existing degree programmes. We create another pathway that uses competency-based assessments to develop workplace learning activities that can lead to the same learning outcomes of our existing programmes. Through this, we can also recognise prior competencies and award credits accordingly, enabling learners to complete their degree faster. Inevitably, there will be gaps that need to be bridged, either through having the learners return to campus for a day or two per week, or through online modules. This workplace learning pathway will run alongside the traditional on-campus pathway which will continue to cater to learners who prefer to study full-time.\nQ: What is SIT’s niche in applied\nresearch? What can we do to level up our competencies in this area?\nA: As a University of Applied\nLearning, we position our research to bridge knowledge creation to utilisation. So this spans technology readiness levels (TRLs) 3 to 7. At TRLs 3-5, we do what we term as translational research, where we take the results of basic research (from other Autonomous Universities, A*STAR or our overseas university partners) a step closer to application. At TRLs 5-7, we focus on innovation activities and work with companies to develop prototypes that they can use and commercialise.\nOur academic staff, comprising\nfaculty and Professional Officers, is quite a unique combination that is well suited to lead in our translational research and innovation activities,\nrespectively. Our students, whether industry postgraduate students or undergraduate students, will be involved in our research and innovation projects with industry. They form the talent pipeline and catalysts for transformation that we hope will help move local companies up the innovation value chain.\nFor translational research, we\nhave identified five focus areas\n(Energy Resilience, Sustainable Food Innovation, Field/Service Robotic Engineering, Sustainable Infrastructure Engineering & Maintenance, and Community Health Transformation), as well as three horizontal enablers (Cyber Security,\nAugmented/Virtual Reality, and Artificial Intelligence). For Financial Year (FY) 2021, we will focus on building up two areas – Sustainable Food Innovation and Sustainable Infrastructure Engineering & Maintenance. This means identifying potential partners and funding agencies that we can work with.\nWe will also put together the\nrelevant pieces needed to support innovation activities, such as the RaPID Centre and Design Factory at SIT, in a holistic end-to-end innovation framework that includes intrapreneurship programmes to prepare our students for their role as catalysts for transformation.\nQ: It is exciting that we are rolling\nout various digital initiatives such as VirtualSIT. How will it pan out in the next three years?\nA: VirtualSIT is the online version\nof SIT. Just as we plan the future\nSIT campus in Punggol as a living lab, VirtualSIT will have a digital twin of the physical living lab. This potentially will allow us to have seamless interactions between the physical and virtual worlds of SIT. It will open up innumerable applications and services for all SIT stakeholders, whether in education, research or other future missions of SIT. 11 10\nSurvey by SIT students shows many other hindrances to\nphysical activity – barriers that organisations and the public can help to reduce.\nClose to 750 students learn job interview and presentation skills through The Mapletree Challenge; they also find out how to pitch innovative and entrepreneurial ideasStroke Survivors’ Inactivity Not\nJust Due to Lack of Motivation\nReimagining Sustainability withThe Mapletree Challenge\nMost strokes are preventable through\na healthy diet, regular exercise (of at least 150 minutes each week or taking 10,000 steps a day), and by avoiding smoking and drinking too much alcohol. For people with disabilities or chronic illnesses, the recommendation is to walk 6,500 to 8,500 steps a day. So why are stroke survivors in Singapore walking just an average of just 5,382 steps a day?\nA team of SIT Physiotherapy\nstudents – led by Assoc Prof Kwah Li Khim, Health and Social Sciences, Singapore Institute of Technology (SIT), and Dr Shamala Thilarajah, Principal Physiotherapist, Singapore General Hospital – have found out why by studying 38 stroke survivors from the Singapore National Stroke Association (SNSA), between June and December 2019. The survey finds that the stroke survivors face a host On 9 March 2021, the six finalist teams of The Mapletree Challenge 2020 Grand Final gathered at long last to present their innovative and entrepreneurial ideas in person at The Mapletree Challenge 2020 Prize Presentation Ceremony, hosted by Mapletree Investments Pte Ltd.\nThe Grand Final was held on 23\nJuly 2020 but plans for the prize presentation had to be delayed amid the COVID-19 outbreak. Eight months on with safety measures in place, Team Paste Pods was crowned the winner of The Mapletree Challenge Gold Award at the Ceremony. The team had shown how seaweed abstracts can be used as alternative packaging to eliminate single-use plastic toothpaste tubes to reduce the carbon footprint of hotels.\nThe Prize Presentation Ceremony was\nthe culmination of The Mapletree Challenge which comprised of barriers to being physically active, the top three being:\n• A lack of suitable exercises classes or programmes for stroke survivors at fitness centres\n• A lack of assistance from fitness centre staff\n• Feelings of tiredness or fatigue\nOther significant factors include a lack of appropriate exercise equipment at fitness centres, high membership fees, motivation loss, and concerns about injuries and pains.\nSaid Assoc Prof Kwah, “Physical\ninactivity is a complex problem that goes beyond the individual. Other than feeling too tired to exercise, the lack of motivation, fear of injury and pain, we now know that there are many more barriers stopping stroke survivors from being physically active. These are factors that organisations and the public can help with to make the environment more conducive for stroke survivors to be active.”\nAssoc Prof Kwah and Dr Thilarajah\nwill be collaborating with SportCares - ActiveSG, Singapore National Stroke Association, and Republic Polytechnic to introduce MOTIVATE: a multi-modal training programme to promote physical activity after a stroke. The programme includes education and training resources for stroke survivors, caregivers, as well as healthcare and fitness professionals on topics like health screening prior to exercise, selection and modification of exercises using gym equipment and adaptive aids such as arm and leg straps.\nMOTIVATE will also work on\nestablishing a pathway to improve access and use of fitness centres for stroke survivors in Singapore. It is due for completion by the end of 2022.\nSaid Dr Thilarajah, “After a stroke,\nsurvivors’ ability to perform activities of daily living may be impaired to varying degrees. Inactivity and reduced fitness have many consequences beyond increased risk of stroke. With the MOTIVATE programme, we hope to improve stroke survivors’ access to fitness centres. This is a step towards an inclusive society where stroke survivors have the same access and opportunities to physical activity as the rest of Singapore’s healthy population.”\nTeam Paste Pods pose for a socially distanced photo to mark their victory as The Mapletree Challenge 2020 Gold Award winners. With them are\nProf Tan Thiam Soon (second from left), President, SIT, and Mr Edmund Cheng (second from right), Chairman, Mapletree Investments Pte Ltd.\nJob Interview & Presentation Masterclasses, The Mapletree Innovation and Entrepreneurship Forum, Mentoring Masterclasses, as well as The Grand Final. Close to 750 students had taken part in the Challenge, which ran from September 2019 to July 2020. A total of 44 teams, comprising 152 participants, submitted their entries for The Mapletree Challenge.\nAll six finalist teams received their\ncertificates and medallions, and winning teams in the fourth to sixth place each received a cash prize of $1,000.  Winners of the Mapletree Bronze award, Mapletree Silver award, and Mapletree Gold award received cash prizes of $2,000, $3,000 and $5,000 respectively. Mapletree Gold award winner Team Paste Pods also received the Mapletree Gold Trophy.\nSaid Mr Edmund Cheng, Chairman,\nMapletree Investments Pte Ltd,  “Mapletree has always placed great emphasis on giving back to the communities in which we operate. In fact, we find great synergy with The Mapletree Challenge, organised by SIT and supported by Mapletree, because education and the environment are two of our four corporate social responsibility pillars.”\nProf Tan Thiam Soon, President, SIT,\nexpressed pride at the winning teams’ achievements in the year of pandemic disruptions, when even The Grand Challenge had to be moved to a virtual platform. “On behalf of SIT, I would like to express our appreciation to Mapletree Investments, for its steadfast support of The Mapletree Challenge – a platform that allows our students to learn, compete, and showcase their innovations,” he said.13 12\nGenerous gifts from Mr Patrick Lee and the Yangzheng\nFoundation enable SIT to establish a new Scholarship, Bursary, as well as a Community Leadership and Social Innovation Grant\nSince 2017, The Ngee Ann Kongsi has made an indelible impact on the lives of SIT students through its wide-ranging philanthropic supportEmpowering Future Leaders\nfor the Community\nIt Takes a ‘Kongsi’\nUndergraduates at the Singapore\nInstitute of Technology (SIT) who are passionate about contributing to the community can look forward to the new Sing Lun Scholarship and Sing Lun Bursary - thanks to a $1 million endowed gift from Mr Patrick Lee, Chairman of Sing Lun Holdings Pte Ltd.\nThe Bursary and Scholarship\nrecipients are encouraged to volunteer for at least 12 days during the academic year, and to continue to participate in meaningful community projects in the key areas of need.\nAt steady state, five scholarships\nand five bursaries will be awarded annually and in perpetuity. The Sing Lun Scholarship (valued at $10,000 each) will nurture academically outstanding undergraduates at SIT, who have also made significant contributions to SIT or the community beyond their academic studies. The Sing Ms Saifoon Faheema had always wanted to pursue a career in Biology. Combined with her passion for building rapport with people, she eventually enrolled into the Diagnostic Radiography programme at the Singapore Institute of Technology (SIT). She hopes to pursue a Masters in Radiography and ultimately to gain experience in the industry. All this has been made possible for her since her first year at SIT, through The Ngee Ann Kongsi Scholarship. “It means a lot to a me, especially as I was pursuing my degree after starting a family,” says the scholar. “This scholarship gave me the strength and support I needed to continue my education. I’ve also made new friends with other scholars and we enjoy catching up at events and awards ceremonies.”\nMs Saifoon is one of many students\nat SIT whose academic efforts and achievements have been supported Lun Bursary (valued at $5,000 each) will be awarded to financially disadvantaged students who have excellent community service records.\nFormed in 1951, Sing Lun started\nas a textile trading company but has since successfully diversified into a privately-owned enterprise with a diverse range of business interests worldwide. The Group’s key business interests include industry, investments, and real estate.\nSaid Prof Tan Thiam Soon, President,\nSIT, “We are thankful for the unwavering support from Mr Patrick Lee Kwok Kie to help SIT’s financially-disadvantaged undergraduates since 2013. His philanthropic leadership will greatly benefit our students, and support SIT’s projects and community initiatives.”\nMr Lee’s friendship with SIT goes\nback to 2013 (in his capacity as President of the Yangzheng Foundation) – the year when the Foundation made possible the endowed Yangzheng Foundation Bursary for SIT students.\nThe Foundation’s latest gift of\n$150,000 makes possible the Yangzheng Foundation Community\nLeadership and Social Innovation\nGrant to support programmes and projects under SIT’s newly formed Community Leadership and Social Innovation Centre (CLASIC). The Centre’s role is to nurture community leadership among SIT students.\nThe Yangzheng Foundation\n(formerly known as Yeung Ching Foundation), a privately funded charity, was established in 1990. The objectives of the Foundation are to promote, foster, develop and improve education in Singapore and to provide financial support for the needy students and other charitable bodies to aid social development of the society.\nProf Tan Thiam Soon, President, SIT (right),\npresenting a token of appreciation to Mr\nPatrick Lee (middle) and Mr Mark Lee (left) on 13 November 2020.Mr Patrick Lee (fourth from left in the front row), with some of the Yangzheng Foundation Bursary\nrecipients at a community event in 2018.Some of The Ngee Ann Kongsi scholars (in red t-shirts) volunteering at the Teochew Cultural & Food Festival held at Ngee Ann City Civic Plaza in\nDecember 2019.\nand recognised by the Kongsi.\nSince Academic Year (AY) 2017/18,\nthe Kongsi has supported SIT students through The Ngee Ann Kongsi Scholarship and The Ngee Ann Kongsi Gold Medal (For The Most Outstanding Graduating Student). More than 260 scholarships have been awarded since AY 2017/18, while the Gold Medal is awarded each year to a top-scoring graduating student.\nMs Sabrina Tan, who received the\nGold Medal when she graduated from the Nursing programme in AY 2018/19, said that the recognition has given her more confidence to pursue leadership roles at work. She added, “It has aided me in my career progression as a nurse and I am hoping to use the prize to further my studies in the healthcare sector.”\nThe 176-year old Kongsi (the\nword ‘kongsi’ means ‘company’ in Teochew) has also been quick to support SITizens who were severely impacted by the COVID-19 outbreak, by making possible The Ngee Ann Kongsi Emergency Relief Fund at SIT in June 2020. Valued at $500 each, 65 grants were awarded over three consecutive months to those of our students struggling with sudden financial emergencies as a result of the pandemic.\nFirst formed in 1845, The Ngee\nAnn Kongsi has been a prominent supporter of educational andother charitable projects in Singapore. Prof Tan Thiam Soon, President, SIT, said “We are truly honoured by the friendship and philanthropic commitment that The Ngee Ann Kongsi has shown to SIT and our students. The impact from the Kongsi’s giving will be felt for many generations to come.”15 14\nIt makes possible a new bursary to support financially\nneedy undergraduates from all fields of study The Masonic Charitable\nFund’s First Endowed Gift\nto an IHL Goes to SIT\nOn 10 December 2020, a signing\nand cheque presentation ceremony was held at the SIT@Dover campus to establish the Masonic Charitable Fund Endowment Bursary at the Singapore Institute of Technology (SIT). Dr Yeoh Sin Hock, Assistant District Grand Master, District Grand Lodge of the Eastern Archipelago, presented an endowed gift to Prof Tan Thiam Soon, President, SIT, on behalf of The Masonic Charitable Fund.\nThe gift marks the first endowed\ngift The Masonic Charitable Fund has made to an Institute of Higher Learning (IHL). It will enable SIT to support three Singaporean undergraduates with the Bursary (valued at $5,000 each) from Academic Year 2021/22 onwards, annually and in perpetuity. The Masonic Charitable Fund Endowment Bursary is one of the most inclusive bursaries at SIT, as it is applicable to financially disadvantaged students from all fields of study.\n“SIT, with its unique positioning as\nthe university of applied learning, gives Singaporeans access to a tertiary education that nurtures professionals who are highly relevant to the needs of the industry and the community. We are happy to support SIT in its mission and to see the Bursary enable students from less privileged backgrounds to make the\nPrior to the cheque signing and presentation\nceremony, representatives from The Masonic Charitable Fund also toured SIT’s facilities such as the Allied Health Labs.\nTo commemorate its Diamond Anniversary, the homegrown international food company makes an endowed gift of $3 million to make possible\nthe Prima Group Applied Research Grant and\nPrima Group Scholarships at SIT\nThe Prima Group has made an\nendowed gift of $3 million to the Singapore Institute of Technology (SIT) to encourage Food Technology innovations and talents at the University. The gift will enable SIT to establish the Prima Group Applied Research Grant to support innovation projects focused on closing technological gaps in food manufacturing and processing, as well as the Prima Group Scholarship to nurture academically talented Food Technology undergraduates at SIT. At least three Scholarships will be awarded annually, and in perpetuity.\nThe Prima Group, led by\nMr Primus Cheng Chih Kwong, Chairman and Chief Executive Officer, is channelling its resources into education endowment and research funds to commemorate its 60\nth year milestone, in lieu of lavish\ncelebrations. This tradition was (From left): Mr Bernard Cheng, Prima Group\nExecutive Director; Mr Primus Cheng, Prima Group Chairman & CEO; Prof Tan Thiam Soon, President, SIT; Prof Chua Kee Chaing, Deputy President (Academic) & Provost, SIT and Assoc Prof Susanna Leong, Asst Provost (Applied Research), SIT.\nstarted by Mr Cheng’s late father, Mr\nCheng Tsang Man, who founded the Prima flour mill in 1961. Today, the Prima Group has grown to become an international food company, with manufacturing hubs in Singapore, Sri Lanka, China and Australia and a distribution network over 40 markets across five continents.\nProf Tan Thiam Soon, President, SIT,\naccepted the cheque on behalf of SIT from Mr Primus Cheng at a ceremony held at the National University of Singapore (NUS) on Monday, 3 May 2021.\nAt the ceremony, Mr Cheng highlighted\nPrima’s firm belief in education as the foremost fundamental enabler. He added, “For our diamond anniversary this year, we want to commemorate this milestone in a more impactful manner by supporting both universities’ education and research efforts in food science and technology which would in turn improve food quality and nutritional value as well as enhance the safety of food for societies at large. The enabling effect of education can only be maximised if people can also have adequate, safe and nutritious food. As a food conglomerate, it is our hope that our gift will provide more synergistic impact.”\nWelcoming the Prima Group’s\nphilanthropic leadership to encourage industry innovation and transformation in food technology, Prof Tan said:  “SIT is focused on applied research and innovation to bridge knowledge discovery and application. SIT is honoured to partner the Prima Group, a global name in the food manufacturing industry, in this philanthropic initiative.”from Prima Groupmost of their university education at SIT. We trust that this Bursary will help create a positive multiplier effect in our industry and our community,” said Dr Brian Shegar, Chairman, The Masonic Charitable Fund.\n“The Masonic Charitable Fund was\nfirst established in Singapore in 2019, and it is very impressive how much support it has already provided to educational institutions in the past year. SIT is very proud to become one of your earliest beneficiaries, and we are especially honoured to be the first Institute of Higher Learning to receive an endowment to support our SITizens,” said Prof Tan Thiam Soon, President, SIT.A Glittering Gift17 16\nWith an eye to community development, OUE Limited\nmakes possible a permanent scholarship at SIT Nurturing Talent, Inspiring Service\nThanks to an endowed gift from\nOUE Limited, a new scholarship has been established at the Singapore Institute of Technology (SIT). The OUE Scholarship nurtures academically talented students who have a proven track record as leaders, whether in their co-curricular activities or in community service. At least one and up to two scholarships (valued at $10,000 each) will be awarded annually and in perpetuity, starting from the upcoming Academic Year 2021/22.\nThe OUE Scholarship is applicable\nto Singapore Citizens and Singapore Permanent Residents from all undergraduate programmes offered at SIT. Preference will be given to those who come from financially disadvantaged families. The OUE Scholarship will nurture\nacademically outstanding students who have\nexcelled in their co-curricular activities and\nmade contributions to the community.\nProf Tan Thiam Soon, President, SIT,\nsaid, “We are very grateful for this gift from OUE Limited, as nurturing graduates who can be catalysts of transformation in the community is integral to SIT’s aspirations as a university. We trust that the OUE Scholarship will encourage the recipients to grow into their full potential as service leaders for the future.”\nOUE Limited is a diversified real\nestate owner, developer and operator with a real estate portfolio located in prime locations in Asia. It grows its business by leveraging its brands and expertise in developing and managing landmark assets across the commercial, hospitality, retail and residential sectors.We are very grateful for this\ngift from OUE Limited, as\nnurturing graduates who can be catalysts of transformation in the community is integral to SIT’s aspirations as a university.\n- Pr of Tan Thiam Soon,\nPr esident, SIT\nPermanent support for Nursing and Allied Health undergraduates at SIT – thanks to a new endowed gift made by the Ti Sui Tsu Memorial FundNew Bursary Uplifts Future\nHealthcare Professionals\nIn honour of Ms Ti Sui Tsu’s 100th\nbirthdate on 12 April 2020, the Ti Sui Tsu Memorial Fund made an endowed gift to the Singapore Institute of Technology (SIT), to establish the Ti Sui Tsu Bursary in support of Nursing and Allied Health students at the university.\nThe late Ms Ti was a pioneer in the\nnursing profession in Singapore and had a career spanning over 30 years. She was among the first batch of six local nurses who were promoted to Ward Sister at Singapore General Hospital in 1951, and retired as Matron in the 1970s. She was passionate about helping those in need, especially nursing students. After her passing in 1988, she bequeathed her estate to several charities including the Barker Road Methodist Church, which set up the Memorial Fund in her name. In accordance with her wishes, many financially needy students have been supported.\nThe Ti Sui Tsu Bursary, valued at\n$5,000 each, will support deserving undergraduates in SIT’s Nursing or Allied Health programmes. Seven\nTrustees of the Ti Sui Tsu Memorial Fund Mr Loke Beng Fong (fourth from right) and Mr Bill Chua (far right), together with Ms Gina Tan from Barker\nRoad Methodist Church (third from right), the Ti Sui Tsu Bursary recipients, Prof Tan Thiam Soon (fifth from right), President, SIT, and Prof Loh Han\nTong (second from right), Deputy President (Technical Development), SIT. Ms Ti Sui Tsu (pictured with children) was a pioneer in the nursing profession in Singapore.students have received the Bursary so\nfar, and at least seven bursaries will be awarded annually and in perpetuity.\nDuring a campus visit on 27 April 2021\nby the Trustees of the Memorial Fund, Prof Tan Thiam Soon, President, SIT, thanked the trustees for empowering Allied Health and Nursing students at SIT. “This thoughtful gift will generate a multiplier effect in Singapore’s healthcare sector and the larger community for years to come, as SIT is the only Autonomous University that offers a full suite of degree programmes in Allied Health and Nursing. Our graduates from these programmes are equipped with the skills to run hospitals and nursing homes, and their work will be pivotal in our nation’s efforts to increase not just the life span, but also the health span of the population. They are the healthcare professionals who are helping to make life more optimal for many of us – our seniors and those in their families as well,” he said.19 18\nAmid the pandemic, alumni Krithi Pushpanathan and Ang Xu Kai\nspend countless hours at the frontlines to assist migrant workers,\nsuspected COVID-19 cases and other groups in needMaking an Impact,\nthe SITizen Way\nDuring the circuit breaker period, Krithi\nPushpanathan volunteered with Transient Workers Count Too (TWC2) five times a week to help migrant workers affected by the lockdown. She worked with the Small Essential Needs team, contacting workers stuck in the dormitories and bringing them daily necessities to help them cope with the anxiety of their situation. Krithi helped with case work as well, assisting them to write to the Ministry of Manpower if they had work issues requiring intervention.\nThe Class of 2020 Pharmaceutical\nEngineering alumnus has also been tutoring primary school children at Cheng San Family Services Centre for the past four years. When asked why volunteering is such a big part of her life, Krithi replied that she used to feel that she had been living life mostly for herself instead of others. “The basic commitment with TWC2 and tutoring was just one time a week each. I alsohad a friend who told me stories about what migrant workers were going through, and I felt I wanted to help this vulnerable group of people. So I just tried it, made friends with fellow volunteers who are very passionate, and didn’t look back.”\nKrithi is a SINDA Excellence Award 2020\nwinner, SIT Scholar and recipient of the AbbVie Outstanding Student Award in Pharmaceutical Engineering (2020). She is currently working as a Research Engineer in SIT, exploring potential methods of bringing down the cost of expanding T-Cells through development of serum-free media. She will be going to Imperial College London later this year to pursue a Master’s degree in epidemiology.\nPhoto courtesy of SINDA Photo courtesy of National University HospitalShortly after completing his clinical placement at Philips Healthcare in April 2020, Ang Xu Kai was asked by his employer National University Hospital (NUH) if he could start work earlier in May, just a few days after completing his Diagnostic Radiography studies at the Singapore Institute of Technology (SIT). Hospitals were struggling to Bringing Necessities,\nEasing Anxieties cope with the rising COVID-19 cases\nat the time, and radiographers were in high demand to perform chest X-rays for suspected cases.\nWhen he commenced work as\na Radiographer at NUH, he was deployed at higher-risk areas of the hospital which treated and housed suspected COVID-19 patients. He also manned portable X-ray machines in isolation rooms. The uncertainty of the pandemic did not deter Xu Kai. “I didn’t mind it at all as my job is to help the sick and those in need of care,” he said. “During my studies at SIT and my clinical attachments, the best practices and standards of care were always advocated by our teachers. I felt well-equipped to adjust to the heightened measures in that period.”\nXu Kai hopes to one day become\nan Allied Health teacher to inspire future students, similar to how his teachers prepared him for his role now. “Modules like Anatomy and Physiology helped me understand clinical diagnoses. During my clinical placements, I acquired both technical and soft skills, complementing my theoretical knowledge, which made the transition to full-time employment easier.”\nDuring his time in SIT, Xu Kai\nreceived the Canon Medical Systems Asia Outstanding Student Award in Diagnostic Radiography (2020), Fullerton Health & Radlink-Asia Yearly Performance Award for Diagnostic Radiography (2018), and the Radiology & Co. Book Prize in Clinical Radiography Practice 1 (2017). Making a Difference in Higher-Risk Areas of Healthcare21 20\nThe SIT Alumni Mentoring Programme concluded its\nsuccessful inaugural cycle in March 2021. We catch up\nwith a trio of participants from the Health & Social Sciences\ncluster to find out how their mentoring journey wentA Therapeutic Match\nThe SIT Alumni Mentoring Programme\nhad a rather rocky start. It launched amidst the COVID-19 pandemic, meaning its participants would mostly only be able to meet virtually, not the most ideal situation for a mentoring relationship. Nevertheless, the programme is currently mid-way through its second cycle – and gaining traction among SITizens.\nAmong the SITizens who joined the\nprogramme looking to learn from each other through their academic and professional experiences are The trio has plans to keep in touch through social media and messaging apps, now that their mentoring cycle has concluded. And it appears that the SIT Alumni Mentoring Programme has found legs beyond SIT: Having been inspired to use her newfound mentoring knowledge, Sharifah has started a mentoring programme at work within her team, where new therapists are paired with seasoned therapists. She also supports them by facilitating reflection sessions throughout their mentoring journey.\nAfter months of only communicating via text messages and Zoom calls, mentor Sharifah\n(clockwise, first from left), and mentees Marcus (clockwise, sixth from left) and Darren (clockwise, seventh from left) finally met in person at the mentor-mentee dinner, together with pairs from other clusters.\nAlumni mentors and Student mentees met each other in person for the first time at specially arranged dinners in February 2021. This was also a chance to network with mentors and mentees from other clusters.\n*All activities pictured were carried out in accordance with Phase Three of the Singapore Government’s guidelines in February 2021.The SIT Alumni Mentoring Programme\nThis is a six-month long\nprogramme bringing together SIT alumni and students to foster personal and professional growth, as well as exchange knowledge and skillsets through mentorship. Organised by the SIT Advancement & Alumni Division and supported by SIT Student Life Division, the programme’s first cycle was officially launched in September 2020.\nA total of 43 Alumni mentors\nwere matched with 52 Student mentees in Cycle 1, where each mentor could choose to take on one or two mentees. The programme will soon be completing its second cycle in August 2021, where 45 mentors were matched with 50 mentees. As many as 10 mentors have joined the programme for the second time since the first cycle.Alumni mentor Ms Sharifah Rawiah and her two Student mentees, Mr Darren Lim and Mr Marcus Oon.\nSharifah, an Occupational Therapy\nalumnus, decided to take on the role of a mentor for the first time through this programme. Her interest is in grooming future therapists and sharing real-life experiences about working in the healthcare industry, such as the difference between working in a hospital setting and the social service sector. “Back when I was in school, we could only have such candid conversations with therapists in the workforce during clinical rotations. But that can be stressful as you are being supervised, or you simply may not have the time,” she explained.\nShe was matched with Darren and\nMarcus, both Year 2 students in the Physiotherapy degree programme. Sharifah recalled that the mentees were initially worried that her being in a different discipline would limit the learning experience. However, the difference between the two professions actually helped them better understand how physiotherapists and occupational therapists can work together.\nSharifah has also learned to be a\nbetter communicator through her mentor role. “My mentees have very different personalities and I had to be mindful of being adaptable in the way I communicated with each of them.”\nDarren said he was thankful to have a\nsenior open his eyes to the workings of his future career. “My mentor is very nurturing, and I appreciate that apart from academics, she also taught me important soft skills as a Physiotherapist,” he said.\nMarcus said the programme has given\nhim a deeper understanding of the healthcare industry. “I got to learn more about the different healthcare settings available and whether it would fit my career goals. I found that Intermediate and Long-Term Care is a good fit for me,” he said.\n23 22\nDebuting as a competing Cluster at SIT ICG 2021,\nSIT alumni bag 1 Gold, 3 Silvers, and a Bronze First Time!\nThe SIT Inter-Cluster Games (ICG)\n2021 was the first-ever ICG where alumni pitted their skills as a cluster against the five academic clusters – and went on to make a very good first showing for themselves. They bagged the gold medal for Counter-Strike: Global Offensive, silver medal for Chess (Males, Individual), silver medal at Badminton, silver medal at Cue Sports, and bronze medal at Futsal.Held from 27 February to 13 March 2021, ICG 2021 tested the athletic and mental prowess of participants in Bowling, Badminton, Basketball, Cue Sports, Floorball, Futsal, Chess, Chinese Chess, as well as e-Sports such as Counter-Strike: Global Offensive, FIFA and Mobile Legends: Bang Bang. The Games stretched over two weeks due to COVID-19 safe management measures.\nThe Alumni Cluster was created after\nheeding feedback from participants of past ICGs. Said Accountancy alumnus Mr David-Mark Lim, a first-time ICG participant, “I think having an Alumni Cluster for ICG gives us an identity. It’s a good initiative that allows different generations of alumni to meet and have meaningful exchanges.”\nMs Cheryl Boey, a representative of\nthe Chemical Engineering and Food Technology cluster in Floorball since 2016, said it felt surreal to be able to return to SIT@Dover campus to play Futsal for the Alumni Cluster “despite the COVID-19 restrictions”. “I’m glad that the committee was still able to organise Futsal 3v3 matches,” the fifth-time ICG alumni participant added.\nAt ICG 2021, the Health and Social\nSciences Cluster emerged overall champion, prying the title from the InfoComm Technology Cluster.\n1 Alumni te am wins Gold at Counter-Strike: Global Offensive.\n2 Alumni te am takes home the silver medal at Cue Sports.\n3 Alumni par ticipants proudly donning their Silver Medals for Badminton.\n4 SIT izens strategise their moves to seal the victory in the game of chess.\n5 Alumni defending a move fr om their opponents.\n6 Chemical Engineering and F ood Technology (CEFT) representative (in yellow) taking\na swing to lead the ball away from the rink.\n7 Alumni par ticipant attempts to sink the ball into the pocket.\n8 P articipant from the CEFT cluster aims for a strike!\n9 T he alumni participants work in unison to win the top spot at Counter-Strike: Global\nOffensive.Their Very\nCompetition heats up as\nalumnus (in grey) shields the ball from his opponent’s advances.\n1\n2\n3\n45\n6 7\n8\n925 24\nStaying Safe,\nConnected – and Delighted!\nHeld in collaboration with the Institute\nfor Financial Literacy, this Zoom webinar shared with SITizens how to put together a good financial planning roadmap. One of the key principles is that a good financial plan       covers three areas: Save, Protect,         and Invest. SITizens learnt how to        decide on how much insurance             coverage one should get,            and general principles for              making investment decisions.SITizens get a taste of Barre, a high-intensity fitness class combining ballet techniques, yoga and pilates.\nThe Zoom photos may not show all\nparticipants in great clarity (or entirety), but the contorted bodies tell the story of how SITizens were trying their very best – and having great fun – at high-intensity movements such as mountain climbers, tricep dips and plié exercises commonly executed by ballet dancers. While ballet dancers normally do plié exercises with a barre as support, the participants used the back of a chair or a table instead.\nI exercise regularly, but Barre\nis still difficult for me as it uses\ndifferent muscles from the ones\nI’m used to. The instructor also\nmade sure to correct our posture\nso we could feel the stretch.\nMs Hilary Lim, Accountancy graduate  All that glitters is not gold – in fact it may be wood, which can be used to make jewellery – and SITizens learned how to at this workshop. Led by Ms Lyn Ng from wood-crafting studio Studio MU YU, they created wooden earrings, necklaces and bag charms. Although not a wearer of accessories, Information and Communications Technology alumnus Mr Chong Hiu Fung enjoyed learning how to customise something for himself rather than buying an already finished product. “I have always wanted to try similar projects,” he said. “I have worked mostly with plastic material, so it’s fun learning about how to handle wood and the different ways to treat wood products.”\nResin pouring is one of the latest ways for people to flex their creativity. SITizens at this workshop were provided with an Art Experience kit that included a wooden cheeseboard. To create the resin for pouring, they had to mix clear epoxy resin with hardener, which would become solid plastic once it is set. The resin was then combined with inks to create unique colours.\nAt a Zoom webinar guided by Mr Brian Lee from Be The Voice Academy, participants learnt to harness the power of their voices.\nA key concept introduced during\nthe talk was the importance of word stress and speaking fluently. The stresses contribute to the clarity and meaning of one’s speech so that one is easily understood. Good speakers also have the power to influence others with their voice.SITizens unleashed their inner artist, expressing themselves on the canvas at this workshop led by Ms Joie Tan from Artify Studio. They each received a set of acrylic paints, paintbrushes, a canvas, a toothbrush and a Galaxy Mountain image to follow.\nThey began by priming their canvas black. Ms Tan then demonstrated wet and dry\nbrush techniques to blend different shades of blue to create layers, imitating the night sky. The finishing touch was to create the textures of snow on the mountains, and this was achieved with white paint, using the dry brush technique. Like most other key events on SIT’s university calendar, the tradition of holding the annual SIT New Alumni Welcome Party to welcome newly minted graduates was disrupted amid social distancing measures. Still, the celebration must go on, and a warm welcome was delivered in a box to new alumni from the Class of 2020, right to their doorsteps.The pack contained a packet of customised rock candy, a handcrafted soap bar from Rough Beauty founded by alumnus Ms Chew Jia Tian, a fabric mask with a pouch, and stickers as well as stick-on patches featuring the winning designs by SITizens from the Sticker-Patch Competition held in September 2020.\nDiagnostic Radiography graduate\nMs Jolene Tan was looking forward to receiving her New Alumni Welcome Pack as many of her friends had already received it before she did. “I definitely enjoyed unwrapping and exploring the items in the pack, I thought it was very thoughtful especially in times like this. I like that the mask had a small design at the side and I have stuck the patches onto my room display as a memento,” she said.\nFun online workshops keep alumni together, while\nthe Class of 2020 gets a special delivery\nWhen plans for physical gatherings had to be put on hold due to the ongoing\nsafe-distancing measures, SITizens were still able to join in the fun at a myriad of online workshops and webinars organised by the SIT Alumni Networks, all from the comfort of their homes.\nImplementing Your Financial Plan | SIT Alumni Career Network\n9 December 2020\nBarre Fundamentals | SIT Alumni Sports Network\n19 December 2020Wooden Jewellery Workshop | SIT Alumni Leisure Network\n26 - 28 January 2021\nResin Cheeseboard Workshop | SIT Alumni Leisure Network\n24 and 25 March 2021\nEffective Public Speaking and Presentation Skills | SIT Alumni Career Network\n28 April 2021Galaxy Mountain Art Jamming Workshop | SIT Alumni Leisure Network\n24 and 25 May 2021When Celebration Comes in a Special Delivery\n27 26\nSITizen Ambassadors\nBeing a SITizen Ambassador is\nanother way that students are contributing to SIT. The SITizen Ambassadors (SAms) programme was launched in 2019 by the Student Life Division to develop students who are deeply passionate about SIT and embody the SIT spirit and DNA to represent the University and engage with key stakeholders. After a successful pilot run, a new batch of 67 Ambassadors was installed in October 2020.\nThe SAms have been a key part of\nseveral A&A events, including the SIT Alumni Mentoring Programme, where they help to facilitate meetings between Alumni mentors Edsel (back row, second from left), together with his fellow SAms, represented SIT at university events organised by different divisions. In this\nphoto, they were at SIT Open House in January 2020 to engage with the public.\n*All activities pictured here were carried out in accordance with Phase 3 of the Singapore Government’s guidelines in March 2021.Student hosts enjoyed catching up over food and playing mini golf, together with staff from the Advancement & Alumni Division.\nand Student mentees. They have also\ncontributed to SIT in their roles as\nphotographers, emcees, as well as playing hosts to community leaders and SIT donors at University events.\nMr Edsel Li, a Hospitality Business\nstudent, who was among the pilot batch of SAms, describes his experience as “fruitful, beneficial, and eye-opening”. “I had the privilege to meet different people, connect with like-minded peers and be exposed to professional settings,” he said. “As university is the last lap of my academic life, I am extra grateful to pick up life skills and strategies to help me understand how to differentiate myself to be an effective person.”In appreciation of SIT’s Student Hosts and SITizen AmbassadorsCelebrating SITizen Volunteers\nVolunteers’ Appreciation\nGathering\nIt is almost impossible to imagine the\nworld of SITizens without the Student Hosts, who give their support so generously to SIT’s Advancement & Alumni (A&A) events. From 19 – 23 March 2021, 21 student hosts past and present were finally able\nto gather in small groups amid\nthe pandemic, at Holey Moley in Clarke Quay for the Volunteers’ Appreciation Gathering. Hosted by A&A, this annual event should have been held in 2020, were it not for the COVID-19 circuit breaker.The student hosts have supported many SIT Alumni Network events over the years, including a range of activities launched in 2019 such as Night @ The Projector, The SITuation Room, and friendly alumni sports sessions like Basketball and Captain’s Ball. Their roles included event management and engaging with alumni through networking and outreach.\nAmong the former student hosts\nwho turned up at the event was Sustainable Infrastructure Engineering (SIE) alumnus Mr Shawn Koh, who is now working in facilities management at JTC Corporation. He said, “I haven’t met my fellow student hosts since my graduation, so it was great to finally hang out.”\nSaid Year 3 Diagnostic Radiography\nstudent Ms Seah Zhi Xuan, “The atmosphere and the company were awesome, and I enjoyed playing mini-golf together!”\n29 28\nA little help from SITizens births new bursary for\nOccupational Therapy students at SIT‘4 Angels’ to the Rescue\nMr LU Kee Hong had been leading\nan active lifestyle since 2008, running marathons for around 10 years and cycling regularly. Yet, on 5 January 2021, he was surprised by strong leg cramps, just as he was cycling on the Park Connector Network from Marina Barrage to home at the end of his ride.\nHe laid on the ground to rest and\nas luck would have it, other cyclists with just the right skills were there. Occupational Therapy students Ms Yao Xingyi, Ms Lim Xue Jun, Ms Felicia Woo Ying Yi and Ms Anita George from the Singapore Institute of Technology (SIT) saw Mr LU and stopped to render aid. With some experience in treating athletes, they were able to help stretch both his legs to relieve the pain, while getting him hydrated and sheltered from the sun. Other passersby asked if he needed help too, and Mr LU recovered after 30 minutes. He managed to cycle back home safely. Mr LU Kee Hong (centre) and his “Four Angels”: (from left) Ms Anita George, Ms Yao Xingyi, Ms Woo Ying Yi Felicia and Ms Lim Xue Jun.\nThe four Year 3 students initially\ndeclined his request to inform their University. “The young ladies told me they didn’t need any recognition,” said Mr LU. “They only agreed after I explained that news of good deeds makes a difference during this period filled with negative news like COVID-19.”\nMr LU wrote to SIT to praise these\n“four angels”. Later, he met up with them again to express his thanks once more. Then, after gaining a better understanding of occupational therapy, Mr LU and his wife Ms Chan Haw Ngee decided to make an endowed gift to SIT to establish the 4 Angels and LU Kee Hong Bursary. The Bursary will support Occupational Therapy students at SIT, particularly those who give back through community service.\n“4 Angels is part of the bursary name\nas I think people would be keen to know the story behind the bursary,” Mr LU said. “This bursary didn’t come about because of me; the primary driver was the four students. They are the ones who created this opportunity for me to know more about occupational therapy and contribute to the field.”\nSaid Ms Lim, “All four of us have\ndifferent reasons for entering the course, but we’re all glad that we could use our knowledge to help Mr LU in his time of need. This encounter was a reminder of the impact my course mates and I can one day make, to help and guide patients to recover and perform daily activities they would otherwise take for granted.”\n31 30\nAlumni\nApp Ad\nThe SIT\nAlumni\nApp\nUpdates coming soon\nto your free-for-life\nSIT Alumni Email Account!\nAn Awesome\nCommunity of SITizens\n@ Your Fingertips.Coming to you in 2021!\nYour personalised\nSIT Alumni e-Card!Classof\n2021\nJoin programme-based and special-interest\ngroups for alumni!\nAccess\ncareer & learning\nopportunities!\nSign up for upcoming\nalumni events!\nConnect with your fellow SITizens!PB 32"
}