{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-13.pdf",
  "type": "pdf",
  "content": "SIT’s New\nCollaborations with NUS, SACEOS and\nTan Tock Seng Hospital\nPM Lee Visits SIT\nThe Latest Buzz at\nSIT@Dover CampusRecognition of\nExcellence… and\nSupportive Donors\nBursaries and\nScholarships, thanks to New Endowed Gifts\nHappy Graduation,\nClass of 2016! And…\nWelcoming New Alumni\nwith a Rocking PartyOnce a SiTizen, Always a SiTizen ISSUE NO. 13  |  NOVEMBER 2016\nThe last few months have been far more lively than usual. For starters, there was the flurry\nof the various graduation ceremonies. We bid farewell to the Class of 2016 and welcomed them as New Alumni – check out details and photos inside to see their joyous celebration at the 2016 New Alumni Welcome Party!\nHopefully the Class of 2016 will have\nmuch to look forward to as they venture into the working world. SIT graduates are sought after as shown by the encouraging results from the latest Joint Graduate Employment Survey. Around nine in 10 new SIT graduates surveyed had found employment after graduation. More significantly, 83% had secured full-time permanent employment within six months after completing their final examinations. They were also earning higher starting salaries with the median gross monthly salary at $3,055 in 2015, up from $3,000 the previous year.\nSIT is also delighted to be celebrating the achievements of its students, and new support\nfrom donors. At this year’s Recognition of Excellence, even more Book Prizes, Outstanding Student Awards and Scholarships were presented to talented students.\nAt the same time, we also welcomed this year’s intake of students in August and\nSeptember. They got more than a taste of the SITizen experience at the SIT Student Orientation 2016, SIT Carnival, Day Zero and Chillout at SIT@Dover. This year’s Chillout\nhad a different twist – featuring a tie-up with Purple Parade, allowing SITizens to learn\nabout the special needs community in Singapore.\nTo add to all this excitement, students at SIT also had the rare chance to interact with\nPrime Minister Lee Hsien Loong, when he visited the SIT@Dover campus on 24 Oct 2016. PM Lee, who spoke at SIT’s inaugural Dialogue with SITizens on the future economy, answered some burning questions from them. He even took the time to take a few ‘wefies’ with some lucky students!\nWe hope you will enjoy reading this issue of SITizen. Should you wish to contribute a story,\ndo drop us a line at Alumni@SingaporeTech.edu.sgWHAT’S\nHAPPENING\naround our little\nbig campus\nSITizen is a publication by the\nSIT Advancement & Alumni Division.\nFor enquiries, please e-mail us at\nAlumni@SingaporeTech.edu.sg© Singapore Institute of Technology 2016\nThis crowd couldn’t wait to start partying. See what they got up to\ninside…\nDear SIT Alumni,\n2016 – What a Year!\nSiTIZEN  |  02/12\nSingapore Institute of Technology (SIT) had the privilege of\nhosting Prime Minister Lee Hsien Loong on 24 Oct 2016 to kick start its inaugural ‘Dialogue with SITizens’. The theme of the student-organised event was ‘Preparing for the Future Economy’.\nSIT students made up most of the more than 500-strong\naudience that also included Mr Ng Yat Chung, Chairman, Board of Trustees, SIT, Prof Tan Thiam Soon, President, SIT, as well as SIT faculty and staff. Also present were\nSIT with National University of Singapore\nOn 1 Sept 2016, the Singapore Institute of Technology\n(SIT) inked its first Collaborative Agreement with the National University of Singapore (NUS), to jointly deliver courses for SIT’s Allied Health degree programmes. These are the Bachelor of Science degrees in Physiotherapy, Occupational Therapy, Diagnostic Radiography and Radiation Therapy.\nThe five-year collaboration entails the co-development\nand co-teaching of curricula, and of pedagogical research. Lectures and tutorials will be held in SIT’s interim campus at Dover, and lab sessions will be conducted at nearby NUS. In addition, SIT’s faculty will co-teach Anatomy and Physiology modules with faculty from the NUS’ Yong Loo Lin School of Medicine.\nSIT with Tan Tock Seng HospitalSIT and Tan Tock Seng Hospital (TTSH) signed a\ncollaboration agreement on 23 Sept 2016 to develop and deliver Simulation Based Healthcare Education to SIT’s Allied Health and Nursing students. This new curriculum will be conducted at the Simulation and Integrated Medical Training Advancement Centre at TTSH and will focus on equipping SIT students with specific clinical skills.PM’s Dialogue with SITizens\nThree new collaborations offer more opportunities to\nstudents in SIT’s Allied Health and Nursing as well as Hospitality programmesPrime Minister Lee Hsien Loong says that SIT’s applied learning pathway will help graduates find good jobs\nNew Collaborations to\nBenefit SIT StudentsPM Lee gets an SIT jacket and poses for a selfie with students. At his earlier dialogue\nwith them, he said that SIT is the epitome of the way Singapore succeeds, as SIT\noffers its students the chance to develop themselves through different pathways and\nexplore a wide range of opportunities.\n(From left) Prof Ng Siu Choon, Associate Provost, and Prof Loh Han Tong, Deputy\nPresident (Academic) & Provost, SIT at the TTSH signing ceremony, along with\nrepresentatives from TTSH.\nSIT with Singapore Association of Convention and\nExhibition Organisers and Suppliers\nOn 5 Oct 2016, SIT entered into a two-year Memorandum\nof Understanding with the Singapore Association of Convention and Exhibition Organisers and Suppliers (SACEOS) to collaborate and promote learning and career opportunities for SIT students in the meetings, incentives, exhibitions and conventions (MICE) industry.\nSACEOS will familiarise SIT students with the MICE\nindustry and its real-life business environments through educational talks by senior members of SACEOS as well as provide placement opportunities for SIT’s unique Integrated Work Study programme. SIT and SACEOS will also jointly create executive development programmes for the MICE industry.representatives from SIT’s Overseas University partners, the\npolytechnics and other autonomous universities in Singapore.\nPM Lee said that the education provided by universities with\napplied pathways like SIT will lead to qualifications which are relevant to industry.  He noted how SIT was also giving students “different pathways” to develop themselves, such as occupational therapist Adelene Teck, 43, who was back in school to upgrade her skills after working for 20 years.\nHe added that SIT’s Integrated Work Study Programme\n(IWSP) where students spend a year on internship - will bring “industry to the school and school to the industry”, which may lead to job opportunities for SIT students even before they graduate.\nSpeaking to SITizen after the event, Ms Teck recalled that\nalthough she had been accepted by NUS Science Faculty in 1992, she chose to pursue a diploma in occupational therapy at Nanyang Polytechnic. She is now taking a sabbatical for the one-year conversion programme for SIT’s Bachelor in Science (Occupational Therapy).\nMs Eri Farah Tsuboi, a final year student from the Bachelor\nof Science (Hons) in Nursing Practice who attended the dialogue said that it was “positive and reassuring to hear from PM Lee that we have all the conditions available for us in Singapore to create a bright future”.\nSiTIZEN  |  03/12\nSIT Student Orientation, 25-27 Aug 2016\nBad weather certainly did not put a damper on the SIT Student\nOrientation. Even though the haze meant that some activities were moved indoors, the fun still continued during the three-day, two-night camp organised to welcome the latest intake of SIT students.\nAs with the previous student orientations at SIT, students were\ndivided into four empires – Gryphon, Hydra, Phoenix and Pegasus. The highlight of the camp was Legacy Night, where the campers spared no effort in putting up mass performances to impress the judges. In the end, Gryphon was announced the Best Empire for the third consecutive time.\nChillout at SIT@Dover, 11 Oct 2016\nChillout was first launched in 2014, to foster friendships among SIT faculty,\nstudents and staff through games and activities. SIT staff and faculty helped to run the game booths catering to the more than 1,000 attendees.\nSaid Ms Nur Atiqah Borhan Said, a second-year student from the Bachelor of\nEngineering (Hons) in Pharmaceutical Engineering degree programme, “It was a really stressful week as there were many assignments and tests due that week, so I feel that going for the Chillout session really helped us to wind down and relax.”\nThis year’s Chillout was also made more meaningful through a tie-up with Purple\nParade, Singapore’s largest movement to support the inclusion and celebrate the abilities of the special needs community. SITizens had the chance to learn about the special needs community in Singapore through the Purple Parade’s interactive media truck.Ms Kimberlin Chew, from the Bachelor of Accountancy (Hons) degree programme, said that the camp was an enjoyable experience for her and she has kept in touch with the friends she made. “Attending the SIT Student Orientation made me feel welcome at SIT, and I definitely enjoyed the food!” she added.This year’s intake of students get a taste of the vibrant\ncampus life at SITThe Latest Buzz at SIT@Dover\nSIT Day Zero, 2 Sept 2016\nDay Zero has always marked the start of the academic year for the year’s new intake\nof students who are pursuing SIT-conferred degrees. And it was no different for this year’s students. Through various team-building activities, the one-day camp provided an opportunity for the first-year students to learn more about the SIT-DNA, particularly the “ability to learn, unlearn and re-learn.”\nSaid Mr Marcus Lee from the Bachelor of Science (Hons) in Physiotherapy degree\nprogramme and current President of the Physiotherapy Student Management\nCommittee, “Day Zero was a good way to meet and interact with my course\nmates. It’s a pity that it lasted for a day only!”\nStudents also participated in a campus tour and attended a briefing by their\nrespective Programme Directors.\nStudents got the chance to build bicycles like this\none during a team-building activity.\nFood, fun and games awaited these excited students at Chillout at SIT@Dover.\nSIT Carnival, 27 Aug 2016\nSIT Student Orientation culminated with the SIT Carnival which was\nattended by more than 2,000 people. It was a chance for the new intake and their families to find out more about student life at SIT. For the current student leaders, the event was also a way to showcase the many student clubs at SIT, as well as recruit new members.\nSIT staff not only helped to man the food and game booths but also put up a performance in the Sports Hall. Each guest was also issued a visit pass which entitled them to food and drinks from the refreshment stalls. The pass also contained a game card where guests could complete activities to redeem SIT-related gifts.\nMs Cherlyn Tei, a first year student from the Bachelor of Engineering (Hons) in\nSustainable Infrastructure Engineering (Building Services), was one of those who attended the SIT Carnival with her friends. She quipped, “It was fun to accomplish the tasks on the game card. Getting free bubble tea was even better.”\nThere was plenty to do and see at the SIT\nCarnival including visiting booths of the various\nCo-Curricular Activities available (right), and\nriding a mechanical bull (above).\nHelping each other out, one drop at a time.\nSiTIZEN  |  05/12 SiTIZEN  |  04/12 SiTIZEN  |  05/12\nReady\nto Blaze\na Trail\nArmed with their new degrees, SITizens are\neager to make their mark in the world Prof Tan Thiam Soon, President, SIT, presenting the certificate to valedictorian\nMs Divya Balakrishnan during the SIT-TCD Graduation Ceremony.\nCIA’s new graduates are eager to cook up a storm.\nThe Culinary Institute of America\nCommencement Ceremony\n15 Sept 2016\nTaking centre stage at the commencement ceremony\nfor The Culinary Institute of America (CIA) at Temasek Polytechnic were its 38 new graduates from the Bachelor of Professional Studies in Culinary Arts Management programme. Special honours went to Mr Ng Zu Yao, who won The Francis Roth Award for Leadership and the Julius Wile Academic Achievement Award, while the Culinary Award went to Muhd Ihzyan bin Muhd Iskandar. In her speech, student speaker Srijaenthi Natraj said, “The world is waiting for us, full of opportunity, and it is up to us to make the best of it.”\nDigiPen Institute of Technology Commencement Ceremony\n25 Sept 2016\nIt was a bittersweet day for the 78 students of DigiPen Institute of Technology at their commencement ceremony held at One Marina Boulevard. While all were eager to venture forth and make their careers, they were sad at leaving the camaraderie of school.\nTwo students also took to the stage to reminisce about\ntheir time at DigiPen. Ms Samantha Chiam, who graduated from the Bachelor of Arts in Game Design programme, said, “We can’t remain stagnant, we need to expect the unexpected and adapt. We need to constantly challenge ourselves in order to get better.”\nDigiPen’s latest cohort is all ready to break fresh ground.\nThe ceremony began with the arrival of the Newcastle University mace.\nNewcastle University Congregation Ceremony 19 Oct 2016\nWith 332 graduands, the Congregation Ceremony for the Newcastle University on 19 Oct at SIT@Dover had to be split up into three sessions spread over from 10am to 6pm. Each was a regal affair, complete with the university mace. Ms Adeline Toh, who graduated with a Bachelor of Engineering (Hons) in Chemical Engineering degree, was one of the student orators. She stressed the importance of teamwork and the commitment to hard work. She said, “We worked together, struggled together and eventually succeeded together. After all, the only place where success comes before work is in the dictionary.”\nSIT Graduation Ceremony - Trinity College Dublin\n14 Oct 2016\nA total of 111 new graduates congregated at SIT@Dover on 14 Oct to receive their degrees from Trinity College Dublin (TCD). Valedictorian Divya Balakrishnan, who graduated from the Bachelor in Science (Occupational Therapy) programme, thanked the lecturers and her\nfellow students for creating “a beautiful learning\nenvironment filled with mutual respect and trust”. She also emphasised that as they make the transition from students to professionals, they will probably not be able to solve all of the problems that their clients will face but should nevertheless, persevere and ensure their clients live their lives to the fullest.\nThese UoL graduates are happy to have emerged victorious.\nUniversity of Liverpool Graduation Ceremony\n1 Oct 2016\nIt was the pioneer cohort to graduate with degrees from the Bachelor of Arts (Hons) in Criminology and Security programme at the University of Liverpool here. At the ceremony at Hilton Hotel, the highest achiever award went to Mr Jonathan Ling Zheng Wei. Mr Gabriel Yeo Yu Kai and Ms Kesha Rui Mei Ramdev won awards for their exemplary work-based learning projects while Mr Muhamad Fadzli bin Mohamed Yusoff received the award for an exemplary dissertation. Valedictorian, Mr Ling, said, “If you are passionate about excellence… the tasks given to you become an opportunity for you to shine.”Two very happy graduates from UofG congratulating each other on having\nmade it.\nUniversity of Glasgow Graduation Ceremony\n21 Oct 2016\nThe distinctive sound of bagpipes once again heralded\nthe graduation ceremony of the University of Glasgow at The Star Theatre. The Secura Group Ltd Top Computing Science Student Award went to Mr Yin Xiang Wei and runner-up, Mr Zhu Ruohua, while the winner of the Project\nPrize for Computing Science was Mr Yip Jun Hui. The\nProfessor Wu Dao Quan\n(吴道全教授)  Outstanding\nEngineering Student Award went to top student Ms Lim\nYong Le, who graduated from the Bachelor of Engineering (Hons) in Mechanical Design Engineering programme. The Project Prize for Engineering was won by Mr Alvin Wong Wei Jun, a Bachelor of Engineering (Hons) in Aeronautical Engineering graduate.\nSeveral UoM graduates celebrating their graduation in the customary manner.\nUniversity of Manchester Graduation Ceremony\n23 Sept 2016\nIt was a befitting graduation ceremony for the 73-strong cohort from the University of Manchester (UoM) in the ballroom of Grand Copthorne Waterfront Hotel. Student leader Jerome Lee described the two-year Bachelor of Science (Hons) in Nursing Practice programme as “tough, requiring a lot of research”. The graduates had also created a special card and a trophy which they presented to Dr John Costello, Associate Professor and Programme Director. Mr Lee said, “Dr Costello was also our lecturer and he went above and beyond the call of duty to help us.”\nSiTIZEN  |  06/12 SiTIZEN  |  07/12\nThe Singapore Institute of Technology’s (SIT) Recognition of Excellence\nwas held on 26 Oct 2016 at the Student Activities Centre at the SIT@Dover campus. Now in its second year, it is a special and important occasion on the SIT calendar to celebrate the achievements of SIT students and to recognise donors whose gifts support student excellence through scholarships and student performance awards.\nAt this year’s ceremony, 15 named scholarships were awarded to 35 students\nfrom various degree programmes offered at SIT. These non-bonded scholarships were presented along with 24 Book Prizes and three Outstanding Student Awards. All were made possible by generous donors.\nWelcoming the afternoon’s guests to the event, Prof Loh Han Tong, Deputy\nPresident (Academic) & Provost, SIT, noted the increase in the number of awards that were presented this year, thanks to support from SIT’s donors. He said, “These scholarships, prizes and awards to be presented today will spur our students on their journey to learn and to excel.”\nAn acoustic performance from Muzeka, SIT’s student\nband, jazzes up the afternoon.\nMr Sharil Reiza (left), who received the EnGro Scholarship and the Rotary Club of Bugis Junction Outstanding Student Award, and Ms Lim Pei Shan, recipient of the Kewalram Chanrai Group Scholarship, charmed the guests\nwith their heartfelt appreciation presentation.Scholarship recipients at the Recognition of Excellence together with SIT Senior Management.\nFor Ms Lim Pei Shan, who is enrolled in\nthe Hospitality Business programme at SIT, receiving the Kewalram Chanrai Group Scholarship has inspired even bigger dreams for her. The first-year undergraduate said, “This scholarship will not just help me financially – I can see now the possibility of my helping to shape the future of hospitality in Singapore, particularly the tourism industry, with lots of hard work.”\nThanking the donors for their\ntransformative philanthropy and “making the pivotal difference in the life-long journey to pursue excellence”, Prof Tan Thiam Soon, President, SIT, said, “Our donors have set an example for our students on how giving back can change the lives of others.”\nMore than 200 guests attended the\nceremony, including SIT’s donors and friends, SIT senior management, faculty and staff, as well as representatives from SIT’s Overseas University partners. Of course, the stars of the evening were the award and scholarship recipients, who had loved ones by their side to join in the happy occasion. (From right) Scholarship recipients, Mr Chew Kia Yong\nand Ms Neo Belinda sharing mementos with their\nfriends and loved ones.\n(From left) Mr Chan Wing Leong, Deputy President\n(Administration) & Chief Financial Officer, SIT, and Prof Loh Han Tong, Deputy President (Academic) & Provost, SIT, greet donors, Dr Reto Callegari, Club Treasurer/\nPast President, and Mr Alex Eow, Past President, from\nthe Rotary Club of Bugis Junction.\nScholarship recipients and award winners such as Mr Eu Jun Wei (left), a Sembcorp Marine Book Prize\nrecipient, received their certificates from Prof Tan\nThiam Soon, President, SIT.In its second year, the Recognition of Excellence was held\nat the Student Activities Centre at SIT@Dover campus. Mr Pang Yao Yi (second from right), recipient of the Wilmar Scholarship, gets a photo op with Prof Tan Thiam Soon, President, SIT (second from left), flanked by his proud parents.\nMr Tan Cheng Gay, Chairman & Chief Executive Officer, EnGro Corporation (middle), speaking to the recipients\nof the EnGro Scholarship at the reception.Soul Extreme, SIT’s very own hiphop group, giving the\nafternoon’s programme an energetic opening.\nTime for thanks and celebration – Mr Kevin Liang, CEO, EPS Computer Systems Pte Ltd (right) pictured\nhere with Mr Tan Dong Xiang, recipient of the EPS\nComputer Systems Scholarship.\n24 Book Prizes and 3 Outstanding Student Awards were presented at SIT’s\nsecond Recognition of Excellence, a special reception to celebrate student achievement and the philanthropic support to nurture student excellence;\n15 non-bonded scholarships were also awarded to 35 recipientsRecognition of Excellence…\nand Supportive Donors\nIn 2015, the Rotary Club of Bugis Junction (RCBJ) made its\nfirst gift to the Singapore Institute of Technology (SIT) to establish the Rotary Club of Bugis Junction Outstanding Student Award. This year, to commemorate the club’s 20th anniversary, RCBJ members came together to raise slightly more than $300,000 to establish the Rotary Club of Bugis Junction Endowment Fund at SIT.\nTogether with the government matching grant that their\ngift attracts, this gift will result in an endowed fund that will enable SIT to award one Rotary Club of Bugis Junction Scholarship (valued at $10,000) and two Rotary Club of Bugis Junction Bursaries (valued at $5,000 each) annually, beginning in AY 2017/18, and in perpetuity. In addition, the gift will also support the Outstanding Student Award (which recognises the recipient for outstanding leadership as well as contributions beyond academic studies to SIT or the community) in perpetuity.\nThanking RCBJ at their 20th Anniversary Celebration\nDinner for their gift, Prof Tan Thiam Soon, President, SIT, highlighted that apart from the Club’s generous philanthropic support, it was also nurturing SITizens through its sponsorship of the Student Rotaract Club at SIT, and through its collaboration with SIT’s Enterprise and Innovation Hub to mentor students who are keen to start their own businesses.\nSaid Prof Tan, “The spirit of philanthropy and service\nas exemplified by the Club’s members will inspire our students to become active and contributing members of the community in future.”SiTIZEN  |  08/12\nPrestigious scholarship made possible by the\nSingapore Chinese Chamber of Commerce Foundation will give recipients the special opportunity to forge ties within the industry\nA generous endowed gift from the Rotary Club of\nBugis Junction to commemorate its 20th anniversary will nurture undergraduates at SIT with a scholarship, two bursaries and an outstanding student award each academic yearSCCCF Scholarship\nEstablished at SIT\nRotary Club of Bugis Junction\nMembers Give SITizens Their All-Round Support(From left to right) Prof Tan Thiam Soon, President, SIT, Assoc Prof Muhammad\nFaishal Ibrahim, Parliamentary Secretary, Ministry of Education and Ministry\nof Social and Family Development, Mr Chew Ghim Bok, Past District Governor,\nRotary International District 3310 and Mr Ralph Ang, President, Rotary Club of Bugis Junction during the cheque presentation at the Club’s 20th Anniversary Celebration Dinner.The Mid-Autumn Festival brought with it good tidings for\nthe Singapore Institute of Technology (SIT) as it continues to receive growing support from the community. Supporting SIT for the first time is the Singapore Chinese Chamber of Commerce Foundation (SCCCF), which has made an endowed gift of $1.2 million to make possible the SCCCF Scholarship at SIT.\nThe Scholarship was announced at the Singapore Chinese\nChamber of Commerce & Industry (SCCCI)’s Mid-Autumn Festival Celebrations and University Scholarship Endowment Fund Inauguration Ceremony. Prof Tan Thiam Soon, President, SIT, and Mr Wu Hsioh Kwang, Vice-Chairman, SCCCF, signed the agreement at the ceremony.\nApplicable to undergraduates from SIT-conferred degree\nprogrammes (including joint-degree programmes), this Scholarship is awarded to candidates who have excelled academically as well as in their contributions to SIT or the community. The SCCCF Scholarship is valued at $15,000 annually and is tenable for three years, provided that the academic performance of the recipient is sustained. Thanks to SCCCF’s endowed gift, two selected SIT students will benefit from this Scholarship annually, and in perpetuity.\nScholarship recipients will also receive membership to the\nSCCCI that allows them to take part in events organised by the Chamber, giving them the special opportunity to network with and learn from some of Singapore’s best entrepreneurs – an opportunity that will prove invaluable, as these young SITizens learn to become future leaders in the industry.\nEstablished in 1906, SCCCI is a renowned business\norganisation and has a membership network comprising 4,000 corporate members and over 150 trade association members, representing more than 40,000 companies.\nProf Tan Thiam Soon, President, SIT (left), and Mr Wu Hsioh Kwang, Vice-Chaiman,\nSingapore Chinese Chamber of Commerce Foundation.\nThanks to an endowed gift of $1 million from the Kewalram\nChanrai Group, three undergraduates at the Singapore Institute of Technology (SIT) are being supported by the Kewalram Chanrai Group Scholarship in the current Academic Year of 2016/17. From AY 2017/18 onwards, this transformative scholarship (which is valued at $15,000 each) will support up to five undergraduates each academic year.\nThe Kewalram Chanrai Group Scholarship is also special in that it was created to nurture talented women undergraduates who\nhave demonstrated both academic and leadership excellence.\nIn recognition of the substantive support, Prof Tan Thiam\nSoon, President, SIT – along with Prof Loh Han Tong, Deputy President (Academic) & Provost, SIT; as well as SIT faculty, staff, and students – hosted Kewalram Chanrai Group Chairman Mr Narain Girdhar Chanrai to an appreciation lunch at the SIT@Dover campus on 22 Sept 2016.\nOn this special occasion, Mr Chanrai urged the students to\nrise to the challenges of a very volatile age, especially those moments in life when confronted with a change that was not anticipated. He said, “Yet, you take advantage of these opportunities; these are the moments that define you and your character.”\nAmong the scholarship recipients was Ms Tee Xin Ying, who\nis doing her Bachelor of Arts (Hons) in Criminology and Security. She thanked Mr Chanrai for helping her to relieve the financial burden on her family and bringing her one step closer to her dream of becoming an educator.\nThe Kewalram Chanrai Group is committed to making the\nworld a better place by enhancing and improving the lives of communities through healthcare and education for the underprivileged.SiTIZEN  |  09/12\nKewalram Chanrai Group Scholarship recipients (from left) Ms Lim Pei Shan,\nMs Elaine Yeow Yee Ling, and Ms Tee Xin Ying, bidding thanks and farewell to\nMr Narain Girdhar Chanrai.\nThe Khoo Chwee Neo Foundation has a mission that is\nbeautifully but simply expressed: It aims to “put God’s love into action by creating lasting solutions to poverty and social injustice”. It was set up in 2014 by Ms Peggy Goh in honour of her late mother, Madam Khoo Chwee Neo.\nOn 16 Sept 2016, Ms Goh and Mr William Chua, the\nFoundation’s Executive Director, were treated to an appreciation lunch by the Singapore Institute of Technology (SIT) at the SIT@Dover campus. In his welcoming address, Prof Tan Thiam Soon, President, SIT, thanked the Foundation for its endowed gift of $1 million to SIT to offer greater promise and more possibilities for SIT students.\nThis gift from the Foundation made possible the Khoo\nChwee Neo Foundation Bursary, which has been awarded to six undergraduates this Academic Year (AY 2016/17). From AY 2017/18 onwards, the Bursary will be able to support up to 15 undergraduates each academic year. Valued at $5,000 or $10,000 each depending on student need, this is one of the more generous bursaries for financially disadvantaged students at SIT.\nThat afternoon, Ms Goh and Mr Chua also got to see an\nexample of student volunteerism at SIT. Ms Suhaila binte Zainal Shah, a second-year undergraduate and President of SIT’s Project Cambodia, gave a short presentation on how she and her fellow SITizens had built a new function room cum library and renovated the kitchen at the Project Khmer (H.O.P .E.) Trang centre. The centre provides education and meals to more than 300 poor Cambodian children every year. Ms Goh told SITizen, “My mother was always reminding me that I should give to the poor and needy and take care of them. This Foundation in her name has programmes to provide care for the physical and emotional needs of the elderly poor, and to provide access to education for underprivileged children and those with special needs.”\n“We hope the Khoo Chwee Neo Foundation Bursary at SIT\nwill level the playing field for undergraduates who need the financial support to complete their education, and make it possible for them to build a better future for themselves and their families,” she also said.\nThe Khoo Chwee Neo Foundation, founded on a daughter’s\nlove for her mother, now nurtures SIT students with an endowed bursary fund Putting Love into\nPhilanthropy Nurturing Women Leaders for the Future\nMr Narain Girdhar Chanrai, who made possible the Kewalram Chanrai Group Scholarship at SIT to nurture talented\nwomen undergraduates, urges them to take advantage of unanticipated changes in a volatile age\n(From left) Ms Peggy Goh, Chairman, Khoo Chwee Neo Foundation, and Prof Tan\nThiam Soon, President, SIT sharing a lighthearted moment.\nSiTIZEN  |  10/12 SiTIZEN  |  11/12\nA Better Florist\n• 20% off total bill at\nhttp://www.abetterflorist.com\n• Key in the code ‘ABFSIT20’ at checkout\n• Valid until 16 Aug 2018\nAFFINITEA • 10% off all AFFINITEA beverages\n• Valid until 22 Aug 2017\nAngelFlorist Services • 10% discount with a minimum purchase\nof $80\n• Key in the code ‘SIT2016’ at\nhttp://www.angelflorist.com\n• Valid until 31 Jul 2017\nAtlas Eye Specialist Centre • Discounted consultation rates\n• $250 off any refractive surgery\n• Valid until 31 Dec 2016\nBattlestrike • 10% off total bill\n• Book sessions at\nhttp://www.battlestrike.com.sg\n• Valid until 30 Apr 2017\nBenjamin Barker • 50% off suits\n• 25% off regular-priced shirts\n(Use code SITXSHIRTS)\n• 10% off accessories (Use code SITXACC)\n• Valid until 31 Dec 2016\nBi Bing Korean Dessert Café • 10% off total bill\n• Valid until 1 June 2017\nCharles & Keith • 10% off regular items\n• Valid at all stores except\nChangi Airport Terminal 1, 2 and 3\n• Valid until 31 Jan 2017\nClubvivre • $50 off on all online bookings\n• Key in the code ‘CVSIT2016’\nat http://www.clubvivre.com\n• Valid until 15 Jul 2017\nComedy Hub Singapore • 50% off on regular door price for bookings\nat http://comedyhubsingapore.peatix.com\n• Valid until 31 Dec 2016\nContactLens.sg\n• 15% off all contact lens with a minimum\nof $40 spent\n• Use code ‘SingTech2016’ at checkout\n• Valid until 31 Dec 2016SIT Alumni Card Benefits\nDancepointe Academy\n• Free first trial and 10% off first term\n• Valid until 1 Mar 2017\nDojo • 15% off total bill\n• Valid until 31 Dec 2016\nEyecon Optical • $19.80 onwards for a pair of\nstandard prescription lenses\n• Waiver of eye examination fees\n• Valid until 31 Dec 2016\nFloral Garage Singapore\n• 10% off total bill at www.floralgaragesg.com\n• Key in the code ‘SIT010’\nGifts Less Ordinary\n• 5% off any purchase\nat http://giftslessordinary.com\n• Valid until 1 June 2017\nGiovanni L. • 10% off total bill\n• Valid until 31 Dec 2016\nGlacier Frozen Yogurt Café • 10% off on all food products\n• Valid until 1 June 2017\nGOtixs.com • Additional 10% off successful bid price\nat http://www.gotixs.com/site/sittreats\n• Valid until 28 Feb 2017\nHipVan • 10% off bill at www.hipvan.com\n• Use code ‘10SIT’ at checkout\n• Valid until 1 June 2017\nIntune Music • 10% off on course fees for first 3 months;\nwaiver of administrative fees\n• Valid until 1 Mar 2017\nKF1 Karting Circuit\n• Entitled to members’ rates\n• Valid until 31 Dec 2016\nKitchen Capers\n• 10% off bakeware tools/packaging\nneeds/books/DVDs\n• 5% off food/ingredients\nKKday\n• 5% off KKday travel experiences\nat http://bit.ly/KKdxSIT\n• Enter code ‘KKDAY SIT5’ prior\nto checkout\n• Valid until 31 Dec 2016Morganfield’s\n• 10% off total bill\n• Participating outlets: The Star Vista,\nSuntec City\n• Valid until 31 Dec 2016\nNanyang Optical • 40% off all regular-priced frames\n• 10% off all contact lenses with minimum\npurchase of 2 boxes\n• 30% off conventional contact lenses\n• Valid until 1 Mar 2017\nNational Geographic • 20% off the subscription of the following:\nNational Geographic Magazine, National\nGeographic Kids, National Geographic\nLittle Kids, National Geographic Traveler\n• Valid until 31 Dec 2016\nOld Boys Gallery • 10% off total bill\n• Valid until 31 Jan 2017\nOPPA Chicken\n• 1 for 1 Oppa Chicken from 3-5.30 pm\n• Free sour plum soju shot with any OPPA\nChicken Order during Happy Hour (3-8pm)\n• Valid until 31 Dec 2016\nPezzo\n• 10% off total bill\n• Valid until 31 Dec 2016\n• Valid at all outlets except for Changi\nAirport, Takashimaya & Sentosa Outlets\nPies & Coffee • 10% off total bill\n• 50% off slice cakes with 2 gourmet\npies/brunch purchased\n• 15% off whole cakes\n• Valid until 31 May 2017\nPlanet Popcorn • 10% off purchases using code ‘SIT2014’\nduring checkout at www.sgplanetpop.com\n• 15% off and free delivery for orders\nabove $150. Use code ‘Corporate’\n• Valid until 1 Mar 2017\nQQ Rice • 10% off on Oat Rice, Rice Roll, Snack Roll,\nWholemeal Sandwich\n• $5 value set for rice roll/oat\nrice & standard drink\n• Valid until 31 Dec 2016\nSeasonal Salad Bar • 10% off all regular priced items\n• Participating Outlet: One@KentRidge\n• Valid until 1 Apr 2017Seattle Pike Chowder • 10% off total bill\n• Valid until 31 Dec 2016\nSharetea • 10% off all regular priced items\n• Valid until 15 June 2017\nShopBack • $10 Benefit\n• Up to 18.0% Cashback when shopping\nwith selected partners\n• Visit https://www.shopback.sg/\nfor more details\nSingapore Flyer\n• 10% off a la carte menu at Sky View Kitchen\nwith min. $50 in one bill\n• 10% off Premium Sky Dining\n• Valid until 30 Nov 2017\nSolemates\n• 10% off sales items with every $200 spent\nin a single receipt\n• Valid until 1 Mar 2017\nSpectacle Hut • 20% off on frames & sunglasses;\n15% off on lenses\n• 3% off on contact lenses\n• Participating Outlet: Jurong Point\n• Valid until 30 Apr 2017\nSunlife Durian Puffs & Pastries • 10% off total bill\n• Participating outlets: Causeway Point\nShopping Mall, 333 Coffee Shop\n(Blk 136 Bedok North Avenue 3)\n• Valid until 31 Jul 2017\nThe Assembly Ground • 10% off menu items\n• Valid until 31 Dec 2016\nThe Braces Practice • Discounted rates for various braces options\n• Valid until 14 June 2017\nTotally Hot Stuff • 10% off total bill\n• Valid until 30 Apr 2018\nXorex Press Pte Ltd • $8 for A2 poster with mounting\n• $16 for A1 poster with mounting\n• Valid until 1 Mar 2018They had left school, many hard at\nwork building up careers. So when the opportunity came to party at the annual new alumni get-together, there was no stopping them.\nOn Nov 4, many came early and\nmilled outside Hard Rock Cafe in Orchard to wait for their former ‘comrades-in-study’. Then, at 7 pm sharp they flowed eagerly through the doors to kick off the 2016 New Alumni Welcome Party.\nRepresenting the SIT Board of\nTrustees was Dr Richard Charles Helfer, who is also Chairman of RCH International Pte Ltd. Other party attendees include members of SIT senior management, faculty and staff as well as representatives from its Overseas University partners.\nProf Loh Han Tong, Deputy President\n(Academic) & Provost, SIT, welcomed more than 200 alumni to the party and encouraged the new graduates to stay in touch with SIT.\nThe buffet lines were declared open at\n8 pm and the food practically flew off the tables. There were no complaints as Hard Rock Cafe staff were quick to replenish the favourite bites.SITizens make merry at 2016 New Alumni Welcome PartyTime to rock and roll\nGood food and good company is a sure recipe for a great time.\nCheers to us all! Assoc Prof Lee Kwee Hiong (fourth from right) toasts his students\nat the party.Hip Hip Hurray! Prof Loh Han Tong, Deputy President (Academic) & Provost (right), kicks off the party!\n“I can’t believe it’s me!” Alumni were entitled to amazing prizes in the lucky draw.\nThroughout the evening, there were lucky draws and loads of entertainment\nincluding a rollicking performance by SIT’s very own Muzeka belting out rock classics, and the ever-popular Jive Talking. To cool things down, Mentalist Ferris Yao came on to perform his mind-boggling tricks.\nTo add to the cheer, the party crowd celebrated the birthdays of Mr Chan Wing\nLeong, Deputy President (Administration) & Chief Financial Officer, SIT, and an alumnus who was invited on stage.\nAll too soon, it was time to bid farewell but the crowd was reluctant to leave. Ms\nRosmalinda Tay Yan Ting, who graduated with a degree in chemical engineering from the Technical University of Munich said, “This is an amazing fun-filled night that will always be remembered. It’s a pity it wasn’t an all-nighter.”\nMaybe next year.The music was so mesmerising that it got these alumni on their feet and on the dance floor.\n(From left) Alumnus Mr Lin Pei Kun, Dr Richard Helfer, Member, Board of Trustees, SIT, Mr\nChan Wing Leong, Deputy President (Administration) & Chief Financial Officer, SIT and\nalumnus Mr Tan Yao Wei.\n*Please present your SIT Alumni Card\nprior to making payment.\nTerms and conditions apply. Please refer to\nhttp://sl.singaporetech.edu.sg/Welfare/SITreats.aspx\nfor detailed terms and conditions."
}