{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2021/07/ag-guidelines.pdf",
  "type": "pdf",
  "content": "GUIDELINES\nFOR\nSIT ALUMNI GROUPS\nAdvancement & Alumni Division\n1. PURPOSE\nThis document outlines various considerations and procedures in creating and managing official\nalumni groups recogni sed by the Singapore Institute of Technology (SIT)  and under the purview of\nthe Advancement and Alumni Division (A&A) . All appointed alumni leaders of official alumni groups\nshall abide by these guidelines in their activities and should otherwise consult with the respective\nalumni staff -in-charge.\n1.1 What is an official  SIT Alumni Group?\nAn official SIT  Alumni group is an organi sed group of S IT alumni who actively engage in\ncommunicating and/or gathering around a central unifying purpose, mission, background, interest\nor activity  to serve SITizens, SIT, or the larger society.\n1.2 Objectives of SIT Alumni Groups\n• Support SIT in realising its vi sion to be a leader in innovative university education by integrating\nlearning, industry and community;\n• Provide opportunities for alumni to remain connected among themselves and to SIT , as well as\nto serve S ITizens, S IT and the larger society ;\n• Establish and maintain communication amongst alumni and between alumni and SIT;\n• Organise social and professional events to strengthen ties among alumni; and\n• Encourage alumni to support and propagate the good name of SIT\n1.3 Type  of Alumni Groups\nAlumni Groups can generally be catogerised into the following groups:\n•   Clusters/Programme - Based Alumni Group\nClusters/ Programme -Based alumni group are formed by alumni who graduated from a specific\nacademic clusters or programme. Clusters/Programme -Based Alumni Groups seek to\nstrengthen connections between alumni and their Clusters/Programme.\n• Interest Based Alumni Group\nInterest -based Alumni Groups are typically an extension of the respective Student Interest\nGroup. These Groups maintain links with the Student Groups for training and advice. Alumni\nmay also form special Interest Groups may also be formed based on a common interest  in\nspecific sports, martial arts, arts and culture or in community/social causes.\n1.4 Use of SIT Name & Trademarks\n“Singapore Institute of Technology” or “SIT” names and logos are registered trademarks and their\nuse is governed by rules and guidelines. Any Alumni Group that intend s to use the SIT name and\ntrademarks (including logo) in any form or manner, shall first b e required to submit the proposed\nartwork and seek the consent of A&A prior to use.\nUpon approval, the use of SIT name and trademarks shall at all times be used in accordance with\nSIT’s rules and regulations on SIT’s corporate identity.\n2. CLUB/ COMMITTEE MANAGEMENT\n2.1 Leadership Structure for Alumni Groups\nEach alumni group shall comprise an Executive Committee (EXCO) of minimum 4 members with a\nrecommended appointment term of two years. The roles and responsibilities of each EXCO member\ninclud e, but are not limited to those described in the table below.\nPosition  Roles & Responsibilities\nChairperson  - Serve s as primary liaison between the Alumni Group\nand A&A\n- Provide s overall leadership and direction\n- Establish es goal and annual work plan for  the Alumni\nGroup/ committee\n- Responsible for ensuring compliance with all stipulated\nrules and guidelines for Alumni Group activities and\nmanagement.\n- Chairperson is appointed with the support of A&A\nVice -Chairperson  - Assist s and support s Chairperson in his duties\n- Assumes duties and serve as Acting Chairperson in the\nabsence of the chairperson\n- In the event that the Chairperson steps down, the Vice -\nChairperson will assume the position of  Chairperson\nuntil the next Annual General Meeting\nSecretary  - Responsible for all administrative duties, including but\nnot limited to coordinating meeting agenda and\nattendees, minute taking.\n- Responsible for maintaining complete and accurate\nfiling of all club/committee documentation, including\nwritten re cords, photos, and video footage.\n- Support s the Chair and Vice -Chair in discharging\nobligations of the EXCO\n- To undertake duties of the Treasurer in the absence of\na suitable candidate.\nTreasurer  - Maintain s accurate financial records throughout the\nyear t o be reviewed at any time by members, or A&A.\n- Ensure s that the club/committee adopts and adheres\nto the financial practices and approval processes of the\nUniversity, including providing necessary guidance to\ncommittee members when submitting claims.\n- Prep ares the alumni group’s budget for approval by\nA&A at the beginning of each work year.\n- Ensure projected and actual expenses are kept within\nallocated budget during the work year.\n*All committees members must be SIT alumni.\nIt is recommended that all committee members should be elected for a term of two years, with elections\ntaking place  at the Annual General Meeting.\n2.2 Formation of a new Alumni Group\nAlumni who wish to form a new alumni group shall adhere to the following procedures and guidelines.\nAn interview will be conducted by A&A to assess the feasibility of the group’s formation.\n• Applicants are to gather a group of at least 10 enthusiastic alumni who are interested to be in\nthe Alumni Group and submit their details  are to be submitted  to Advancement and Alumni\nDivision\n• The group would then be required to recruit their Executive Committee (EXCO). It must\nminimally consist of a Chairperson, Vice -Chairperson, Secretary and Treasurer.\n• The applicants are to complete & submit the Alumni Group Application Form (Annex 2) to A&A .\n• Advancement and Alumni Division will assess and approve the establishment of the official SIT\nAlumni Group.\n• Upon approval, A&A will send a Letter of Approval to all EXCO members listed in the Application.\n• Email addresses of Alumni Groups and/or Chairpersons will be published on SIT Alumni website ,\nand other listings distributed to alumni. This is to ensure that alumni interested to join Alumni\nGroups will be able to contact the respective Alumni Group Chair person directly.\n• The A&A division will conduct a review of the alumni new alumni group one year after their\nestablishment to assess the progress of their planned activities and the sustainability of the\ngroup.\n2.3 Appointment of New EXCO and Handover\nThe Chairperson and committee members of the Alumni Groups have to undertake succession\nplanning to identify and groom new leaders. The EXCO shall initiate internal selection processes to\nidentify and appoint new EXCO members no later than three months pri or to the completion of their\ntwo-year tenure.\nSIT Alumni Groups are encouraged to organise a General Meeting at least once every two years to:\n• Review their activities for the last two years;\n• Plan their programme for the next two years; and\n• Elect and s elect their committee members.\nSIT Alumni Groups have full discretion on the proceedings of their internal selections, below are basic\nprocedures for consideration:\nProcedures  Recommended Timeline\ni.\nii.\niii.\niv.  Recruitment via internal advertisement to all\nclub/committee members\nApplications by interested members\nShortlist and interviewing of candidates\nResults and announcement\nSeptember -Oct (at the end of\n2-year tenure)\nv.\nvi.  Transitioning  period  for outgoing and incoming EXCO\nIncoming EXCO to sign necessary forms and notify A&A on\nthe new EXCO members  October to December  (at the\nend of 2 -year tenure)\nvii.  The n ew EXCO term  to take effect  January  (at the start of new 2 -\nyear tenure)\n3. FRAMEWORK OF SUPPORT FROM SIT ADVANCEMENT AND ALUMNI DIVISION\nAlumni Groups are encouraged to organise at least one alumni event annually  for a start . In support\nof Alumni Group events, A&A offers the following:\n• Venue at SIT campus (subject to availability)\nAlumni Groups can seek venue support for events and meetings in the following SIT venues\no Auditorium\no Seminar Rooms\no Meeting Rooms\n• Publicity\nA&A supports Alumni Groups in the publicity of their events and programmes through its\nwebsite, its eDM to alumni, its quarterly magazine SITizen  as well as other avenues of\ncommunication, where applicable.\n• Funding Support\nEach Alumni Group is responsibl e for establishing its own operating budget. New alumni groups\nwill be provided with funding support of up to S$2,000 for the first year and S$1000 per year for\nthe subsequent two years  as seeds funding to offset the costs of their events and activities.\nFunding will be allocated on a case -by-case basis and depending on the nature of the event.\nOnce approved, funding will be disbursed on a reimbursement basis upon submission of\nrelevant receipts and supporting documents.\n• Corporate Gifts\nA&A may sponsor token gift items with SIT branding for Alumni Group events, to be given to\nevent participants.\nIn reciprocation, Alumni Groups are to acknowledge A&A & SIT as a Supporter and feature SIT’s logo\nprominently on event publicity materials and  collaterals. These publicity and event material should\nbe sent to A&A to ensure proper application of A&A & SIT logo prior to use or publication.\n4.  REVIEW OF ALUMNI GROUPS\nAlumni Groups are subjected to a yearly review by A&A to assess their objectives and activities. At\nany point in time, if the objectives and activities of the Group are not aligned with SIT ’s mission and\ngoals, A&A reserves the right to:\n• Mandate immediate adjustments or changes to re -align with SIT’s and A&A’s mission and g oals;\n• Renew the leadership of the Alumni Group;\n• De-register the Alumni Group; and/or\n• Withdraw any permission or terminate any license for the use of SIT name, trademarks and/or\nuse of any collaterals and name cards.\nAny decision made by A&A in the cou rse of the above -mentioned review shall be final and not\nsubject to further appeal.\n5. ALUMNI GROUPS FORMATION PROCESS FLOW DIAGRAM\nApplicant  Advancement & Alumni  President -Designate\nStart\n1. Gather a group of at least 10\nenthusiastic alumni who are\ninterested to form an alumni\ngroup\n2. Recruit the group Executive\nCommittee (EXCO)\n3. Send completed forms to A&A\nfor approval   4. Review application\n5. Notify respective parties of\napplication\nApproved\n?      No  6. Ensure that all EXCO\nmembers received the\nletter of approval from\nA&A and acknowledge it.  Yes\n7. A&A will call for a review\nof the new alumni group\n1 year after their\nestablishment to assess\nthe progress and\nsustainability of the group\nReview  End\nSuccessful\nEnd 8. Probation extended by 3\nmonths\nNot successful  1 year later\n6.  Appendixes to Annex B\n6.1  Appendix B6.1 - New Alumni Group Application Form  See Attached\nDocuments\n6.2  Appendix B6.2 -Alumni Group Event Proposal and Funding Request Form  See Attached\nDocuments\n6.3  Appendix B6.3- Personal Data Protection Act Undertaking Form  See Attached\nDocuments"
}