{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-22.pdf",
  "type": "pdf",
  "content": "SIT's New Academic\nOfferings for AY 2019/20\nA Ferry Tale Win for\nSITizens\nSITizens win First Prize\nat Healthcare Team Challenge 2019\nNursing Student’s Good\nDeed Inspires Others… and Scholars Bring Year-End Cheer\nHands-Free Driving at SIT\nIt Takes a Club…\nTo Raise Up Talents\nWinning Hotel Rooms by\nInterior Design Students\nAlumni Help Organise\nInter-Cluster Games for\nthe First Time\nHospitality Business\nand Pharmaceutical Engineering Grads\nReady to PartyOnce a SiTizen, Always a SiTizen ISSUE NO. 22  |  FEBRUARY 2019\nWHAT’S\nHAPPENING\naround our little\nbig campus\nSITizen is a publication by the\nSIT Advancement & Alumni Division.\nFor enquiries, please e-mail us at\nAlumni@SingaporeTech.edu.sg© Singapore Institute of Technology 2019\nDear SIT Alumni,\nHitting All the Right Notes\n2019 has gotten off to an exciting start at SIT.\nFuturistic technology and thrilling performances dazzled visitors at the SIT Open House in\nJanuary where SIT announced its latest degree offerings. These are the Bachelor of Science with Honours in Dietetics and Nutrition as well as the Bachelor of Science with Honours in Air Transport Management degree programmes – the first such undergraduate degrees to be offered by an Autonomous University in Singapore. They are aimed at grooming talents for growth industries. On display was also SIT’s first Electric Autonomous Vehicle (EAV), developed as a key learning tool for Telematics undergraduates (more about the EAV in this issue’s Imagine column on Page 7).\nIn partnership with the Ministry of Health and Workforce Singapore, SIT will also be offering\na new degree-entry accelerated Professional Conversion Programme in Physiotherapy. This will provide a new pathway for mid-career professionals with a relevant degree to join the growing healthcare sector.\nAt this year’s Inter-Cluster Games (ICG), the Health and Social Sciences Cluster emerged\nchampions for the third year in a row. It also marked the first time alumni were part of the organising committee, helping to provide the alumni perspective and encouraging their peers to be part of the games. Said alumnus Mr Fong Ming Hong from the Food and Human Nutrition programme, “I’d recommend next year’s ICG to alumni looking for a good bonding session with old classmates, or a chance to expand their network with people of similar interests.”\nSITizens are also proving their mettle – with several of them winning in local as well as\ninternational competitions. Read all about how Interior Design students took up the challenge to conceptualise 'Made-in-Singapore' hotel rooms for Far East Hospitality, and how Allied Health undergraduates working in a multidisciplinary team came up with a winning care management plan for an actual patient. Internationally, Aeronautical Engineering and Aerospace Systems students are also making their mark with Black Wing, an Autonomous Aerial Vehicle, whereas students from the Offshore Engineering and Naval Architecture programmes clinched first place in the Worldwide Ferry Safety Association 2019 Ferry Design Competition with the MV Pasig Express.\nTo top it all off, SIT undergraduates from various programmes can look forward to a\ngrowing range of philanthropic support from SIT’s donors. Thanks to new gifts, The Abang\nScholarship, the JSP Study Grant, the K M Quek Applied Research Grant and the Rotary\nClub of Tanglin & Tong Kok Chiang Scholarship have been endowed at SIT.\nWe hope you will enjoy reading this issue of SITizen. Should you wish to contribute a story,\ndo drop us a line at Alumni@SingaporeTech.edu.sg.\nSiTIZEN  |  02/16\nA ‘House’ of the Future\nStudents do more as one, as they showcase futuristic\ntechnology and thrilling performances to dazzle more\nthan 6,000 visitors at this year’s SIT Open House\nHeld on 12 and 13 January 2019, the SIT Open House 2019 at Suntec\nSingapore Convention & Exhibition Centre attracted over 6,000 visitors who turned up to discover more about SIT’s applied learning approach to education, as well as its degree offerings for the upcoming Academic Year 2019/20. (For more on the latest programmes, please see Page 3).\nThe visitors learned about internship experiences, such as SIT’s\nIntegrated Work Study Programme, and real-world projects from\nfirst-hand accounts by student ambassadors. They also interacted with cutting-edge technologies that showcased the exciting hands-on learning opportunities available to SIT students.\nMs Audrey Lim, a Year 3 Telematics (Intelligent Transportation Systems\nEngineering) student, enjoyed chatting with visitors as a student ambassador for her course at Open House.“Many visitors hadn’t heard about Telematics before and asked what it meant,” she says, “so it was a great opportunity to share that Telematics refers to a merging of telecommunications and informatics, as well as explain how my peers and I will graduate with diverse skill sets in both engineering and infocomm technology.”\nSIT Calisthenics club members showing fine control of their bodyweight to perform dynamic and\nstrength movements – a picture-perfect display of the slogan, 'Do More As One'.Looking for their dream course in the midst of a crowded hall.\nA prospective student ponders a potential future at SIT.\nThis mirrored photo booth with neon lighting gives participants both\na photo printout and a gif of their various poses, sent to their email.\nA visitor interacting with the ABB YuMi robot, which can collaborate with human workers by performing tasks such as factory work or even coffee preparation. Mechanical Engineering\nstudents at SIT will get to work with exciting technologies as they train in the various aspects of\nrobotics, and learn to harness the capabilities of robots in areas such as Healthcare Engineering, Smart Design and Robotic Automation.A young visitor and possible future SITizen gets to try out the latest virtual reality technology.\nSiTIZEN  |  03/16\nSIT’s New Offerings for Academic Year 2019/20\nBSc (Hons) in Dietetics and Nutrition and BSc (Hons) in Air Transport Management introduced\nto groom talents for growth industries\nThe Singapore Institute of Technology (SIT) has two new\nofferings for the upcoming Academic Year (AY) 2019/20: the Bachelor of Science with Honours in Dietetics and Nutrition programme and the Bachelor of Science with Honours in Air Transport Management programme. The first of such undergraduate degrees to be offered by an Autonomous University (AU) in Singapore, these programmes are in line with the university’s mission to groom industry-ready students while providing\nwell-equipped talent for growth industries – the healthcare and aviation sectors in these instances.\n• The Dietetics and Nutrition programme, developed in\nclose consultation with chief dietitians from Singapore’s three major public healthcare clusters, addresses the lack of a specialised undergraduate dietetics degree in Singapore, at a time when diet-related chronic diseases such as diabetes, hypertension and obesity are on the rise in Singapore. The Ministry of Health has reported a 56% increase in demand for dietitians in acute care from 2010 to 2015.\nWith a curriculum that provides students evidence-based theoretical knowledge, research skills, and\nindustry-relevant practical experience, aspiring dietitians\ncan apply their skills in managing medical conditions, disease prevention and health promotion. Previously,\nthe only way to achieve a recognised dietetics academic\nqualification was through an overseas degree.  Prof Loh Han Tong, Deputy President (Academic) &\nProvost, SIT, commented: “Through theoretical and clinical education recommended by international professional dietetics organisations, graduates will be well prepared for the role of an entry-level professional dietitian.”\n• With the development of Changi Airport Terminals 4 and 5, the Air Transport Management programme aims to strengthen the pipeline of skilled aviation professionals to meet future manpower demand in the expanding aviation industry.\nDeveloped in close partnership with the Civil Aviation Authority of Singapore (CAAS), the curriculum will cover operations, management and business aspects of the air transport industry. Students will also undergo an eight-month Integrated Work Study Programme (IWSP), a signature component of SIT-conferred degrees, in\ntheir third year to gain first-hand industry experience in\nair transport-related companies.\n“SIT’s new degree programme in Air Transport Management will help expand the air transport manpower pipeline and enhance job-readiness of students and job-seekers looking to join the sector. Graduates of the programme may consider careers in the air transport sector, as well as at CAAS,“ said Mr Ho Yuen Sang, Director (Aviation Industry), CAAS.\nNew Accelerated Professional Conversion Programme\nin Physiotherapy\nIn partnership with the Ministry of Health (MOH) and\nWorkforce Singapore (WSG), SIT is launching a new degree-entry Professional Conversion Programme for Physiotherapists (Accelerated) (PCP-PT (Acc)). This is in line with the strategies under the Healthcare Industry Transformation Map (ITM), to build a strong local core in healthcare by providing multiple pathways for\nmid-career Singaporeans to join this growing sector.\nThe accelerated Bachelor of Science (Hons) in\nPhysiotherapy programme is targeted at mid-career locals with a prior degree qualification in a science-related field.\nIt will be offered by SIT from September 2019. The\nprogramme will last for 2 years 8 months, allowing trainees to complete their training in a shorter period of time compared to the current four-year PCP-PT, also offered by SIT. Course fees will be fully sponsored and trainees will receive training allowances throughout the duration of the course. This new programme underscores MOH and WSG’s committment to provide additional pathways for mid-careerists hoping to make a switch into a meaningful career in healthcare.\nSaid Dr Amy Khor, Senior Minister of State, Ministry of\nHealth, “The introduction of the accelerated Professional Conversion Programme for Physiotherapists comes at an opportune time for mid-career Singaporeans to join the healthcare sector. The shorter training duration of less than three years could also make it more attractive for mid-career switchers who are thinking of joining the profession, to take up the course.”\nApplications for the PCP for Allied Health professions\nis now open until 19 March 2019.\nSiTIZEN  |  04/16\nA Ferry Tale Win For SITizens\nUndergraduates from SIT-NU joint degree\nprogrammes emerge as champions in\ninternational ferry design competition\nA team of students comprising Mr J Vinoth from the\nOffshore Engineering programme, and Mr Daniel Immanuel Sukartio and Mr Lin Qimiao from the Naval Architecture programme clinched first place in the Worldwide Ferry Safety Association’s (WFSA) 2019 Ferry Design Competition. Contestants were tasked with designing a passenger ferry for the Pasig River in Manila, Philippines, aimed at reducing congestion as well as ferry fatalities.\n(Seated from left to right) Mr Lin Qimiao, Mr J Vinoth and Daniel Immanuel Sukartio\nwith their faculty advisors from Newcastle University – Dr Mohammed Abdul Hannan\n(in blue) and Dr Ivan CK Tam (in white).MV Pasig Express, an aluminium-hulled catamaran ferry designed by the winning team to tackle the congestion and fatality issues faced in the Pasig River, Manila.\nDespite being inexperienced in designing an entire vessel\nfrom scratch, the trio did a lot of research and consulted with their faculty advisors, tapping on the knowledge\nSafety has to start in the\ndesign phase to minimise\noccurrence of accidents.\n- Team captain Mr J Vinoth,\nBEng (Hons) in Offshore Engineeringfrom their modules to create the final concept. However, the greatest challenge the team faced was not technical, but involved time management. Juggling between the project, assignments and their Integrated Work Study Programme (IWSP), they worked through nights and weekends to complete their submission.\nTheir tenacity, team spirit and creativity resulted in MV\nPasig Express – an aluminium-hulled catamaran ferry that\nis affordable yet utilises state-of-the-art technologies to\nimprove safety and operational standards. These include the use of solar panels as an alternative source of energy and a rain water harvesting roof to reduce the vessel’s\ndependency on water sources. In addition, a hybrid\npropulsion system is deployed to optimise fuel usage at\nberthing or low speed.\nThe team’s design tackled the multiple challenges\nidentified by WFSA by including a debris and vegetation\ncollector attached to the bottom of the ferry which\nhelps to restore river cleanliness. Safety concerns were\nalso addressed in the design by featuring three levels of\nfire protection and egress through six points of escape\nincluding exit doors on both sides of the craft.\nMr Lin, the team’s chief designer added, “Through\nknowledge gained from the classrooms, we were able to think critically and come up with new, innovative ideas such as Hi-Fin propeller, hybrid propulsion and debris collector for our ferry design.”\nAll three SITizens will deliver a presentation of their\nwinning design and receive their prize of US$5,000 at WFSA’s Ferry Safety and Technology Conference in Bangkok, Thailand, in February 2019.\nSITizens win First Prize at\nHealthcare Team Challenge 2019\nOccupational Therapy and Physiotherapy undergraduates work\ntogether in a multidisciplinary team to come up with their\naward-winning care management plan\nThird-year students Mr Muhammad Izikeil bin Ramli and Ms Sharanyah\nMaganthiran flew the SIT flag high with their winning presentation at the Healthcare Team Challenge, a competition that was held in conjunction with the Asia Pacific Medical Education Conference in January 2019. Designed to be a patient-centred interprofessional learning experience, the challenge saw five teams, each comprising a mix of aspiring healthcare professionals from various educational institutions, proposing a care management plan for an actual patient.The award-winning presentation at the Healthcare Team Challenge by SITizens Ms Sharanyah Maganthiran (second\nfrom left) and Mr Muhammad Izikeil bin Ramli (extreme right) “showed how a multidisciplinary team should operate\ncollaboratively for good delivery of care.\"SiTIZEN  |  05/16\nBoth currently in their third year of studies in Occupational Therapy and\nPhysiotherapy respectively, Mr Izikeil and Ms Sharanyah worked alongside four other teammates over a period of three days to come up with a multidisciplinary care plan for a 78 year-old gentleman who had an unwitnessed fall and had also I decided to join the competition to challenge\nmyself and my abilities in working within a\nmultidisciplinary team which reflects the real\nworking environment we will be placed in\nupon graduation, where practitioners of various\ndisciplines will be involved in developing\ncare plans for the patients we see.\n- Mr Muhammad Izikeil bin Ramli,\nBSc (Hons) in Occupational Therapysuffered from a stroke. Their\nteammates included NUS students from Medicine, Nursing and Pharmaceutical Science as well as a Medicine student from China.\nWhen asked about the process of\nformulating a care management plan, Mr Izikeil said, “It was an interesting experience as it was my first time working with students from other institutions. Prior to our discussions, we shared a little bit about what our professions aim to achieve with our patients. With this mutual understanding, our individual roles became clearer and where they overlapped, we learned to work in tandem to achieve the best results possible. No matter what the differences or difficulties we faced, we always\nreminded each other that the\nwell-being of the patient should\nbe our main priority. “ The team\noffered a three-step care action plan that was targeted at:\n• stabilising the patient’s condition\nand ensuring that he is able to perform his activities of daily living within the ward,\n• modifying his home environment to suit his condition,\n• equipping caregivers through proper training, and\n• prescribing the patient powered mobility in the form of a motorised wheelchair that would allow ease of movement.\nMr Izikeil added, “Our aim was to propose a plan that encourages the patient, who is still very much an active member of the community, to adopt a positive outlook on life and successfully regain confidence to go about his daily activities.\"\nA representative from the\njudging panel shared that the winners clearly displayed respect and understanding of how a multidisciplinary team should operate collaboratively for good delivery of care. Each member of the winning team was awarded with $100 worth of CapitaLand vouchers.\nSiTIZEN  |  06/16\nNursing Student’s Good Deed\nBecomes an Inspiration to Others\nUndergraduate An Xin Yun, along with two of her fellow cadets\nfrom St John Singapore, were recently recognised for their attempt\nat saving a stranger’s life\nOn November 8, 2018, Ms An Xin Yun, 24, who is currently pursuing a Nursing\ndegree at SIT, came across an 80-year-old security guard who was having a cardiac arrest as she was about to leave after helping out at Damai Secondary School’s St John Brigade’s annual training camp.\nHer instincts as a professional nurse kicked in as she quickly assessed the situation\nin a calm manner and applied the DRSABC (Danger, Response, Shout for help,\nAirway, Breathing and CPR) Action Plan. Ms An immediately called for assistance and carried out cardiopulmonary resuscitation (CPR) on the victim.\nMs Eunice Yam and Mr Muhd Aqasha bin Juhari, her two 16-year-old juniors\nat the St John Brigade, assisted Ms An by setting up the Automated External Defibrillator (AED) and also took over chest compressions when asked to do so.\nSaid Ms An who regularly helps out at her secondary school’s St John Brigade,\n“I never once expected that my juniors will be using the knowledge and skills\nshared by me, together with me,”\nshe told SITizen.\nUnfortunately, the security guard\npassed away two days after the incident, but the trio were not discouraged. They believed they have done their best to assist. Witnessing the incident first-hand made both Ms Yam and Mr Aqasha recognise the importance of equipping themselves with essential first aid skills and they are now inspired to become nurses, said Ms An.\nMs An was initially hesitant to\ninvolve her juniors as she was afraid that the incident might cause some trauma to them; but she went ahead to enlist their help as she recalled having taught them and seeing them practise these skills on a dummy before. “I’m really proud that they did not shy away from their responsibilities as\nfirst-aiders despite their young age,” said Ms An.\nTheir good deed was featured by\nthe Chinese daily Lianhe Wanbao on 16 January 2019. To commend them for their good deed, Songhe donated food packages totalling 500kg of rice and 60 litres of canola oil to their selected beneficiary Sunlove Home in their names. SIT Nursing student An Xin Yun's (right) good deed was also featured in Lianhe Wanbao.\nScholars Bring Year-End Cheer\nOn 29 November 2018, five recipients of the Tan\nSri (Dr) Tan Chin Tuan Scholarship at SIT were part of a group of volunteers who took part in\nyear-end celebrations for some beneficiaries from\nCARElderly Seniors Activity Centres, organised by the Tan Chin Tuan Foundation.\nTogether with volunteers from YMCA, the scholars\nspent the morning at YMCA of Singapore helping to lead the games. They also assisted and\nbefriended the seniors during the celebrations.\nSecond-year Electrical Power Engineering student, Mr Muhammad Firdaus bin Fawzi Laza even ended up dancing with one of the seniors during one of the activities. Tan Sri (Dr) Tan Chin Tuan Scholar, Ms Ong Siew Woon (in red polo\ntee) playing bingo with the seniors.SIT students and staff (in red polo tees) together with volunteers and staff of the Tan Chin Tuan Foundation after the event.\nSaid Ms Nur Aqilah bte Abdul Rashid, a second-year undergraduate\nfrom the Occupational Therapy programme, “It was a heartwarming experience to see the elderly having fun and participating during\nthe event. It was also definitely inspiring to see them being so\ncheery and energetic.”\nMs Thang Ai Qin, from the Pharmaceutical Engineering\nprogramme, felt that it was meaningful to have spent some time with the seniors during the event. It made her appreciate what the elders have done to build Singapore to what it is today. She said,\n“The opportunity to interact with the Pioneer Generation during\nthe session was a huge eye-opener for me! Hearing their stories about how they survived World War II, living under constant fear from the Japanese, made me realise just how fortunate my generation is.”\nSiTIZEN  |  07/16\nHands-Free Driving\nSIT develops its first Electric Autonomous Vehicle as key learning tool for Telematics\nundergraduates\nTo further enhance undergraduate\nlearning within the Bachelor of Engineering in Telematics (Intelligent Transportation Systems Engineering) degree programme, SIT has developed an Electric Autonomous Vehicle (EAV) in collaboration with SingPilot, a start-up focused on developing autonomous driving technologies.\nThis EAV will be used primarily for\neducating undergraduate students from the Telematics programme. “Most autonomous vehicle trials have been used for research purposes, or for commercial entities to gain knowledge and experience,” said Mr Dan Chia, Senior Lecturer, SIT. As the first and only degree programme in Singapore that focuses on the Automotive and Intelligent Transportation Systems arena, the EAV will be an important IMAGINE!\napplication tool for students as part of\ntheir curriculum.\nThird-year student Mr Boris Khoo,\nwho is among SIT’s pioneer batch of Telematics students, had the opportunity to make his own contributions to the vehicle through his Integrated Work Study Programme (IWSP) with SingPilot. He was tasked with creating a modular design for its vehicular controls, including functions such as the acceleration, brakes and gear system, among others.\nPlans are also underway to\ncomplement the EAV with the ‘smart lamp post’ (part of Singapore’s Smart Nation Sensor Platform Project) which can be used to direct driverless cars, catch speeding e-scooters and even analyse faces, down to race, gender and age. This will drive research between autonomous vehicles and infrastructure communication. It will also allow SIT to perform in-depth studies of the relationship between technology deployment and concepts in real-applied situations.\nSIT showcased the EAV at the SIT Open\nHouse, held at the Suntec Convention Centre from 12 to 13 January. Visitors at the open house had a chance to view the vehicle up close and speak with faculty to learn more about the various technologies used, such as sensors and controls, wireless communication, and vehicular networks.\nThe vehicle is set to be a mainstay\nat the SIT@Dover campus, and is currently completing its final phases of integration and mapping at SIT. Its first lab session is slated to begin at the end of March 2019.\nSiTIZEN  |  08/16\nFor SITizens, New Gifts that Keep on Giving\nImpactful endowed gifts from donors advance a diverse range of support for students at SIT\nSIT students can look forward to a growing range of philanthropic support which nurtures undergraduate learning.At the Singapore Institute of Technology (SIT), a range of endowed gifts was recently made possible by generous donors\nwith a strong belief in the transformative power of education. These three gifts, made in support of student excellence, research, and financial aid at SIT, will permanently enable SIT undergraduates to make the most of their education, and realise their potential to the fullest.\nThe Abang Scholarship\nThe Abang Scholarship has been made possible by an\nanonymous donor, who hopes to provide aid to financially needy but deserving students in the same way that an elder brother (or Abang in Malay) would gladly offer help to a sibling in the family.\nIn this spirit of communal and familial support, two\nscholarships will be disbursed in Academic Year (AY) 2020/21 and from AY 2021/22 onwards, three to four scholarships will be given out annually.\nThe awards will be given to academically talented and\nall-rounded students, including students from the Malay community or those in need of financial assistance.\nJSP Study Grant\nThanks to a new endowed gift from Mr Jeff Goh, the JSP\nStudy Grant that he has made possible at SIT since 2015 was recently endowed to support academically promising undergraduates at SIT in perpetuity.The Study Grant was realised out of a wish to nurture talented undergraduates who need some financial support. Thanks to this new and permanent philanthropic commitment, one Study Grant will be awarded annually – and in perpetuity – to academically talented but financially needy students from SIT-conferred or joint degree programmes.\nThe JSP Study Grant will help shape their future through\neducation, and inspire them to pay it forward to the community when they one day have the ability to do so.\nMs Jasmine Lee, a Year 2 Physiotherapy student who\nreceived the Study Grant in AY 2017/18 said that the Study Grant has given her the opportunity to continue her studies as well as have extra time to learn new things through her CCAs. “I would like to thank Mr Goh for being a role model to many of us, and one day I hope that I’ll be able to help others in the same way that he has,” she added.\nK M Quek Applied Research Grant\nMade possible through Dr Stanley Quek and The Ireland\nFunds (Singapore) in support of the health sciences, the K M Quek Applied Research Grant will support research projects involving undergraduate participation and learning at SIT’s Centre of Health Sciences Research & Innovation (CHeSRI) from the next academic year (AY 2019/20) onwards.\nCHeSRI was set up within the Health and Social Sciences\n(HSS) Cluster in 2017, as a strategic initiative to consolidate all health and social sciences research activities within the university.\nThe CHesRI projects funded by the Research Grant will\nopen up new possibilities in making improvements in patient care, physical rehabilitation and the promotion of healthier living in other areas; as well as giving SIT’s HSS undergraduates greater exposure to these areas of applied research.\nSiTIZEN  |  09/16\nIt Takes a Club… to Raise Up Talents\nThe new and permanent Rotary Club of Tanglin & Tong Kok Chiang Scholarship will nurture\nstudent excellence among Nursing and Allied Health undergraduates at SITMs Samantha Tan (middle) says thank you with some chocolate cake to Mr Robert Sabaka (second from left), President (Rotary Year 18-19), Rotary Club of Tanglin,\nSingapore, Mr Tong Kok Chiang (second from right), Member, Rotary Club of Tanglin, Singapore and Mrs Jessie Tong (extreme right) as Prof Alan Wong (extreme left),\nCluster Director, SIT, looks on.\nProf Alan Wong (middle) receives the cheque from Mr Tong Kok Chiang, Member\n(left), Rotary Club of Tanglin, Singapore, and Mr Robert Sabaka, President (Rotary\nYear 18-19) (right), Rotary Club of Tanglin, Singapore.Ms Samantha Tan, a first-year undergraduate from the\nBachelor of Science with Honours in Occupational Therapy degree programme at the Singapore Institute of Technology (SIT), has always aspired to join the healthcare sector as a professional. She said, “As an Occupational Therapist, I will be able to help patients with a wide range of conditions get back on their feet again.”\nNow thanks to an endowed gift from the members of\nRotary Club of Tanglin, Singapore – led by their fellow member Mr Tong Kok Chiang – to make possible a new permanent scholarship, talented undergraduates with demonstrated leadership qualities from SIT’s Allied Health and Nursing programmes like Ms Tan will be nurtured to fulfil their potential as they pursue their dreams of becoming healthcare professionals.\nOne Rotary Club of Tanglin & Tong Kok Chiang Scholarship\nwill be awarded annually and in perpetuity, starting from this Academic Year 2018/19. Ms Tan is the very first recipient of the scholarship and was able to express her appreciation to the Rotary Club of Tanglin, Singapore and Mr Tong Kok Chiang during the cheque presentation ceremony that took place on 28 January 2019.\n“I am grateful for this scholarship as it will give me\nthe opportunity to seek ways to enrich my university experience. I hope to be able to continue helping those in need around me and bring out Rotary’s motto of ‘Service before Self’,” she said.\nProf Alan Wong, Cluster Director, SIT, was also present\nat the ceremony and was heartened to see the growing\nsupport from the community for SIT’s Nursing and Allied\nHealth students. He said, “We are truly grateful to Mr Tong Kok Chiang for his philanthropic leadership, together with the members of the Rotary Club of Tanglin, Singapore to make possible this very special scholarship for talented Health Sciences undergraduates at SIT.”\nSince it was chartered in August 1984, the Rotary Club of\nTanglin, Singapore and its members has involved itself in many areas of service in order to reach out to different groups of people including the sick, the handicapped, the under-privileged and also those who are afflicted by natural disasters.\nSiTIZEN  |  10/16\nProf Tan Thiam Soon, President, SIT (second from right), together with members of the Singapore Leong Khay Huay Kuan as well as guests at the event.\nTeam Black Wing comprising (from left) Andre Wan, Gibson Tubiba Teo, Ryan Koh Wee\nLun, Yap Thian Hong, Ryan Koh Kok Fong, Glendon Sim and Tin Nilju, with Assoc Prof\nDr Sutthiphong Srigrarom.SITizens beat over 16 international teams to\nclinch top prize at the Autonomous Aerial\nVehicle Challenge (AAVC)Triple Celebrations for the New Year\nFlight to VictoryRecipients of the Singapore Leong Khay Huay Kuan\nBursary at the Singapore Institute of Technology (SIT) were treated to a very special afternoon on 16 February 2019 at the Raffles City Convention Centre. They were among the attendees of a triple celebration held by the Singapore Leong Khay Huay Kuan to celebrate the 80th anniversary of the clan association, the 5th anniversary of the clan’s Education Trust, as well as to usher in the Lunar New Year. Prof Tan Thiam Soon, President, SIT, along with SIT staff were also present at the event.\nFor Ms Ho Sin Yue, who received the Bursary for two\nconsecutive years, the event was an opportunity to say thank you to the clan members she met. The second-year Hospitality Business student said, “I learned just how much the Singapore Leong Khay Huay Kuan has worked\nTeam Black Wing, comprising seven students from\nUniversity of Glasgow’s Aeronautical Engineering and Aerospace Systems programmes, made SIT proud when they clinched the top prize for ‘The Best Platform Innovation’ in the Fixed Wing Category at the AAVC in Chiang Mai, Thailand in November 2018. Competitors were tasked to create a drone that complements search-and-rescue efforts with the ability to drop off a ‘payload’, such as medication or food supplies to people in emergency situations.\nIt was the team’s first time building a drone, but they\novercame technical and unfamiliar environmental challenges to triumph over teams from India, Singapore and Taiwan, as well as those from defence academies of Thailand and Japan. Team member Mr Glendon Sim attributes their success to their daringness to try. “I believe our team dared to attempt something different or even challenging, and always questioned if there were ways to push the limits of innovation without compromising on the flight fundamentals and principles\nto help students cope with their school fees and I am very grateful for the bursaries I’ve received.”\n“It was a wonderful reception, and being able to meet\nand thank the clan members who made the bursary possible in person was a great honour,” added Ms Nurush Shifa’ Binte Kamarul Zaman, a second-year student from Physiotherapy programme.\nThe clan association endeavours to preserve Chinese\nlanguage and culture, promote education and social welfare, as well as benefit the Hokkien community and Singapore society at large. The Singapore Leong Khay Huay Kuan Bursary was established at SIT in 2015. It is applicable to all Singaporean students who come from financially disadvantaged families. This bursary supports 12 financially disadvantaged Singaporean students annually.\nwe learnt,” he said. “We dared to make changes throughout the process of building that put the team’s critical thinking to the test.”\nThe competition is in its sixth year and was hosted by the\nConsortium of Aerospace Engineering (Thailand) and Chiang Mai University. Besides the experience, the team also valued the opportunity to forge international bonds. Said team leader Mr Yap Thian Hong, “The competition made us realise the value of perseverance and hard work. As a bonus, we also made good friends with the rest of the competitors from the other international universities.”\nSiTIZEN  |  11/16\nChengal Pasir by Ms Felyna Chia (right). Ms Chia wanted the hotel room ambience to reflect the natural heritage\nof Changi’s yesteryears.\nThe constructed Chengal Pasir Room at Village Hotel Changi.\nMr Kingsley Koh (right) was inspired by the richness of Peranakan culture when he came up with the\nTuang Teh concept.\nThe constructed Tuang Teh room at Village Hotel Katong.Budding talents from the Interior Design programme conceptualise winning hotel rooms‘Made-in-Singapore’ Sensibility\nThanks to their award-winning\ndesigns, Interior Design students\nMs Felyna Chia and Mr Kingsley Koh had the opportunity to work with Far East Hospitality to bring their concepts to life through the inaugural ‘Made-in-Singapore’ project.\nThe project saw Far East Hospitality,\none of Singapore’s leading operator of hotels and serviced-residences, challenging students from the\nunderstand better the challenges of\ndesigning a hotel room.\nMs Chia, who designed the Chengal\nPasir Room for Village Hotel Changi, was inspired when she learned about the abundance of Chengal Pasir\ntrees in Changi Village. She said,\n“These trees are amongst the tallest\nin this area and they ‘grew’ up with the village.” She added, “I want the room guests to appreciate the natural\nlaid-back ambience of Changi that is away from the usual hustle and bustle of Singapore.”\nMr Koh’s Tuang Teh concept for\nVillage Hotel Katong was inspired by the Peranakan culture and activities that are integral to Katong. He wanted people to be able to appreciate Peranakan culture through the Tuang Teh tea ceremony.\nHe said, “Design is more than just aesthetics, colour and embroidery. Through Tuang Teh, I wanted both\ntourists and Singaporeans to take away a slice of the Peranakan way of life, which adds to the melting-pot culture of Singapore.”Singapore Institute of Technology (SIT) and the Nanyang\nAcademy of Fine Arts (NAFA) to conceptualise rooms for four hotels – Village Hotel Albert Court, Village Hotel Bugis, Village Hotel Changi, and Village Hotel Katong. Participating students visited the hotels and the enclaves they were located in to draw inspiration from cultural landmarks as well as their locations’ history and heritage. Winners were chosen based on their creativity, interpretation of Singapore-inspired hospitality and the ability to highlight Village’s brand positioning.\nBoth Ms Chia and Mr Koh also asked their fellow SITizen,\nHospitality Business student Ms Oh Jun Yi to share her insights about travellers and hotel operations so that they were able to\nSiTIZEN  |  12/16 SiTIZEN  |  13/16\nA healthy amount of cluster pride and the chance to\nclock in a good workout brought 30 alumni back to SIT@Dover to join current students and lecturers at an all-out bid for victory at Inter-Cluster Games (ICG) 2019.\nHeld on 26 January 2019, the event saw the five SIT\nacademic clusters (Engineering, Health and Social Sciences, Infocomm Technology, Chemical Engineering and Food Technology, and Design and Specialised\nHere are some photos of our alumni in action at ICG 2019:Back to Play For Their Clusters... And More\nAlumni help organise Inter-Cluster Games (ICG) for the first time this year; Health and Social Sciences Cluster emerges champions third year in a row\nFurious and fast-paced ultimate frisbee games had participants scrambling\nnon-stop up and down the green.Floorball enthusiasts clashing with quick hands and deft flicks of their sticks.\nA defender’s work never ends in captain’s ball. Jumping high and reacting fast is a must for overcoming the height advantage of the catcher.Many years of friendship make for great teamwork as well: an Engineering\ncluster team composed almost entirely of alumni won the first place in the ultimate frisbee competition.\nTaking a break and bonding during the intense games! This team of ladies from DSB snagged first place in the\nBasketball (Female) competition.\nNice tans, nice sun, and good fun for these hearty and\nsporty SITizens!Putting well-laid plans into action and initiating the attack on the futsal pitch.\nA team of Engineering cluster alumni and current students\ngathering for a pre-game strategy huddle.\nalumni perspective on the games as well as to encourage their peers to\nparticipate.\nAmong the five alumni organisers was Mr Fong Ming Hong from the Bachelor\nof Science with Honours in Food and Human Nutrition programme. “I enjoyed being able to interact with my juniors and sharing my experiences in the working world with them,” he said. “I’d recommend next year’s ICG to alumni looking for a good bonding session with old classmates, or a chance to expand their network with people of similar interests.”Businesses) forming teams to compete in six different sports: basketball, captain’s ball, floorball, futsal, relay racing and ultimate frisbee. Around 200 participants took part in this fierce yet friendly competition; they bonded across cohorts and showed once again that 'Once a SITizen, Always a SITizen'.\nThis also marked the first time that alumni were part of the\norganising committee of the ICG – helping to provide the\nA Design and Specialised Businesses (DSB) alumna passes\nher defender to score some hoops.\nSiTIZEN  |  14/16\nLast year, graduating students from the Hospitality Business and Pharmaceutical Engineering programmes took the\ninitiative to organise graduation parties for their respective classes (with a little support from SIT). The celebration for the Hospitality Business students took place at Hilton Singapore on 27 October 2018 while the Pharmaceutical Engineering students partied at Carlton Hotel Singapore on 1 December 2018.\nSIT Hospitality Business Graduation Ball\n27 October 2018Pharmaceutical Engineering Graduation Night\n1 December 2018\nAttendees at the Pharmaceutical Engineering Night (which was supported by SIT)\nincluded 70 alumni, as well as SIT faculty and staff. One alumnus, Mr Tee Jin Feng\nsaid, “It was an exciting and enjoyable night, and it’s probably the very last chance to\nhave most of us doing funny and weird stuff together. Everyone should attend their graduation celebrations for a complete university experience!”\nAlthough the night was themed 'A Star Was Born', these alumni decided to dress in cartoon character onesies instead. Ms Lim Yee En (not pictured), the chairman of the organising committee said planning the event was a slightly bittersweet experience for her, knowing that it was the last one she would plan for her classmates. She said,\n“I’m very thankful for all the help and support given by the committee and I appreciate\neveryone coming together to plan this celebration despite having a busy trimester.”\nThe Pharmaceutical Engineering alumni walked away with lucky draw prizes, played games and also watched a video put together by their professors, who recounted their first impressions of the graduating class. Alumni also enjoyed an impromptu karaoke session, singing to their heart's content.The Hospitality Business Class of 2018 got all dressed up to celebrate ‘The Greatest Graduation’. The students drew inspiration from the movie, The Greatest Showman,\nand wanted the night to represent the final curtain call for the academic journey that\nthis pioneer batch had embarked on together three years ago. More than 85 people including alumni and faculty attended the event.\nOne of the highlights of the night was the inaugural Hospitality Business Awards\nwhere titles like 'Best Actor', 'Best Actress', 'Best Joker', 'HB Fashionista', and\nmore were given out. Here, Asst Prof Liu Zhaoping (in red) congratulates alumnus\nMr Darren Sze, for winning the 'Best Actor' award.\nRepresentatives from each table struck a pose after being dressed up by fellow\nstudents for a game. Mr Keith Tan (second from left), who chaired the organising\ncommittee, said he and his committee members planned for the night in their final\nyear. He said, “It was very heartening as we worked together as a team towards making the event an unforgettable one. Planning for the event also allowed us to put into practice what we learnt in school.”Ready to Party!\nGraduates from both the Hospitality Business and the Pharmaceutical Engineering\nprogramme make memories\nSiTIZEN  |  15/16\nAfter an exciting year full of key SIT events such as Beers\nwith Peers: Annual Alumni Beanfeast, the Recognition of Excellence presentation, as well as the ever-popular Alumni Movie Night, the time had come once again to thank the dedicated student hosts for their invaluable support in making these events a success. A total of 38 student hosts arrived on Saturday, 16 February 2019 at the Volunteers’ Appreciation Gathering, hosted by SIT’s Advancement and Alumni Division. These hosts are in for a fun and relaxing afternoon at Happen @ Jalan Besar, together with SIT staff.\nStudent hosts Mr Jasper Leow Xiang Rong, Mr Tan Lai Choon and Mr Cheah De Qing\n(from left to right) had a blast belting out their favourite hits on the karaoke machine.A Happening\nGatheringFor engaging their fellow SITizens and\nfriends of SIT, students hosts are treated\nto an afternoon of fun activities\nSIT Alumni Card Benefits\nScan for the latest merchant\ndiscounts available!\nThis year’s gathering was a little different compared to previous years. Instead of the usual brunch, the event was held at HAPPEN @ Jalan Besar, a space where the student hosts could relax and unwind with some foosball, console and table top games, and even a pool table and karaoke machine. Mr Tan Lai Choon from the Criminology and Security degree programme (University of Liverpool), said, “The event was very enjoyable, and I had fun singing karaoke. In particular my favourite part was meeting the other volunteers again after so long, especially since we’re based at different campuses.”\nAs a bonus in the spirit of Chinese New Year, a number of\nred packets containing small prizes were hidden all over the area for the students to find. Besides the treasure hunt, they also had the opportunity to win prizes through some team-bonding games."
}