{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-9.pdf",
  "type": "pdf",
  "content": "Once a SiTizen, Always a SiTizen ISSUE NO. 9   |  NOVEMBER 2015\nWHAT’S\nHAPPENING\naround our little\nbig campusDear SIT Alumni,\nSITizen is a publication by the\nSIT Advancement & Alumni Division.For enquiries, please e-mail us at Alumni@SingaporeTech.edu.sg© Singapore Institute of Technology 2015On the Road to Success\nThe season of celebration kicks into high gear at SIT, even as 2015 progresses steadily\nto its fruitful conclusion. In August and September, the new student intake was gleefully welcomed into the SIT family at three fun-ﬁ  lled events: SIT Student Orientation 2015, SIT Carnival and SIT Day Zero. Of these, the SIT Carnival at Dover Campus was an\ninaugural event that drew 1,500 attendees including new students and their families, who were given a glimpse into the vibrant campus life at SIT.\nFor the graduating students, this is the time of the year when many of them receive their\ndegrees. In September and October, more than a thousand students from The Culinary Institute of America, DigiPen Institute of Technology, The University of Manchester, University of Nevada, Las Vegas, Trinity College Dublin, University of Glasgow and\nNewcastle University were given their certiﬁ  cates at their respective graduation ceremonies.\nAmong them was Mr Fou Zi Xuan, a First Class Honours graduate from the Bachelor of Engineering (Honours) in Naval Architecture degree programme (Newcastle University), who was recognised with a whopping nine awards for his academic achievements.\nNow an Engineer with Sembcorp Marine, Mr Fou credits his father, a car mechanic who\ndelights in taking apart his car, for instilling in him a passion for Engineering. He also credits the “interesting experience at SIT”, where the packed academic schedule pushed him to achieve more within a shorter time frame. “I like the idea of having a ‘concentrated life’ like this,” he told SITizen, adding, “Of course, the Overseas Immersion Programme makes the overall SIT experience an eye-opening and unique one.”\nMr Fou also has SIT’s donors to thank. Four of his awards – the Sembcorp Marine Book\nPrize in Naval Architecture II, the Sembcorp Marine Book Prize in Ship Design, the ST Engineering Gold Medal and the Choo Chiau Beng Outstanding Student Award\nin Naval Architecture – were made possible by private donors who wish to encourage academic excellence at SIT. These four awards were among the 23 presented at the SIT’s ﬁ rst ever Recognition of Excellence held in October, a special occasion designed to bring\ntogether talented SITizens, their loved ones, generous donors and friends of the university, in an intimate celebration of student achievement and thoughtful philanthropy.\nSITizens have something else to cheer about beyond graduation and awards: the Graduate\nEmployment Survey 2014 reveals that they enjoy a high employment rate of 91.7%, competitive salaries and a seamless transition to industry. So perhaps it is no surprise that this year’s New Alumni Welcome Party, held in November, was the hottest yet. Turn the pages, and you will ﬁ  nd 200 partygoers rocking the night at Hard Rock Cafe with abandon.\nAs alumnus Chin Jun Ming puts it, “It was awesome!”\nWe hope you will enjoy reading this issue of SITizen. Should you wish to contribute a story,\ndo drop us a line at Alumni@SingaporeTech.edu.sgBig Welcome for\nNew Students\nSIT’s Graduate\nEmploymentSurvey 2014\nAlumnus Fou Zi Xuan,\nWinner of 9 Academic Awards\n’Tis the Season\nfor Graduation\nRecognising\nExcellence at SIT\n2015 New Alumni\nWelcome Party:Lip-syncing Good!\nScholars GaloreWhat’s Your\nPersonality Type?From orientation to graduation and beyond, SITizens are making the most\nof optimum conditions at SIT for personal breakthroughs\nSiTIZEN  |  02/12\nSIT Student Orientation 2015\n20 to 22 August 2015\nThe queues outside Buona Vista MRT station started as early as 8.30 am on\n20 August 2015. In line were hundreds of newly matriculated students from the Singapore Institute of Technology (SIT) waiting for shuttle buses to take them to the SIT@Dover campus for the August SIT Student Orientation Camp 2015. The camp, a three-day-two-night affair that took place from 20 to 22 August 2015, was attended by 925 incoming first-year students.\nSIT Day Zero\n4 September 2015\nSIT Day Zero was ﬁ  rst held in August 2014 with the start of SIT’s very own degree\nprogrammes to welcome and orientate students from degree programmes offered under the SIT name. This year’s Day Zero was no different and gathered over 450 students from the eight SIT programmes, including the ﬁ  ve new programmes that were introduced\nthis year.\nDay Zero focused on one speciﬁ  c component\nof the SIT-DNA – being “Able to Learn, Unlearn and Relearn”. Students attended academic orientation talks of their respective programmes, and learned to bond with each other through the various team-building activities.\nAddressing the students after lunch, Prof\nTan Thiam Soon, President, SIT, said, “Learn to make the SIT-DNA a part of your life. In everything you do, ask ‘Can I do something better?... Can I transform the world into a better world?’”SIT Carnival\n22 August 2015\nTaking place immediately after the end of the SIT Student\nOrientation Camp on 22 August 2015 was the SIT Carnival at the SIT@Dover campus. The inaugural event, part of this year’s welcome festivities for incoming students, attracted more than 1,500 attendees including the ﬁ  rst-year students\nand their family members, current students as well as staff. At the Carnival, student clubs, sports groups and the Student Management Committees put up booths which offered a glimpse of the vibrant campus life students can expect at SIT.\nIn addition to the food and game booths showcasing\nthe SIT-DNA, there were also workshops and talks held throughout the day. The sports groups held different activities including c limbing sessions in the bouldering room by the\nSIT Climbers, and even horse riding by the SIT Saddlers Club. Welcome, New SITizens!\nA fresh intake is inducted into life at SIT at events like the Orientation Camp, SIT Carnival, and Day Zero\nSITizens who learn together also build\ntogether.Looking for the woman in the mirror.Biggest orientation camp at SIT to date with 925\nparticipants was managed by 150 student organisers and facilitators.\nNew SITizens try to avoid getting wet during a water bomb ﬁ  ght that took\nplace at the SIT@Dover campus.\nThe Orientation culminated in the Legacy Nite where\nthe students put up performances which they had been preparing for throughout the camp. Said Ms Chynna Ang, from the Bachelor of Arts (Honours) in Communication\nDesign (The Glasgow School of Art), “I had a lot of fun during the camp. Even before school started, the SIT Student\nOrientation enabled me to make friends from different courses, and I am still in contact with them today.”\nThe SIT Saddlers Club led horse rides\nto anyone who was willing to stand in line for the hour-long wait.Even Prof Tan Thiam Soon, President,\nSIT (right), wanted in on the fun and got a temporary airbrush tattoo at the SIT Carnival.\nSiTIZEN  |  03/12\nTell Him WhyCommissioned by the Ministry of Education, the\nGraduate Employment Survey (GES) is jointly conducted by Autonomous Universities to survey the employment conditions of graduates six months\nafter graduation. GES 2014 was the ﬁ  rst time that\nthe Singapore Institute of Technology (SIT) – which became an Autonomous University in 2014 – took part in the annual survey.\nHere are ﬁ  ve key ﬁ  ndings from GES 2014:\n• SIT graduates enjoyed a high employment rate of\n91.7% , with 86% of economically active graduates\nsecuring full-time permanent employment six months after graduation. (Economically active graduates refer to those who are working, and those who were not working but actively looking and available for work.)\nWhile most people see a car as a means of transport,\nMr Fou Zi Xuan, sees a car “as an engine connected to wheels with gears and pinions” and it is this attitude that has served him well in his endeavours: The new SIT alumnus from the Bachelor of Engineering (Honours) in Naval Architecture (Newcastle University) achieved a First Class Honours and received a whopping nine academic awards upon graduation. At SIT’s Recognition of Excellence held on 16 October 2015 (see Page 8 for a detailed report) , he received the Sembcorp\nMarine Book Prize in Naval Architecture II, the Sembcorp Marine Book Prize in Ship Design, the ST Engineering Gold Medal and the Choo Chiau Beng Outstanding Student Award in Naval Architecture. These four are excellence awards made possible at SIT by private donors.SIT Graduates\nFaring Well in Job MarketSITizens enjoy high employment rates,\ncompetitive salaries and a seamless transition to industry, according to the Graduate Employment Survey 2014\nNew alumnus Fou Zi Xuan, the recipient of\nnine academic awards, is passionate about engineering and asking questions • The gross median monthly salary of SIT graduates\nworking in full-time permanent jobs is $3,000 .\n• The salaries of SIT graduates in specific fields are\ncomparable to their peers. Nursing graduates earn a gross median monthly salary of $3,511 and Mechanical Engineering graduates earn gross median monthly salaries of between $3,100 and $3,250.\n• This is the ﬁ  rst year that SIT is part of this annual survey\nwhich was conducted from March to May 2015, together with NUS, NTU and SMU.\n• A total of 1,006 out of 1,212 SIT graduates from the\nClass of 2014 took part in the survey and this includes graduates from the 10 Overseas Universities across 24 different degree programmes.\nMr Fou Zi Xuan (middle) with his parents who travelled from Malaysia to attend\nSIT’s Recognition of Excellence held on 16 October 2015.Then, at the Newcastle University Congregation held on\n28 October 2015 (more details on page 5) , Mr Fou was\nalso awarded the Society of Naval Architects and Marine Engineers Singapore Award, the Institute of Marine Engineering, Science and Technology Award, the School of Marine Science and Technology Prize for Best Performance in Bachelor of Engineering with Honours in Naval Architecture, the School of Marine Science and Technology Design Prize for Best Ship Design, and The Burrill Award.\nThe eldest of three siblings, Mr Fou came to Singapore to\npursue his diploma in Marine Engineering at Singapore Polytechnic after completing his ‘O’-Levels in Malaysia. He credits his father, a car mechanic, as the inspiration for him to become an engineer. “He loves his car and I still remember that when I was young, how he would literally take apart his car every Sunday morning, just to maintain it and put it all back together again before driving us out to have a good meal,” he said.\nMr Fou counts himself lucky to be good in the ﬁ  eld he is\nmost interested in. He said, “I am always curious about how stuff works.” This extends to everyday machines like the air conditioner or telephone. “They do amazing things and I will really put in effort to understand the way they work and the principles they rely on, even if the information falls outside what is needed for my course.”\nCurrently an Engineer at Sembcorp Marine, Mr Fou says his\nwork focuses on structural design and helping to “realise ship owners’ imaginations”, responsibilities for which his education has prepared him well. “Most of my current work scope as a structural designer is covered or at least introduced during my time in school – I would say my two\nyears at SIT and Newcastle University are certainly well spent!”\nSiTIZEN  |  05/12 SiTIZEN  |  04/12\nMore than a thousand new graduates\nfrom CIA, DigiPen, UoM, UNLV, TCD, UofG and NU can now step out into the professional world and show what they’re made of’Tis the Season for Graduation\nSIT Graduation Ceremony – University of Nevada, Las Vegas (UNLV)\n15 October 2015SIT Graduation Ceremony – Trinity College Dublin (TCD)\n15 October 2015\nA total of 136 students graduated from the four degree programmes offered\nby TCD at SIT on 15 October 2015. The occasion also marked the graduation of the ﬁ rst batch of students from the Diagnostic Radiography programme, a joint degree\nprogramme between SIT and TCD, and the Radiation Therapy programme. Both programmes were ﬁ  rst offered in Academic Year 2014/15.\nHis Excellency Geoffrey Keating, Ambassador of Ireland to Singapore, graced the\nceremony as Guest of Honour. Also attending the event was Prof Tan Thiam Soon, President, SIT, SIT senior management, and faculty.\nMs Goh Mei Zhi Henrietta, who graduated from the Bachelor in Science (Honours) in Diagnostic Radiography was the\nvaledictorian. She said, “This graduation ceremony marks not the end, but the beginning of our lifelong pursuit for knowledge for the advancement of healthcare. No matter which healthcare discipline we belong to, let us strive to push the standard of healthcare to greater heights. Let us not forget the passion we had started out with.”\nUniversity of Glasgow (UofG) Ceremony of Graduation\n16 October 2015\nMore than 240 graduates from the ﬁ  ve degree programmes offered by\nUofG at SIT were presented at the UofG Graduation Ceremony, which\nwas held on 16 October 2015 at The Star Performing Arts Centre.\nProfessor Muffy Calder, Vice-Principal and Head of the College of Science &\nEngineering delivered the Charge to the Graduates.\nThe following awards were presented during the ceremony: the Top Engineering\nStudent went to Mr Kasem Chaisieng from the Mechanical Design Engineering programme, The Final Year Project Prize Winners were Mr Ng Han Kiat\nfrom the Mechatronics programme and Mr Zulfika Bin Rusdi from the Aerospace Systems programme, the Boeing\nPrize went to Mr Melvin Low from the Aeronautical Engineering programme, the Singapore Level 4 Honours Class Prize for the Academic Year 2014/15 were jointly awarded to Ms Chuan Wen Bing and Mr Bang Er Quan from the Computing\nScience programme, and the Singapore Project Prize for Project Work in Level 4 Honours in Academic Year 2014/15\nwas awarded to Ms Claris Kerlyn Ke Yue’e.\nSaid Mr Chaisieng, “I feel very proud and I feel very accomplished but I am also grateful to SIT for giving me\nthis opportunity by accepting me as a student in the ﬁ  rst place.”DigiPen Institute of Technology (DigiPen) Commencement Ceremony\n19 September 2015\nThe UoM’s Bachelor of Science with Honours in Nursing Practice degree programme\ngraduated 90 students at the UoM Graduation Ceremony, held on 25 September 2015 at Sheraton Towers Singapore. The event was attended by Professor Rod Coombs, Deputy President and Deputy Vice Chancellor, The University of Manchester, and members of SIT Senior Management, and faculty.\nFour awards were presented on the day – the Outstanding Dissertation Award to\nMr Issac Ong Jun Hao, Most Improved Student Award to Ms Hia Pei Ling Andrea,\nOutstanding Contribution to Leadership and Service to Mr Viknesh S/O Vijayan, and Outstanding Student Award to Ms Nur Farahin Bt Mohamed Zakaria.\nMr Ong’s thesis studied the implementation of a ceiling lift that reduces manual handling by nurses to reduce injuries among\nthem. He said, “Receiving this award makes me feel humbled and honoured as it came completely as a surprise for me!” The Staff Nurse added, “It has served as a vindication and impetus for me to contribute to the greater good for the healthcare\nsociety in Singapore, leading to better care for both patients and nurses.”\nNewcastle University (NU) Congregation\n28 October 2015\nTaking place over two sessions on 28 October 2015, the NU Congregation\nceremonies saw the graduation of more than 320 graduates from the seven degree programmes offered by NU at SIT. Over 40 prizes were also awarded to the graduands on that day.\nThe top prizes presented at the ceremony were: the Society of Naval\nArchitects and the Marine Engineers Singapore Awards which went toMr Chiew Hay King Joel (Top Overall Performance in Bachelor of Engineering (Honours) in Marine Engineering), Mr Lim Sim Ping (Top Overall Performance in Bachelor of Engineering (Honours) in Offshore Engineering) and Mr Fou Zi Xuan (Top Overall Performance in Bachelor of Engineering (Honours) in Naval Architecture); the Food & Human Nutrition School Prize for Best Student Performance went toMs Melanie Leong Lai Yeng; the Electrical Power Engineering School Prize for the Top Student Performance went to Ms Fu Shiyao; the School of Chemical Engineering and Advanced Materials for the Stage 3 Top Student went to Mr Guan Shunfeng Justin and the Frank Robinson Book Prize for Best Overall Performance went to Mr Chang Jun Yang Alexander (Mechanical Design & Manufacturing Engineering).\nMr Scott Wightman, the British High Commissioner to Singapore, was the Guest of Honour for the afternoon session.\nThe sessions were attended by Prof Tan Thiam Soon, President, SIT, and Prof Loh Han Tong, Deputy President (Academic) & Provost, along with SIT faculty and staff.\nThe student speakers for the morning session were Ms Sharmini Devi Tiru from the Chemical Engineering programme, and\nMr Go Zhong Hong from the Food & Human Nutrition programme. Mr Go said, “I feel relieved to be graduating and feel\nlike I have accomplished something great. I am deﬁ  nitely looking forward to the start of my next adventure!” More than 160 students graduated from UNLV’s Bachelor of Science (Major in\nHospitality Management) degree programme at a ceremony held at the SIT@Dover Campus on 15 October 2015.\nThe Guest of Honour at the ceremony was Mr Ng Yat Chung, Chairman, Board of\nTrustees, SIT. Prof Tan Thiam Soon, President, SIT, as well as SIT senior management and faculty were also present.\nThe valedictorian for the Class of 2015 was Mr Koh Qi Shen, Fabian. Telling the\naudience about the many sleepless nights he and his fellow course mates had lived through, he went on to remind his classmates to “make a difference in society, live by our principles and values, demand high standards of ourselves and most importantly, to stay connected with one another.”The University of Manchester (UoM) Graduation Ceremony\n25 September 2015 Over 70 graduands from DigiPen’s four degree programmes at SIT received their\ncertiﬁ  cates at the DigiPen Commencement Ceremony at The Star Performing Arts Centre.\nMr Claude Comair, President and Founder of DigiPen presided over the ceremony.\nMr Olivier de Rotalier, Managing Director of Ubisoft Singapore was the Commencement\nSpeaker, and Prof Tan Thiam Soon, President, SIT, was the Congratulatory Speaker for the ceremony. Also attending the event were SIT Senior Management, and faculty.\nValedictorian, Mr Julian Teh from the Bachelor of Science in Computer Science in Real-\nTime Interactive Simulation degree programme said, “I’m proud of what my course mates and I have accomplished in DigiPen, and honoured to be named Valedictorian. That being said, I am keenly aware and constantly reminded that the world is a far bigger place than DigiPen. There is much more for us to learn, to grasp, to overcome; our journeys are far from over.\nOn 16 September 2015, Dr Tim Ryan, President, CIA, conferred the Bachelor of Professional Studies in Culinary Arts Management degree on 36 budding chefs.Mr Andrew Tjioe, Executive Chairman of Tung Lok Group, who gave the Commencement Address and Prof Tan Thiam Soon, President, SIT were also present at the ceremony.\nThe Francis Roth Award for Leadership was awarded to Mr Ames Raphael Sim, the\nJulius Wile Academic Achievement Award went to Mr Joachim Crispian Pereira and the Culinary Award was presented to Mr Tan Cong Wen.\nSaid Mr Sim, “I am most grateful for being chosen as the recipient of the Francis Roth Award for Leadership. I look\nforward to enjoying what I love to do most, and to make the most of the experiences I have gained so far.” The Culinary Institute of America (CIA) Commencement\n16 September 2015\nSiTIZEN  |  07/12 SiTIZEN  |  06/12\nFirst-ever event brings together talented SITizens and generous donors, in an intimate celebration of\nstudent achievement and thoughtful philanthropy to support excellence awards at SITRecognising Excellence at SIT\nIn a ﬁ  rst at the Singapore Institute\nof Technology (SIT), 23 awards were presented at the Recognition of Excellence, a new platform created to recognise the excellence of its students and to honour the donors whose generosity had made possible these awards at SIT.\nTaking place on Friday, 16 October\n2015, at the SIT@Dover campus, the special occasion drew more than 120 guests. Mr Ng Yat Chung, Chairman, SIT, presented the awards and among the attendees were members of SIT’s Board of Trustees, SIT Senior Management, representatives from SIT’s Overseas University partners, the award recipients and their loved ones, as well as the University’s donors and friends. SIT students from various\ndegree programmes were on hand to play host to the guests.\nProf Loh Han Tong, Deputy President\n(Academic) & Provost, SIT, said in his welcome address, “We are very proud of all the award recipients ... and this pride I believe belongs equally to their families, and to the private and corporate donors whose collective generosity has made it possible for SIT to establish these 23 book prizes, outstanding student awards and gold medals. On behalf of SIT, I would like to express our grateful appreciation for their philanthropic dedication to promote student excellence.”\nBook Prizes are awarded to students\nwith the highest grade in a particular module. Outstanding Student Awards recognise students who not only do well academically, but have also made contributions to SIT or the community, while Gold Medals are awarded to the top scoring students in their respective degree programmes.\nMr Fou Zi Xuan, who received the most\nnumber of donor-supported awards (the Sembcorp Marine Book Prize in Naval Architecture II, the Sembcorp Marine Book Prize in Ship Design,the Choo Chiau Beng Outstanding Student Award in Naval Architecture and the ST Engineering Gold Medal) and Mr Wong Kai Xian, who received\nthe Rotary Club of Bugis Junction Outstanding Student Award, jointly delivered some words of appreciation to the donors.\nIn his closing remarks, Prof\nTan Thiam Soon, President, SIT, said,\n“I would like to highlight just how important a sense of community is to SIT, and how grateful we are to have the support of a community of friends – our Overseas University Partners, industry and, last though certainly not least, our community of generous donors. Without your involvement, it will be impossible for us to fully realise the SIT dream.”\nDuring the reception that followed,\nguests were entertained by Muzeka, SIT’s student band, and the award winners got a chance to personally thank the donors of their awards.\nMr Sng Guan Kian Ernest was an award\nrecipient who managed to meet with his donor, Mr Gary Lee, Director, Zicom Group. He said, “As a recipient of the Zicom Group Outstanding Student Award in Mechatronics I am ever grateful for SIT and Zicom Group for this opportunity given to me. Having met Mr Lee, the Director for Zicom Group, I have gained an insight on what the industry is looking for and the opportunities that are offered.”\nAward recipients Mr Fou Zi Xuan (left) and Mr Wong Kai Xian (right), share their joy and appreciation at the\nRecognition of Excellence.Prof Loh Han Tong, Deputy President\n(Academic) & Provost, SIT, delivering his welcome remarks. Prof Tan Thiam Soon, President, SIT, (right) gets\nthe request for a selﬁ  e with Mr Kasem Chaisieng\n(middle), who received three awards, and his family. Recognising excellence – the award winners with SIT Senior Management and members of SIT’s Board of Trustees after the event.Mr Sng Guan Kian Ernest (right), recipient of the Zicom Group Outstanding Student\nAward in Mechatronics, got to meet Mr Gary Lee, Director, Zicom Group (left).The student band, Muzeka, entertained the guests with popular hits.\nSome of the recipients of the Sembcorp Marine Prizes had a chance to interact\nwith Ms Koh Guat Siew, Vice President, Human Resource Operations, Sembcorp Marine.\nProf Tan Thiam Soon, President, SIT, and the student hosts after the event.Mr Ng Yat Chung, Chairman, Board of Trustees, SIT (left) presenting the Singapore\nChemical Industry Council Book Prize in Process Safety to Mr Guan Shunfeng Justin (right).\nMs Nurfarahin Bt Mohd Zakaria (left), who received the Rotary Club of Jurong Town\nBook Prize in Care Pathways for Long-Term Conditions, was glad to be able toﬁ nd out more about the Rotary Club of Jurong Town from Mr Rodger Kimpton,\nPast President, Rotary Club of Jurong Town (right).\nSiTIZEN  |  08/12 SiTIZEN  |  09/12\nThe Class of 2015 put on their dancing shoes and funny hats for this year’s exhilarating New Alumni\nWelcome Party, held for a second time at Hard Rock Café (Orchard Road) Lip-Syncing Good!\n“I deﬁ  nitely enjoyed myself at the party. It was awesome!” said Mr Chin Jun\nMing. Why? “Good food, good drinks and good company made the night!” he explained.\nMr Chin, who graduated from the University of Glasgow (UofG)’s Bachelor of\nEngineering (Honours) in Aerospace Systems degree programme, was one of the more than 200 attendees at the 2015 New Alumni Welcome Party,held on Friday, 6 November 2015 at the Hard Rock Café (Orchard Road). Among the other party guests were Prof Tan Thiam Soon, President,\nSIT, Prof Loh Han Tong, Deputy President (Academic) & Provost, SIT,Mr Chan Wing Leong, Deputy President (Administration) & CFO, SIT, the University’s Senior Management, Faculty and staff as well as representatives from its Overseas University Partners.\nLip-sync battles, dancing, and a whole load of fun – that was what took\nplace at this year’s do. The annual New Alumni Welcome Party is specially organised by SIT to welcome new graduates into the SIT alumni family.Prof Tan kicked off the night’s festivities, congratulating the new alumni on their academic achievements and reminding them to tap on their lifelong network of friendships with fellow alumni, faculty, staff and students at SIT. “As we like to say at SIT, ‘Once a SITizen, always a SITizen’,” he said in his welcome remarks.\nAs a matter of tradition, the SIT student band, Muzeka, gave their fellow\nSITizens a great show at the party, but this year was the ﬁ  rst time that the band’s student and alumni players are featured in the same performance. This year’s band line-up includes alumni Mr Emmanuel Chia (UofG),Mr Douglas Heng (University of Nevada, Las Vegas), Mr Timothy Lye (Trinity College Dublin), Ms Fion Na (University of Nevada, Las Vegas) and Ms Deborah Fernando (UofG), as well as student Mr Muhammad Helmi (University of Liverpool), who is President of Muzeka.\nVentriloquist Joseph Then’s comedic act was a hit with the partygoers –\nespecially when he was aided by alumnus Mr Tyrus Yoong, who gamely donned a mouth mask to become a human puppet – followed by Hard Rock Café’s very own Jive Talkin’ whose set brought guests to the dance ﬂ  oor.\nFor many, the highlight of the night was the Lip-sync Battle, which saw alumni and even a student host lip-syncing to top hits, with alumnus\nMr Benson Tan became the undisputed\nstar of the night after he was called on stage to claim his lost driver’s licence. The graduate from the Bachelor of Engineering (Honours) in Mechatronics (UofG) programme was egged on by his friends and the emcee to be one of the ﬁ  ve\ncontestants of the Lip-sync Battle.\nNot only did Mr Tan win the applause and cheers of his fellow new alumni during the two rounds of Lip-sync Battle, he did it with such style and swagger that he even got Prof Tan and a faculty member to be part of his posse of back-up dancers in a much lauded version of Lady Gaga’s Bad Romance.\nWhat looks to be serious conversation\nfor a party.\n“We’re not a pair!” Alumni went looking for their other\nhalves during a stage game.\nMore than 30 lucky draw prizes were given out\nthroughout the night. Here, Mr Jason Neo (right), receives a Hatter Street voucher from Prof Loh Han Tong, Deputy President (Academic) & Provost.\nJive Talkin’ brought the house to its feet.First stop: New graduates collecting their\npersonalised SIT Alumni Cards at the party.Faculty members offer a toast, the ﬁ  rst of many during\nthe night, to the Class of 2015.Presenting…the talented members of Muzeka.\nProf Tan Thiam Soon, President, SIT, kicks off the night with\na toast to fellow alumni.Alumnus Mr Tyrus Yoong dons a mouth mask to perform as a human-puppet.\nMr Chan Wing Leong, Deputy President (Administration)\n& CFO (right), and two alumni get a “Happy Birthday” cheer from those present.\nA quiet moment to catch up over a sumptuous spread\nbefore the partying began.\nWhat a night! The much coveted Apple Watch, the ﬁ  rst prize in the\nGrand Draw, went to alumnus Mr Daemian Koh (right), seen here receiving his prize from Prof Tan Thiam Soon, President, SIT (left).Mr Benson Tan (extreme left) lip-synced Lady Gaga’s Bad\nRomance, which included a surprise appearance from Prof Tan Thiam Soon, President, SIT, (middle) much to the delight of his fellow partygoers.“That’s us!”\n”You don’t mess with us!” The lip-sync kings of SIT,\nMr Gan Hian Jiun, and Mr Benson Tan, who was crowned the runner-up, and the champion of the Lip-sync Battle respectively.\nSiTIZEN  |  10/12\nScholars\nGalore\nTalented SITizens recognised at the\nsecond SIT Scholarship Awards and Appreciation Ceremony\nWhat’s Your Type?At the Basic Personality Workshop, alumni participants learn about themselves and more using the MBTI® toolA total of 42 SIT Scholars were recognised at the second\nSIT Scholarship Awards and Appreciation Ceremony which took place on Wednesday, 28 October 2015 at the SIT@Dover Auditorium. The Ceremony was held to welcome new SIT Scholars and to celebrate the achievements of graduating Scholars.\nThis year, 28 new scholarships were awarded, a signiﬁ  cant\nincrease from the 20 that were awarded last year. Of these 28 were three mid-term scholarships, a newly-launched category. Since SIT’s ﬁ  rst intake of students in Academic\nYear 2010/11, 122 bond-free SIT Scholarships have been awarded to students who are selected as SIT Scholars through a rigorous process.\nClose to 200 guests attended the event, which included Mr\nNg Yat Chung, Chairman, Board of Trustees, SIT, Members of the Board of Trustees, SIT, Prof Tan Thiam Soon, President, SIT, Prof Loh Han Tong, Deputy President (Academic) & Provost, SIT, as well as representatives from the Overseas\nFor Ms Daphne Lee, who graduated from the Bachelor of\nScience in Early Childhood Education (Wheelock College) degree programme, attending the Basic Personality Workshop organised by the SIT Alumni Career Network was an eye-opener.\nShe said, “I used to always do the free online tests on\nthe Internet to ﬁ  nd out my personality and it yielded the\nsame results. However, after attending the workshop, I discovered that the answers I gave were inﬂ  uenced by the\nenvironment and circumstances I was in at the time and not a true indication of my personality.”\nDuring the 3.5-hour activity-based foundational workshop\nheld on Saturday, 5 September 2015 at Hotel Jen (Orchardgateway), Mr Charles Sng, a certiﬁ  ed practitioner of\nthe Myers-Briggs Type Indicator® (MBTI) with two decades of experience, guided the alumni participants through various activities which would reveal different aspects of their individual personalities, and also shared insights on how different personality types work.\nAt the beginning, Mr Sng reminded the participants to keep\nan open mind during the activities and to answer as they would really prefer, without sticking to the perception of who they want to be or who they are expected to be.\nAfter attending the workshop, Ms Lee is now reading up\nmore on the different personality types and following up with Mr Sng to correctly determine her personality type.University partners and polytechnics.\nIn his opening address, Prof Loh called on the new scholars\nto make full use of the opportunities that will open up to them through the SIT Scholarship. He said, “Network with those around you and as you grow in maturity, remember to Learn, Unlearn and Relearn… We also expect you to be the one who will rally your peers to take part fully in SIT life to help shape the culture of SIT.”\nMr P Mukkesh Kumar, who has achieved a First Class\nHonours and is currently working with A*STAR, is one of the 14 graduating SIT Scholars. Said the 2014 SIT Scholarship recipient from the Bachelor of Engineering (Honours) in Chemical Engineering (Newcastle University) degree programme, “Holding the SIT Scholarship has paved the way for me to learn and excel at the University,” he said. “It has pushed me to strive for excellence and helped me to develop into an all-rounded resourceful leader.”\n“I’m trying to let my real personality shine through again,\nso that I can grow and improve both personally and professionally,” she said. “I’m deﬁ  nitely looking forward to\nmore personality workshops in the future.”\nMr Ng Yat Chung, Chairman, Board of Trustees, SIT\n(left) presented the Scholarship Award letters to the new SIT scholars such as Ms Lisa Tang (right).Graduating SIT Scholar Mr P . Mukkesh Kumar at\nthe ceremony.\nAlumni participants pick a side that best describe them for one of the activities.\nBy popular demand, the Basic Personality Workshop\nwill run for a second time on 5 December 2015. The Basic Personality Workshop is the first in a series of self-development personality workshops, which will focus on the operations of one’s personality traits in life aspects such as communication, relationship management, stress management and decision-making. Attendance at this Workshop is a pre-requisite for Alumni or graduating students who would like to attend subsequent workshops. To sign up or to find out more, email us at Alumni@SingaporeTech.edu.sg\nor call 6592 2013.\nDancepointe Academy\n• One-time free dance trial\n(appointment required)\n• 10% off at Jurong East, Jurong West,\nChoa Chu Kang, Yio Chu Kang,Taman Jurong CC, SerangoonGardens branches\n• 50% off at Bukit Timah and Sembawang\nbranches for pairs\n• Free Dance Factory Uniform Tee when\nyou sign up for your ﬁ  rst full term\nDojo\n• $10 nett for Dojo’s best-selling burgers• Participating Outlet: Circular Rd• Valid until 31 Dec 2015\nIntune Music\n• 10% off on ﬁ  rst 3 months’ course fees\n• Waiver of admin fees of $20• Valid until 31 Dec 2015\nLAZADA.SG\n• One-time $10 off with minimum\nspending of $30\n• Use promo code: SIT010 at checkout\nto obtain the discount\n• Valid until 31 Dec 2015\nMorganﬁ  eld’s\n• 10% off total bill• Participating outlets: The Star Vista,\nSuntec City\n• Valid until 31 Dec 2015SIT Alumni\nCard Beneﬁ  tsNanyang Optical\n• 40% off regular priced frames;\n30% off conventional contact lenses\n• Valid until 31 Dec 2015\nPies & Coffee\n• 10% off total bill; 15% off whole cakes;\n50% off on slice cakes/tarts with2 gourmet pies/brunch purchased\n• Valid until 31 Mar 2016\nQQ Rice\n• 10% off Oat Rice, Rice Roll,\nSnack Roll at all outlets\n• Optional top-up: $0.90 for standard drink• Valid until 31 Dec 2015\nSeasonal Salad Bar\n• 10% off all regular priced items• Participating Outlet: One@KentRidge• Valid until 1 Apr 2017\nSharetea\n• 10% off all regular priced items• Valid until 31 May 2016\nShopBack\n• $10 Beneﬁ  t\n• Up to 18.0% Cashback when shopping\nwith selected partners\n• Visit https://www.shopback.sg/for\nmore details\nSkinny Pizza\n• 10% off total bill at all outlets• Valid until 31 Dec 2015\nSolemates\n• 10% off on regular priced items;\n20% off for 2 or more regular priced items; additional 5% off on sale items\n• Participating Outlet: One@KentRidge• Valid until 31 Dec 2015St. Games Café\n• Free membership with 30 minutes\nfree extension upon purchase ofala carte hours (min. 1 hour)\n• Available from Mondays to Thursdays,\nexcluding Public Holidays\n• Valid until 30 Dec 2015\nSunlife Durian Puffs & Pastries\n• 10% off total bill• Participating outlets: Causeway Point\nShopping Mall, 333 Coffee Shop(Blk 136 Bedok North Avenue 3)\n• Valid until 31 July 2016\nTart & Co.\n• 10% off all items with min.\nspending of $10\n• Participating outlet: The Star vista• Valid until 31 Dec 2015\nThe Braces Practice\n• Discounted rates for various\nbraces options\n• Valid until 10 May 2016\nThe Ordinary Co.\n• 10% off all items with min.\nspending of $10\n• Key in code “SITStudents” at checkout.• Valid until 31 Dec 2015\nTom’s Palette\n• 10% off selected ice-cream products\nXorex Press Pte Ltd\n• $8 for A2 poster with mounting; $16 for\nA1 poster with mounting at all outlets\n• Valid until 31 Dec 2015\n*Please present your SIT Alumni Card prior to\nmaking payment. Terms and conditions apply. Please refer to:http://sl.singaporetech.edu.sg/Welfare/SITreats.aspx for detailed terms and conditions.SiTIZEN  |  11/12"
}