{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue26v2.pdf",
  "type": "pdf",
  "content": "ISSUE NO. 26  |  FEBRUARY 2020\nWHAT’S\nHAPPENING\naround our little\nbig campusDear SIT Alumni,\nSITizen is a publication by the\nSIT Advancement & Alumni Division.\nFor enquiries, please e-mail us at\nAlumni@SingaporeTech.edu.sg\n© Singapore Institute of Technology 2020Once a SiTizen, Always a SiTizen\nSIT Offers Singapore’s First\nUndergraduate Degree\nProgrammes in Speech and\nLanguage Therapy, Digital\nCommunications and\nIntegrated Media\nContributions from SIT Making\nan Impression at Community\nand National Level\nWinning First Prize at the United\nNations Cybersecurity Challenge\nSITizen Ambassadors in Action\nat PDD Groundbreaking\nCeremony\nSIT Holds Second Applied\nLearning Conference, Signs\nLearning Partnership MOU\nwith SMRT and SSG\nConnecting with\nPotential Employers\nat Career Nexus 2020\nUshering in the Lunar New\nYear with SIT’s Philanthropic\nPartners at Leadership\nAppreciation\nMovie Time, Tea and\nWine Appreciation, Dress and\nLinkedIn for Career Success –\nall this and more for\nSIT Alumni!SITizens have a lot to look forward to as SIT starts off its second decade.\nThe university is offering two new undergraduate programmes for Academic Year 2020/21.\nThe first is the Bachelor of Science with Honours in Speech and Language Therapy, which\nis the first of its kind to be offered in Singapore. It will cater to the increasing demand\nfor speech therapists to care for children needing early intervention and older adults\nneeding speech therapy following acute care episodes such as stroke. The other new\nprogramme is the Bachelor of Science with Honours in Digital Communications and\nIntegrated Media programme. It aims to train students in three key spheres: Digital Web\nAnalytics, Integrated Media Management and Digital Media Production. Additionally,\nfour existing degrees offered solely by SIT’s Overseas University partners will be conferred\nas joint degree programmes for the AY 2020 intake.\nIn January, SIT honoured donors who nurture financially disadvantaged students through\nbursaries and grants at the inaugural Leadership Appreciation. Held at SIT@Dover, the event\nwas also a reunion for recipients to come together with donors to usher in the Lunar New\nYear. Prof Tan Thiam Soon, President, SIT, highlighted the magnitude of the generous giving\nfrom donors - since SIT’s establishment, more than 2,500 bursaries, grants and other forms of\nstudent financial aid have been disbursed at SIT in support of students who are less privileged.\nAlumni are staying in touch by having fun at a multitude of events – from basketball to\nshucking oysters to harvesting pearls to learning about tea and wine and even catching\nParasite at The Projector, before it was an Oscar winner. There are also plenty of learning\nopportunities for alumni like learning to network through LinkedIn, and how best to make\nan impression at a series of personal grooming workshops.\nIn the meantime, SITizens are making an impression locally and globally. SIT students\nhave designed environmentally friendly and recyclable cardboard voting booths which\nare adjustable and portable. These booths will debut in the next Singapore General\nElection. At the United Nations Cybersecurity Challenge, the SIT team wowed judges\nwith their “Forensics in a USB Stick” solution; another SIT team won first runner-up at the\nKaspersky Secur’IT Cup 2019 Grand Finals with the “Automated Android Mobile”. A team\nof Hospitality Business students who won the first prize at the Singapore MICE Challenge\nlast year also had the opportunity to present their winning proposal for a medical tourism\nevent at the Professional Convention Management Association (PCMA) 2020 Convening\nLeaders in San Francisco in January.\nRead about all these and more in this issue of SITizen. In light of the recent COVID-19\noutbreak, may we take this opportunity to remind everyone to keep safe and healthy, and\ndo our part to be socially responsible as well.\nShould you wish to contribute a story, do drop us a line at Alumni@SingaporeTech.edu.sgA Running Start to 2020\n38 undergraduate degree programmes\nshowcased at SIT Open House 2020 which\nreached out to more than 4,500 potential\nstudentsSIT Offers Singapore’s First Undergraduate Degree\nProgrammes in Speech and Language Therapy,\nDigital Communications and Integrated Media\nAn attentive audience at the “Admitting the Right Student: What Does SIT Look For?” talk. SIT Open House 2020 drew a record-breaking increase of more than 49% in overall talk attendance over two days in January this year.\nThe Singapore Institute of Technology (SIT) has two new offerings for the upcoming Academic Year (AY) 2020/21: the\nBachelor of Science with Honours in Speech and Language Therapy (SLT) programme, and the Bachelor of Science with\nHonours in Digital Communications and Integrated Media (DCIM) programme.\nNAME OF DEGREE PROGRAMME PROGRAMME DETAIL DURATION\nBachelor of Science with Honours\nin Speech and Language Therapy\n(SIT)Developed in close consultation with Speech Therapists (STs) from\nNational University Health System, Singapore Health Services and National\nHealthcare Group, Ministry of Social and Family Development-funded\nTherapy Hubs and Social Service Agencies (SSAs), as well as practitioners\nfrom private practice.\nCaters to increasing demand for STs to care for children needing early\nintervention and older adults needing speech therapy following acute\ncare episodes such as stroke.4 years\nBachelor of Science with Honours\nin Digital Communications and\nIntegrated Media\n(SIT)Aims to train students in three key spheres: Digital Web Analytics,\nIntegrated Media Management and Digital Media Production.\nGraduates will be able to work in a wide variety of fields, including\nadvertising, media, corporate communications and public relations.3 years\nBachelor of Science in Computer\nScience in Real-Time Interactive\nSimulation\n(SIT-DigiPen)Caters to the ever-growing need for engineers and computing\nprofessionals with deep software development skills. Students will acquire\nskills required for the software industry, including data analytics, machine\nlearning and augmented reality. Graduates will be well-equipped to take\non highly technical roles in the digital economy.4 years\nBachelor of Science in Computer\nScience in Interactive Media and\nGame Development\n(SIT-DigiPen)An enhancement of DigiPen (Singapore)’s current Computer Science and\nGame Design degree. Graduates will be well-equipped to enter both\nthe games and broader software industry to take on roles requiring both\nengineering and design expertise.4 years\nBachelor of Engineering with\nHonours in Electronics and\nData Engineering\n(SIT-TUM)Combines electronics and data engineering to groom work-ready\ngraduates for the electronics industry, by equipping them with the\nnecessary competencies expected of the new digital workforce.4 years\nBachelor of Engineering with\nHonours in Chemical Engineering\n(SIT-TUM)Equips students with Industry 4.0 skillsets to address the manpower\ndemands of the chemical industry. Graduates will be hands-on chemical\nengineers with knowledge in data engineering and additive manufacturing.4 years\nMaster of Engineering Technology\nin Civil Engineering\n(SIT)Curriculum developed in consultation with agencies and companies\nin the construction sector. Selected modules will be co-delivered by\npractising industry experts to train students in two specialisation tracks –\nStructural Engineering and Geotechnical Engineering.1 year\n(Full-Time)\n2 years\n(Part-Time)Additionally, under new agreements between SIT and\ntwo Overseas University (OU) partners – DigiPen Institute\nof Technology Singapore (DigiPen) and Technical\nUniversity of Munich (TUM) – four existing OU degrees\nwill be conferred as four joint-degree programmes\nfor the AY 2020 intake. These programmes will focus\non technologies that will address the challenges as\nwell as reshape business models and strategies in the\nengineering and Information and Communications\nTechnology (ICT) sectors. They are:\n• Bachelor of Science in Computer Science in Real-Time\nInteractive Simulation (SIT-DigiPen)\n• Bachelor of Science in Computer Science in Interactive\nMedia and Game Development (SIT-DigiPen)\n• Bachelor of Engineering with Honours in Electronics\nand Data Engineering (SIT-TUM)\n• Bachelor of Engineering with Honours in Chemical\nEngineering (SIT-TUM)\nAdding to its suite of postgraduate programmes,\nSIT will offer the Master of Engineering Technology\n(MEngTech) in Civil Engineering to equip graduates and\nprofessionals with deeper training in civil engineering\ntechnologies and practices.\nProf Chua Kee Chaing, Deputy President (Academic) &\nProvost, SIT, said: “The new degree programmes will offer\nspecialised pathways for students in the related fields.\nThe SLT programme, the first of its kind in Singapore,\nserves to meet national needs to train a new generation\nof market-ready speech therapists. Similarly, the DCIM\nprogramme will train communications professionals for\nthe rapidly changing digital media landscape.”\nHe added: “We are also pleased to bring our\ncollaborations with DigiPen (Singapore) and the Technical\nUniversity of Munich even closer with the roll-out of four\nnew joint degree programmes. Building on the success\nof the current programmes, students will additionally\nbenefit from SIT’s applied learning pedagogy, including\nan eight-month Integrated Work Study Programme\n(IWSP), a characteristic feature of all SIT programmes.”This young visitor attempts to find out\nmore about the human body on an\ninteractive touch-screen display.Held on 11 and 12 January 2020 at the Suntec\nConvention & Exhibition Centre, the SIT Open House\n2020 provided an opportunity for potential students\nto find out more about the 38 undergraduate degree\nprogrammes offered by the Singapore Institute of\nTechnology (SIT) for Academic Year 2020/21. The annual\nevent also featured co-curricular activities to showcase\na holistic university experience.\nThrough informative talks with arresting titles\nsuch as “The Secret Life of a Physiotherapist”,\nand “Air Transport Management: Fly Higher than\nYour Dreams Can”, as well as visiting booths with\ninteresting applied learning tools and equipment\nover the two-day Open House, visitors learnt\nfirst-hand from faculty and SITizens about the various\napplied learning programmes. SIT’s alumni also took\npart in the panel discussion to speak about their\npersonal SIT experience.\nRepresentatives from various student clubs and\nsocieties such as DanceFit, Muzeka, Vocalist Insight,\nas well as the Silat, Taekwondo and Wushu clubs were\npresent to give interested applicants a glimpse of the\nvibrant student life awaiting them with performances\nand showcases.\nFirst-year Air Transport Management student,\nMr Joshua Loke, served as a course ambassador at the\nOpen House, answering questions that prospective SIT Open House 2020:\nOpening Up Opportunities\nProspective students lean in to learn about the course of their interest.students and their\nparents had. “It was\neye-opening to meet\nso many interested\napplicants and see the\npassion that many of\nthem expressed. Even\nthough it was very\ntiring to talk and stand\nfor almost a full day, it\nwas effort well spent,”\nhe said.SiTIZEN  |  03/16 SiTIZEN  |  02/16\nFrom the community level to the national level, SIT’s contributions are beginning to make\nan impression Rooted in the Community!\nVoting in Recyclable Booths\nMaking their debut at the next Singapore General Election will be voting\nbooths designed by Singapore Institute of Technology (SIT) students.\nMade of environmentally-friendly and recyclable cardboard, these\nbooths will be used by voters in one Group Representation Constituency\nand two single-member wards, thanks to a collaboration between the\nElections Department Singapore (ELD) and SIT.\nMr Eddie Sim, Mr Chua Wei Yang, Mr Joseph Lim Yicong and Mr Ang Zi\nHao, recent graduates from The Glasgow School of Art’s Communication\nDesign programme, spent a year in the research, ideation and development\nof these booths. They engaged the ELD to better understand the voting\nprocess, and factored in key considerations such as voting habits, ease of\ntransportation, storage and eco-friendliness in their design.\nDr Ng Khee Yang (second from left), Asst Director, Innovation\nResource & Policy, SIT, and Assoc Prof Nicholas Teo (extreme\nright), Deputy Programme Director, SIT, mentored (from left)\nalumni Mr Eddie Sim, Mr Chua Wei Yang (role-playing in\nwheelchair), Mr Joseph Lim, and Mr Ang Zi Hao in designing\nand the development of their recyclable voting booths.\nIn recognition of SIT’s efforts in adding value to the quality of community\nlife in Punggol, the university received the “Community Partnership\nMerit Award 2019” at the annual People’s Association (PA) Community\nSpirit Awards 2019 presentation ceremony on 20 November 2019.\n“We are honoured and encouraged by the Community Partnership Merit\nAward,” said Assoc Prof Ivan Lee, Vice President (Industry & Community),\nSIT. He added, “I hope this award would further inspire SIT and PA to\ndeepen our collaboration and continue to support the community in\ninnovative ways. As the university prepares the groundwork for our\nfuture home in Punggol, we sincerely hope our contributions will forge\na strong bond with the residents of Punggol as well.”\nSIT was one of the 84 PA-partner organisations recognised for their\ncommunity collaborations with PA.SIT receives PA’s Community Partnership Merit Award\nMr Chan Chun Sing, Minister for Trade and Industry & Deputy\nChairman of the People’s Association (left) presents the PA\nCommunity Partnership Merit Award 2019 to Assoc Prof Ivan\nLee, Vice President (Industry & Community), SIT.Their design features an adjustable table height to make these booths small and portable. They can be positioned on the\nlap of a person who is wheelchair-bound. Lighter than the current metallic versions, the cost of producing each booth is\n$30, as compared to existing booths costing $750 each.\nBeing Part of HDB “Lively Places Challenge 2020”\nResidents from Sengkang and Punggol were guided on the use\nof tools, methods and best practices on community-building and\nplacemaking, at the workshop conducted by Asst Prof Nicholas\nTeo (front row, third from left), Deputy Programme Director, SIT,\nwho was assisted by Mr Long Junming (front row, second from\nleft), Senior Manager, Innovation Resource & Policy, SIT.Even before SIT moves into its future campus in Punggol, the university\nis already actively engaging the local community. On 2 November 2019,\nSIT held a one-day design-thinking workshop at Sengkang Primary\nSchool for 40 residents from Punggol and Sengkang, as part of Housing\nDevelopment Board “Lively Places Challenge 2020.”\nThe collaborative effort with HDB aimed to help residents create friendly\nand lively neighbourhoods – based on their own ideas to increase community\nbonding as well as enhance the identity of their neighbourhoods.\nSaid Ms Peggy Tang, a resident at Treelodge@Punggol, “The workshop\nis helpful for residents who desire to create changes to a space or wish to\nimplement an event that benefits the community.”\nSubmissions from Sengkang and Punggol will be pitted against other teams across Singapore, the top three winning\nteams will receive cash prizes of up to $2,500. All approved ideas will be rolled out at their respective communities between\nDecember 2019 and March 2020, where they will be showcased at the HDB Community Week in May 2020.SiTIZEN  |  04/16\nThe Singapore Institute of Technology (SIT) team wowed\njudges and won the first prize at the United Nations\nCybersecurity Challenge with their “Forensics in a USB\nstick” solution that can be used to collect forensic data\nfrom computing equipment used by terrorists.\nTheir solution included a script to harvest data from a\ntarget machine that can be executed via Bash Bunny (a\npre-existing multi-function USB attack and automation\nplatform). The harvested data is then fed to an analysis\nsoftware designed by the team to obtain information\nof interest.\nThe team comprised Mr Tan Guan Hong, Mr Roysten\nNg Kiang Ann, Mr Muhammad Farid Bin Shafie, all of\nwhom are from the Information and Communications\nTechnology (Information Security) as well as SIT faculty,\nAsst Prof Goh Weihan. The solution was refined from a\nproject that was developed during the Digital Forensics\nmodule, together with a larger team at SIT.\nThe international hackathon was held collectively by the\nUnited Nations Office of Counter-Terrorism (UNOCT),\nthe UN Office of Information and Communications\nTechnology (OICT), the UN Technology Innovation Labs\n(UNTIL) and the Austrian Institute of Technology (AIT) to\nencourage talents to step up in the fight against digital\nterrorism. The solution presented by the SIT team will\nbe made open source, and is under review by UNTIL\nand the OICT Digital Blue Helmets Team to be possibly\nimplemented by UNTIL labs. The final round of the Secur’IT Cup 2019 saw SIT’s\nthird-year Information and Communications Technology\n(Information Security) student Mr Yu Pengfei achieve the\nfirst runner-up place on behalf of his team, which includes\nMr Lim Hong Xuan and Mr Muhammad Aizuddin Akmal\nBin Kamim, both of whom are from the same programme.\nMr Yu presented his team’s “Automated Android Mobile\nApplication Obfuscator” project – which empowers\nusers to create customised obfuscation, the deliberate\nact in software development where the original source\nis manipulated, making it extremely difficult for humans to\nunderstand, in an effort to enhance cyber security. With the\naid of artificial intelligence, the platform aims to obfuscate\napplications through an automated process, with the\noption of letting the user customise where necessary.\nThe annual global competition by Kaspersky unites\nbudding cybersecurity experts from all over the world,\nwith the aim of helping to create a safer cyber future.\nThe final round of Secur’IT Cup 2019 saw 27 finalists from\n12 countries, who presented projects to a jury consisting\nof Kaspersky and industry experts. The competition took\nplace at Kaspersky Academy Partner’s Summit held in\nLisbon, Portugal.\nThe project garnered praise from the judges and the\nteam bagged an all-expenses paid trip to the Kaspersky\nSecurity Analysts’ Summit 2020 in Barcelona from 6 to 9\nApril 2020.\nOn 8 January 2020, M1 Limited (M1) and the Singapore\nInstitute of Technology (SIT) signed a research collaboration\nagreement to jointly research and develop advanced\nartificial intelligence (AI) deep learning algorithms and\nmethodology to improve the planning, operations and\nmaintenance of large and complex mobile networks.\nWith this collaboration, M1 will set up a deep learning\nenvironment at SIT using real-world data from its operational\nmobile network to provide domain knowledge for data\npre-processing, analysis, visualisation and interpretation.  Tie-up with telco will allow SIT\nto play an integral role in the\ntelecommunications ecosystem to\nco-create technological solutionsM1 and SIT Unveil Joint\nResearch Agreement to\nSpearhead AI Deep Learning Champions at the United Nations\nCybersecurity ChallengeFirst Runner-Up at the Kaspersky\nSecur’IT Cup 2019 Grand Finals\nSIT will research, model and jointly develop algorithms\nwith M1 for AI machine learning to detect mobile traffic\nanomalies and predict the volume of mobile traffic.\nThe aim of this project is to develop a performance\nanomaly detection methodology and to model and\npredict active users in mobile networks, enabling M1 to\ndeliver optimal user experience and improve network\nresiliency. SIT students will also have opportunities\nto be involved as part of their Integrated Work Study\nProgramme and projects.SiTIZEN  |  05/16\nA team of SIT Hospitality Business students not only had\nthe opportunity to attend, but also to present their proposal\nfor a medical tourism event at the Professional Convention\nManagement Association (PCMA) 2020 Convening Leaders held\nfrom 6 to 8 January 2020 in San Francisco. Their proposal had\nalready won the first prize at the Singapore MICE Challenge 2019\nheld on 26 July 2019 at Resorts World Sentosa Convention Centre.\nTitled “Singapore Medical and Wellness Tourism 2020”, Team\nVoyage proposed a specially curated online marketplace for\nSoutheast Asian medical and wellness providers to list their\nservices with transparent pricing to consumers, culminating\nin a physical exhibition where buyers can meet the providers\nin person to obtain more information and try out their Virtual\nReality (VR) facility tours or wellness massages at the show.\nMr Dalton Wong, Ms Bronte Santa Maria, Mr Tan Uzen and Ms\nEmmaline Woo improved on their proposal further by adding\nmore information on Singapore as a MICE destination before\ntheir presentation. While they were in San Francisco, they had a\ngood learning experience, practising nightly on their presentation\nand participating in networking events and dinner events.\nTheir lecturer, Asst Prof Eunice Yoo, Design & Specialised\nBusinesses Cluster, SIT, also put them in contact with other\nindustry partners who took good care of them over the few\ndays that the team was there. “The most memorable thing\nabout our experience would definitely be how the Singapore On 17 January 2020, SIT was part of the Punggol Digital District\n(PDD) groundbreaking ceremony that showcased the launch of\nthe PDD Exhibition by Senior Minister Teo Chee Hean. This also\nmarked the first time that the university’s SITizen Ambassadors were\ndeployed to interact with vistors at a community event in Punggol.\nThe SITizen Ambassador programme was launched in 2019 to\ndevelop students who embody the SIT spirit and DNA to represent\nSIT at various events and engage with key stakeholders.\n“It was a great experience being able to interact with the public SITizen Ambassadors in Action at\nPDD Groundbreaking Ceremony\n(From left) SITizen Ambassadors, Mr Zhou Xihao and Mr Frank Fan with Senior Minister Teo Chee\nHean, Senior Parliamentary Secretary Sun Xueling and Senior Minister of State Dr Janil Puthucheary.\nTeam Voyage was the only Asia Pacific student team to present at the PCMA 2020\nConvening Leaders, an annual business event for event professionals to come\ntogether and network with other similar event professionals in the region.\nindustry partners actually took the time to get to\nknow us, speak to us and share their knowledge with\nus over the course of the three days,” said Mr Wong.\nHe added: “Because we were on our own in a foreign\ncountry, we definitely felt quite lost in the initial phases,\nbut all the industry partners were quick to ensure we\nwere safe and included.”\nand educate them more about SIT. Generally, the\nmajority of the public don‘t really know about SIT\nand they‘re curious when the new campus will be\nup. It was our job to inform them more about the\nuniversity and the positive impact the new campus\nwill bring to the Punggol community,” said Zhou\nXihao, SITizen Ambassador and Year 2 Computing\nScience (SIT-University of Glasgow) student.\nSIT showcased three projects from the Infocomm\nTechnology Cluster underlining the “Future of\nLearning” theme in the PDD Exhibition. Virtual\nreality simulations such as “Cow Butchery”,\n“Air Traffic Controller”, “Radiation Therapy”\nand “Virtual Bioreactor” as well as the service\nrobot, Cruzr, were the highlights to give the\npublic a chance to experience what the future\nof learning could be.\nThe multi-agency exhibition featured other\ninnovative projects that provided a glimpse into\nwhat PDD could offer for residents of Punggol –\nincluding creating more jobs, as well as learning\nand connectivity opportunities. The exhibition\nalso earmarked the next phase of development\nfor the township. Envisioned to be Singapore’s first\nsmart town, PDD showcases how technology can\nhelp residents and students in their daily lives and\ncreate economic opportunities for businesses.\nHospitality Students Take Their Winning Idea of\na Medical Tourism Event To International StageCeremony included launch of PDD\nExhibition which saw 15,000 visitors\nover three days at Waterway PointSiTIZEN  |  06/16\nHeld on 15 January 2020 at Sands Expo & Convention\nCentre, the Career Nexus 2020 is a one-day event organised\nby the Singapore Institute of Technology (SIT) for its\nstudents seeking Integrated Work Study Programme (IWSP)\nattachments as well as full-time jobs. A key platform for\nSITizens to connect with the industry, the event attracted\na turnout of close to 1,600 students and more than 180\norganisations from the industry across various sectors.\nProf Chua Kee Chaing, Deputy President (Academic) and\nProvost, SIT said, “We are heartened by the continued\nsupport and year-on-year increase in companies who\nhave come to partner SIT – a testament to our students’\nachievements in their career journeys.”Organised by the Singapore Institute\nof Technology (SIT), the Applied\nLearning Conference (ALC) 2020 took\nplace at Sands Expo and Convention\nCentre on 30 and 31 January 2020.\nGraced by Guest-of-Honour Mr Ong\nYe Kung, Minister for Education,\nthe second conference facilitated\ncompelling discussions among\nSIT’s community of academics and\nindustry partners.\nRevolving around the theme of\n“Developing Future-Ready Talents\nIn An Era Of Disruptive Change”,\nsome of the pertinent discussions\nat this year’s conference included\ntwo emerging education trends, a\nconsideration on engaging students\nas partners in teaching and learning,\na showcase on the importance of\ntransformation of human resource\nmanagement, and an interactive\nKey platform sees more than 1,600 students seeking full-time job and IWSP opportunitiesMore than 400 international and local thought leaders attend event\nConnecting with Potential Employers at Career Nexus 2020SIT Holds Second Applied Learning Conference\nCareer Nexus 2020 is the largest career event for SIT, attracting a turn out of close to 1,600 students and more than 180 organisations.\nSecond-year Telematics student Mr Soon Zeng Fu had a\nfruitful time at the event. “It gave me insights on which\ncompanies were hiring and I also found out more about\nthe job scope and roles in the company. I also got to speak\nto quite a few companies and learn about the projects that\nthey are working on, which can help me better prepare for\nthe job interview in future,” he said.\nMs Rachael Low who had recently graduated from the\nPharmaceutical Engineering programme commented,\n“Overall, the experience was great and I do hope that SIT\nwould bring in more companies that are looking out for\nfresh graduates in the future Career Nexus events.”\nFirst-of-its-kind Partnership signed with SMRT and SSG\nSIT also signed a memorandum of understanding with SMRT Corporation\nLtd and SkillsFuture Singapore (SSG) at the Conference. This first\nworkplace learning partnership for the land transport sector will support\nskills development and workplace learning for SMRT's large base of\npartners. It aims to help SMEs improve rail reliability and drive innovation\nand productivity improvements across the land transport sector.\n“Workplace learning is an integral component of the work-learn\ncontinuum. Through SIT’s suite of integrated industry solutions, we\nare well equipped to support this new skills partnership in building a\nstrong skills ecosystem and workplace learning culture in enterprises.\nWe are pleased to have SMRT onboard as a lead firm to drive\nworkplace learning practices to help upskill, deep-skill and reskill its\nstaff and value chain partners in domain-specific and emerging skills,”\nsaid Assoc Prof Ivan Lee, Vice President (Industry & Community), SIT.roundtable discussion featuring SIT faculty, students, alumni and industry\npartners, SBS Transit and Ernst & Young, on the essence and benefits of\nSIT’s signature Integrated Work Study Programme.SiTIZEN  |  07/16\nA New Year, and a New Way to Celebrate\na Generous Giving Community\nThe Leadership Appreciation, held for the first time at the\nSingapore Institute of Technology (SIT), is a platform for\nthe university to honour its donors for their philanthropic\nleadership in nurturing SIT students through various\nforms of financial aid. Close to 200 people attended the\nafternoon’s festivities, held at the Sports Hall at SIT@Dover\non 17 January 2020.\nIn his welcoming remarks, Prof Tan Thiam Soon, President,\nSIT, highlighted the magnitude of the impact of their\ngenerous giving. Over the past decade since SIT was\nestablished, more than 2,572 bursaries, grants and other\nforms of student financial aid, have been awarded to less\nprivileged students at SIT. Highlighting the larger impact\nof this philanthropic giving, Prof Tan pointed out that for\nmany of these students who are the first in their families to\nattend university, their family income would also increase\ntremendously when they graduate and start a career.\nProf Tan added, “Thank you for empowering these young\npeople to pursue their dreams, and most of all, for leading\nthe way and showing them how even a single act of giving\ncan transform the future for many others.”\nThe committed support shown by donors have inspired\nstudents like Mr Yam Wei Jian, a Year 2 student from the\nSustainable Infrastructure Engineering (Building Services)\nprogramme, to give back to the community. Mr Yam started\nthe Building Information Modelling Club at SIT, which\nprovides members a platform to learn from each other and\nfrom engineering professionals, beyond their curriculum.\nMr Leslie Goh, a first-year student from the Accountancy\nprogramme who received the ICH Gemini Bursary, said,\n“The experience of receiving a bursary – apart from the\nfinancial support, there is the feeling that you are being\nnurtured, and there is a community out there that wants you\nto succeed.”At the inaugural Leadership Appreciation\nceremony, SITizens usher in the Year of the\nRat together with SIT’s donors who support\nstudents through bursaries and grants\nMs Dilys Ho, a Year 3 Physiotherapy student, setting\nthe tone for the celebratory event with a rhythmic\ngymnastics routine.Bursary recipients (from left): Mr Yam Wei Jian, Ms Eunice Toh and Mr Leslie Goh,\nexpressed just how grateful they are to receive support from SIT’s donors.Prof Tan Thiam Soon, President, SIT (on stage), addressing the close to 200\nattendees at the event – organised specially to honour donors who have\nsupported financially disadvantaged SITizens.\nProf Tan Thiam Soon, President, SIT (right) presenting a token of appreciation\nto Mrs Wong Kwok Leong (left). The token, which was personalised with notes from\nthe recipients, and made at SIT’s makerspace, was presented to all donors.Mr Lim Teck Kheng, Executor, The Estate of Lim Doa Hin, speaking to recipients of\nthe Lim Doa Hin Bursary.(From left) Mr Brian Tan, Regional President, South East Asia, Applied Materials\nSouth East Asia Pte Ltd; undergraduate Mr Chua Sai Wei; Prof Tan Thiam Soon,\nPresident, SIT; Assoc Prof Lim Bee Gim, Programme Director, SIT; Mr Keith Chua,\nFounder, Nehemiah Foundation; undergraduate Mr Yong Jian Ming; Ms Sharon\nChua, Nehemiah Foundation.\nProf Ng Siu Choon, Assoc Provost (Students), SIT, speaking to students and guests\nat the event.\nVoices of Philanthropy: Ms Angela Wu, Staff Threat Intelligence Analayst, VMWare\n(left) and Mr Teng Ngiek Lian, Founder & Executive Chairman, The Silent Foundation\nLtd (right) share their reasons for nurturing SIT students.\nMs Reshma Maria, Manager, HR, Singapore, Tyco\nElectronics Singapore Pte Ltd (third from left), Mr Lim\nHorng Huei, Director, T.E. Engineering & Trading\n(fourth from left), Ms Karrie Wong (third from right) and\nMr Derrick Teo (second from right), toss to the Lunar\nNew Year with SIT students.\n(Front row, from left to right) Prof Chua Kee Chaing,\nDeputy President (Academic) & Provost; Mr Lo Ngai\nHung, Director of Taxes & Business Advisory Services,\nLo Hock Ling & Co; Mr Gilbert Tan, Chairman, Lions\nCommunity Service Foundation (Singapore); Mrs\nPearlyn Chong, Managing Partner, Lo Hock Ling & Co\ntogether with SIT students.Mr Soo Ye Wah, Executive Chairman, Dou Yee Enterprises (S) Pte Ltd (front\nrow, middle), with recipients of the Dou Yee Enterprises Bursary.\nTwo donors, Ms Angela Wu, Staff Threat Intelligence Analyst,\nVM Ware, and Mr Teng Ngiek Lian, Founder & Executive\nChairman of The Silent Foundation Ltd, spoke about why\nthey had chosen to support SIT students.\nMs Wu, who had made possible the Wu Peihui Bursary, shared\nhow she did not have any savings for her tuition fees when\nshe started university but did not want to give up on pursuing\na degree as she knew that a university education would help\nher progress in her career. She said, “This bursary is my way\nof encouraging students to pursue undergraduate studies\nin ICT, software engineering or computer engineering. My\nhope is also that that more women would join the IT industry\nand to encourage more locals to pursue cybersecurity jobs. ”\nMr Teng shared his motivations to pave the way for\nminorities through The Silent Minority Bursary. Ms Gloria\nFrancis, who received the Bursary, said that she was glad to\nbe able to meet with Mr Teng and thank him personally. The\nsecond-year Hospitality Business student was especially\ninspired by Mr Teng’s commitment to giving back to society\nand supporting minority students like herself. She added,\n“What Mr Teng has done is truly admirable and I would like\nto follow in his footsteps.”\n(From right) Prof Yaacob Ibrahim, Advisor, Office of the President, SIT with Mr\nMohamed Abdul Jaleel, Founder, S M Jaleel Foundation, and Mr Edmund Cheng,\nChairman, Mapletree Investments.\nSiTIZEN  |  08/16 SiTIZEN  |  09/16\nThey meet new friends and brand new hosts\nlearn more about their roles at the Student Hosts\nWelcome GatheringIt’s ‘Picnic’ Time for Student Hosts!An ‘Eye-Opening’ Volunteering Stint\nIt was a fun night for student hosts both old and new, together with\nSIT staff from the Advancement & Alumni Division.Some of The Ngee Ann Kongsi scholars (in red t-shirts) at the event.\nThe student hosts enjoyed a chill evening, getting to know each other over food and drinks.On Wednesday, 18 December 2019, a small gathering was held at\nPicnic at Wisma Atria for the student hosts of SIT’s advancement\nand alumni-related events, including new students who had\nrecently signed up at the Student Club Fair in August. This was a\nchance for the students to meet new friends from other clusters\nand programmes, as well as learn more about the importance and\nbenefits of being a Student Host.\nThe gathering was attended by seasoned Student Hosts who shared\ntheir experiences from past events. At previous advancement\nand alumni-related events such as The SITuation Room and the\nNew Alumni Welcome Party, Student Hosts were instrumental in\nengaging fellow SITizens and helping alumni stay connected to SIT\nand their peers. Student Hosts will have opportunities to meet new\npeople and gain new skills, such as event management, hosting,\nand networking skills. This volunteering role is also recognised by\nSIT in the Student Hosts’ Record of Achievement.Over 13 – 15 December 2019, more than 70 SITizens had the\nopportunity to learn more about Teochew culture and practices when\nvolunteering for the Teochew Culture & Food Festival. All of them are\nalso recipients of The Ngee Ann Kongsi Scholarship.\nMs Saifoon Faheema from the Diagnostic Radiography programme,\nand Ms Tham Kah Mun from the Hospitality Business programme,\nboth of whom are in their third year of studies, were among those who\nhelped at the event.\nMs Jamie Kweh, a first-year student from SIT’s\nAccountancy programme, had signed up to\nbecome a Student Host at the most recent\nStudent Club Fair held in August 2019. “I talked\nwith some of the other Student Hosts and I’m\nreally looking forward to my first event with\nthem!” she said.\nShe invited her friend Mr Heng Yong Ren to join\nthe gathering and learn more about their roles as\nwell. “The gathering was very well planned and\ninformative to me,” he said. “I feel that events\nlike this are excellent opportunities to network\nand make new friends.”\nIf you spot our Student Hosts at the next SIT\nevent, don’t be shy to approach them and say hi!\nFor Ms Faheema, the experience was an\neye-opening one as she did not have much\nknowledge about the Teochew community.\nOne of the things that she discovered was\nTeochew opera. She said, “Even though I did\nnot understand much of what was being sung,\nit was my first time seeing one in real life and\nthe costumes were beautiful and unique.”\nShe added, “I hope to be able to volunteer\nin more events like this and learn more about\nother cultures.”\nMs Tham who helped manage guests’ entry\ninto the event said, “It was really heartwarming\nto see how people from all walks of life gather\nto appreciate various aspects of the Teochew\nculture. I even managed to learn about the\nspecial and traditional ingredients used in the\nvarious Teochew delicacies.”\nThe Festival was organised by the Ngee Ann\nCultural Centre, a subsidiary of The Ngee\nAnn Kongsi. The Kongsi has made possible\nThe Ngee Ann Kongsi Scholarship as well as\nThe Ngee Ann Kongsi Gold Medal (For The\nMost Outstanding Graduating Student) at SIT.\nSince 2017, the scholarships have supported\nstudents like Ms Faheema and Ms Tham\nthroughout their course of studies. More than\n80 students have received The Ngee Ann\nKongsi Scholarship at SIT. The Ngee Ann Kongsi scholars learn about Teochew\ncultural heritage through volunteeringSiTIZEN  |  10/16\nSITizens score at alumni basketball game while enjoying\nprofessional facilities\nAlumni enjoyed a CheerS IT’s Thursday packed with\nfun ice-breaking games and the chance to catch up\nwith faculty they have not seen since graduationLet’s Shoot Some Hoops\nBingo, Let’s Say Cheers!A player shoots for the hoop as members of the opposing team try\ntheir best to defend.\nTime for a group shot after working up a sweat on the court!\nAlumni from the CEFT cluster share a drink with Assoc Prof Tham Ming Tan\n(second from right).\nAssoc Prof Alan Wong (third from right), Cluster Director (Health and Social\nSciences), and Assoc Prof Lee Kwee Hiong (fourth from right), Cluster Director\n(Engineering), re-connected with alumni over drinks and delicious food.\nMs Vanessa Chan shows off her accumulation of nametags, which alumni\nhad to collect from each other to earn points and win prizes.\nSaturday morning, 7 December 2019, saw 13 alumni gathered at\nthe OCBC Arena for a friendly basketball game. This was part of the\nongoing series of sports sessions organised by the SIT Alumni Sports\nNetwork. They were split into four teams with five members each.\nFor Mr Adrial Lai, a Criminology and Security graduate, this was\na good chance to stay connected with his former lecturer Dr Jiow\nHee Jhee, Assistant Professor at SIT’s Health and Social Sciences\n(HSS) Cluster. “We used to play basketball together on our own\ntime, so I thought it would be good to ask him along.”\nMr Yeo Ray En, an Aeronautical Engineering graduate and regular\nbasketball player, felt that this was a great opportunity to meet\nnew people and expand his network while enjoying a sport he\nloves. “The session was great fun even though we all came from\ndifferent backgrounds and experience levels,” he said. “I loved\nhow everyone came together and enjoyed the game of basketball\nas if we knew each other for years.”\nKeep your eyes peeled for more sports games coming up!\nAs Thursday, 28 November 2019 rolled around, it was time\nto wind down and relax after work at CheerS IT’s Thursday\n(CheerSIT). 53 alumni gathered at The Armoury Craft Beer Bar\nfor some bonding over sharing platters and drinks. This was\nalso the first CheerSIT where alumni had the opportunity to\nmeet seven faculty members from the Chemical Engineering\nand Food Technology (CEFT), Engineering, Health and Social\nSciences (HSS) and Infocomm Technology (ICT) clusters.\nFood & Human Nutrition graduate Ms Vanessa Chan thoroughly\nenjoyed the food and ice-breaking games played at the\nevent such as Human Bingo. “I’ve attended three CheerSIT\nevents and never once regretted! Through the games I got to\nmake new friends from the Nursing course. It really did help\nin breaking the barrier of awkwardness and opening up for\nconversations.”\nMr Chua Hock Yao, a graduate from the Information and\nCommunications Technology (Software Engineering) programme,\nappreciated the opportunity to interact with other alumni and\nmake new friends from different clusters. “It’s great to just\nhang out and chill after work with fellow SITizens, and learn\nabout different working industries,” he said. “I even met an\nold friend in the HSS cluster from way back in polytechnic! It\nwas a rather enjoyable event throughout.”\nSiTIZEN  |  11/16\nA SITizen carefully shucking her oyster.\nFreshly harvested pearls gleaming in the hands of participants.On 19 December 2019, 36 SIT alumni turned up at Picnic at Wisma\nAtria after work for the Pearl Workshop organised by the SIT Alumni\nLeisure Network.\nLed by Pearl Promises’ founder Ms Caryn Cheng, the infotainment-style\nworkshop introduced the participants to the unique shapes of pearls,\nthe symbolism of the various pearl colours, and also demonstrated how\nto differentiate real pearls from fake ones. Participants were taught the\nbasics of pearl care and maintenance as well.\nA sense of palpable excitement was in the air as the oysters were\ndistributed. SITizens inserted their shucking tool into one end of the\nshell near its hinge, slid carefully along the edges before popping\nit open with a twist. With bated breath, they gingerly massaged the\noyster in search of the pearl and some lucky SITizens even discovered\ntwin pearls in their oysters! After a quick rinse in mineral water, and a\nsit in the salt bath, participants wiped their pearls with a dry soft cloth\nbefore placing it in a charm. SITizens also had their pearls certified by\nMs Cheng.\nHospitality Business alum Miss Daphne Xiao thought it was an\ninteresting experience. “The oyster shucking was tougher than it\nlooked and I had to get some help from the instructor. Still, it was an\nexciting experience to uncover what lies in each oyster,” she said. Just Pearlfect\nA unique hands-on experience for alumni to shuck\noysters to harvest pearls\nLet’s get shucking!\nParticipants flashing their pearly whites after a fun workshop about pearls.\nSiTIZEN  |  12/16\nSpending Quali-tea Time\nTwenty-one SITizens made their way to Yixing Xuan Teahouse on a Saturday\nafternoon for a Tea Appreciation Workshop organised by the SIT Alumni Leisure\nNetwork on 11 January 2020.\nThe cosy ambience of the teahouse set everyone at ease and got them in the\nmood for tea. Yixing Xuan Teahouse’s founder, Mr Vincent Low, introduced the\nparticipants to the different categories of tea, as well as how to recognise them.\nSpecimens of various tea were passed around for the participants to smell and\nobserve the colour of the tea leaves. During the workshop, the participants were\ntreated to different premium samples of white tea, green tea, and black tea. One\nof the samples they tried was the Lapsang Souchong Tea, a black tea known for\nits smoky flavour and fragrance. The participants were also regaled with facts\nabout the rich history and culture of Chinese tea and the health benefits of tea.\nMr Low then demonstrated the traditional way of tea appreciation – from the\npreparation of the tea set and tea leaves, to brewing and sipping.\nParticipants jumped right into action and tried their hands at brewing a pot\nof tea, appreciating the nuanced flavours of the tea amidst bites of dim sum\nprovided for the complete experience.\nMr Jason Leong, who graduated from the Information and Communications\nTechnology (Software Engineering) degree programme in 2018, said that the\n$10 registration fee of the workshop grabbed his attention and he signed\nup together with two fellow alumni.\nHe said it turned out to be a very interesting afternoon for him. “I have learnt\nthat the white tea contains catechins that acts as antioxidants to combat illness\nand diseases, and Vincent mentioned it is three times better than green tea,”\nhe said.\nSITizens have regularly enjoyed popular movie\nblockbusters at SIT Alumni Movie Night, a signature\nevent by the SIT Alumni Leisure Network. On\nTuesday, 10 December 2019, they were introduced\nto a different cinema experience at Night @ The\nProjector. Attended by 73 alumni and graduating\nstudents, the event was held at The Projector,\na refurbished cinema from the 1970s that was\npreviously known as Golden Theatre. It is now\nknown as a hip, indie cinema offering alternative\nscreenings from traditional cinemas.\nScreening that night was the South Korean dark\ncomedy thriller film Parasite. The film has won\nseveral awards since its 2019 release, including\nthe Palme d’Or at the Cannes Film Festival and Participants immerse themselves in the history and culture of\nChinese tea, and experience the joy of brewing an exquisite pot\nNo better way to bond than over a pot of tea and\ndelectable dim sum.\nSITizens raise their cups for an afternoon well-spent!A participant carefully pouring the tea into a holding\npot, which later allows everyone to enjoy the same\nflavour intensity when poured into individual cups.\nFriends gathered and ready for a cosy movie night out. Settled in their seats with popcorn, they’re ready to\nenjoy the show! Attendees ready to enter the Blue Room, one of the\nold-school theatres located within The Projector where\nthe movie would be screened.\nParasite At\nThe ProjectorSITizens treated to ‘unique’ experience of watching\nthe acclaimed South Korean movie at The Projector,\none of Singapore’s hidden cineplex gems\nthe Golden Globe Award for Best Foreign Language Film.\nRecently, it made history at the 2020 Oscars as the first\nnon-English language film to win Best Picture. “I had always\nwanted to watch this movie, and the experience was terrific\nand unique,” said Ms Jacelyn Poh, who graduated from the\nHospitality Business programme. “I tend to watch mainstream\nmovies with my friends, so I would love to watch more movies\nlike this.”\nThe attendees also enjoyed a delicious buffet dinner and\nnetworking session before the movie. Mr Norsatria Asyraf Bin\nNorman, a Mechanical Design and Manufacturing Engineer\ngraduate, enjoyed the vintage vibe of the venue. “I have\nattended a few Alumni Movie Nights, and this place, however\nlacking in size, is cosy and a lot more intimate as we mingle\nduring the dinner session.”SiTIZEN  |  13/16\nAlumni enjoy their wine with a platter of soft\ncheeses and ham.The first step to becoming a wine connoisseur is\nto learn how to properly open a bottle – without\nhitting someone in the face with the cork.Participants learning to identify the three wine structures to differentiate\nwines, such as between a merlot and pinot noir.Wrapping up an informative session with a group photo at the LinkedIn Office! SITizens find out how to review their own LinkedIn profiles and\nmake changes according to the guidelines shared at the workshop.\nOn Saturday, 14 December 2019, 20 alumni gathered at The\nCommunal Bistro Delicacy for a Wine Appreciation Workshop,\norganised by the SIT Alumni Leisure Network. Hosted by Fine Wines\nSingapore, the workshop introduced three main wine regions of\nFrance – Champagne, Burgundy, and Bordeaux. The participants\nwere given an overview about each region’s history and the types of\nwines that are produced.\nBefore proceeding to wine tasting, the participants had to learn the\nproper technique to open a wine bottle. One of the most important\nthings to remember – make sure you’re not pointing the wine bottle\nwhere the cork could hit someone’s face.On Thursday, 5 December 2019, 54 alumni and\ngraduating students visited the LinkedIn offices at Marina\nBay Financial Centre for LinkedIn 101, an informational\nworkshop on one of the most popular social platforms for\nprofessional networking and career development. The\nsession was conducted by Mr Shawn Soh, Programme\nManager (Social Impact) at LinkedIn.\nThe workshop was designed for the participants to\nlearn how they could optimise their LinkedIn profile\nto increase their employability as well as network with\nother SITizens. They were guided from the setting up of\ntheir profile to finding jobs, to building a professional\nnetwork to access opportunities. Mr Soh also shared\nStop and Smell the Rosé\nParticipants enjoy an afternoon of wine history and wine\ntasting as they learn how to become wine connoisseurs\nFor their first bottle, the participants tasted a Pinot\nNoir Rosé, a pink champagne that takes about\nthree to four years to make. A ham and cheese\nplatter to be paired with the wine was also served.\nOther wines served included a variety of red wines\nsuch as Cabernet Sauvignon, and white wines such\nas Sauvignon Blanc. As the SITizens tasted each\nwine, they also had to identify its three structures,\nnamely, Body, Acidity, and Tannins.\n“I enjoyed the array of wines introduced and the\ninstructor gave us an elaborate explanation on how\nto appreciate wine,” said Ms Tan Chor Lin, who\ngraduated from the Nursing Practice Programme.\n“I was particularly intrigued by the taste of the last\naged wine the instructor introduced. It had notes\nof ‘mushrooms’ I had never tasted in other wines.”\nParticipants who guessed the type and age of the\nwine correctly won tickets worth $180 to a French\nWine class by Fine Wines Singapore.\nLinkedIn 101:\nTips for SuccessSITizens find out more about LinkedIn and\nhow to maximise their profiles to benefit their\ncareers at a workshop organised specially by\nthe SIT Alumni Career Network\nuseful tips, such as using the app to engage with potential\nemployers or to research the type of employees one wants\nto look for.\nMr Lee Chuanfeng, who graduated from the Computer\nScience in Real-Time Interactive Simulation programme,\nfelt that the knowledge acquired from the workshop would\nhelp his LinkedIn profile stand out more. “I got to know\nabout some interesting functions on the app, such as the\nability to discover people nearby during a networking\nsession, and that profiles can be shared via QR code,”\nhe said. “Another interesting tip was that reapplying to a\ncompany that has rejected you before can increase your\nchances of actually getting hired!”SiTIZEN  |  14/16\nMs Ivy Chen demonstrates the ideal proportions to achieve when drawing your\neyebrows.\nSIT alumnae test their newly-gained knowledge with their complimentary\nmakeup kit.\nMr Lionel Lim helps the participants identify which colours would suit them best\nthrough a process called draping. Participants would then be able to discern\nbetween cool or warm colours and dark and light shades.Personal grooming plays an essential role in one’s\neveryday life. Taking that extra time in your appearance\nnot only enhances your professional image, but also\nboosts your confidence and self-esteem. SITizens had\nthe opportunity to learn more about the art of grooming\nand style at workshops organised by the SIT Alumni\nCareer Network.\nAt the Personal Grooming and Makeup Workshop, female\nSITizens focused on how to properly utilise makeup and\nskincare. Held on three separate sessions in November\nand December 2019, the workshops were conducted\nby makeup and hairstyling expert Ms Ivy Chen of One\nAcademy. Participants were taught how to identify their\nface shape and the ideal proportions for one’s facial\nfeatures, as well as how to use basic makeup products\nsuch as foundation and mascara, which were provided for\nthem in a complimentary makeup kit.\nThey were also taught pre-makeup skincare and how\nto select products best suited for them. “For someone\nwho does not have any makeup experience, I found the\ntips very useful,” said Ms Cassandra Yeow, a Chemical\nEngineering graduate. “One great tip was how to identify\nour skin tone by the colour of our veins, and we can then\npurchase face products that suit our skin tone. Most of\nus are unaware of this as we tend to purchase products\naccording to our liking instead.”\nThe guys learnt how clothes maketh the man at the\nProfessional Grooming Workshop, held on 13 January\n2020 at room 2F at Esplanade Mall. Led by style expert\nMr Lionel Lim, the participants learned about the\nimportance of first impressions and how to avoid “image\ndestroyers” – such as unkempt hair, crumpled shirts and\nloose socks. They were taught how to identify their face\nand body shapes, which would help them understand\nwhich styles suit them best.\nMr Lim also talked about wardrobe essentials from\nbusiness shirts to shoes and watches, and the different\ntypes of styles available. Mr Edsel Li, a Year 3 Hospitality\nParticipants take turns measuring each other to identify their individual body shapes.\nHere’s Looking at You, SITizens!\nAt grooming workshops specially tailored for men and women, SIT alumni learn tips and\ntricks on how to project their best professional image through makeup and dressing\nBusiness student, felt that the workshop has helped him\nunderstand better the wardrobe he needs as a man. “I\nalways thought that our fashion choices make us look\nbetter, but I also learnt that different face shapes suit\ndifferent styles,” he said. “Through that I’ve come to\nlearn what works well for me.”SiTIZEN  |  15/16\nPresented by:\nAdvancement & Alumni Division\nContact Us: Alumni@Singapor eTech.edu.sg\nTel: 6592 3314 | 6592 2129BachataBachataSOCIAL DANCE:\nDATE:\nTIME:\nVENUE: shall wedance. sg\n23 Kampong Bahru Road , #04-04\nsingapore 16934910.30am to 1.30pmSaturda y, 21 March 2020\nPresented by:\nAdvancement & Alumni Division\nContact Us: Alumni@Singapor eTech.edu.sg\nTel: 6592 3314 | 6592 2129#01-208, Marina SquareNERF Action XperienceSaturday, 7 March 2020\n9.30am to 2.00pmDate:\nTime:\nVenue:NERfNERf\nActionAction\nXperienceXperienceNetwork:Network:\nSportsAlumniAlumni\nSports\nPOSTPONED TILL FURTHER\nNOTICE"
}