{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-17.pdf",
  "type": "pdf",
  "content": "The Next Chapter Begins\nfor Class of 2017\nImagine! – Projects that\nKeep an Eye Out for You\nYoung NTUC Programme\nHelps Prepare SIT Students for Future Careers\nSITizens Get Inspired by\nThe Ngee Ann Kongsi\nThird Recognition of\nExcellence at SIT is the Biggest Yet\nNew Bursaries and Study\nGrants from Tiong Seng Contractors, Singapore Contractors Association Limited and Singapore Leong Khay Huay Kuan\nNew Alumni Welcome Party\nBrings Down the House\nAlumni Gather for Ultimate\nFrisbee Fun in TaiwanOnce a SiTizen, Always a SiTizenISSUE NO. 17   |  NOVEMBER 2017\nAs is tradition at SIT – the Class of 2017 celebrated\ntheir graduation at the year’s New Alumni Welcome\nParty, where they brought the house down with a\nparty train.\nSITizens certainly have a reason to cheer. They\nhave been bagging various awards – from first\nprize at the Sembcorp-EMA Energy Challenge for our Sustainable Infrastructure Engineering (Land)\nstudents, to a Young Hawker Award for Plum & Rice,\na stall run by SIT-CIA alumni. In the virtual world, SIT-GSA alumnus Mr Lim Kim Hui has managed to\nraise $1.5m for his app, BeLive, and Mr Lim Xing Yi from the Information and Communications\nTechnology programme clinched the top prize in the OneMap IdeaWorks! challenge for his app, WhereMyJob – which will help people locate jobs close to their homes.\nNot only that, the results of the Graduate Employment Survey 2016 have now been released,\nand similar to last year, findings indicate that around nine in 10 SIT graduates found jobs within\nsix months of completing their final examinations. SIT graduates also enjoyed higher starting\nsalaries than those who were surveyed in 2015, from $3,055 in 2015 to $3,200 in 2016.\nIn this issue, we have also introduced a new series titled Imagine! – to keep you updated with\nthe latest innovations developed by SIT students and faculty. For this first report, we look at a\nmotion-sensing eye to deter vandals and a new way to board trains.\nUndergraduates at SIT are indeed getting more nurturing support and encouragement for\ntheir education from generous donors, whose philanthropic commitments are making possible more bursaries and study grants, as well as scholarships and excellence awards. Many of these\ndonated awards were presented at SIT’s Recognition of Excellence in October, the third such\nevent at SIT so far.\nTurn the pages to read about these stories and more in this issue!We hope you will enjoy reading this issue of SITizen. Should you wish to contribute a story, do\ndrop us a line at Alumni@SingaporeTech.edu.sg WHAT’S\nHAPPENING\naround our little\nbig campus\nSITizen is a publication by the\nSIT Advancement & Alumni Division.For enquiries, please e-mail us at  Alumni@SingaporeTech.edu.sg© Singapore Institute of Technology 2017Dear SIT Alumni,\nSweet Celebrations to Cap 2017…\nand New Ideas for the Future\nThe Class of 2017 living it up at the New Alumni\nWelcome Party.\nMr Jeremy Tan Jin Kiat, a Bachelor of Engineering (Hons) in\nAeronautical Engineering graduate who earned the Boeing\nTop Student Award, said: “The bagpipes and other Scottish\ntraditions at the event made me feel as if I was in Glasgow.\nIt was very unique.”\nTrinity College Dublin Graduation\n19 October 2017\nAt the SIT-TCD Graduation Ceremony, SIT celebrated the\ngraduation of 139 Trinity College Dublin (TCD) students. These graduands received their degree scrolls for the\nBachelor in Science in Diagnostic Radiography, Bachelor in\nScience in Occupational Therapy and Bachelor in Science in Physiotherapy programmes.\nMs Ong Zhen, who received her degree in Diagnostic\nRadiography, took to the stage to present her valedictorian speech. She left her fellow graduands with a lasting reminder, “This is not the end but a stepping stone to embark on your careers.”\nSingapore Institute of Technology Graduation\n20 October 2017\nThe Singapore Institute of Technology Graduation Ceremony\non 20 October saw a total of 71 graduands receiving their The Culinary Institute of America Graduation\n13 September 2017\n37 graduands received their Bachelor of Business\nAdministration in Food Business Management degree from\nThe Culinary Institute of America at Temasek Polytechnic’s\nAuditorium 3.\nMs Lisa Tang Fu Le received both The Julius Wile Academic\nAchievement Award and The Frances Roth Leadership Award. She said, “My advice to my peers and juniors is to\ncontinue to have passion and the desire to serve. The root\nand fundamental of the industry is to bring joy to people.”\nAlso receiving The Frances Roth Leadership Award was Ms\nAshiqa Hasan. The Culinary Award was presented to Mr Guah Lih for Culinary Art and Ms Ethel Koh for Baking & Pastry Art.\nMr Himmat Shergill received a Certificate of Appreciation for\ndesigning the menu and serving as the main Chef for the pre-graduation dinner held in honour of the Guest of Honour.\nUniversity of Liverpool Graduation Celebration\n1 October 2017\nThe University of Liverpool Graduation Celebration at the\nSIT@Dover Auditorium saw 73 students graduate with a\nBachelor of Arts (Hons) in Criminology & Security degree.\nThe Award for Highest Achiever and Valedictorian went to\nMs Ong Yu Qi. Said Ms Ong, “I feel incredibly surprised and\nhumbled to receive this honour. I am grateful for our lecturers SiTIZEN  |  02/12\nStarting a New Chapter\nwho facilitated our learning and stretched our intellectual\ncapacities. I believe that a budding criminological collective in\nSingapore will cultivate a more socially conscious community\nthat is able to think critically and empathise.”\nThe Award for Exemplary Work-Based Learning Project was\npresented to Ms Lim Jia Jia. Mr Koh Soon Long, Mr Lee Cheng Wai, and Mr Ong Jun Jie Alvin all received the Award\nfor Exemplary Dissertation Project.\nDigiPen Institute of Technology Graduation\nCeremony\n7 October 2017\nAnticipation was thick in the air as the 98 graduands from\nthe DigiPen Institute of Technology preened themselves to\nreceive their degrees at the graduation ceremony at the Star Gallery at Star Vista.\nTaking centre stage were the three valedictorians – Mr Calven\nKoh from the Bachelor of Science in Computer Science in Real-\nTime Interactive Simulation programme; Mr Seoh Jing Xuan\nfrom the Bachelor of Arts in Game Design programme, and Mr Aaron Quek Jun from the Bachelor of Fine Arts in Digital\nArt and Animation programme. An avid gamer himself, Mr\nKoh, who is now working as a programmer, said: “Receiving recognition for my hard work for the 3 ½ years at DigiPen\nwas a glorious experience and I am inspired to achieve my\nambition of creating a high quality video game that will keep\nthe world entertained.”\nUniversity of Glasgow Graduation Ceremony\n13 October 2017\nThe 316 students of the University of Glasgow were all in high\nspirits at their graduation ceremony at The Star Theatre.\nFor the Academic Year 2016/17, the Secura Group Ltd\nTop Computing Science Student Award went to Mr Han Yi\nChou while the Secura Group Limited Top Project Prize for Computing Science was awarded to Mr Chia Ming Hong.\nThe Professor Wu Dao Quan Outstanding Engineering\nStudent Award was won by Ms June Tan and the Project Prize for Engineering went to Mr Cheong Kah Yuen; both of\nwhom graduated from the Bachelor of Engineering (Hons) in\nAerospace Systems programme. More than 1,000 SITizens were conferred their degrees at the various graduation ceremonies\nbetween September and November of this year\ndegree scrolls for the Bachelor of Accountancy with\nHonours and Bachelor of Hospitality Business with Honours programmes. Mr Kelvin Tay Kai Wen represented his peers as\nthe Valedictorian for Accountancy.\nThe graduation ceremony, which took place at SIT@Dover,\ncommemorated a significant moment for the cohort of 19 Hospitality Business students as the very first batch to\ngraduate from the programme.\nGraduate Ms Samantha Tan said she had initially gotten an\noffer from the University of Queensland, but ultimately chose\nto put her faith in SIT’s Hospitality Business programme\ninstead. She said, “School life has been fulfilling especially being the pioneer batch with my special 18 classmates.\nI truly enjoyed my university life. Now that I’ve graduated, the feeling of transitioning from being a student to an adult\nis surreal.”\nNewcastle University Congregation Ceremony\n1 November 2017\nWith 353 graduands, the Congregation Ceremony for\nNewcastle University was split into 2 sessions, held at SIT@\nDover. Mr Lim Yue Ning from the Bachelor of Engineering with Honours in Chemical Engineering programme and Ms Nusrath Jumana Yusoof from the Bachelor of Science with Honours in Food and Human Nutrition programme were the\nvaledictorians for the respective ceremonies.\nIn her speech, Ms Nusrath reflected fondly on her OIP\nexperience in Newcastle, “The culture, work environment\nand society that we were surrounded by back in UK was\nvery different from Singapore,” she said. “As an individual, I realised that these 4 weeks in Newcastle, had moulded me and made me independent, responsible not only for myself but my friends. It pushed me to step out of my comfort zone,\nlearning to adjust with new people and environment. These\nqualities and values are critical in today’s world.”\nSiTIZEN  |  03/16\nSiTIZEN  |  04/16\nClinching First Place\nat Sembcorp-EMA Energy Challenge\nUndergraduates from the Sustainable Infrastructure\nEngineering (Land) programme make an impression with their ability to manage a simulated power plant\nEdging out 33 teams from other local autonomous universities,\npolytechnics and ITEs, four third-year students from SIT’s Sustainable Infrastructure Engineering (Land) degree\nprogramme clinched first place in the annual Sembcorp-EMA\nEnergy Challenge (SEEC), in the Higher Education Institute category.\nThe competition was held in conjunction with the Urban\nSustainability R&D Congress 2017, a national platform for\ngovernment agencies, the research community and industries to discuss R&D solutions to address Singapore’s urban sustainability challenges. It provided an excellent opportunity\nto expose students to modern challenges and opportunities\nin the power sector and related fields of urban sustainability.\nStudents were given a real-life computer simulation termed\n‘Power Quest’ that challenged them to manage a power Projects That Keep\nan Eye Out for You\nCheck out some recent project prototypes by SIT\nengineering students that serve community needs\nand capture the imagination\necosystem. Teams were judged based on the reliability,\nenvironmental sustainability and profitability of the plant.\nTeam member Denise Tong felt that the event was an\neducational and enjoyable journey. “Through this challenge,\nwe discovered how to manage resources optimally and to ensure that the plant is operating efficiently, economically and in a more eco-friendly way,” she said.\nFor their efforts, the team will also be rewarded with internship\nopportunities in Sembcorp.(From left) Assoc Prof Zheng Jianxin, Programme Director, SIT; SIT students Wong\nQi Xian, Denise Tong, Ong Shi Ming, Jennifer Wee; and Assoc Prof Lee Kwee Hiong,\nCluster Director, SIT.\nMotion Sensing Watching Eye\nto Deter Vandals\nMr Qiu Yonglin (first from left) who recently graduated from the\nMechatronics degree programme worked with the Waterways\nWatch Society to design a Motion Sensing Watching Eye. The\nEye provides security through friendly deterrence to public areas affected by vandalism as it plays on human psychology to change behaviour. It detects movement and rotates up and down and left\nto right to focus on subjects of interest. The Society is currently\nworking to find the right suppliers and vendors to develop the prototype into a real product.\nThird year students Mr Chiam Cheng Yang, Ms Eliza Tay, Ms Goh Xin Ying, Mr Lee Zi Yu, and Mr\nTan Chee Chong, all of whom are from the Sustainable Infrastructure Engineering (Building Services) programme, have designed a prototype for a Convenient & Contactless EZ Xcess System for train\nstations. The proposed system would use radio frequency identification (RFID) to detect a passenger’s\ncard and initiate payment through a sensor embedded in the floor as he or she walks through a gantry right before boarding a train. Without having to tap their cards on a scanner, passengers would have a more seamless and efficient travelling experience. Train operators can also use this for crowd control.\nThis is the first in a series of innovations by SITizens. Watch out for more in upcoming issues!A Convenient & Contactless Way to Board TrainsIMAGINE!\nSiTIZEN  |  05/16\nZero-emission Experimental Multi-energy\nMicro-grid at SIT’s Campus in Punggol\nYoung NTUC Programme Helps\nPrepare SIT Students for Future Careers The grid will enable SIT to tap green energy sources, increase efficiency and savings in addition\nto providing students with a living experimental laboratory to learn from\nSIT’s pilot rollout of the Youth Career Network programmes will give engineering students a chance\nto tap on real-time industry insightsSingapore Institute of Technology (SIT) and SP Group signed\na Memorandum of Understanding (MoU) on 23 October 2017 to collaborate in the building of a multi-energy urban micro-grid at the university’s upcoming Punggol campus with a\ntarget to reach zero-emission.\nWith its expected completion around 2023, the new SIT@\nPunggol campus will be the first university in Southeast Asia\nto have a multi-energy micro-grid network. Specially designed\nfor Singapore’s tropical climate, the micro-grid will integrate\ngas, electricity and thermal energy into a unified smart energy network. It will also seamlessly incorporate renewable sources of energy such as solar energy with energy storage\ntechnologies. Once achieved, the system could help SIT save energy and eliminate carbon emissions, equivalent to removing close to\n2,000 vehicles from the roads. As a distributed energy system,\nthe micro-grid can also operate independently from the\nnational grid in times of emergency.\nStudents from SIT’s Electrical Power Engineering and\nother engineering and information security programmes\nwill have the opportunity to participate in the design and\nimplementation of the campus micro-grid, giving them\npractical hands-on experience while building a pipeline\nof local power and other engineering talents. SIT is also\nexploring a postgraduate programme in Electrical Power\nEngineering in the near future aimed at professionals working in the power and energy sector.\nMr Wong Kim Yin, Group Chief Executive Officer of SP\nGroup said that they are pleased to partner SIT to develop innovative solutions that enable the university to save energy and cost and that the SP Group is “committed to work with SIT to create a zero-emission campus at Punggol.”\nProf Tan Thiam Soon, President, SIT, shared, “Other than\nsupplying power to our future SIT@Punggol campus, the\nmicro-grid will also serve as a living experimental lab to support the research, development and test-bedding of\ndistributed energy systems and cyber-security solutions,\nwhich will benefit the whole of Singapore.”\nThe MoU signing was held at the opening of the Singapore International Energy\nWeek.\nTo give undergraduates a head start in their careers,\nthe Singapore Institute of Technology (SIT) signed a Memorandum of Understanding (MoU) on 22 August 2017 with Young NTUC (YNTUC) to bring the labour organisation’s Youth Career Network (YCN) programmes to the university.\nThe YCN programmes, which include mentoring, career\ncoaching and skills workshops, will provide undergraduates\nwith real-time industry information and guidance they\nneed to prepare themselves for careers in today’s fast-\nevolving economy.\nSIT’s pilot rollout of the YCN programmes will be\ncustomised for its engineering degree programmes. Other degree programmes will be included in due course. SIT undergraduates will be paired with career guides from relevant sectors to provide them with a deeper understanding of working life and the opportunities available to them when they graduate. Students will also go through career discovery workshops and learning journeys. Such mentoring and networking opportunities are crucial in maintaining a healthy pipeline of young graduates into the industry especially with the manpower crunch in the engineering sector. Assoc Prof Ivan Lee, Vice President (Industry & Community), SIT, said, “Today’s MoU with Young NTUC is very much in line with our career mentoring initiative. We look forward to expanding our network of mentors from the industry to help our students navigate the workplace and succeed in their careers.”\nYoung NTUC, which also signed the MoU with the Singapore\nUniversity of Social Sciences (SUSS), aims to recruit and train\nover 60 career guides and help 500 mentees in both SIT and SUSS within a year.\nRepresentatives from SIT, Young NTUC and SUSS at the MoU signing ceremony in\nAugust 2017.\nInspiring SITizens the ‘Kongsi’ Way\nOn the afternoon of 8 November 2017, 40 SIT undergraduates\ngathered at the Auditorium Foyer at SIT@Dover campus\nto welcome some special guests for an appreciation lunch\nhosted by Prof Tan Thiam Soon, President, SIT. These were representatives from the 44th Committee of Management of\nThe Ngee Ann Kongsi including its President, Mr Richard Lee.\nThe 40 SIT students were those who had been selected to be\nthe first of The Ngee Ann Kongsi scholars.\nAlso attending the lunch that day were Prof Loh Han Tong,\nDeputy President (Academic) & Provost, SIT, faculty and staff of\nSIT, as well as staff from The Ngee Ann Kongsi.\nThe Ngee Ann Kongsi’s generous philanthropic commitment\nto SIT amounting to more than $800,000 annually makes\npossible The Ngee Ann Kongsi Scholarship as well as The\nNgee Ann Kongsi Gold Medal (For The Most Outstanding Graduating Student). As many as 40 Scholarships will be\nawarded annually to academically promising students from\nthis Academic Year 2017/18 onwards, whereas one Gold\nMedal will be awarded annually to the most outstanding\ngraduating student from each cohort.\nAt the lunch, the Ngee Ann Kongsi scholars had a chance\nto get to know more about The Ngee Ann Kongsi and its members. One of the scholarship recipients, Mr Lou Hong\nYeow who is a first-year Physiotherapy student, was very\ninspired by the conversation he had during lunch with one of the members of the 44th Committee of Management of The\nNgee Ann Kongsi. He said, “Mr Chua Huan Theng shared a\nlot about his experiences as a young man in Japan to further his studies and gave his advice to find something that you\nlove to do.”\nCertificates were also presented to the 40 scholarship\nrecipients by representatives from The Ngee Ann Kongsi’s\nEducation/Scholarships & Bursaries Sub-Committee.\nMs Ng Xin Rong, a first-year Occupational Therapy student\nwho spoke at the lunch, said, “Being one of The Ngee Ann\nKongsi Scholars has motivated me to work even harder\ntowards my goals and aspirations as it makes me push myself beyond my own expectations to find out what my limits are.”\nShe added, “It also gives me a chance to explore and try out\nnew things to develop myself fully.”\nFormed in 1845, The Ngee Ann Kongsi is a non-profit body\nwhich funds educational and other charitable projects with revenue generated from its ventures such as the landmark\nNgee Ann City shopping and office complex on Orchard\nRoad.\nMr Tan Ter Lun, Vice-Chairman, Education/Scholarships & Bursaries Sub-Committee\n(left) speaking to Prof Loh Han Tong, Deputy President (Academic) & Provost, SIT.Prof Tan Thiam Soon, President, SIT (left), with Mr Jamie Teo, Vice-President, 44th Committee of Management, The Ngee Ann Kongsi. SiTIZEN  |  06/16\nGuests from The Ngee Ann Kongsi were especially intrigued by the Anatomage Table, an advanced anatomy visualization system for anatomy education. The Ngee Ann Kongsi Scholarship recipient, Mr Lou Hong Yeow (with hand on table) was one of the students who helped to demonstrate how this tool enhanced their learning.Generous annual philanthropic gifts from The Ngee\nAnn Kongsi will allow SIT to award 40 Scholarships\nand one Gold Medal each academic year\nSome of the scholars with members of the 44th Committee of Management of The Ngee Ann Kongsi and SIT Senior\nManagement.One of The Ngee Ann Kongsi\nscholars, Ms Tan Yan Ni, showing off\nher award-winning wushu skills to the\naudience.\nThe Ngee Ann Kongsi Scholars introducing themselves to Mr\nRichard Lee, President, 44th Committee of Management, The Ngee Ann Kongsi (right) before the lunch.\nProf Tan Thiam Soon, President, SIT (left), receiving the cheque from Mr Richard Lee,\nPresident, 44th Committee of Management, The Ngee Ann Kongsi.Mr Goh Kim Hock, Chairman, Education/Scholarships & Bursaries Sub-Committee, The Ngee Ann Kongsi, reminding the students to study hard as they say\ngoodbye.\nProf Tan Thiam Soon (middle) bidding farewell to (from left) Mr Jamie Teo,\nMr Suntianto,  Mr Tan Kien Lip, Mr Tan Ter Lun, Mr Chua Huan Theng and Mr Lie Kee Pong after the tour of SIT@Dover campus.Mr Tan Shui Yuan (right) receiving his scholarship\ncertificate from Mr Yeo Boon Hon, Vice-\nChairman, Education/Scholarships & Bursaries\nSub-Committee, The Ngee Ann Kongsi.\nMr Lie Kee Pong, Member of the 44th Committee of Management of The Ngee Ann Kongsi (middle) speaking to scholarship recipient Ms Cheryl Lim (right) and Assoc\nProf Jeanette Ng, Cluster Director, SIT.SiTIZEN  |  07/16\nMr Chua Huan Theng (right) of The Ngee Ann Kongsi speaking with Mr Lou Hong\nYeow during lunch.\nCelebrating Student Excellence;\nHonouring Nurturing Donors\nStriving for excellence involves doing your very best at\nevery opportunity and it is this commitment that tends to distinguish the achievers at the Singapore Institute\nof Technology (SIT). On 26 October 2017, the University\ncelebrated the achievements of these outstanding students as well as the generous philanthropic support from donors, at the Recognition of Excellence presentation at the Sports Hall at the SIT@Dover campus. Now in its third year, the ceremony\nis a platform where SIT presents donor-supported excellence\nawards and scholarships to its respective recipients.\nIn his welcoming remarks, Prof Loh Han Tong, Deputy\nPresident (Academic) & Provost, SIT, thanked all the donors\nand said, ““Your philanthropic leadership and your generous\ncommitment to supporting a good education for the younger\ngeneration is the best example for our students on what it\nmeans to be ‘catalysts of transformation’ who are ‘grounded\nin the community’.”\nIn the ensuing presentation ceremony, 33 Book Prizes,\n9 Outstanding Student Awards and Yearly Performance\nAwards, 7 Gold Medals and 40 non-bonded scholarships, all\nmade possible by donors, were handed out by Mr Ng Yat Chung, Chairman, Board of Trustees, SIT. Also attending the presentation ceremony were members of SIT’s Board of\nTrustees, Senior Management, faculty and staff, as well as\nrepresentatives from the Overseas University partners along with the recipients’ loved ones.\nIn his closing speech, Prof Tan Thiam Soon, President, SIT,\nsaid, “Thanks to our community of donors who are unafraid to support a young university like ours, and to support young\npeople who dream of attaining a good university education, SIT has been able to nurture more and more students\nthrough scholarships, bursaries and study grants that help\nlevel the playing field for students who face challenging circumstances.”\nAddressing the students and graduates, he said, “To our\nSITizens who are present today – you will always be SIT’s best\nambassadors. I wish you every success, as you go boldly into the industry or community to transform the future.”\nThe Recognition of Excellence presentation was a\nchance for scholarship and award recipients to meet\nwith the donors who made the awards and scholarships\npossible. Scholarship recipients strike a pose with members of SIT’s Board of Trustees and Senior Management.\nScholarship recipient Ms Koko Sia, with Mr John Phua, Managing Director, Safety Systems Engineering\nPte Ltd. She said that receiving the Safety Systems\nEngineering Scholarship is a “golden opportunity.”The SIT Innovation Showcase displayed the projects done by SIT students. Here, Mr Chern Chyi Yang (left)\nshares more about “Past Twelve”, a game he and his\nteam mates worked on.SiTIZEN  |  08/16\nMore than 300 guests including donors as well\nas award and scholarship recipients attended the\nthird Recognition of Excellence presentation at SIT, which also featured performances from SIT’s student groups and an Innovation Showcase\nFirst-year Diagnostic Radiography\nstudent, Ms Anjelina Teh, who received\nthe KKH Scholarship said that to her, the\nscholarship represents much more than\njust a financial boost. She said, “It has\ngiven me the courage to stand up for\nsomething I believe in and because of Mr\nKuok’s generous gift, I am one step closer\nto my dreams of helping the community.”\nMr Lionel Ng Kuan Yuan, who graduated\nthis year, received the CEI Outstanding Student Award in Mechanical Design and\nManufacturing Engineering.\nHe said, “I have never won such an award\nin my studying career before. It proves\nhard work and effort are rewarded. It was\nalso definitely an honour to meet the\ndonor in person. My simple gesture of\nappreciation was the least I could do after\nhe has made this award possible.”\nAt the SIT Innovation Showcase, (from right) SIT student\nMr Benjamin  Chua had the opportunity to talk about his\nproject to Mr Kon Yin Tong, Managing Partner of Foo\nKon Tan LLP and Mr Nagaraj Sivaram, Member, Board of Trustees, SIT.Scholarship and award recipients (from left) Ms Anjelina Teh and Mr Chester Liew represented\nthe students to say a heartfelt “thank you” to SIT’s\ndonors.\nJing King Tech Book Prize recipient Ms Tan Ting (second from left) with guests from Jing King Tech Holdings Pte\nLtd: (from left) Mr Anthony Ong, Group Chief Executive\nOfficer, Mr Foo Tee Meng, General Manager, Digital Payments and Identity, and Ms Jenny Kiah, Group (SG) HR & Admin Manager.Soundbox, SIT’s student performance group, opened the ceremony held in the Sports Hall with a bang.(From left) Singapore Food Manufacturers’ Association Book Prize recipient Mr Daniel Ker Sheng Rong, with Mr\nWong Mong Hong, Immediate Past President, and Mr\nPeter Loo, Executive Director, both from the Singapore Food Manufacturers’ Association.\n(From left) Mr David Lee, Director, Marketing & Business Development, Yeakin Plastic Industry Pte\nLtd, chatting with three of the recipients of the Yeakin\nBook Prize for the Top Student in Product Design Engineering, Mr Chew Kia Leng, Mr Norsatria Asyraf Bin Norman, and Ms Tan Sok Kee.(From left) Mr Liew Kai Kiat, recipient of the RSM\nSingapore Financial Scholarship with Mr Teo Cheow\nTong, Senior Partner, Audit Services, RSM Chio Lim LLP and Prof Tan Thiam Soon, President, SIT.ST Engineering Gold Medal recipient,\nMr Jed Lee Jian Xiong (middle), celebrating with his parents after the ceremony.Scholarship recipients Ms Hazel Lim Jia Qi (left) and Mr Mohammad\nNorfairus Bin Abdul Rahim getting to know Ms Jagjit Kaur, Director\nof Learning & Development, Millennium Hotels and Resorts (right).SiTIZEN  |  09/16\nSiTIZEN  |  10/16\nTiong Seng Holdings, one of\nSingapore’s largest construction and property development groups, has made an endowed gift to establish the Tiong Seng Bursary and support students at SIT, especially those in the field of engineering. From Academic Year 2018/19 onwards, five bursaries will be awarded to SIT students annually, and in perpetuity.\nMr Ong Lay Khiam, Chairman,\nand Mr Pek Lian Guan, Executive Director and CEO, both from\nTiong Seng Holdings, and other\nguests from the company visited SIT@Dover campus on\n4 October 2017 for an appreciation lunch hosted by Prof Tan Thiam Soon, President, SIT, along with SIT faculty, staff and students.\nSaid Mr Pek during the lunch: “We at Tiong Seng are very\nglad to be part of this SIT journey in contributing to the university’s students. As a polytechnic graduate who went on to pursue studies in university, I look at SIT and see an educational route I have walked through before. Knowing Empowering SITizens in Need\nWidening Support\nFor All Tiong Seng, one of Singapore’s largest construction companies, makes possible a bursary\nfor undergraduates at SIT\nThe Singapore Leong Khay Huay Kuan extends\nfinancial aid to more SIT students\nThe Singapore Leong Khay Huay Kuan (SLKHK) has\nincreased its support for SIT undergraduates by making\nmore bursaries available and widening the eligibility criteria for the bursary.\nPreviously, SIT was able to award eight Singapore Leong\nKhay Huay Kuan Bursaries annually to support students of Hokkien descent.\nFrom the upcoming Academic Year 2018/19 onwards, SIT\nwill be able to award 12 Singapore Leong Khay Huay Kuan Bursaries annually. In addition, the bursary will now be open to students of other ethnic and dialect groups.\nSaid Mr Chuah Yip Cheng, second-year Bachelor of\nHospitality Business with Honours student and recipient of the Bursary in Academic Years 2016/17 and 2017/18: “I’m truly grateful for the Huay Kuan’s bursary fund which has helped me greatly in financing my education. With their support, I’ve been able to focus and excel in my studies without being weighed down by financial burdens.”\nThe Singapore Leong Khay Huay Kuan is a Hokkien clan\ngroup whose 220 members trace their roots to a city in China’s Fujian province.\nMr Ko Oon Joo, Chairman (fourth from left), and Ms Chen Teck Shing, Secretary\nGeneral (fourth from right), both of the Singapore Leong Khay Huay Kuan Education\nTrust Fund, at the Singapore Leong Khay Huay Kuan Mid-Autumn Celebration &\nBursary Agreement Ceremony on 8 October 2017. With them were Prof Ng Siu Choon, Associate Provost (Students), SIT (fifth from left), and the Academic Year 2017/18 recipients of the Singapore Leong Khay Huay Kuan Bursary.the SIT vision, we are very excited for SIT graduates who\nwill not just be academically strong, but also very hands-on and capable in their fields of study.”\nEstablished in 1959, Tiong Seng has played a significant\nrole in shaping Singapore’s landscape through the construction of commercial buildings, high-profile residences, expressways and iconic hotels such as PARKROYAL on Pickering and Capella Singapore.Guests from Tiong Seng Holdings with SIT Senior Management, faculty and staff at the future SIT@Punggol campus\nmodel.\nSIT Undergraduates\nGet Support from\nConstruction IndustryUndergraduates from SIT’s building and\nconstruction-related programmes are getting even more support thanks to an endowed gift\nfrom SCAL Resources Pte Ltd and members\nof The Singapore Contractors Association Ltd. The gift will enable SIT to award three Singapore Contractors Association Study Grants annually, and in perpetuity.\nThe Study Grant, which aims to nurture talent\nfor the building and construction industry in Singapore, is valued at $5,000 each. It\nis applicable to undergraduates pursuing\nthe Sustainable Infrastructure Engineering (Building Services), Civil Engineering and Electrical Power Engineering programmes who show an interest in pursuing a career in\nthe building and construction industry.\nThe Singapore Contractors Association\nLimited (SCAL) was formed in 1937, and is the official representative body of the\nconstruction industry in Singapore with over\n2,800 members.\nPlum & Rice, a hawker stall run by three\nSIT alumni at Bedok North Street 1,\nrecently won the Young Hawker Award\nas part of the City Hawker Food Hunt,\na yearly contest organised by City Gas and Shin Min Daily News. The stall\ndishes out rice and porridge cooked\nwith umeboshi (a Japanese plum) served with fish or braised meats and\nside dishes.\nThe alumni, Mr Raphael Sim, Mr\nGladwin Yap and Mr Eric Lee, are all 26, and graduated from the Bachelor\nof Professional Studies in Culinary Arts\nManagement (The Culinary Institute of America) degree programme at SIT. Mr Sim and Mr Yap graduated in 2015\nwhereas Mr Lee graduated in 2016.\nTheir desire to be part of the hawker\nscene in Singapore took root even\nwhen they were still studying. They had\nnoticed that hawkers were dying out and not a lot of the younger generation were willing to be hawkers. “We wanted to do\nsomething about that as we all grew up\neating in hawker centres,” said Mr Sim.\nMr Sim explained that Singaporeans\nalready had their favourite stalls when\nit came to traditional hawker fare like\nfishball noodles or lor mee, so they came up with a different concept to\nattract customers and break into the\ntough hawker scene.\nWhen they first opened, their main\nchallenge was trying to convince people that despite being young hawkers, they were indeed capable of cooking. Mr Sim said that he had customers coming to ask them if their parents were the ones cooking\nand they were just manning the stall. Their neighbours at the hawker centre were\nthrilled to have the trio open the stall. “They said that the place felt young again,” said Mr Sim. Business has since picked up and the stall now has regular customers\nincluding the office crowd and quite a few senior citizens as well.\nAdded Mr Sim, “We are humbled by this award, and didn’t expect this during the\nfirst year. This award lets us know that we are doing things on the right track and we have to go further and improve ourselves.”SITizens Bag Young Hawker Award\nPlum & Rice, run by three SIT-CIA alumni, won the Young Hawker Award in NovemberProf Tan Thiam Soon, President, SIT (right), receiving the cheque from Mr Kenneth Loo, President,\nSingapore Contractors Association Limited (left), witnessed by Guest of Honour, Mr Lawrence Wong,\nMinister for National Development, Second Minister for Finance, at the Singapore Contractors Association\nLimited 80th Anniversary Gala Dinner on 28 September 2017.\n(From left) Mr Gladwin Yap, Mr Raphael Sim and Mr Eric Lee in front of their stall which serves fish and meat cooked in a local homely style, served with plum-infused rice.SiTIZEN  |  11/16\nSiTIZEN  |  12/16\nThe beginning of November saw the last\ngraduation ceremony of the year for the Singapore Institute of Technology (SIT)\nand also an important milestone for the\ngraduating students – transitioning from students to alumni. There was no better way for them to celebrate than party the night away at the 2017 New Alumni\nWelcome Party on 3 November.\nThis year, SIT’s sixth New Alumni\nWelcome Party held at Hard Rock Café in Orchard attracted over 250\nnewly-minted alumni, together with SIT\nSenior Management, faculty and staff, as well as representatives from SIT’s Overseas University partners joining in the merriment. Prof Tan Thiam Soon, President, SIT, was there to welcome the new alumni and kicked off the evening with a toast.\nAs the partygoers attacked the buffet and\nwaited eagerly for the announcement of the lucky draw prizes, they were entertained by acts such as SIT’s own student band Muzeka —the music makers added their own spin to a performance of a medley of songs, including a rock version of ‘Blank Space’ by Taylor Swift. Comedian Dr Jason Leong of Malaysia\nfame made an appearance, sending the\ncrowd into fits of laughter with his stand-up comedy act.\nA highlight of the night was the moment\nwhen SITizens spontaneously formed a dancing human train snaking around the dancefloor, led by none other than our\nvery own president. Prof Tan became\nthe life of the party, joining the alumni in grooving to the classic rock sounds of Hard Rock’s ever-popular in-house band Jive Talking.\nMs Nor Rahayu Binte Supa’at, who\ngraduated with a Computing Science\ndegree (University of Glasgow), had\nan especially fun time showing off her moves on the dancefloor. “I totally enjoyed myself! The band was so good!” she enthused. In fact, her dancing was so impressive that it earned her the title of Party Queen. Accepting her award, she said, “I feel honoured to win Party Queen, but this award should be shared with all those who came down\nto celebrate together.”\nMr Lim Guo Xiong, who graduated with\nan Electrical Power Engineering degree (Newcastle University), won a Fuji Instax Square SQ10 Instant Camera in the grand draw. He said, “I didn’t know\nthere was a digital Polaroid camera until\nnow. I used that camera and took some photos with my fellow classmates. Truly a great prize.”\nBefore the partygoers knew it, Jive\nTalking had finished their last set  and it was time to leave. The night ended on a high as people lingered on the dancefloor, calling for an encore. Some\nare already looking forward to the\nnext event. Mr Lim added, “I am sure everyone enjoyed that night. Tasty food, good live performance. Hope there may be more events for the alumni!”\nThere definitely will be.\nParty Rocking in The House\nTonightSITizens dance the night away at the 2017 New Alumni Welcome\nParty\nAlumnus Mr Sherman Hardie (middle), who performed\nas part of Muzeka at last year’s New Alumni Welcome\nParty rocks out with this year’s student band!\nFaculty like Assoc Prof Malcolm Low, Programme Director, SIT (1), Assoc Prof Eicher Low, Deputy Cluster Director, SIT (2), Assoc Prof Alan Wong, Cluster Director, SIT (3) and Chris Hand, Programme Director, The Glasgow School\nof Art (4) , and alumni get a chance to catch up over great food and drinks.\nJive Talking, Hard Rock Café’s resident band, brought the crowd to their feet early in their night with their covers\nof popular dance hits.\n1\n3\n2\n4 SiTIZEN  |  13/16\nMost people understand the importance of saving for one’s future, but we have\nour reservations when it comes to investing. At the Financial Literacy Workshop, 22 alumni learned that although it does not come without risk, investing is not just a rich man’s game. The workshop was organised by the SIT Alumni Career Network at Hotel Jen Orchardgateway on 16 September 2017 and led by Mr Tan Swee Chiew, a trainer with the MoneySENSE Institute for Financial Literacy.\nThis is the second run of the Financial Literacy Workshop and was an Introduction\nto Investing. Participants learned that both saving and investing are important parts of a financial plan, and that investment objectives should be set to support financial goals.\nIn addition, participants were taught about financial markets, types of financial\ntools and how to construct and manage an investment portfolio. Mr Tan gave the participants opportunities to apply their newly-gained knowledge by analysing case studies and conducting live polls.\n“The course has been useful in helping me understand the differences among\nvarious investment methods and how we should go about doing them,” said Mr Lim Yong Jin, who graduated in 2015 with a Chemical Engineering degree (Technical University of Munich). “It got me thinking about trying out investing.”\nMs Chia Siok Ching, who graduated with a Food & Human Nutrition degree\n(Newcastle University) in 2014 said that she feels more confident in investing after attending the workshop. She said, “Currently, I am investing using some of the financial tools mentioned in the workshop and there are definitely plans to invest using other financial tools when I reach my savings goal.”Making Sense of Investments\nAlumni get together to learn about investing sensibly at the Financial Literacy Workshop\nMr Tan Swee Chiew talks about the importance of\ninvestment as part of your financial plan.\nSITizens listen intently as Mr Tan conducts the\nworkshop.\nWith great prizes in store, alumni like Ms Nor Rahayu\nBinte Supa’at (top) who was the Party Queen and Mr Woo\nBing Han (bottom) could not contain their excitement at\nwinning.Alumni losing no time in joining in the party train, complete with beverages in hand.A birthday is another reason to party.\nCapturing memories of the night.\nSiTIZEN  |  14/16\nApp, App and Away!\nTwo SITizens are flying high with the apps they created\n$1.5m seed funding for SIT alumni’s start-up\nAfter two years of living off his income from freelance design\nassignments, while at the same time, conducting intensive market research on a video streaming idea he had when still\nat SIT, Mr Lim Kim Hui, an alumnus from the Communication\nDesign (The Glasgow School of Art) programme finally managed to garner $1.5 million seed money for his video streaming start-up company BeLive.\nHe said, “The GSA programme taught me the value of\nresearch and how to present ideas in a coherent manner\nSIT student’s location-based job app wins prize\nMr Lim Xing Yi, a final-year student from the Information and Communications Technology (Software Engineering) programme at the Singapore Institute of Technology (SIT),\ntook the top prize in the school category of the OneMap\nIdeaWorks! challenge with his web app WhereMyJob in October 2017. The 31-year old edged out 11 other teams in the same category including those from NUS and Nanyang Polytechnic to win $3,000 in cash and $5,000 worth of Amazon\nWeb Services credits.\nWhereMyJob helps users search for jobs available in specific\nlocations as it places job listings on a map. In developing the\napp, Mr Lim tapped on his experience of having to endure\nlong commutes from his home in Woodlands when he joined the labour force after completing National Service.\nHe said, “This app could help any job seeker find jobs near\ntheir homes so they spend less time commuting, which\ncontributes to a better work-life balance. As a result, the cost of transport reimbursement employers have to bear is also lower.”\nAt present, travelling time by car between a user’s home and\nthe job’s location is displayed but Mr Lim has plans to include time taken by public transport to make his app more useful.\nThe OneMap IdeaWorks!, challenge which started in July\n2017, was organised by the Singapore Land Authority with the introduction of the OneMap mobile application, an\nintegrated map system for government agencies to deliver\nlocation-based services and information. Participants were challenged to provide solutions in the form of mobile, web or analytics applications to solve challenge statements provided by organisations from the social services sector or the public\nsector.\nbased on findings from market research. I strongly believe it\nwas through the lessons and applications I learned from the\nmodules on research and presentation that helped me to persuade and convince my investors.”\nAdditionally, Mr Lim felt it was also due to the encouragement\nof his mentors, especially Asst Prof Terence Heng, Deputy Programme Director of the Communication Design programme, at GSA, that nudged him to pursue his start-up\ndream.\nSaid Asst Prof Heng, “Kim Hui is a great example of that\nwillingness to take risks and work really hard for something\nhe believes in. He also made use of his existing knowledge\nand life experiences and applied it to the products that he is creating. It is that flexibility and tenacity that makes him an inspiration to others.”\nToday, BeLive, co-founded by Mr Lim – is on a roll. The\nfirm is aided by Singapore’s Mediapreneur incubator, a\nprogramme run by MediaCorp, with the mission to provide a clean, nurturing and safe environment for talented creators to showcase their works through live video streaming.\nThe app sports more than 1,000 channels of different\ncategories – music, comedy, magic performances and DJs. The start-up is run by a 21-strong staff based in Singapore\nand Vietnam.Belive’s co-founders alumnus Mr Lim Kim Hui (left) and Mr Kenneth Tan.\nMr Lim Xing Yi posing proudly with his WhereMy Job app and his trophy from the\ncompetition.\nSiTIZEN  |  15/16\nA Better Florist\n• 20% off total bill at http://www.abetterflorist.com\n• Key in the code ‘ABFSIT20’  at checkout\n• Valid until 16 August 2018\nAngelFlorist\n• 10%  off total bill with minimum purchase of $80\nat www.angelflorist.com\n• Key in the code ‘AngelSIT18’  at checkout\n• Valid until 31 August 2018\nAmara Singapore\n• High-Tea Buffet at Element Restaurant at  $20++\n• Participating outlets: 165 Tanjong Pagar Road\nS(088539)\n• Reservation is required\n• Valid until 31 December 2017\nCharles & Keith\n• 10%  off regular items\n• Use code: SIT10OFF2017  at checkout\n• Participating outlets: All except Changi Airport\nTerminals 1, 2 & 3\n• Valid until 31 December 2017\nContactLens.sg\n• 15%  off total bill with a minimum of $40 spent\n• Use code: SingTech2017  at checkout\n• Valid until 31 December 2017\nCrunchie Cookies\n• $2 off every $30 spent for cookies\n• Valid until 1 October 2018\nDOJO\n• 50%  off second burger set\n• Valid until 31 December 2017\nDr Chen’s Tea Products\n• 10%  off all Dr. Chen’s products\n• Free delivery to designated places for purchases\nabove $100\n• Valid until 7 December 2017SIT Alumni Card Benefits\nEthan Men\n• 20% off total bill for regular priced-items\n• Participating outlets: 333 Kreta Ayer Road\n#02-32 S (080333)\n• Valid until 31 December 2019\nFloral Garage Singapore\n• 10%  off total bill at www.floralgaragesg.com\n• Key in the code ‘SIT010’\nFoodline\n• $30 cash rewards w/min spending of $300 (All\ncatering orders) with promo code “SITFL30”\n• $10 cash rewards on w/min spending of $500\n(All cakes) with promo code “SITFLC10”\n• Participating Outlets: 18 Howard Road #10-03\nNovelty Bizcentre S(369585)\n• Order at www.foodline.sg\nIntune Music\n• 10%  off course fees for first 3 months\n• Waiver of administrative fees\n• Valid until 1 April 2018\nKF1 Karting Circuit\n• $22 (non-peak)/$28  (peak) for 30kph\n• $28 (non-peak)/$35 (peak) for 50 kph\n• Book at http://kf1karting.com/kf1-events/\n• Valid until 31 December 2017\nKitchen Capers\n• 10% off bakeware tools/packaging needs/\nbooks/DVDs\n• 5% off food/ingredients\nKK Day\n• 5% off KKDay travel experiences\n• Use code: KKDAY SIT 5 prior to checkout\n• Valid until 31 December 2017\nKPO Café Bar\n• 20% off all regular priced items\n• Valid until 31 December 2017Mad About Comedy\n• $10 per entry for monthly events\n• Location: 69 Circular Road\n• Valid until 31 December 2017\nQQ Rice\n• 10% off on Oat Rice, Rice Roll, Snack Rolls, Wholemeal Sandwich\n• $5 Value Set for Oat Rice/Rice Roll + Standard\nDrink\n• $6 Value Set for Bento Box + Standard Drink\n• Valid until 31 December 2017\nShopBack\n• $10 Benefit\n• Up to 1 8.0%  Cashback when shopping with\nselected partners\n• Visit https://www.shopback.sg/ for more details\nTHE FACE SHOP\n• 15%  off total purchase for regular-priced items\n• Participating outlets: THEFACESHOP at\nClementi Mall\n• Valid until 1 May 2018\nTHHG\n• 20%  off across 3 THHG properties on all room\ntypes\n• Key in the discount code “SITreats20”\n• Valid until 20 March 2018\nTotally Hot Stuff\n• 10% off total bill\n• Valid until 30 April 2018\nXorex Press Pte Ltd\n• $8 for A2 poster with mounting\n• $16 for A1 poster with mounting\n• Valid until 1 March 2018\n*Please present your SIT Alumni Card\nprior to making payment.\nTerms and conditions apply. Please refer to\nhttp://sl.singaporetech.edu.sg/Welfare/SITreats.aspx\nfor detailed terms and conditions.Over two days in October, 18 SIT Ultimate Frisbee alumni\ntook part in “2017 Run to Taiwan”, an international frisbee\nchampionship which featured 22 teams from the Asian region.\nThe team, which also included some SIT students, placed fourth in their pool after slogging through mud and rain to edge\nout a fellow Singaporean team even after they were initially trailing 2-5.\nMr Pang Wenjie, who graduated in 2016, said taking part in\nthis tournament was an “opportunity to kill as many birds as possible with one stone.” It was a way to play together and\ntravel as a team. “We wanted to re-live the adrenaline rush that\ncomes about from competing together as a team. And while\nwe were still university students, we had neither the time nor\nmoney to travel overseas together,” he added.\nThe camaraderie and team-spirit of these alumni also extends\nbeyond competing and having fun together. They have\ncontinued to keep in touch and help train their juniors in the\nUltimate Frisbee team. In September, 36 of them attended\nthe SIT Ultimate Frisbee Alumni day, as part of the 3 day 2\nnight Ultimate Frisbee Training Camp in preparation for the\nSingapore University Games (SUniG).\nThe trip to Taiwan was an initiative that the alumni undertook\nthemselves with some help and well-wishes from SIT. Mr Pang explained that they hope that this trip will give the current members of SIT Ultimate Frisbee the view that it is not just\na club they joined for university as the bonds and friendship\nforged extend beyond that. He said, “ In SIT Ultimate Frisbee, we’re like a big family.”Having Ultimate Fun in Taiwan\nSIT alumni from the Ultimate Frisbee team got together to compete in an international frisbee tournament in Taiwan\nAlumnus Mr Wong Kai Xian (left) was one of seven players in the entire tournament\nto receive the Mythical Seven award for exhibiting great skill and sportsmanship.\nA little pep talk before their games."
}