{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2021/07/Mentor-Handbook.pdf",
  "type": "pdf",
  "content": "Mentor  Handbook\nSIT Alumni Mentoring Programme\nMentor Handbook  Page 1\nMentoring is a fundamental human relationship, in which a person invests his or her time, energy\nand expertise to nurture the growth and ability of another person. As a Mentor, you are the special\nperson who helps Mentees reach their potential. You are a ‘ helper ’ and your style may range from\nthat of a persistent encourager who boosts self -confidence to that of a stern taskmaster who\nteaches a Mentee to appreciate excellence in performance. Whatever your style, it is the care for\nyour Mentees that really matters.\nMentoring is one of the all -encompassing methods of encouraging human growth. Today, mentoring\nis often spoken about in corporate circles, but mentors can touch every facet of a person’s be ing if\ntheir wisdom is accepted and applied in diverse ways to an individual’s life. It is a process wherein\nthe Mentor and Mentee work together to discover and develop the Mentee’s latent abilities and\nencourage the mentee to acquire knowledge and skills as and when the opportunities and needs\narise.  The Mentor  serves  as a tutor,  counsellor,  friend  and foil enabling  the mentee  to sharpen her/his\nskills and increase her/his  knowledge.\nThe following guidelines show you how to make best use of your Mentoring Relationship :\n1. Getting  Acquainted\n“Fit and chemistry must be considered when pairing the mentor and the protégé.\nIf the two don't get along, it matters little what each can offer t he other  in terms of knowledge\nand skills.”\n- Michael Zey, Building a successful formal mentor program\nGetting acquainted with your Mentee over the Web can be quite convenient. If you are looking for\nways to connect online using the S IT Alumni Mentoring P rogramme, the following are a few\nsuggestions to help you get started on conversations with your Mentee:\n1. Jobs, hobbies, and extracurricular  activities.\n2. Research, projects, or career -related  accomplishments.\n3. Ways of balancing work with your personal  life.\n4. Your favourite modules in SIT, favourite book,  etc.\nDon't forget to learn about your Mentee by asking her/him questions too!\nSIT Alumni Mentoring Programme\nMentor Handbook  Page 2\nWe encourage  your  Mentee  to voice  his or her concerns  with  you,  but if your  Mentee  does  not speak\nhis/her concerns, you should certainly be comfortable with taking the initiative. In case, your\nMentee  lacks  the vocabulary  or technical  terms  to discuss  topics  or issues  with  you,  we ad- vise your\nMentee to paraphrase the questions/concerns as best as he or she can. Please be certain that you\nunderstand  what  your  Mentee  is trying  to say. Although  it might  take  several  online discussions  to\nclarify a point, your Mentee is likely to appreciate your  patience.\n2. Means to  Communicate\nThere are various ways in which you can communicate with your mentee. These include:\n1. E-mails\n2. Skype /Zoom  for audio or video  conversations\n3. Meeting in person whenever  possible\n4. SMS/ WhatsApp/ Telegram/  etc.\n3. Set Your Goals and Summarize Completed  Sessions\nTo have a successful Mentoring Relationship , we encourage the Mentees to set the pace and\ndirection for what they hope to accomplish through mentoring.\nWe hope you and your Mentee will be able to set the goals concretely before continuing with the\nmentoring. Also, we urge you and your Mentee to summarize every completed session in order to\nform new action items and goals.\nHere are some specific questions related to growth and goals:\n▪ Is there anything you wish to  develop?\n▪ Are you interested in improving your mentoring, communication, listening or  leadership\nskills?\n▪ Are you seeking greater self -awareness and fresh perspectives through the mentorin g of\nanother?\n▪ Which areas do you wish to improve?\n▪ How can I help you to achieve your goal when you graduate?\nSIT Alumni Mentoring Programme\nMentor Handbook  Page 3\n4. Ideal Traits for  Mentors\nThere are several ideal traits defined for good Mentors and Mentees. We hope the following\npointers serve as a useful refresher for your Mentoring Relationship with your Mentee.\n▪ Inspire - What makes Mentors effective may very well rest in the ability to inspire their\nMentees. By setting an example, you may be able to motivate your Mentee towards future\npaths  that are beyond  his/her  original  dreams.  Challenge  your  Mentee  to find importance  in\nwhat he/she aspires to do and help to create future visions  for themselves.\n▪ Be an Active Listener - A sign of good listening is that your Mentee feels he/she has been\nclearly heard and understood. Your Mentee feels accepted and thus places tr ust on the\nMentoring Relationship. Remembering or showing interest in things your Mentee mentioned\nin the past is one form of active listening and is likely to be appreciated by your Mentee.\n▪ Share Similar Experiences - Mentors are not expected to be superm en. Most of the time,\nthey are people who have already experienced similar situations as their Mentees. By sharing\nyour experiences, you can help your Mentee feel more empowered to deal with his/her\nchallenges  successfully.\n▪ Provide Corrective Feedback in a n Encouraging Manner - All of us have probably found\nourselves acting defensively at one time when we received feedback. Taking feedback well\nis not always easy. However, hearing it in a motivating and an encouraging tone can help\nyour mentee to accept fee dback and apply it  readily.\n▪ Speak of Your Mentee in Positive or Neutral Ways - Trusting that your discussions are\nconfidential and that the mentoring relationship is mutually supportive are important\nbuilding blocks for the Mentoring Relationship. When spe aking of your mentee to others,\nprovide only positive or neutral  comments.\n5. Effective Online  Communication\nThe term ‘ Communication ’ covers just about any interaction with another person. It includes sharing\ninformation, ideas and feelings. Communication is a two -way process. You can probably re - member\nseveral occasions when the lack of communication or miscommunication has left you feeling angry,\nor worried.\nWhile speaking to someone, whether face to face, or on the phone, you can use hand  gestures, facial\nexpressions and voice modulation for conveying your thoughts. Imagine what happens when you\ncommunicate over emails; or, when you have to communicate through online discussion boards.\nHere,  you cannot  make  use of non-textual  ways  of conve ying information;  you can only  rely on your\ntext messages.\nSIT Alumni Mentoring Programme\nMentor Handbook  Page 4\nThe following netiquette tips are critical to a Mentor - Mentee relationship:\n▪ Meaningful Subject Line - A good subject line ensures that the recipient recognises the\nimportance of your message and doesn’t delete it accidentally. Another reason is that the\nsubject line will give your Mentee a clear idea of the topic you want  to discuss.\n▪ Clear and Concise Messages - Were your Mentee’s points clear? Were you able to under -\nstand  them?  If not, ask your  Mentee  for clarification.  Asking  for a clarification  will allow  your\nmentee to restate, elaborate or reconsider her/his message. It is very i mportant that even\nyour messages are clear and  concise.\n▪ Investigating Assumptions - Even if they have not been stated explicitly, have you\nunderstood the assumptions your Mentee has made in the message? Stating your\nunderstanding of the message, or asking your Mentee to clarify his/her words can be useful\nin preventing any  misinterpretations.\n▪ Communicating about Communication - It is very important to inform your Mentee  of your\nschedule, well in advance. This prevents a communication breakdown, which would have\nresulted in unnecessary  frustration.\nWe sincerely hope that you have a fruitful online experience, as you exchange your thoughts and\nmessages with your Mentee.\n6. Ten Reminders for Effective  Mentoring\n1. Demonstrate interest, helpful intent and involvement. When you talk with your Mentee, keep\nyour mind clear. Avoid unnecessary thoughts and distractions. This will help in giving undivided\nattention to your  Mentee.\n2. Establish rapport by learning or remembering personal information about your  Mentee.\n3. Begin by  focusing on your Mentee's strengths and potentials rather than  limitations.\n4. Stay  in contact with  your  Mentee.  Even  a short  email  or phone  call can make a  big difference.\n5. Be available and keep your schedule and  appointments.\n6. Follow up continuously on your Mentee’s commitments and  goals.\n7. Don't be critical of other faculty or staff  members.\n8. Evaluate consistently the effectiveness of your mentoring and make suitable adjustments  to\nyour style of  mentoring.\n9. Be yourself and allow your Mentee to be what they  are.\n10. Remember that active listening is one of the most important skills of a good  Mentor.\nSIT Alumni Mentoring Programme\nMentor Handbook  Page 5\n7. Networking  Tips\nDeveloping  and maintaining  quality  relationships  can improve  your  life and empower  you to achieve\nyour goals. By meeting people, connecting with them, and keeping in touch, you are probably\nconstantly networking. We hope you will share some of your advice, approach and in- sight into\nnetworking with your mentee. Some suggestions on what you can  share  are:\n• You may want to let your Mentee know if you found your current job or a promotion, clients,\nor were able to complete a recent project through  networking.\n• You may want to share ideas about communication skills, such as smiling when meeting\npeople, maintaining eye contact, active listening, body language, finding common interests\nover which to connect and  complimenting.\n• You may  share  your  networking  techniques  with  your  Mentees.  Some  of the techniques  that\nyou may share may include us ing an opening line when meeting people, having a list of\ngetting -to-know -you questions or a list of ideas for casual  conversation.\n• Your thoughts on what is not considered a good networking practice may be helpful as well\nto the Mentees. For example, you can tell them why and how contacting long -forgotten\nconnections only when you need something (e.g. a job referral) is never a good practice.\nSimilarly  contacting  by coercion  or manipulation  of others  is considered  unethical  and is not\nwelcome.\n• Finally, we hope you will be willing to share your contacts with your Mentee as they might\nhelp reach his/her  goals.\n8. Suggested Activities for Mentors and  Mentees\nThe following are activities that we suggest you participate with your mentoring partner when you\nmeet him/her in person:\n• Engage in lunch meetings to discuss different subjects, including the university, classes,\nIWSP, career path and extra -curricular  activities.\n• Introduce your fellow colleagues or members from other departments that may be of\ninterest to your  Mentee.\no Tour  of workplace  and key facilities.\no Show your Mentee some of your favourite places in your area  — places he/she\nmight otherwise never discover themselves.\n• Attend cultural and sporting events  together.\nSIT Alumni Mentoring Programme\nMentor Handbook  Page 6\n9. Don't Lose Sight of Your  Goals\nThere might be times in your Mentoring Relationship when things might stagnate and a fresh\nimpetus is required. At such times, we recommend the following activities:\n• Revisit the goals that you have set for your mentoring p artner and for yourself. Are you  on the\nright track to achieve what you had set out to  do?\n• Could you have done something better? Being enthusiastic can help you and your  partner\nmove forward.\n• Do you think you need to extend the mentoring period? Learning, as they say, never  stops.\n• Re-energizing the relationship goes a long way in ensuring the success of  the partnership.\n10. Help during Periods of  Transition\nAs you and your Mentee near the completion of your Mentoring Partnership, you may wonder\nwhether your Mentee’s takeaways from the Mentoring Relationship will smoothen his/her\ntransition into future endeavours. There may still be loose ends that need to be tied up, or some\nfears about moving on.\nWe now encourage you and your Mentee to discuss about the transition from his/her current\nposition  to the post -mentoring  goals.  You may  be in a position  to help  your  Mentee  prepare  better\nfor what lies ahead and thus reduce the anxieties that he/she may have about the changes that\nawait them. Your advice could well help in realizing his/her full  potential.\nNothing can replace experience!\n11. Need for a Good  Closure\nSome  Mentoring  Partnerships  end with  the successful  completion  of learning  goals;  some  do not for\na number  of reasons.  Even  unproductive  or unsatisfactory  Mentoring  Relationships  can benefit  from\na good closure. The key to a successful closure is being prepared with an exit strategy. A good exit\nstrategy has five  components:\n• A learning conclusion (processing the learning that took place because of the relationship\nwhile working towards the achievement of learning  goals)\n• A process for integrating what was learned (a conversation focusing on how to apply the\nlearning and take it to the next  level)\n• A meaningful  way of celebrating  success  (planning  a mutually  satisfying  way to celebrate  the\nsuccessful achievement of  goals)\n• A conversation  focusing  on redefining  the relationship  (talking  about  how  the relationship  is\nto continue, whether it moves from a ‘ Professional Mentoring Relationship ’ to ‘ Col- league ’,\n‘Friendship ’, or ceases to exist  entirely)\nSIT Alumni Mentoring Programme\nMentor Handbook  Page 7\n• Moving on (both partners let go and identify ways of keeping in touch, if appropriate\nand/or mutually  desired)\n12. Provide Regular  Feedback\nIt is important to provide regular feedback on your mentoring experience and your mentoring\nrelationship to the Mentor program facilitators. Please complete the Mentor Program survey(s) and\nfeedback form(s) sent to you without failure. Feedback to the Mentor Program facilitators will allow\nthem to address your necessit ies and thus serve you better, thereby ensuring an enjoyable\nmentoring experience. Constructive feedback to your Mentee is also important as it will help her or\nhim learn more effectively and improve your Mentoring Relationship."
}