{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-19.pdf",
  "type": "pdf",
  "content": "New Ties Bring New\nOpportunities for Students\nSITizens Initiate: TEDx\nat SIT, Charity Dinner,\nand Meat-Free Mondays\nat SIT@Dover\nImagine! An App for\nAmbulances!\nLee Foundation’s\nTransformational Gift to\nSIT Undergraduates\nSIT Faculty & Staff Do\nMore Together\nDonor Inspires First-Year\nStudents with Study Grant,\nEncouragement Award\nand Valuable Life Lessons\nMarvel-lous Movie Nights,\nSITizens Make Perfect\nScents\nAlumnus Wins\nRare Internship Once a SiTizen, Always a SiTizen ISSUE NO. 19   |  MAY  2018\nWHAT’S\nHAPPENING\naround our little\nbig campus\nSITizen is a publication by the\nSIT Advancement & Alumni Division.\nFor enquiries, please e-mail us at\nAlumni@SingaporeTech.edu.sg\n© Singapore Institute of Technology 2018\nIn this issue, you will read about SIT students and alumni who are venturing out and\ncreating opportunities for themselves to do something new and change the world just a\nlittle at a time.\nThere is Mr Swe Hao Yi, a Hospitality Business undergraduate who was among the students\nto bring the very first TEDx event to SIT. The lead organiser of TEDxSIT said he and a few\nfriends had made up their minds to provide this platform for SIT, so as to “allow people\nto hear great ideas and speakers, and to let ideas take flight”. It is this same can-do spirit\nthat has spurred other groups of SIT students to launch a Meat-Free Monday campaign at\nSIT@Dover, and to hold a charity dinner to raise funds for a soup kitchen.\nThe alumni too are seizing the day to follow their passion – read more about alumnus\nLim Xing Yi and the business idea he pitched to win an internship at 2345.com, a China\ninternet portal, and about the alumni from the SIT Futsal Club who organised a trip to\nBangkok for friendlies against universities and local clubs there.\nAt the same time, current and future SIT students can look forward to new opportunities.\nA Research Collaboration Agreement with SP Group will allow Engineering and\nInfocomm Technology students to participate in the design and implementation of the\nmulti-energy micro-grid for SIT's future campus in Punggol. SIT will also train full-time\nnational servicemen in cybersecurity, thanks to a Memorandum of Understanding (MoU)\nwith MINDEF. An MoU with Kaga City will see international exchanges between SIT and\nthe Japanese city.\nTo pursue their dreams and realise their potential to the fullest, SITizens can also count\non some solid philanthropic support. In April, SIT faculty and staff turned up at the fifth\nFaculty & Staff Giving Roadshow to give their support to the SIT Bursary. In the same\nmonth, SIT undergraduates received the most transformative gift to have come their way\nas yet – a generous endowment from the Lee Foundation to ensure support for more than\n200 financially disadvantaged undergraduates at SIT, each year and in perpetuity.\nAccountancy student Nazurah Binte Mohamed Ishak is supported by the Lee Foundation\nEmergency Grant. She said, \"The Emergency Grant means a lot to me and I appreciate\nit. I am truly thankful, grateful and lucky to be one of the recipients. I will try my best to\ncomplete and excel in my studies so I can help others in the future.”\nWe hope you will enjoy reading this issue of SITizen. Should you wish to contribute a story,\ndo drop us a line at Alumni@SingaporeTech.edu.sg.Dear SIT Alumni,\nSeize the Day\nSiTIZEN  |  02/12\nNew Ties, New Endeavours\nRecent agreements open up exciting opportunities for SIT students\nResearch Collaboration with SP Group\nSIT to Train NSFs in Cyber SecuritySIT students reading degree programmes in Engineering\nand Infocomm Technology will soon be able to play\na part in the design and implementation of the multi-\nenergy micro-grid in the future SIT campus at Punggol,\nthanks to a Research Collaboration Agreement (RCA)\ninked with SP Group on 23 April.\nThe RCA follows on from the agreement SP Group\nand SIT signed on 23 October 2017 at the Singapore\nInternational Energy Week to build a multi-energy\nmicro-grid at Punggol.\n\"The first of its kind in the region, the multi-energy micro-\ngrid will also serve as a teaching and applied research\nplatform for SIT students and other stakeholders in the\nenergy ecosystem. While SIT students will undoubtedly\nbenefit through this partnership by leveraging SP Group's\nexpertise, SP Group will eventually have an industry-\nready pool of local power engineering talent that it can\ntap on as well,\" said Prof Tan Thiam Soon, President, SIT.\nWith Singapore positioning itself to be the next solar\nenergy centre in Asia, the future campus at Punggol\nwill become a living lab to test bed and support future\nresearch in distributed energy systems. Starting early next year, SIT will provide modules for\nregular service full-time national servicemen (NSFs) who\nare interested to sign up to become elite cyber specialists\nwith MINDEF’s Defence Cyber Organisation (DCO).\nThe arrangement with DCO was made possible because\nof a work-learn Memorandum of Understanding (MoU)\nthat will allow full-time NSFs to study while serving their\nNational Service (NS). The MoU was signed by Defence\nCyber Chief Mr David Koh and Prof Loh Han Tong,\nDeputy President (Academic) and Provost, SIT. This is\nthe first work-learn tie-up between MINDEF and an\neducation institute.\nThe once-a-week classes at SIT will allow cyber specialists\nto earn academic credits for an SIT-conferred degree\nin cyber security, while being deployed in advanced\ncyber defence roles such as penetration testing, cyber\nforensics and malware analysis.From left: BG Mark Tan, Director (Cyber Plans & Policy Directorate), MINDEF;\nMr David Koh, Deputy Secretary (Special Projects) and Defence Cyber Chief,\nMINDEF; Mr Ong Ye Kung, then Minister for Education (Higher Education and\nSkills) and Second Minister for Defence, and presently Minister for Education; Prof\nLoh Han Tong, Deputy President (Academic) & Provost, SIT; and Prof Tan Thiam\nSoon, President, SIT; at the MOU signing.\nInternational Exchange with Kaga City for SIT Students\nSIT students could soon choose to broaden their learning horizons in Kaga\nCity, Japan. This is thanks to a Memorandum of Understanding (MOU)\nthat was inked with the Mayor of Kaga City during his visit to Singapore in\nFebruary 2018.\nThe five-year agreement will see international exchanges between potential\nindustry partners in Kaga City and SIT. The exchanges may include the\nInternational Internship Programme (IIP), Overseas Exposure Programme\n(OEP) and the Overseas Integrated Work Study Programme (OIWSP) for\nSIT students.\nLike Singapore, Kaga City faces the challenges of undergoing an industrial\nreform through the development of Internet of Things (IoT), Big Data and\nArtificial Intelligence. The industrial scenarios present overseas opportunities\nfor our SITizens to take on district-level assignments and promote innovation\nand development in Kaga City.\nMayor of Kaga City, Mr Riku Miyamoto (left), and\nProf Loh Han Tong, Deputy President (Academic) &\nProvost, SIT, signed a five-year MOU that will pave the\nway for international exchanges between SIT students\nand industry partners in Kaga City.From left: Mr Wong Kim Yin, Chief Executive Officer, SP Group; Guest-of-Honour\nMr Lawrence Wong, Minister for National Development and Second Minister for\nFinance; Mr Brandon Chia, Head, SP Centre of Excellence, SP Group; Assoc Prof\nIvan Lee, Vice President (Industry & Community), SIT; and Prof Tan Thiam Soon,\nPresident, SIT.\nSiTIZEN  |  03/12\nBringing TEDx to SIT\nCareer Nexus and IWSP PreviewStudent-driven initiative TEDxSIT presents compelling speakers\nwith great life stories and advice to inspire and inform\nStudents gear up for internship and career opportunities at exhibitionsOn 2 March 2018, a team of SIT students from\nacross a variety of programmes inaugurated the first\never TEDx event at SIT. In the TED spirit of “ideas\nworth spreading”, the students secured a list of\ncompelling speakers with great life stories and\nadvice to inspire and inform an audience of close\nto 200 people. The evening’s speakers included Ms\nElim Chew, founder of streetwear label 77th Street,\nMr Gary Loh, Deputy Chairman of SunMoon Food\nCompany, Ms Zelia Leong, co-founder of e-commerce\nand travel start-up Anywhr, as well as frontrunners in\nthe fields of science and sports.\nLead organiser and second-year Hospitality Business\nstudent Mr Swe Hao Yi saw the conference as being\nin line with SIT’s vision of producing students who are\nThinking Tinkerers. He said, “I feel that opportunities\nOver 600 SIT students got the chance to meet more than\n110 companies to discover attractive internship and career\nopportunities during the Career Nexus and IWSP Preview held\nat Suntec Singapore Convention and Exhibition Centre on\n9 March 2018.\nThe Career Nexus event showcased graduating students\nof SIT’s overseas university partners, connecting them to\nwell-established companies such as SP Group, Infineon\nTechnologies and Continental Automotive Singapore.\nAt the IWSP Preview, students reading the SIT-Newcastle\nUniversity (SIT-NU) joint degree programmes had the chance\nto network with SIT’s industry partners. This allowed them to\nmake more informed choices for their Integrated Work Study\nProgramme (IWSP) applications and get to know prospective\nemployers such as Keppel Offshore & Marine, 3M Asia Pacific\nand Philips Electronics Singapore.\nMr Swe Hao Yi (right), Lead Organiser of TEDxSIT with the other members of the student\norganising committee.\nVisitors to Career Nexus were able to engage with representatives from\nestablished organisations such as SMRT.Mr Toh Poh Joo, Vice-President, Airport\nOperations Management, Changi Airport\nGroup, spoke at the conference and shared\nthe story of how he completed a 566km race\nthrough extreme cold weather to raise funds\nfor a good cause.\nand ideas are everywhere, but most of the time they don’t have the privilege to ‘meet’\none another which is such a waste. When my schoolmate and eventual co-organiser\nSharil first told me that SIT had never had a TEDx event before, a few friends and\nI made up our minds to provide this platform for people to hear great ideas and\nspeakers, and to let ideas take flight!”\nIn line with TEDxSIT’s theme, “Be Bold, Think Different”, Hao Yi believes the biggest\nlesson learnt from the speakers is about having grit and courage in both good and\nbad times. “It’s not just during adversities that we need to do and think differently.\nEven in good times, we must do so. If it’s the right thing to do such as doing charity,\ngiving up our seat on a bus, or helping someone in distress, and even if there is no\none doing it, we must still do it. In life, we just need to take a step forward in courage\nand faith, and our whole world can change,” he added.\nSiTIZEN  |  04/12\nA Mediterranean Voyage for a Good Cause\nSIT@Dover Gets New Meat-Free Monday Campaign CIA students hold a cruise-themed charity dinner and raise over $2,000 for charity\nWilling Hearts, which operates a soup kitchen\nFood Technology students champion mycoprotein as a nutritious, vegetarian and\nearth-friendly protein sourceOn 28 April 2018, final-year students from the\nBachelor of Business Administration in Food Business\nManagement (The Culinary Institute of America)\nhosted 85 guests at a Mediterranean cruise-themed\ncharity dinner, organised as their capstone project for\nthe Food Service Management module.\nBranding themselves as “Knotty Tours”, the students\nwelcomed guests with Spanish tapas and mocktails\nbefore serving a 3-course dinner with dishes cooked in\nFrench, Italian and Greek styles at the Temasek Culinary\nAcademy at Temasek Polytechnic. The students\nrounded off the cruise experience with a Bingo game\nand a live singing performance. Said Ms Lisa Lim, a\nguest at the dinner, “Excellent food and service from\nthe students, and great singing too! It has been an\nenjoyable evening.” The students who put it all together: (from left) Ms Ong Jing Ting, Marketing Executive,\nMr Eng Kim Tian, General Manager, Mr Linus Chee, Logistics Manager, Mr Louis Ho,\nExecutive Chef, Mr Destin Tay, Finance Manager and Mr Chester Tay, Service Manager.\nMs Seah Xin Hui’s internship at Monde Nissin\nSingapore has given her opportunities to\nexplore many aspects of Food Technology\nbusiness.Quorn™ is sold in a variety of\nforms such as meatballs (in photo),\nnuggets, meat-free mince and even\n“sausage” patties!\nHappy guests can’t wait to dig in to their main\ncourse of barramundi with fregola, charred\nbroccolini and clams.“As a group, we were inspired by the extraordinary standards of hospitality and\nfood shown by the cruise industry ,” said Mr Eng Kim Tian, who took on the role\nof General Manager for the event. “We wanted to make the event as memorable\nas possible. It provided us a huge learning experience and exposure beyond a\nclassroom or kitchen.”\nMr Eng states that he and his fellow classmates share a strong vision with Willing\nHearts, their charity of choice and beneficiary for the dinner. The charity operates a\nsoup kitchen that is mostly run by volunteers, and prepares, cooks and distributes\nabout 5,000 meals daily to over 40 locations in Singapore. Along with a booth that\nsold French pastries and merchandise from Willing Hearts at the reception, the\nevent managed to raise a total of $2061.35.\n“This event wasn’t just about cooking, serving, and allowing people to enjoy our\nfood and hospitality, it was also about contributing back to society,” said Mr Eng.\nA nutritious green protein source called mycoprotein has\nbeen introduced to SIT@Dover as part of a new Meat-\nFree Monday campaign by Food Technology students Ms\nSeah Xin Hui and Ms Esther Ong.\nXin Hui and Esther are currently on their Integrated\nWork Study Programme (IWSP) placements as Food\nTechnologists in Monde Nissin Singapore Pte Ltd. They\nstarted the Meat-Free Monday campaign to encourage\nSIT students and staff to skip meat for a day and try green alternatives. To encourage\nvegetarian food dining, they got selected stalls in the SIT@Dover canteen to\nincorporate Quorn™, their company’s mycoprotein food product, into their menus\nand recipes. Quorn meat-free meatballs, nuggets and sausages were offered by\nselected canteen vendors for the month of May.\nAccording to these third-year students, mycoprotein is derived from a naturally occurring\nfungus through the process of fermentation (similar to bread and soy sauce). High in\nprotein and fibre and low in saturated fat, it is also environmentally friendly and has a\nwater usage and carbon footprint many times smaller than that of beef.\nXin Hui, who is currently in the fifth month of her IWSP internship, says, “We hope to\nspread awareness among students about this whole new category of food that is up\nand coming in Asian markets, as well as give our vegetarian fellow students more\noptions to choose from at our canteen!”“It is heart-warming to be able\nto give back to society with our\npassion.”\nSiTIZEN  |  05/12\nLee Foundation Makes Transformational Gift to SIT\nRespected Foundation’s firm philanthropic commitment ensures permanent support for\nmore than 200 financially disadvantaged undergraduates at SIT each year\nThanks to a generous gift from the Lee Foundation to\nendow the Lee Foundation Fund at the Singapore Institute\nof Technology (SIT), SIT will be able to nurture more than\n200 financially disadvantaged students each year and in\nperpetuity. This is the single largest gift SIT has received\nsince the university was established in 2009.\nProf Tan Thiam Soon, President, SIT, says, “The Lee\nFoundation gifts are the most transformative that SIT has\nreceived so far, and will generate a positive multiplier\neffect on the future of our students, and for the industry\nand community at large in the years to come.”\nThe Lee Foundation Fund, which was first established\nat SIT in 2017, will now enable SIT to award the Lee\nFoundation Bursary and the Lee Foundation Emergency\nGrant – annually and in perpetuity – to deserving\nundergraduates.\nEach Lee Foundation Bursary is valued at $6,220 and will\nbe used to support the recipient’s tuition fees. The Lee\nFoundation Emergency Grant can be used for overseas\nexposure/immersion programmes conducted by SIT,\nImproving Access to Private Ambulances – A Mobile Application Software Framework\nBy Chin Zhi Qiang, Fendi Tan, Nicholas Lim Wei Meng, Nicholas See Wee Kiat, Ong Por Yee, Revian Kesuma, Shevaun Koh Wei Lin,\nTay Li Hong, Yeo Xiaoting\nBachelor of Engineering with Honours in Information and Communications Technology (Software Engineering)\nScreenshots from the 1777 Ambulance Booking App which is still being incubated. The interface\nis intuitive and will be familiar to users who use ride-hailing apps.emergency ambulance services by optimising\nthe efficiency of services provided by private\nambulances. Users can request for ambulances\nwith the equipment they need and see the costs\ninvolved. An algorithm will locate the nearest\navailable vehicle for them. Users also need not\nbe in the same location as the patient to request\nan ambulance.\nThis can potentially reduce the volume of non-\nemergency calls received through the emergency\nhotline, allowing more bandwidth for operators\nto handle emergency cases.\nGraduating student Mr Nicholas See Wee Kiat\nsaid that the team worked with emergency room\nphysicians from various public hospitals, medical\nprofessionals and private ambulance companies\nto gather requirements and test the app. He\nexplained, “Private ambulances provide different\nmedical services, hence hotline operators have\na difficult time matching requestors to private\nambulances that could provide what they need.”\nHe added that the app was well-received, with\ngreat interest shown in taking up the app for\ntheir operations. An App for AmbulancesHow to improve access to private\nambulances? SITizens figure out\na nifty way miscellaneous educational expenses, as well as allowance\nfor meals and transportation. The Emergency Grant has\na quantum (of up to $5,000) that is determined based on\nthe need of the recipient.\nBoth the Bursary and Emergency Grant are applicable to\nSingapore Citizens and Singapore Permanent Residents\npursuing a full-time undergraduate degree programme\nat SIT.\nMs Jasmine Lee from the Physiotherapy programme is\namong the first students to receive the Lee Foundation\nBursary at SIT. Expressing her gratitude to the\nFoundation, she said the Bursary will help alleviate her\ncurrent financial situation. She said, “The Lee Foundation\nBursary also gives me an opportunity to continue pursuing\nmy dream and complete my university studies, alongside\nmy friends,\" she added.\nThe Lee Foundation was founded in 1952 by the renowned\nphilanthropist and business leader Tan Sri Dato Dr Lee\nKong Chian for the advancement of education, healthcare\nand cultural activities, and other social causes.\nIMAGINE!\nApart from the Emergency 995 Hotline, Singapore’s main phone\nline for government medical services, the 1777 Hotline is also\navailable for non-emergency cases, working with over 100 private\ncommercial ambulance operators with differing capabilities and\nservices. However, many non-emergency calls are still being\nreceived through the emergency hotline.\nThe 1777 App, a mobile application similar to popular ride-\nhailing apps used today, aims to raise the usage of the non-\nBesides teaching and serving, many SIT faculty and staff\ngive generously to lend a helping hand to their students\nthrough the Faculty & Staff Giving (FSG) initiative. Through\nthis, they not only offer financial aid, but also let students\nknow that they will be there to support their growth in more\nways than one. Last year, faculty and staff raised more than\n$82,000 in support of the SIT Bursary, making possible 27\nBursaries for financially disadvantaged students at SIT.\nIn appreciation for their support, the fifth Faculty & Staff\nGiving Roadshow was organised on 25 April 2018 at SIT@\nDover campus. Participants were treated to doughnuts,\ncoffee and freshly fried vadai with green chillies. Doing More, Together\nSIT employees give students their heartfelt\nsupport at the fifth Faculty & Staff Giving\nRoadshow\nAt this year’s Faculty & Staff Giving Roadshow, donors received a small token for\ntheir big-hearted support of SIT students: a tiny pouch shaped like a mini-backpack.\nSIT faculty and staff came down to University Tower to show their support and enjoy a quick tea break before\nheading back to work.\nSITizens giving back – SIT Bursary recipients had the chance to thank Prof Tan Thiam Soon, President, SIT (second\nphoto, left) and other SIT faculty and staff members for their support.\nAttendees happily queuing up for their snacks and coffee. Snacks for tea time: freshly cooked vadai served\nwith green chillies, as well as doughnuts and coffee. SiTIZEN  |  06/12\nPast recipients of the SIT Bursary\nwere present as well, serving\nsnacks to faculty and staff and\nchatting with them to share how\nthe Bursary had helped them\nin their studies. Said Bursary\nrecipient and final-year student Mr\nHarikrishnan Panayamthatta from\nthe Bachelor of Engineering with\nMechatronics degree programme,\n“I would like to thank all the\ndonors and SIT lecturers and staff\nwho made a difference in students’\nlives, including mine. These acts of\ngenerosity inspired me to help others and give back to the\ncommunity, and the bursary also helped fund my school\nfees which was essential for me to complete my studies.\nThank you again for your generosity and support.”\nSenior Librarian Ms Joan Wee, one of the donors to\nthe SIT Bursary, believes that though a single person’s\ncontribution may not be enough to help everyone, the\ncollective efforts of many can positively impact students’\nlives. She said, “I live by the ‘starfish’ motto. My donation\nmight only make a 10 per cent difference to a student’s\nlife but at least I know I’ve done something instead of\nnot doing anything. With another nine SIT staff or faculty\njoining together, we can make up a 100 per cent difference\nto that student’s life.”\nSiTIZEN  |  07/12\nStudent Leaders Welcome Spring at SFCCA Reception\nSIT student leaders with Mr Patrick Lee (front row, fourth from left), President of Yangzheng\nFoundation, wishing all a Prosperous Lunar New Year at the Spring Reception 2018.To usher in the Lunar New Year, 14 student\nleaders from the Singapore Institute of\nTechnology (SIT) attended the Spring Reception\n2018, organized by the Singapore Federation\nof Chinese Clan Associations (SFCCA) at\nthe Singapore Chinese Cultural Centre. Mr\nTeo Chee Hean, Deputy Prime Minister and\nCoordinating Minister for National Security\nwas the Guest-of-Honour at the event which\nsaw close to 1,000 guests.\nSaid Ms Maizurah Binte Hamzah who is from\nthe Early Childhood Education programme, \"It\nwas an opportunity for me to learn and expose\nmyself to a different culture and celebrate the\ndiversity of cultures that we have in Singapore.\nThrough the exhibitions, sing along sessions\nand performances put up, I gained a better\nunderstanding on some practices from the\nChinese community that are not commonly\nseen in our modern society such as fan making\nand calligraphy art.\"\nRecipients of the Lim Doa Hin Study Grant and the Lim Doa Hin Encouragement\nAward at the Singapore Institute of Technology (SIT) were especially thrilled\nto have lunch with the family members of the late Mr Lim Doa Hin, as well\nas the Executors of The Estate of Lim Doa Hin on 21 February 2018. Hosted\nby Prof Tan Thiam Soon, President, SIT, the lunch gave the recipients an\nopportunity to thank the donors in person and to get to know the people\nwhose support made possible the Study Grant and Encouragement Award.\nMs Wai Chao Qun, a first-year student from the Hospitality Business\nprogramme, said the donors shared their life experiences and gave the New Gifts to Inspire First-\nYear SITizens\nSIT students will be nurtured in perpetuity by the Lim Doa\nHin Study Grant, thanks to generous term and endowed gifts\nfrom the late Mr Lim’s estateRecipients of the Lim Doa Hin Study Grant and the Lim Doa Hin Encouragement Award, together with the\nmembers of the Lim family, the executors of the late Mr Lim's Estate, Prof Tan Thiam Soon, President, SIT, and\nSIT faculty.\nrecipients encouragement and\nadvice during the lunch. Added Mr\nHoe Feng Ting who is pursuing an\nInformation and Communications\nTechnology (Information Security)\ndegree, “After listening to stories\nfrom the donor’s family, I was inspired\nto plan ahead and utilise my time in\nuniversity to the fullest.”\nBoth Ms Wai and Mr Hoe are\nrecipients of the Lim Doa Hin\nEncouragement Award.\nThe Lim Doa Hin Study Grant was\nfirst established at SIT in July 2017.\n“I faced difficulties in polytechnic\njuggling part-time work and my\nstudies, so receiving the Study Grant\nhas allowed me to stop taking part-\ntime jobs, letting me concentrate\nmore on my studies,” said Ms\nFoong Wei Ling, an Accountancy\nundergraduate who received the\nStudy Grant.\nBorn in China in the 1920s, Mr Lim\nDoa Hin sailed to Singapore after\nWorld War II. He had only spare\nchange in his pocket and rags as\nclothing but, undeterred, he rose to\nbecome a successful and reputable\nTeochew businessman. Despite his\nachievements, Mr Lim remained\nhumble. He always remembered the\nneed to contribute back to society,\nespecially to help exemplary students\nwho require financial assistance in\ntheir educational needs.\nSiTIZEN  |  08/12 SiTIZEN  |  09/12\nWith the release of two of the most anticipated superhero\nmovies of the year, fans of the Marvel Cinematic Universe\nwere in for a treat at the two SIT Alumni Movie Nights\nheld this year. A signature event by the SIT Alumni Leisure\nNetwork, the screenings were held on 22 February and 10\nMay 2018, featuring Black Panther and Avengers: Infinity\nWar respectively. This year, the events were held at a new\nand bigger venue at Shaw Lido to accommodate the\ngrowing audiences.\nEach event saw over 250 alumni attending, with many\ncoming straight from the office to get their tickets and\ncatch-up with their friends and SIT faculty. As per movie\nnight tradition, there was also a namecard drop lucky\ndraw at each of the movie nights, and several lucky alumni\nwon $10 Isetan and Takashimaya vouchers.\nAttending the February event for the first time was Ms\nShang Kuan Ke Xin, who graduated last year from SIT’s\nAccountancy programme. “I enjoyed the movie! I like the\nfact that SIT chooses interesting movies to screen, and\nI got to catch up with my professors and friends that I\nhaven’t met since graduation.”\nMr Pang Wen Jie, a Marvel fan who graduated in 2016\nwith a Bachelor of Engineering with Honours in Electrical\nPower Engineering (Newcastle University), has been\neagerly following the superhero movies. “I like to read\nthe comics, and it’s great to see the comic characters we\nlike come to life on screen,” he said. “Infinity War was\ndefinitely a movie I’ve been looking forward to and it was\nworth the wait.”Such Marvel-lous Nights\nHave Team, Will Travel Friends gathered together for a fun movie night out!\nSIT alumni futsal players, decked out in red with the team from Bangkok University.Hungry alumni fuelling up at the buffet reception before the movie.\nA mixture of emotions as alumni follow the adventures of the Avengers on-screen.\nAssoc Prof Alfred Tan (extreme left), Programme Director, SIT, catches up with his former\nstudents over dinner.\nPopcorn and soda are must-haves when you’re watching a movie. Assoc Prof Jeanette Ng (extreme left), Cluster Director, SIT, and Prof Loh Han Tong\n(extreme right), Deputy President (Academic) & Provost, SIT, bond with alumni.\nTime for a quick selfie before catching the adventures of the King of Wakanda.\nProf Tan Thiam Soon, President, SIT, together with alumnus Mr Owen Tan.\nArmed and ready for Infinity War!\nAlumni Movie Night: Black Panther\nSITizens collecting their tickets for the movie with the help of our friendly student hosts.\nAlumni Movie Night: Avengers: Infinity War\nMr Owen Tan, an alumnus from the Food and Human Nutrition\nprogramme (Newcastle University), enjoyed the opportunity\nfor “a rare catch up” with his fellow SITizens at the buffet\nreception before the movie. He also had a chance to speak\nwith Prof Tan Thiam Soon, President of SIT, who attended\nthe SIT Alumni Movie Night for the first time this year at the\nMay event. “It’s a great platform for the alumni to interact\nwith senior management, and at the same time obtain more\nindustry knowledge,” said Mr Tan.\nAlumni from SIT’s Futsal Club are not only continuing\nto keep in touch, they are also embarking on overseas\nadventures together. Over four days from 3-6 May 2018,\n12 alumni travelled to Bangkok, Thailand to participate\nin friendly games against Bangkok University and Kasem\nBundit University, as well as local clubs.\nMr Karthigesan S/O Murukan, who graduated from the\nAeronautical Engineering programme in 2016, said it was\nthe first time that they went to play overseas together and\nit drew the team closer. He said, “The people from the\ndifferent universities in Bangkok hosted us warmly and we\ntook this chance to interact and grow our network while\nwe were there. It was overall a unique experience where\nwe were exposed to a higher level of futsal playing as well\nas an opportunity to understand each and every one in\nthe team better.”\nHe added that the alumni plan to compete in Singapore\nsoon and are looking forward to planning a trip to Japan\ntowards the end of this year.The most anticipated blockbuster movie events\nof the year leave SITizens enthralled\nSiTIZEN  |  10/12\nThe 31 student hosts in this photo are usually busy hosting\nour graduates at SIT’s Advancement and Alumni events – but\non Saturday, 3 March 2018, it was their turn to be entertained\nand feted at the annual Volunteers’ Appreciation Brunch for\ntheir steadfast and passionate volunteering.\nDespite their busy schedules, many found time to\ncontribute to the success of events such as the Recognition\nof Excellence and New Alumni Welcome Party last year,\nand most recently, Alumni Movie Night. This year’s brunch\nwas held at Montana Singapore, where these student\nSITizens were treated to a variety of burgers, pastas, and\nindulged in waffles with ice-cream for dessert.\nAttending the appreciation for the first time was\nMs Megan Lau, a Year 2 student pursuing SIT’s Bachelor\nof Science with Honours in Occupational Therapy degree.\n“I enjoyed it! It was interesting to meet other volunteers\nbecause usually during events you don’t have much time\nto interact with other volunteers.” She has been a regular\nstudent host at Alumni Movie Nights and the New Alumni\nWelcome Party. Big smiles after a filling and satisfying meal!\nMr Caven Chiok, now a Year 3 student in SIT’s Bachelor of\nEngineering with Honours in Pharmaceutical Engineering\ndegree programme, started as a student host in 2016.\nHe recently volunteered at the Scented Candle Making\nWorkshop in April (see top story). “I enjoy getting involved\nat events and being able to learn at the same time,” he said,\n“Plus, volunteering allows me to socialise with people from\nother courses, which is great.”Thank You\nVery Brunch!Student hosts who play a key role at SIT’s Advancement\n& Alumni events come together for an afternoon of\nfood, laughter and pure appreciationThirty-nine SIT Alumni spent a\nSaturday afternoon crafting their\nvery own candles at the Scented\nCandle Making Workshop on\n7 April 2018, held at Novotel\nSingapore on Stevens. Organised\nby the SIT Alumni Leisure Network,\nthe workshop was conducted by\nSally’s Room, which specialises in\nhandmade natural candles.\nTo spruce up their candles, the\nparticipants took their pick of an\nassortment of dried flowers and tiny\nnautical-themed trinkets like seashells\nand penguins to line the bottom of\ntheir candle jars, along with fragrance\noils such as Maple Vanilla and Scandinavian Woodlands. The final\ntouch was a personalised “hidden\nmessage” written on a ring of paper,\nwhich would only be revealed once\nthe candle was lit.\n“I loved the workshop because it was\nso fun and therapeutic,” said Ms Siti Nurhidayah, who graduated in 2015\nwith a Bachelor in Science (Radiation\nTherapy) degree from Trinity College\nDublin (TCD). “I came with three\nfriends and we rarely have time to\nmeet, so this activity gave us a chance\nto spend quality time together. Best\npart was that we got to bring home\nwhat we made!”\nThe participants also enjoyed a bonus\nactivity where they painted scented\nclay ornaments made from moulds.\nMr Neo Jun Hwee, who graduated\nfrom The Glasgow School of Art’s\nCommunication Design programme\nin 2017, said, “I personally enjoyed\npainting the clay ornaments because\nI did arts, painting in particular,\nduring secondary school. I thought\nit was a nice workshop, it was very\nengaging. I hope there will be more\nof such DIY workshops in the future.”Making Perfect Scents\nAlumni get crafty by making their own candles and cute clay\nornamentsGetting ready to melt the soy wax after arranging their decorations! Happy SITizens with their completed candles and clay ornaments.\nCompleted clay ornaments made from moulds and\nmeticulously painted by the alumni.\nSiTIZEN  |  11/12\nAlumnus Mr Lim Xing Yi was one of the nine students from\nthe six autonomous universities in Singapore to win an\naward at the inaugural Singapore Valley Awards (SVA) – an\nannual entrepreneurship award to promote innovation and\nentrepreneurship among undergraduates in Singapore.\nAt the competition, Mr Lim, who is from SIT’s Information\nand Communications Technology (Software Engineering)\nprogramme, pitched his business idea Wande to a Alumnus’ business idea leads to an internship with China internet portal, 2345.com\nMr Lim Xing Yi wowed the judges with his idea, Wande, to provide a one-stop\nmarketplace to link service providers directly with consumers.\nA Better Florist\n• 20%  off total bill at\nhttp://www.abetterflorist.com\n• Key in the code ‘ ABFSIT20 ’ at checkout\n• Valid until 16 August 2018\nAngelFlorist\n• 10%  off total bill with minimum purchase\nof $80 at www.angelflorist.com\n• Key in the code ‘ AngelSIT18 ’ at\ncheckout\n• Valid until 31 August 2018\nAtlas Eye Specialist Centre\n• Pre-LASIK evaluation: $19\n• LASIK surgery (2 eyes) starts from $2,999\n• Cataract Assessment: $86\n• General Eye Screening: $107\n• Not valid with other promotions,\ndiscounts, vouchers or card and rebate\nprivileges, unless otherwise stated\n• Valid until 31 May 2018\nBattlestrike\n• 10%  discount\n• Additional 5% discount if the session is\nconducted within SIT permitted premises\n• Valid until 30 September 2018SIT Alumni Card BenefitsGoing Places with His Business Idea\nCrunchie Cookies\n• $2 off every $30 spent for cookies\n• Participating outlets: 321 Alexandra\nRoad. Unit #01-01 Alexandra Central.\nS(159971)\n• Valid until 1 October 2018\nEthan Men\n• 20%  off total bill for regular priced-items\n• Participating outlets: 333 Kreta Ayer Road\n#02-32 S (080333)\n• Valid until 31 December 2019\nFloral Garage Singapore\n• 10%  off total bill at\nwww.floralgaragesg.com\n• Key in the code ‘SIT010’\nGifts Less Ordinary\n• 5% off total bill at checkout with code\n‘SITU’\n• Valid until 31 October 2018\nKitchen Capers\n• 10%  off bakeware tools/packaging\nneeds/books/DVDs\n• 5% off food/ingredientsShopBack\n• $10 Benefit\n• Up to 18.0%  Cashback when shopping\nwith selected partners\n• Visit https://www.shopback.sg/  for\nmore details\nSingapore Hospitality Group Pte. Ltd.\n• 15%  Off ‘All You Can Eat’ Buffet Special\n• Buffet Lunch: S$25++  per person\n(Mon-Sun: 12pm – 2.30pm)\n• Buffet Dinner: S$35++  per person\n(Mon-Sun: 6.30pm – 10.30pm)\n• Participating outlets: The Landmark @\nVillage Hotel Bugis, Royal Palm @ Orchid\nCountry Club\n• Valid until 31 May 2018\n• Table reservation via phone call to the\nrestaurant is required\nThe Braces Practice Pte Ltd\n• Discounted rates for various braces options\n• Valid till 31 October 2018\n*Please present your SIT Alumni Card prior to making\npayment. Terms and conditions apply. Please refer to\nhttp://sl.singaporetech.edu.sg/Welfare/SITreats.aspx\nfor detailed terms and conditions.panel of judges, which included founders of Chinese\ntech companies 2345.com and Kingnet as well as\nventure capitalists. Wande is a solution for freelancers,\nhousewives, retirees and students in today’s growing\nsharing economy. Mr Lim was inspired by the rising trend\nof young adults being part of the ‘gig economy’. The\n31-year-old proposed a mobile application which links\nboth service providers and consumers for a wide range of\nservices like cooking, photography, driving lessons and\neven pet sitting.\nHe won a three-month internship at 2345.com, a China\ninternet portal, and will also receive $2,000 each month\nfor the duration of his internship. Said Mr Lim who is\ncurrently in Shanghai for the internship, “This is an\nexcellent opportunity as the internship will give me first-\nhand access to China’s start-up ecosystem and culture.”\nAs an undergraduate, Mr Lim participated in SIT’s\nEntrepreneurship Development Programme which\nexposes students to entrepreneurship and the world of\nbusiness. He hopes to start his own company one day\nand added, “I’m passionate in creating something that\nis useful and valuable to the community. I like to think\nof ideas that can solve some pain points or enhance our\nlives. Being in software engineering allows me to create\nlow-cost prototypes to test out my ideas.”\nLorem ipsum\nLEARN life-saving skills and render assistance in times of need\nSHARE positive messages and help maintain racial and religious harmony\nLOOK OUT  for and report suspicious characters, behaviours or objects to the police\nVOLUNTEER my service as a first aider, counsellor and/or a care giver\nDONATE blood\nPROVIDE food, shelter and/or donations\nI PLEDGE TO STAY ALERT, STAY UNITED, STAY STRONG AND\nCONTRIBUTE IN THE FOLLOWING WAYS TO PROTECT\nOUR WAY OF LIFE:\nI WOULD LIKE TO DO MORE FOR OUR COMMUNITY:YOUR PLEDGE  CAN\nHELP SOMEONE\nPLAY A PART TO SAFEGUARD OUR\nHOME FROM ANY TERROR ATTACK\nVISIT YOUR NEAREST COMMUNITY CLUB/ CENTRE\nTO COLLECT A PLEDGE CARD OR VISIT\nWWW.PA.GOV.SG/SGSECURE_PLEDGE TO PLEDGE ONLINE"
}