{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-20.pdf",
  "type": "pdf",
  "content": "Once a SiTizen, Always a SiTizen ISSUE NO. 20   |  AUGUST  2018\nWHAT’S\nHAPPENING\naround our little\nbig campus\nSITizen is a publication by the\nSIT Advancement & Alumni Division.\nFor enquiries, please e-mail us at\nAlumni@SingaporeTech.edu.sg\n© Singapore Institute of Technology 2018\nDear SIT Alumni,\nFirst Shared Facility\nfor Small Batch\nFood Production\nHealth and Social Sciences\nStudents Spread Healthy\nLiving Message in Punggol\nNurses’ Day\nCelebrations at SIT\nWheelock, GSA and\nTUM Graduates Step Out\nSIT Team Wins\nEldercare “Oscar”\nBigger Annual\nAlumni Beanfeast\n84 Seeds for Change\nNew Scholarships to\nNurture Excellence\nLearning in a (Non)\nDestructive Environment\nWinning Big by Skill\nand DesignHow can SITizens build an invincible career in the era of Artificial Intelligence? This important\nquestion was the theme of the panel discussion at SIT’s Annual Alumni Beanfeast, held in July\nthis year at the Marina Mandarin Singapore. Created last year for the pioneer Accountancy\ngraduates, the Beanfeast grew into a special occasion for current and future alumni from\nvarious programmes this year, drawing a record number of nearly 300 attendees. SITizens\nwere excited to interact with the distinguished panellists, as well as SIT’s philanthropic and\nindustry partners who have supported their education in various ways.\nFor SIT’s students, such support is growing – the university’s donors have recently made\npossible four non-bonded scholarships to nurture academically promising students at\nSIT. Three of these scholarships are permanent as they are supported by endowed gifts.\nStudents at SIT who receive scholarships are also getting more opportunities to meet their\ndonors. For example, 21 of SIT’s students and alumni who received the KKH Scholarship\nand Wilmar Scholarship got to meet Mr Kuok Khoon Hong, Chairman and CEO of Wilmar\nInternational, at an appreciation tea on 8 August to benefit from his shared experience and\ninsights. (Two of the earliest non-bonded scholarships to be established at SIT, the KKH\nScholarship and Wilmar Scholarship have nurtured 84 students to date.)\nIn this issue, we also catch up with Ms Denise Tong, a Sustainable Infrastructure\nEngineering (Land) alumnus, who looks back at the immensely educational experience\nshe had as a student while working for SETSCO Services Pte Ltd, one of SIT’s Integrated\nWork Study Programme partners.\nIt is no wonder that more SITizens are finding success in their endeavours with such\nwide-ranging support. Mr Lee Liming and Mr Teo Tze Hau, both graduates from the\nInterior Design programme, were lauded at the Singapore Interior Design Awards.\nUndergraduates from SIT’s Sustainable Infrastructure Engineering programmes became\nthe first varsity students to win bronze in the Rapid Transit Systems category at WorldSkills\nSingapore. Other students, guided by SIT faculty, are coming up with innovations to help\nthe elderly, such as the ʋArm and the Smart Walker (the latter won “Best Smart Care\nTechnology – Product” at the 6th APAC Eldercare Innovation Awards 2018).\nAt the same time, SITizens continue to serve the community. Since November last year,\nHealth and Social Sciences students have been out in Punggol giving physiotherapy advice\nto residents, and more recently in June, they conducted a population health survey among\nPunggol residents.\nWe hope you will enjoy reading these reports and more in this issue of SITizen. Should you\nwish to contribute a story, do drop us a line at Alumni@SingaporeTech.edu.sg .Sweet Taste of Success\nSiTIZEN  |  02/12\nSingapore Gets First Shared Facility\nfor Small Batch Food Production\nTo be operated by SIT, JTC Food Hub @ Senoko will help\nfood companies reduce capital and operating costs\nJTC officially opened its Food Hub\n@ Senoko, a purpose-built facility\nthat will be home to an ecosystem of\nplayers in the food industry. Mr Chee\nHong Tat, Senior Minister of State for\nTrade and Industry, and Education,\ngraced the official opening ceremony\nheld on 31 July 2018. A Memorandum\nof Understanding was signed\nbetween Enterprise Singapore,\nJTC and the Singapore Institute of\nTechnology (SIT) to set up the shared\nfacility for small batch production to\nsupport innovation in the industry.\nJointly conceptualised with the\nSingapore Food Manufacturers’\nAssociation (SFMA) and Singapore\nManufacturing Federation (SMF), JTC\nFood Hub @ Senoko is designed to\nhelp food companies reduce capital\nand operating costs. A key feature\nis an integrated cold room and\nwarehouse facility (CWF) that tenants\ncan tap on a pay-per-use basis. The\nshared CWF is operated by StorBest\n@ Senoko Pte Ltd, which also offers\ndistribution services that tenants can\nuse instead of investing in their own\ndelivery fleets.\nTargeted to be operational in end-\n2019, the facility aims to help food\nmanufacturers overcome challenges –\nsuch as lack of facilities, costly equipment\nand high minimum order requirements\nfrom outsourced manufacturers when To be operated by SIT, the 1,130 sqm Food Hub @ Senoko will make\navailable production rooms and food processing equipment (e.g.\nspray dryers1, extruders2 and advanced equipment such as Microwave\nAssisted Thermal Sterilisation (MATS)3 and Pulsed Electric Field (PEF)\nequipment4) for companies on a pay-per-use basis. This will allow food\nmanufacturers, especially start-ups and SMEs, to validate new products\nafter research and development and test their commercial viability\nbefore leaping into full-scale production.\nThere will also be workplace training courses and seminars at Food\nHub for industry players to deepen technical capabilities, such as those\nin emerging food technologies, through the Food Skills Development\nProgramme (FSDP), a programme that is supported by SkillsFuture\nSingapore and developed with Enterprise Singapore.Witnesses (standing, from left): Mr David Tan,\nPresident of Singapore Food Manufacturers’\nAssociation; Senior Minister of State Mr Chee Hong\nTat; Mr Ng Lang, CEO of JTC; Mr Douglas Foo,\nPresident of Singapore Manufacturing Federation.\nSignatories (seated from left): Ms Chew Mok Lee,\nACEO of Enterprise Singapore; Associate Professor\nIvan Lee, Vice President (Industry & Community), SIT;\nMr Alvin Tan, ACEO of JTC.\n1 Spray drying: Technology to convert liquid into dry powder form via rapid drying with\nhot gas. Supports innovation of powder-form products that are more exportable and\ncost competitive.\n2 Extrusion – Technology widely used in the production of pasta, ready-to-eat cereals, snacks,\npet food and textured vegetable protein.\n3 Microwave assisted thermal sterilisation: Advanced technology that kills bacteria.\n4 Pulsed Electric Field – Advanced non-thermal technology that uses high bursts of electrical\npulses to inactivate bacteria in food. It is suitable for liquid food products that MATS and\nretort cannot handle.\nDisruption, Competition,\nand AccountingOn 28 June 2018 at the SIT@Dover campus, 44 students from\nseven ASEAN universities participated in data analytics\ntraining and competed in a business simulation competition.\nThe budding accountants played the role of a C-suite\nexecutive, made real-time business decisions, strategised\nand managed their own P&L statements. The team from\nAteneo de Naga University, Philippines, emerged champions\nat this simulation competition – the first to be incorporated\nat the ASEAN Accounting Education Workshop (AAEW)\nmeeting that was organised and hosted by SIT.\nApart from the competition and the meeting, the two-day\nevent also included the SIT Symposium on Application of\nTechnologies in Accounting Education.\nThe symposium was attended by 150 participants from\nvarious ASEAN universities, as well as accounting professional\nbodies, industry practitioners and education publishers.\nAmong other topics, the symposium discussed how future\naccountants will need to hone their expertise through digital\neducation in the face of technological disruption, as well as\nhow ASEAN and the profession can embrace technology\namidst the current wave of digital transformation.\ncommercialising new products\nafter research and development –\nin the development and scalable\nmanufacture of new food products.\nThe facility is an initiative under\nFoodInnovate, a multi-agency\nworkgroup that looks at catalysing\nco-innovation and knowledge\nexchange among stakeholders in the\nfood manufacturing industry.\nStrengthening Food Innovation\nSiTIZEN  |  03/12\nSITizens Spread Healthy Living Message in Punggol\nNightingales in the CommunityResidents get some help from SIT’s Health Sciences students to embrace a healthy lifestyle\nCommunity healthcare, the theme of Nurses’\nDay 2018 celebrations at SIT@Dover\nOn 3 August 2018, more than 150 nurses (including eight\nSIT alumni) from across the various healthcare sectors in\nSingapore gathered at SIT@Dover for Nurses’ Day 2018.\nOrganised by the Bachelor of Science in Nursing with\nHonours degree programme (jointly offered by the\nSingapore Institute of Technology and University of\nGlasgow) for the second year running, the day’s programme\nfeatured talks by Guest-of-Honour Professor Lee Chien\nEarn, CEO, Changi General Hospital (CGH) and Deputy\nGroup CEO (Regional Health System), SingHealth, as well\nas Ms Paulin Koh, Chief Nurse, CGH and Deputy Group\nChief Nurse, SingHealth.\nProf Lee, who spoke on the topic “Beyond Hospital to the Residents getting active thanks to tips from SIT’s\nphysiotherapy students.\nOn the first weekend of June 2018, Nursing students from SIT’s Health\nand Social Sciences (HSS) Cluster conducted a population health survey\nin digital health literacy with the residents at Edgefield Plains in Punggol.\nStudents also distributed health promotion messages at block parties\nat Punggol Link, Sunrise and Damai estates that were co-organised with\ngrassroots organisations.\nWith student-produced health posters, games, skits, videos and talks, they\ntouched on a variety of topics such as binge drinking, diabetes, antenatal\ncare, pneumococcal vaccination, colorectal cancer screening and\ndepression. MP for Pasir Ris-Punggol GRC, Dr Janil Puthucheary, Senior\nMinister of State, Ministry of Transport & Ministry of Communications and\nInformation, graced the event.\n\"Thanks to the physical fitness screening by the students, I now realise\nmy level of fitness. Since then, I have heeded the advice on regular\nphysical activities, and I felt my life transformed!\" said Ms Lam Lee Choo,\na grassroots participant.\nSIT’s Allied Health students have also been actively collaborating with\ngrassroots organisations to promote healthy living habits in Punggol –\nwhich will be home to SIT’s permanent campus in a few years.\nLast November, a group of 15 second-year students reading the joint SIT-\nTCD Physiotherapy degree programme put their training into practice in\nthe Punggol community. As part of their curriculum, students organised a\n'Let's Get Active' day where they gave professional physiotherapy advice\nto residents of Edgefield Plains.\nSaid Mr Chong Koh You, Chairman, Punggol Coast Community Sports\nClub, People's Association, \"Although this collaboration gives SIT\nPhysiotherapy students a chance to practise their skills, it also serves as\na platform for residents to bond over this meaningful activity and foster a\nwarm kampung  spirit.\" Divided into four stations, residents had\nan opportunity to test their strength,\nflexibility, balance and endurance, with\nguidance and demonstrations from\nstudents.\n\"This exercise shows me that dealing with\npeople may not be so straightforward,\nand that it requires skills, especially in\nthe area of advising them on change\nin lifestyle habits to attain a healthier\nbody,\" said Mr Chiang Ji Long.\nHis classmate, Ms Lee Pei Shan, echoed\na similar sentiment, \"We are very happy\nthat we can give back to the community\nthis way. This experience has taught\nme how to be skilful in giving advice,\nespecially to the elderly who may not\nunderstand English.\"\nThe students recited the Singapore Nursing Board Nurse’s\nPledge to reaffirm their dedication to caring for the sick,\nregardless of race, religion or status.Community”, said SIT was right\non target to have a “community”\ntheme for this year’s celebration,\nadding that CGH’s mission is\n\"partnering communities to keep\nwell, get well and age well.\"\nSpeaking on “Community Nursing\nDevelopment in CGH”, Ms Koh\nsaid the focus on person-centred,\nholistic care meant that nurses had\nevolved to embrace new roles –\nfrom preventive care, to acute and\nchronic care, and intermediate and long-term care services. Nurses had been making inroads\ninto preventive care within communities through health\neducation programmes based on promoting healthy living\nand preventing health problems.\nA third highlight of the day was “Community Nursing in\nGlasgow”, a presentation by some students who shared\ntheir takeaways from their four-week Overseas Immersion\nProgramme at their home campus in Glasgow, where they\nlearnt how patients were transitioned from hospital care to\ncommunity care.\nSaid nursing student Ms Evangeline Tan Si Hui (Khoo Teck\nPuat Hospital, National Healthcare Group), “In Glasgow,\npractitioners seem to have more autonomy. Patients are\nhappy and content on consulting nurses. Although in\nSingapore, it will take more time for patients to adopt\nthis mindset, there has been lots of progress made.\nNurses now have greater clinical accountability and more\nauthority to make decisions. There are nurse-led clinics\nwhere the nurses perform tasks\nnormally done by doctors, such as\nmonitoring adverse drug reactions\nand issuing repeat prescriptions\nfor medication.”\nThere was also a poster\npresentation by students on\nthe expanded roles of nurses in\nSingapore, and on their health\ninnovation and informatics projects.\nSiTIZEN  |  04/12\nTaking Their Next Step\nFrom May to July 2018, more than 270 students at SIT received their degrees in Early Childhood\nEducation, Communication Design, Interior Design, Electrical Engineering & Information Technology\nand Chemical Engineering\nThe Wheelock College Commencement 2018 that took place on\n30 May 2018 marked the graduation of the final batch of 64 students from\nthe Bachelor of Early Childhood Education degree programme at SIT.\nMs Esther Chua and Ms Faith Yee were lauded as valedictorians of the\ngraduating class while both Ms Tan Xiao Xian Lydia and Mr Muhammad Hadi\nBin Kamal received the Most Significant Contribution to the Program Award.\nMs Yee said she never imagined herself graduating as valedictorian.\n“The professors have taught me that an educator’s job is not just to teach.\nI learned that it is more important to help your students cultivate a love\nfor learning and make them feel valued,” she added.\nAttending the ceremony at SIT@Dover were Prof Tan Thiam Soon,\nPresident, SIT, Mr Chan Wing Leong, Deputy President & Chief Financial\nOfficer, SIT as well as President David J. Chard of Wheelock College and\nMs Beth C. Fredericks, Executive Director, Wheelock College-Singapore.\nIn a ceremony steeped in tradition and complete with a bagpiper,\n65 Communication Design and 47 Interior Design students received\ntheir degrees from The Glasgow School of Art. Held at the SIT@Dover\nAuditorium, the ceremony was also attended by Mr Tsoi Mun Heng, Vice\nPresident (Planning), SIT, Professor Frank Coton, Vice Principal (Academic\nand Educational Innovation), University of Glasgow, and Mr Chris Hand,\nProgramme Director, The Glasgow School of Art, Singapore.\nReceiving the Best Overall Academic Achievement for Communication\nDesign was Ms Adelia Lim Jia Yi, while Ms Charmayne Aw Xue Qi and\nMr Ng Jin Hao Damien were recipients of the same award for the Interior\nDesign Programme. Ms Edith Ng Tse Pei and Ms Nurul Nadia Binte Ahmad\nreceived the Leap Award for the Communication Design and Interior Design\nprogrammes respectively. The Outstanding Contribution to Student Life\nAward went to Mr Liew Wee Peng, Arthur (Communication Design) and\nMr Wee Liang Foo (Interior Design).\nThis year, Ms Radhiah Binte Anis from the Communication Design\nprogramme was the co-recipient for the Highest Achievement in Design\nHistory and Theory for the School of Design in both GSA Glasgow\nand GSA Singapore. She said, “The award was unexpected and I’m\nvery thankful to my lecturers as they were the ones who got me through\nmy dissertation when I was very doubtful about myself and my work.”\nCurrently interning at a graphic design studio and working as a part-time\nresearch assistant, she plans to develop her creative work further.\nAt the graduation ceremony for the Technical University of Munich, held at\nthe SIT@Dover Auditorium, 39 graduands from the Electrical Engineering\nand Information Technology programme and 56 graduands from the\nChemical Engineering programme received their degree scrolls.\nThe Guest of Honour for the ceremony was Dr Heinrich Hubbe, from the\nEmbassy of the Federal Republic of Germany to Singapore. Prof Tan Thiam\nSoon, President, SIT, Mr Chan Wing Leong, Deputy President & CFO, as\nwell as Dr Markus Waechter, Managing Director, TUM-Asia, also attended\nthe ceremony.\nMr Ang Jing Kai and Mr Ashley Teo Hsien Yang were the valedictorians and\nreceived the Best Student Award for the Chemical Engineering and the\nElectrical Engineering and Information Technology programmes respectively.\nAlso receiving awards at the ceremony were Ms Chua Beverly Julia and Mr Wan\nKiat Hwee for the Best Thesis in the Electrical Engineering and Information\nTechnology, and the Chemical Engineering programmes respectively.Performing “Let It Shine”, the graduating class was joined\nby Ms Beth C. Fredericks, Executive Director, Wheelock\nCollege-Singapore.\nThe award winners, together with SIT Senior Management\nand guests at the graduation ceremony. Wheelock College\nCommencement 2018\n30 May 2018\nTechnical University of Munich\n19 July 2018With degree scrolls in hand, it’s time for these graduates to\ncelebrate after two intense years of hard work.The Glasgow School of Art\nGraduation Ceremony\n25 June 2018\nSiTIZEN  |  05/12\nSIT Team Wins\nEldercare ‘Oscar’\nHow These WorkSITizens make their mark at 6th Eldercare\nInnovation Awards with innovations to\nrehabilitate mobility\nʋArm Two SIT teams made a splash with their entries at the 6th\nEldercare Innovation Awards, held in conjunction with the\n9th International Ageing Asia Innovation Forum (AAIF) 2018\nin May. Touted as the 'Oscars of the Eldercare Industry', the\nawards are the only one of its kind in the Asia Pacific region\nthat recognise the best in innovative eldercare product and\nservice delivery.\nAccepting the award for ‘Best Smart Care Technology –\nProduct’ was Assoc Prof Patrick Chua. His team, consisting\nof Assoc Prof Zheng Jianxin, Mr Tan Hong Yong, Professional\nOfficer at SIT, and Ms Koh Min Merissa, who is currently\npursuing a Mechatronics degree from University of Glasgow\n(UofG), produced the Smart Walker for Gait Rehabilitation\nwith Local Positioning System, an innovative smart walker that\nindependently aids patients undergoing rehabilitation. This\nwas part of a continued multidisciplinary collaboration with\nKwong Wai Shiu Hospital (KWSH).\nAssoc Prof Chua was thankful for the opportunity to train and\nlead final-year students in venturing beyond the classroom\nenvironment. “This is indeed a prestigious award and a very\nproud moment for SIT and our industry partner, KWSH, as\nwe managed to come out tops amongst other esteemed\norganisations from the Asia Pacific region,” he said.\nMs Ong Xin Ying (left) and Ms Megan Lau (right) explain how to use the ʋArm.Assoc Prof Patrick Chua demonstrating how\npatients can use the Smart Walker.With this device, a patient would not need the constant physical support of\nphysiotherapists.\nTherapists would instead be able to manage and monitor the patient remotely\nusing the smart walker app from a laptop. The system would record walking\nactivities as well as locate the position of the patient using the smart walker.\nThis is particularly useful in countries with limited and over-populated\nrehabilitation facilities, as it provides an innovative solution to the manpower\nshortage faced by the healthcare industry.\nThis device aims to ease the process of rehabilitation by\nmaking use of a non-immersive virtual reality (VR) game.\nPost-stroke patients are provided with rewarding, goal-\ndirected tasks, which are performed on a table using\nthe ʋArm arm-skate to motivate them to use their arm,\ntherefore engaging them in fun rehabilitation therapy.\nThe project is now ready for deployment and clinical\ntrials at various Intermediate and Long-Term Care\n(ILTC) organisations for their community and group\ntherapy initiatives.Making it to the top five finalists for the same category\nwas the team led by Asst Prof Agnes Xue, with\ntheir entry “ ʋArm” (pronounced as ”New Arm”). In\ncollaboration with Metta Day Rehabilitation Centre\nfor the Elderly, Asst Prof Xue, together with Assoc\nProf Alfred Tan and students from the Engineering,\nHealth and Social Sciences, and Design and\nSpecialised Businesses Clusters in SIT designed an\narm-skate device for post-stroke patients to regain\nupper limb mobility. “Being awarded top five is a\nmajor milestone,” said Asst Prof Xue. “It gives me\nand my team confidence that our design is well-suited\nto improve the quality of life for our patients.\"\nThe student team consisted of Mr Lim Pei Jin, Interior\nDesign, Mr Kong Zhong Rong, Mechanical Design\nEngineering, Ms Megan Lau Si En and Ms Ong Xin\nYing, Occupational Therapy. Ms Lau felt particularly\ninspired by this project, saying, “What fascinated\nme the most was seeing how the various aspects like\ngame design, innovation and therapy came together\nseamlessly. Making the prototype and user-testing\nallowed me to practise my skills in patient care and\nimprove from one patient to another.”\nSmart Walker for Gait Rehabilitation with Local\nPositioning System\nSiTIZEN  |  07/12 SiTIZEN  |  06/12\nSITizens can never get enough of\nspending time with their peers, so it was\nonly natural that Beers with Peers: Annual\nAlumni Beanfeast, held on 20 July 2018\nat the Marina Mandarin, would turn out\nto be one of the most exciting nights of\nthe year for SIT alumni.\nDuring the evening’s networking sessions,\nalumni mingled with their former\nprofessors, SIT Senior Management,\ncurrent students as well as industry\nprofessionals who attended the event.\nSome 300 attendees also celebrated the\ngraduation of SIT’s first-ever graduates\nfrom the Sustainable Infrastructure\nEngineering (Land), and Information\nand Communications Technology\ndegree programmes (Class of 2018).\nThis year’s industry discussion panel\nexplored the future of work through the\ntopic, “How to Build an Invincible Career\nin the ArtificiaI Intelligence (AI) Era?”\nThe speakers were Mr Mark Lee, Chief\nExecutive Officer, Sing Lun Holdings Pte A Second Round of Beers with Peers!\nAlumni come together with SIT’s industry and philanthropic partners for a memorable night at this year’s Annual Alumni Beanfeast\nThe evening’s panel discussion on the future of work in the artificial intelligence era was moderated by Prof Ng\nSiu Choon, Associate Provost (Students), SIT (far left) and student moderator, Mr Ang Guo Gen (far right). The\nspeakers were (from left) Mr Mark Lee, Chief Executive Officer, Sing Lun Holdings Pte Ltd; Ms Angela Wu, First\nVice President, Information Security & T&O Assurance, Group Technology & Operations, United Overseas Bank;\nMr Wan Kwong Weng, Group Chief Corporate Officer and Group General Counsel, Mapletree Investments Pte\nLtd; Mr Sim Guan Seng, Managing Partner, Baker Tilly TFW LLP; and Mr Julian Tan, Chief of Digital Business,\nSingapore Press Holdings.\nProf Tan Thiam Soon (left), President, SIT, thanking the guest speakers for sharing\ntheir valuable experience and insights. Mrs Margaret Lui (left), SIT Board of Trustees and Mr Sam Pang, Assistant\nGeneral Manager at Samwoh Corporation before the start of the\npanel discussion.\nAlumni from the SIT Class of 2018 received a memento capturing memories of\ntheir journey together through the years.Peers gathering around an international selection of beer, food and wine. (From left) Prof Tan Thiam Soon, President, SIT, chatting with Mr Soo Ye Wah, Executive\nChairman, Dou Yee Enterprises (S) Pte Ltd, and Mr Su-Shiqin, Deputy General Manager,\nDou Yee Technologies Pte Ltd.Assoc Prof Malcolm Low Yoke Hean (third from left), Programme Director, SIT, catching up\nwith former students. Enjoying the lively panel discussion together were (from right) Mr Lim Peng Hun, Past\nPresident, Rotary Club of Bugis Junction (RCBJ); Ms Vanisa Lee; Dr Reto Callegari,\nTreasurer, RCBJ; and Class of 2016 alumnus and Rotary Club of Bugis Junction\nOutstanding Student Award recipient, Mr Wong Kai Xian.Mr Lim Wei Wei (left), Partner, Baker Tilly TFW LLP with Mr Matthew Teng, Executive Director,\nThe Silent Foundation.Attendance for Beers with Peers 2018 more than doubled compared to last year’s event. Ltd; Ms Angela Wu, First Vice President, Information\nSecurity & T&O Assurance, Group Technology &\nOperations, United Overseas Bank; Mr Wan Kwong\nWeng, Group Chief Corporate Officer and Group\nGeneral Counsel, Mapletree Investments Pte Ltd; Mr\nSim Guan Seng, Managing Partner, Baker Tilly TFW\nLLP; and Mr Julian Tan, Chief of Digital Business,\nSingapore Press Holdings.\nWith years of experience leading in diverse fields\nsuch as accountancy, property development,\ninformation security, digital media and apparel\ninvestment and manufacturing, they offered multi-\nfaceted insights into how AI is transforming their\nrespective industries and how it could affect\nyoung professionals. Adaptability and openness to\nchanging one’s method of work, for instance, would\nbe key in a world where AI is able to change daily\nprocesses on a frequent basis. The ability to analyse\ncomplex patterns would also grow in importance,\nsince AI is typically only able to deal with standard\npatterns or models of behaviour that it has been\ncoded with.\nClass of 2016 Aerospace Systems alumnus, Mr Wong Kai Xian,\nappreciated the chance to spend time with close friends and peers.\n“I think the event was a really great opportunity for the graduating\nstudents and alumni to come back and reconnect with the school,\ntheir peers and lecturers, and also to meet the leaders of their\nindustries,” he said. Kai Xian is currently working at Pratt & Whitney.\nYear 3 Accountancy student, Ms Anne Wee, particularly enjoyed\nthe panel discussion. “I liked networking with my seniors a lot, as\nwell as learning more from the panellists and their considerations\nof where we as up-and-coming professionals are headed in the\nyears to come,” she said.\nSiTIZEN  |  08/12\nStarting from this new Academic Year, students with good\nacademic results can look forward to four new bond-free\nscholarships. All are non-bonded scholarships that have\nbeen made possible by generous gifts from SIT’s donors\n– three of which are permanent scholarships as they are\nsupported by endowed gifts.\nTogether, these four scholarships will support students\nfrom the full range of programmes at SIT, and can be used\nto cover their educational expenses, including their tuition\nfees and expenses for international programmes like\nregional study trips or Overseas Immersion Programmes.\nThe endowed Mr & Mrs Ko Seng Gie Scholarship  will\nsupport three talented Singaporean students (with a\npreference for those from financially disadvantaged\nhouseholds) enrolled in any degree programme offered\nat SIT, each year and in perpetuity. The scholarship was\nmade possible by Mr Ko Oen Tjiang in honour of his\nparents, the late Mr & Mrs Ko Seng Gie, and with the\nhope that the scholarship will have a positive impact on\naspiring students from lower-income backgrounds.\nThe Seagift Scholarship  is applicable to academically\noutstanding Singaporean students pursuing either\na Chemical Engineering, Food Technology, or an  Prof Tan Thiam Soon, President, SIT (fourth from right), and Dr Jeyatharan Kumarasamy, President, TUCSS (third from right), along with the Committee Members from\nTUCSS and SIT Senior Management at the signing ceremony and appreciation lunch for TUCSS.Bringing Up Excellence\nFour new scholarships for academically promising students at SIT from Academic Year 2018/19,\nthanks to generous donors\nAccountancy degree. At least three scholarships will be\nawarded annually and in perpetuity. This scholarship\nhas been made possible by an endowed gift from\nSeagift Food Pte Ltd, a frozen seafood business, which\nsources and supplies quality food products to various\nmarket segments.\nEngineering students can also look forward to vying for\nthe TUCSS Engineering Scholarship , made possible\nwith an endowed gift by the Tunnelling and Underground\nConstruction Society Singapore (TUCSS). This scholarship\nwill support students pursuing a Civil Engineering or\nSustainable Infrastructure Engineering (Land) degree\nprogramme at SIT. TUCSS was formed in 1998 to advance\nthe standards of tunnelling and underground construction\npractice. The gift from TUCSS will support at least one\nscholarship each academic year (and two scholarships\nevery alternate year) and in perpetuity.\nThanks to a term gift from Feng Ming Construction Pte\nLtd, a civil engineering expert with nearly 30 years of\nexperience in completing technically challenging projects,\nthe Feng Ming Scholarship  has been established at\nSIT. Applicable to first-year students, this scholarship\nwill be awarded each academic year to nurture the next\ngeneration of leaders in the industry.\nSiTIZEN  |  09/12\nThe KKH Scholarship and Wilmar Scholarship, two of the\nearliest non-bonded scholarships to be made available at\nSIT, have positively impacted a long line of SIT students\nfrom as far back as 2011.\nIn appreciation of the many doors the scholarships\nhave opened for 84 scholarship recipients, SIT held an\nappreciation tea for the donors, Wilmar International and\nMr Kuok Khoon Hong, on 8 August 2018 at the SIT@Dover\nCampus. The tea was hosted by Prof Tan Thiam Soon,\nPresident, SIT, and the afternoon’s programme included\na tour of the campus for the guests. Also present were\n21 of the 84 KKH and Wilmar Scholars who received the\nscholarships from 2011 to 2017.\nDuring the session, recipients met Mr Kuok, who is\nChairman and CEO of Wilmar International, and thanked\nhim for the support that had enabled them to pursue their\naspirations. Several of the recipients are now working in\noccupations ranging from mechanical engineering and\nrobotics to research in fields such as artificial intelligence,\nhealth sciences and food technology.KKH and Wilmar scholars welcoming Mr Kuok Khoon Hong.From left: Mr Tay Thiam Peng, Head, Special Projects, Wilmar International; Prof\nTan Thiam Soon, President, SIT and Mr Kuok enjoying a lively chat together with the\nscholarship recipients.\n84 Seeds for Change\n21 of SIT’s 84 Wilmar and KKH Scholars get to meet the donor who made possible the\nscholarships that have changed their lives\nKKH Scholarship and Wilmar Scholarship recipients, together with Prof Tan, Mr Kuok, Mr\nTay, and SIT faculty and staff.\nMr Kuok in turn shared with them a wealth\nof insights gleaned from his years as an\nagribusiness leader. Chiefly, he advised them\nto use their free time in their youth to study\ntopics in depth, as they would not have such\nample time as they grew older. Using his in-\ndepth understanding of grains, soybeans, and\nagriculture as illustrations, Mr Kuok explained\nhow gaining deep knowledge and knowing\nrealities of work done in factories and fields\nwould give a person the “five per cent higher\nlevel of quality” that would give them an edge\nover competitors. He also encouraged the\nrecipients to think about how their products or\nservices could provide the widest commercial\nvalue to consumers.Among the scholars at the appreciation was Class of 2017\nalumnus, Mr Chew Kia Yong (Food & Human Nutrition\nprogramme, Newcastle University). A recipient of the KKH\nScholarship, he went on to join Wilmar International as a\nTechnical Service Executive after graduation. He said, “Mr\nKuok conveyed to us the importance of seizing the right\nopportunity when we are presented with it. He recounted\nhow, during a time when he was heavily involved in the\nwheat trade, he took the opportunity to do extensive\nhands-on work and grasp the industry know-how he\npossesses today.”\nMs Michelle Tan, a Wilmar Scholar who is also from\nthe Class of 2017, is now a Programme Coordinator at\nSingapore General Hospital who works on a research\nprogramme involving pre-diabetes patients. She said\nwhat stuck with her most was Mr Kuok’s lifelong journey\nof continual innovation and of constantly finding ways\nto meet the needs of his consumers. “I felt privileged\nand honoured to be at the session and to hear him tell\nhis story,” she added.\nSiTIZEN  |  10/12\nTwo SIT-GSA alumni were among 33 designers honoured for their\nimpressive entries at the second Singapore Interior Design Awards\n(SIDA) 2017, held in conjunction with Design Week 2018 earlier this year.\nMr Lee Liming, 26, bagged a total of eight awards in multiple categories,\nincluding the SIDA concept 2017 Best of Best Award, given to “the\nmost promising interior designer of the year.” Sharing the spotlight was\nMr Teo Tze Hau, 25, winning two awards for his futuristic residential design.\n“Challenges are often opportunities to become better,” said Mr Lee who\nis currently a designer at Orb Associates. “It was a surreal experience\nto hear the news of winning multiple awards.”Ms Denise Tong, 28, found a great start to an engineering career when\nshe spent a year at SETSCO Services Pte Ltd as part of her Integrated\nWork Study Programme (IWSP). The company is one of Singapore’s\nlargest conducting aerospace Non-Destructive Testing (NDT) and\ninspection of aircraft components.\nDenise’s main duties were to assist NDT personnel in material testing\nmethods, such as Penetrant Testing (PT), Magnetic Particle Testing (MT),\nand Radiography Testing (RT). “Some people feel that working in NDT\nmeans harsh working conditions, but I don’t agree,” says Denise. “There\nare always new things to learn as the procedures, components and\nenvironment change to suit requirements and specifications. Being able\nto constantly learn new things and challenge myself to do better the\nnext day was what made it interesting for me.”\nDenise became a leader when she volunteered to guide polytechnic\ninterns at SETSCO. She said it was tough at first, as she had to\nexperiment with different teaching methods to adjust to the interns’\ndifferent learning styles. “Plus, most of them started around the same\ntime as me, so they didn’t respect me much as a leader. It was only\nthrough doing tasks hands-on with them and even discussing their\nfuture with them, that I started to earn their respect,” she added.\nHer advice for juniors going for their IWSP? “Have initiative,” Denise\nsays. “Supervisors like it when you take initiative to contribute.\nFirst-year Sustainable Infrastructure Engineering students, Mr Lewis Tan\nand Mr Toh Shu Han, made SIT history when they became the first and\nonly university students to take home a medal from the WorldSkills\nSingapore (WSS) 2018 competition. Competing with close to 250\nparticipants from ITE, polytechnics and autonomous universities, the\nduo managed to win bronze in the Rapid Transit Systems category\nafter an intensive 3-day competition, where they had to complete\nseveral tasks in three domain areas of maintenance works in rapid\ntransit, namely Rolling Stock, Traction Power Supply and Signalling.\n“The WSS experience has given me a better understanding of how\nrailway engineering works, and fuelled my interest to join this sector,”\nsaid Mr Tan. “It was also an excellent networking opportunity to get to\nknow the people in this industry.”Design for ‘MBC Buffet Lunch and Bar’ by Mr Lee Liming (inset).Ms Denise Tong (centre) together with her colleagues at SETSCO.\nShe now works in a different department in an effort to pick up\nnew skills.\nMr Lewis Tan (left) and Mr Toh Shu Han (right), both in red shirts,\nworking on the pantograph, an apparatus mounted on the roof\nof an electric train to collect power through contact with an\noverhead line. They found this to be the most challenging task\nduring the competition.Winning Big by Skill\nand DesignLearning in a (Non)\nDestructive Environment\nInterior Design alumni and SIE\nstudents clinch multiple awards\nat prestigious competitionsA Sustainable Infrastructure Engineering (Land) student\nshares her IWSP experience in the Aerospace NDT industry\nStellar Wins at Singapore Interior Design Awards\nCelebrating Skills Mastery\nIn my case, guiding the polytechnic interns\nwasn’t part of my job at first, but I volunteered\nand it eventually became a regular thing.” She\nadded, “Don’t be afraid to make mistakes. The\nimportant thing is admitting to your mistakes,\nand this way you show that you can be trusted.\nThere was an incident where I knocked a dent\ninto a part, so I had to tell my supervisor and ask\nfor suggestions on how to mitigate the issue.\nIf I’d covered up my mistake and the dented\npart had been sent to a customer, there would\nhave been bigger consequences.”\nHaving completed her Bachelor’s Degree,\nDenise has returned to work full-time\nat SETSCO while pursuing a Master of\nEngineering Technology in Sustainable\nInfrastructure Engineering (Land) part-time.\nSiTIZEN  |  11/12\nAlumni enjoying an informative yet light-hearted financial planning session.\nParticipants left armed with greater knowledge of financially sound planning for\ntheir future families.Keen on knowing more about their next phase of life\ntogether, SIT alumni and their partners attended the\nFinancial Literacy Workshop: Starting a Family, held at\nMecure Singapore Bugis hotel on 9 June 2018.\nThe workshop delved into indispensable knowledge on\nplanning finances as a couple, budgeting for a first home,\nreviewing insurance plans and expenses related to having\none’s first child. It also went into details of key policies such\nas HDB housing grants, baby bonus schemes and different\ntypes of tax relief. It was organised by the SIT Alumni\nCareer Network and facilitated by Ms Khor Ling Ling, an  SIT alumni beef up on family financial planning knowledge at a recent workshop organised\nby the SIT Alumni Career NetworkBuilding Life, the ‘Cent-sible’ way\nexperienced practitioner and advisor in the area of\nCompensations and Employee Benefits.\nMs Quan Yuan Ling, an alumnus from the Bachelor in\nScience (Occupational Therapy) degree programme\n(Trinity College Dublin), attended the workshop with her\nfiancé, Mr Alan Leong.\n“We are in the process of getting a house, getting married\nand setting up a family, hence this talk was timely,” she\nshared. “The most useful takeaway was that it opened\nour communication channels to discuss our financial\nmanagement as a couple and how to do it in a more\norganised manner.”\nBATTLESTRIKE\n• 10%  discount\n• Additional 5% off if the session is\nconducted within SIT permitted premises\n• Website: www.battlestrike.com.sg\n• Valid until 30 September 2018\nCrunchie Cookies\n• $2 off every $30 spent for cookies\n• Participating outlets: 321 Alexandra\nRoad, Unit #01-01 Alexandra Central,\nSingapore 159971\n• Valid until 1 October 2018\nEthan Men\n• 20%  off total bill for regular-priced items\n• Participating outlets: 333 Kreta Ayer\nRoad #02-32 S (080333)\n• Valid until 31 December 2019\nFloral Garage Singapore\n• 10%  off total bill at\nwww.floralgaragesg.com\n• Key in the code ‘SIT010’\nFoodline\n• $30 cash rewards w/min spend of\n$300 (All catering orders) with promo\ncode “SITFL30”SIT Alumni Card Benefits\n• $10 cash rewards on all cakes w/min\nspend of $50 with promo\ncode “SITFLC10”\n• Order at www.foodline.sg\n• Valid until 30 June 2019\nGifts Less Ordinary\n• Key in the code ‘SITU’ at checkout to get\n5% off total bill\n• Order at www.giftslessordinary.com/\n• Valid until 31 October 2018\nKitchen Capers\n• 10%  off bakeware tools/packaging\nneeds/books/DVDs\n• 5% off food/ingredients\nShopBack\n• $10 Benefit\n• Up to 18%  cashback when shopping with\nselected partners\n• Visit www.shopback.sg/\nfor more details\nThe Braces Practice Pte Ltd\n• Promotional prices for different types of\ndental braces• 1 consultation; 1 set of clean retainers;\nand pre/post-treatment X-rays,\nphotographs and study models included\nat no additional cost\n• Participating outlets: The Braces Practice\n[12A Lorong Mambong Holland\nVillage (S277676)]\n• Valid until 31 October 2018\n*Please present your SIT Alumni Card prior to making\npayment. Terms and conditions apply. Please refer to\nhttp://sl.singaporetech.edu.sg/Welfare/SITreats.aspx\nfor detailed terms and conditions.\nDate: Friday, 9 November 2018  |  Time: 7.00 pm to 11.00 pm\nLocation: Hard Rock Cafe (Orchard Rd)\nDresscode: Smart Casual\nCost: $18 incl. GST  (Dinner & beverages - soft drinks, beer, wine & spirits )\nWelcome\nNew Alumni\n2018\nContact Us:\nSIT Advancement & Alumni Division\n6592 2129 / 6592 1137 • Alumni@SingaporeTech.edu.sg\nContact Us:\nSIT Advancement & Alumni Division\n6592 2129 / 6592 1137 • Alumni@SingaporeTech.edu.sg"
}