{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2021/07/Mentee-Handbook.pdf",
  "type": "pdf",
  "content": "Mentee  Handbook\nSIT Alumni Mentoring Programme\nMentee Handbook  Page 1\nWelcome to the S IT Alumni Mentoring Programme!\nOrganised  by the S IT Advancem ent and Alumni Division with the  partn ership  of SIT  Student Life\nDivision and SITizen Ambassadors , this flagship programme aims to build a platform to foster a\nnurturing relationship between alumni and students and instill a greater sense of belonging\ntowards our university.\nThe programme launched in 2020 ha d garnered significant support from SIT’s illustrious alumni\nwho working in the  public and private sectors. These alumni have experienced the ‘S IT journey’\nyou, as students, are undertaking, and thus are in the best possible role to mentor you. More\nimportantly, they have volunteered their valuable time to advise, coach and guide you, our S IT\nstudents in the areas of career, academics, life skills a nd more.\nWe urge you to seize this unique opportunity to create a rewarding experience for yourself and\nyour mentor. This is your chance to gain insights from our very own graduates.\n1. What is  Mentoring?\nMentoring is a fundamental human relationship, i n which a person invests his or her time, energy,\nand expertise to nurture the growth and ability of another person. Mentors are the special people\nin our lives who help us reach our potential. They are ‘ helpers ’ and their style may range from that\nof a pe rsistent encourager who boosts our self -confidence to that of a stern taskmaster who\nteaches a ‘ Mentee ’ to appreciate excellence in performance. Whatever their style, they care about\ntheir Mentees.\nMentoring is one of the all -encompassing methods of encou raging human growth. Today,\nmentoring is often spoken about in corporate circles, but mentors can touch every facet of a\nperson’s being if their wisdom is accepted and applied in diverse ways to an individual’s life. It is a\nprocess wherein the Mentor and Mentee work together to discover and develop the Mentee’s\nlatent abilities and encourage the Mentee to acquire knowledge and skills as and when the\nopportunities and needs arise. The Mentor serves as a tutor, counselor, friend, and foil enabling the\nMentee  to sharpen her/his skills and increase her/his knowledge.\nAn Important Note: To gain from mentoring, a person has to reach out, grasp, and learn from the\nwisdom that the Mentor offers. The mentee can only experience the benefits of mentoring by\nassuming ownership of what the Mentor has offered and using it appropriately.\nThe follo wing guidelines show you how to make best use of your relationship with your Mentor.\nSIT Alumni Mentoring Programme\nMentee Handbook  Page 2\n2. Getting  Acquainted\n“Fit and chemistry must be considered when pairing the mentor and the protégé.\nIf the two don't get along, it matters little what each can offer the other  in terms of knowledge\nand skills.”\n- Michael Zey, Building a successful formal mentor program\nGetting acquainted with your Ment or over the Internet can be quite convenient. If you are looking\nfor ways to connect online using the S IT Alumni Mentoring Programme, the following are a few\nsuggestions to help you get started on conversations with your Mentor:\n1. Hobbies and extracurricula r activities.\n2. Modules that you have undertaken, projects that you have worked on, or career related\ninterests.\n3. Your favorite modules in S IT, favorite book,  etc.\nDon't forget to learn about your Mentor by asking her/him questions too!\nWe encourage you to voice your concerns with your Mentor. In case you find it difficult to discuss\ntopics using technical terms, we advise you to paraphrase your questions. Although it might take\nseveral online discussions to clarify a point, your Mentor is likely to apprecia te your interest and\nyour passion to learn.\nSIT Alumni Mentoring Programme\nMentee Handbook  Page 3\n3. Means to  Communicate\nThere are various ways in which you can communicate with your Mentee. These include:\n1. E-mails\n2. Chats/ discussion  boards\n3. Skype /Zoom  for audio or video  conversations\n4. Meeting in person whenever  possible\n5. SMS/ WhatsApp/  etc.\n4. Set Your Goals and Summarize Completed  Sessions\nTo have a successful Mentoring Relationship , you must;\n▪ Understand your  needs\n▪ Set your goals\n▪ Convey your needs and goals to your  Mentor\n▪ Discuss how you can accomplish  them\n▪ On completing  a discussion  session,  summarize  the session  to form  new  action  items\nA good start would be to answer the following  questions;\n1. What do you want to achieve from this mentoring relationship ? (e.g. completing\nrequirements for a degree, finding a  right IWSP or job, securing admission to  graduate\nschool)\n2. How will you know if you have reached these goals? (e.g. being able to graduate as\nintended, receiving an offer to work in the area of your  interest)\n3. What challenges do you anticipate? (e.g. uncertainty about the availability of certain\ncourses, slow job market, time -consuming applications)\nWe hope you are now able to clearly define your goals and make best use of the time spent with\nyour Mentor.\nSIT Alumni Mentoring Programme\nMentee Handbook  Page 4\n5. Effective Online  Communication\nThe term ‘ Communication ’ covers just about any interaction with another person. It includes\nsharing information, ideas, and feelings. Communication is a two -way process. You can probably\nre- member several occasions when the lack of communication or miscommunication  has left you\nfeeling angry, or worried.\nWhile speaking to someone, whether face to face, or on the phone, you can use hand gestures,\nfacial expressions and voice modulation for conveying your thoughts. Imagine what happens when\nyou communicate over email s; or, when you have to communicate through online discussion\nboards. Here, you cannot make use of non -textual ways of conveying information; you can only\nrely on your text messages.\nThe following netiquette tips are critical to a Mentor - Mentee relation ship:\n▪ Meaningful Subject Line - A good subject line ensures that the recipient recognizes the\nimportance of your message and doesn’t delete it accidentally. Another reason is that  the\nsubject  line will give your  Mentor  a clear  idea of  the topic  you want  to discuss.\n▪ Clear and Concise Messages - Was your Mentor’s points clear? Were you able to under -\nstand them? If not, ask your Mentor for clarification. Asking for a clarification will allow\nyour Mentor to restate, elaborate, or reconsider her/his mes sage. It is very important that\neven your messages are clear and concise. Using apt and correct words, avoiding long\nsentences and using formal language (not SMS/slang vocabulary) will help you\ncommunicate  effectively.\n▪ Investigating Assumptions - Even if they have not been stated explicitly, have you\nunderstood the assumptions your Mentor has made in the message? Stating your\nunderstanding of the message, or asking your Mentor about to clarify her/his words can\nbe useful in pre - venting any  misinterpretations.\n▪ Communicating about Communication - It is very important to inform your Mentor of  your\nschedule, well in advance. This prevents a communication breakdown, which would have\nresulted in unnecessary  frustration.\nWe sincerely hope that you have a fruitful online experience, as you exchange your thoughts with\nyour Mentor.\nSIT Alumni Mentoring Programme\nMentee Handbook  Page 5\n6. Networking  Tips\nNetworking is a learned skill that takes time and  practice to improve. It is likely that your Mentor\nhas leveraged her/his network of contacts at various times in her/his life. Learn from her/him how\nshe/he built her/his network. Appreciate the effort that goes into maintaining these quality\nrelationship s. If your Mentor is willing, then request her/him to share her/his contacts with you, so\nthat you can reach your goals.\nWhen you approach your Mentor, or any of her/his contacts, this is the networking etiquette that\nyou must follow:\na. When asking for a fav or, ask politely. For instance, say, ‘Perhaps you can point me in  the\nright direction…’, or, ‘Could you help  me...’\nb. Follow up using the 48 -hour rule. Respond to phone messages and emails, and send  thank\nyou notes, nice -to-meet -you notes, or emails after a meeting, within 48  hours.\nc. When calling up a person who has been referred to you, by someone else, mention your\ncontact’s name early in the conversation. For example, ‘John suggested that I contact  you\nabout...’\nWe wish you the very best in building  your network of contacts!\n7. Suggested Activities for Mentors and  Mentees\nThe following are activities that we suggest you participate with your mentor when you meet\nhim/her in person:\n• Engage in lunch meetings to discuss different subjects, including the institution , classes,\ncareer path and  extra -curricular  activities.\n• Get introduced to your Mentor’s colleagues and faculty members acquainted to  her/him.\no Expand your network of contacts.\n• Show your Mentor some of your favorite places in the country — places they might  other -\nwise never discover  themselves.\n• Attend cultural and sporting events  together.\nSIT Alumni Mentoring Programme\nMentee Handbook  Page 6\n8. Don't Lose Sight of Your  Goals\nThere might be times in your Mentoring Relationship when things might stagnate and a fresh\nimpetus is required. At such times, we recommend the following activities:\n▪ Revisit the goals that you have set for your mentor and for yourself. Are you on the right\ntrack to achieve what you had set out to  do?\n▪ Could you have do ne something better? Being enthusiastic can help you and your  mentor\nmove forward.\n▪ Do you think  you need  to extend  the mentoring  period?  Learning,  as they  say, never  stops.\nRe-energising the relationship goes a long way in ensuring the success of the mento ring relation -\nship.\n9. Help during Periods of  Transition\nAs you and your mentor near the completion of your Mentoring relationship, you may wonder\nwhether your takeaways from the Mentoring Relationship will smoothen your transition into\nfuture endeavors. There may still be lo ose ends that need to be tied up, or some fears about\nmoving on.\nWe now encourage you and your Mentor to discuss your transition from your current position to\nyour post -mentoring goals. Your Mentor may be in a position to help you prepare better for what\nlies ahead and thus reduce the anxieties you may have about the changes that await you.\nNothing can replace experience!\n10. Need for a Good  Closure\nSome Mentoring relationships end with the s uccessful completion of learning goals; some do not\nfor a number of reasons. Even unproductive or unsatisfactory Mentoring Relationships can benefit\nfrom a good closure. The key to a successful closure is being prepared with an exit strategy. A\ngood exit s trategy has five components:\n1. A learning conclusion (processing the learning that took place because of the  relationship\nwhile working towards the achievement of learning  goals)\n2. A process for integrating what was learned (a conversation focusing on how to apply the\nlearning and take it to the next  level)\n3. A meaningful way  of celebrating success (planning a mutually satisfying way to celebrate\nthe successful achievement of  goals)\n4. A conversation  focusing  on redefining  the relationship  (talking  about  how  the relationship\nis to continue, whether it moves from a ‘ Professional M entoring Relationship ’ to ‘ Col-\nleague ’, ‘Friendship ’, or ceases to exist  entirely)\nSIT Alumni Mentoring Programme\nMentee Handbook  Page 7\n5. Moving on (both mentor and mentee let go and identify ways of keeping in touch, if  ap-\npropriate and/or mutually  desired)\n11. Provide Regular  Feedback\nIt is important to provide regular feedback on mentoring and your Mentoring Relationship to your\nMentor a s well as the Program Facilitators. Complete the Mentor Program survey(s) and Mentor\nfeedback form(s) sent to you via mentoring portal. Constructive feedback to the Mentor will help\nher or him guide you better and can improve your Mentoring Relationship. F eedback to us, the\nfacilitators, will allow us to address your necessities/concerns and thus improve the programme,\nthereby ensuring an enjoyable mentoring experience."
}