{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizen-buzz-issue-16-Sept-2021.pdf",
  "type": "pdf",
  "content": "Singapore Institute of Technology\nAppoints Professor Chua Kee Chaing\nas its Third President\nLeadership transition will take effect from 1 January 2022\nEl 03 September 2021\nFrom left: Prof Tan Th tam Soon, Prof Chua Kee Chatng, Prof John Thong\nThe Singapore Institute of Technology (SIT) will appo int current SIT Deputy President (Academic) & Provost Professor Chua Kee Chaing\nas President·desiinate from  1 September 2021, and  Presi dent with effect from 1 Janua ry 2022 . Prof Chua, who will be SIT's third\nPresident, will succeed Professor Tan Thiam Soon who is stepping down as President after nine years in the role.\nProf Tan became SIT's second President in early 2013 and his first task was to steer SIT to become Singapore's fifth autono mous\nuniversity, which was achieved in March 2014 , and launched SIT's first suite of its own programmes that year. He adopted the applied\nlearning pedagogy and introduced the Integrated Work  Study Programme which today, is a signature programm e of SIT. He also led the\neffort to get approval for the construction of a new campus in Punggol, which is conceptualised as a living lab to support applied learn ing.\nToday, SIT students are well-received  by industry and enjoy good emp loyment outcomes.\nProf Chua joined SIT in September 2019 and has led the university's development in academic policies and curriculum, applied learning\nand applied research, faculty development, as well as student adm inistration. Prior to joining SIT, Prof Chua  was the Dean of the Faculty\nof Engineering at the National University of Singapore (NUS).\nProfe ssor John Thong, the current SIT Vice Provost, will be appointed Dep uty President (Academic) & Provost-designate from 1\nSeptember 2021 and assume the role  of Deputy President (Academic) & Provost with effect from 1 January 2022, succeeding Prof\nChua. Prof Thong joined SIT in August 2020 and has worked closely with Prof Chua on academic polici es and curriculum. Prior to joining\nSIT, Prof Thong was the Head of the Department of Electrical and Comp uter Engineering at NUS.\nAt SIT, Prof Chua has started various initiatives to deepen SIT's applied learning pedagogy. These include reorgan ising the academic\nstructure into a matrix of faculty clusters and programmes; harmonising SIT's suite of education programmes to help students achieve\nmastery of disciplinary knowledge, skills and agility; as well as wea ving interdisciplinary learning into the curriculum  to mou ld highly\nemployable and adaptable graduates.  He has also positioned the University to strategically grow its applied research and pioneer a\ncompetency-based workplace learning pathway to support upskilling of in-employment learners.\nProf Tan will continue to be an integral part of SIT's leadership as Institute Professor, supporting the new President in the University's\ncontinued efforts in community and donor engagements, as well as mentoring younger leaders. He will also continue to contribute\nto industry in his roles as the Deputy Chairman of the Building Construction Auth ority and board member  of the Land Transport Authority.\n\"I express my warmest gratitude to Thiam Soon  for his visionary and exceptional leadership as President over the last nine years . I have\nevery confidence that SIT will continue to grow and thrive under  the leadership of Kee Chaing, who possesses the strategic vision and\nexpertise to solidify SIT's reputation as Singapore's premier University of Applied Learning,\" said Mr Ng Yat Chung, Chairman, Board of\nTrustees, SIT.\nProf Chua added, \"I am deepl y honoured to be given the opportunity to lead SIT into its next phase of growt h and I look forward to\nworking with all stakeholders of SIT to further strengthen our mission as Singapore's premier Unive rsity of Applied Learning\".\nr.lirlr linlt c lf'lr lulJ hil'lt1rnnhiP<: rif Pr\"( r.hur, l'lnrl Prnl Thl\\nt1"
}