{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-23.pdf",
  "type": "pdf",
  "content": "Once a SiTizen, Always a SiTizen ISSUE NO. 23  |  MAY  2019\nWHAT’S\nHAPPENING\naround our little\nbig campus\nSITizen is a publication by the\nSIT Advancement & Alumni Division.\nFor enquiries, please e-mail us at\nAlumni@SingaporeTech.edu.sg© Singapore Institute of Technology 2019\nDear SIT Alumni,\nSIT Launches Innovation\nDevelopment Programme\nStudents Find Lean Way to\nAddress Industry Problems\nUndergraduates Make\nTheir Mark at Competitions\nNew Bursary from\nLoyang Tua Pek Kong\nTemple Uplifts SITizens\nYoung Talents Blossom\nThanks to Kewalram Chanrai Group Scholarship\nHeeding the\nSustainability Call at\nThe Mapletree Challenge\nTeam Trolley’s\nModular Wonder\nInside The SITuation RoomAlumni Assemble for\nMovie Night… and Etiquette & Networking WorkshopInnovations Leading the Way\nAt recent competitions, SITizens have been making their mark with their creativity –\nand scooping up prizes in the process. Among them is Mechanical Design Engineering undergraduate, Mr Hilsann Yong, who bagged two awards for his design that transforms a Personal Mobility Device into a shopping trolley in three steps. He was inspired after seeing his elderly mother struggle with transporting groceries.\nIn the spirit of innovation, a new programme was pioneered between October 2018 – May\n2019 at SIT. The Mapletree Challenge is a unique learning initiative that not only inculcates job interview and presentation skills in SIT students, but also encourages them to come up with innovations on the theme of sustainability. In this issue, we round up the events leading up to The Mapletree Challenge Grand Final, where six teams presented their sustainable innovation ideas to compete for attractive prizes on 2 May 2019. Team Trolley, made up of first-year Nursing students, took home the Mapletree Gold for their take on a laundry trolley in a nursing home. (Details on their innovative idea can be found in this issue's IMAGINE!)\nSIT also recently launched the Innovation Development Programme. The programme will\nallow SIT to work with even more organisations to develop sustainable solutions through a guided innovation process. The National Library Board is one of the first to take up this new programme thanks to a recent Memorandum of Understanding with SIT, which will allow NLB and SIT to co-create digital services and solutions for the future Punggol Regional Library.\nOther exciting stories include how SIT’s community of donors and friends are showing\ntheir support in more ways than one. Alumni and students from the Infocomm Technology\ncluster had the opportunity to network with and be mentored by ICT industry leaders (made up of SIT’s donors and friends) during the first run of The SITuation Room. The networking and panel discussion was followed by a series of small-group mentoring sessions. The next run of The SITuation Room will be for the Engineering cluster in August.\nEnjoy reading this issue of SITizen. Should\nyou wish to contribute a story, do drop us a line at Alumni@SingaporeTech.edu.sg.\nThe winning team of The Mapletree Challenge, together with Prof\nTan Thiam Soon, President, SIT (fifth from right), Guest of Honour\nDr Amy Khor, Senior Minister of State, Ministry of Environment and\nWater Resources & Ministry of Health (eighth from right), judges, representatives from Mapletree, as well as SIT faculty.\nNew Innovation Development Programme at SIT\nIDP will help organisations improve processes and solutions while tapping into SIT’s pool of\nresources; NLB is among the first to come on board with new Memorandum of Understanding\nThe Singapore Institute of Technology (SIT) has launched\na new Innovation Development Programme (IDP), in collaboration with Design Factory Global Network (DFGN). Funded by SkillsFuture Singapore, the programme will be offered by SIT’s Lean Transformation Innovation Centre (LTIC) and will last for six weeks.\nThe IDP will focus on identifying service gaps in\norganisations and developing sustainable solutions to improve customer experience through its guided innovation processes. Organisations can also tap into SIT’s pool of resources which now includes DFGN, a network of innovation hubs within universities and research organisations.\nThe National Library Board (NLB) is one of the first\norganisations to take up the new programme, as part of a Memorandum of Understanding (MoU) signed with SIT. The collaboration will allow NLB to co-create digital services and solutions for implementation at the future five-storey Punggol Regional Library in Punggol Town Hub, as well as other branches nationwide. There will also be opportunities for students to work with NLB as part of their Integrated Work Study Programme (IWSP), as well as for the university to support NLB with relevant continuous learning and customised training opportunities.\nMrs Elaine Ng, Chief Executive Officer, NLB, said, “We are\npleased to partner SIT to create innovative library services and design imaginative learning spaces. We appreciate the opportunity to tap on the skills and knowledge of SIT students and faculty to develop solutions for libraries that benefit Singapore’s library users.”\nFrom left: Assoc Prof Ivan Lee, Vice President (Industry & Community), SIT, Prof\nTan Thiam Soon, President, SIT, Mr Ng Cher Pong, Chief Executive, SkillsFuture\nSingapore and Deputy Secretary (SkillsFuture), Ministry of Education, Mrs Elaine Ng,\nChief Executive Officer, National Library Board and Mr William Tan, Assistant Chief Executive, Corporate, National Library Board were present to witness and facilitate the SIT-NLB MoU signing.\nAssoc Prof Ivan Lee, Vice President (Industry & Community),\nSIT said that the new programme will equip local companies with the critical skills needed to address complex inter-disciplinary problems. “We are also excited to work with NLB to explore the use of innovation and technology to support future library digital services and transformation in the Punggol Digital District, where the future SIT@Punggol campus will be located,” he added.\nThe launch of the IDP and the signing of the SIT-NLB\nMoU took place at the fourth CXO Lean Summit on\n24 April 2019 (please see box story). SiTIZEN  |  02/16\nFrom Fire-Fighting to Lean Leadership at CXO Lean Summit 2019\nOn 24 April 2019, the fourth annual CXO Lean Summit was\nheld by SIT’s Lean Transformation Innovation Centre (LTIC), in collaboration with SkillsFuture Singapore and The Lean Global Network. The Summit is an annual conference that provides a platform for local companies to convene and discuss successful Lean achievements and best practices in business productivity and process transformation. Mr Ng Cher Pong, Chief Executive, SkillsFuture Singapore, and Deputy Secretary (SkillsFuture), Ministry of Education, was the Guest of Honour at the event. The theme of this year’s summit was “Transform Fire-Fighting into Lean Leadership.”\nMr John Shook, Executive Chairman of the Lean Global\nNetwork, delivered his keynote speech on Organisational Stability, sharing how leaders can build effective strategic plans by achieving stability and predictability at the workplace.\nThis was followed by a sharing session comprising\nrepresentatives from companies such as Four Seasons Group, Shalom Movers Pte Ltd, and Particle Measuring Systems, Inc.\non their Lean transformation experiences and how the five core principles of Lean were applied within their organisations, in order to strive for organisational stability. Asst Prof Jawn Lim, Deputy Director, SIT, and Asst Prof Lim Chun Yee, SIT, also presented their insights and main takeaways from the companies they were attached to on the Lean Skills Development Programme.Panel of speakers sharing best practices on building lean strategies\nand capabilities at the 4th annual CXO Lean Summit.\nThese activity-based workshops equip students with lean knowledge, and let them try their hand at applying\nthese concepts.\nFrom left: Ms Anita Low-Lim, Senior Director, TOUCH Cyber Wellness, Asst Prof Jiow Hee Jhee, Programme Director, SIT, Assoc Prof Steven Wong, Programme Director, SIT, and Dr Carol Soon, Senior Research\nFellow, Institute of Policy Studies, in a panel discussion.SiTIZEN  |  03/16\nA Lean Way to Address Industry Problems\nA Better Internet, Just a Click AwaySustainable Infrastructure Engineering (Land) students suggest\nsolutions to real-life challenges for local organisations\nAttendees examine the power behind the simple action of a click in order to create a safer, smarter and kinder Internet for all at the first Better Internet ConferenceDuring the “Lean and Quick Response Repair” module, students from\nthe Bachelor of Engineering with Honours in Sustainable Infrastructure Engineering (Land) degree programme have the opportunity to solve issues faced by companies and suggest solutions that will reduce waste. Since 2016, 160 students have embarked on 30 lean projects with 16 host companies through the initiative conceived by Assoc Prof Mustafa Shabbir Kurbanhusen, Deputy Programme Director, SIT.\nStudents spend the first six weeks in the module learning about lean\nprinciples and to eliminate the ‘8 wastes’ commonly found in any process and subsequently apply these concepts in activity-based workshops.\nIn the next six weeks, they work on real industry problems in their host\norganisations which range from government agencies and healthcare settings to engineering and food manufacturing companies. The students go\nOrganised by the Media Literacy\nCouncil and the Singapore Institute of Technology (SIT), the inaugural Better Internet Conference was held on 11 March 2019 at SIT@Dover and graced by Minister for Communications and Information,\nMr S Iswaran. The full-day event drew a crowd of nearly 400 attendees, and featured a line-up of local and international speakers which also included SIT faculty.\nAttendees gained insights on how\nparents and educators can better relate with youths online and build stronger relationships. They also learnt about the new challenges that Internet users, especially youths, face today in the Internet landscape, and how they can help their children navigate online space safely. on-site to obtain crucial information\nfor the process improvement and also consult weekly with SIT faculty and professional officers to come up with implementable solutions.\nMs Veronica Chng, a student from\nthe Sustainable Infrastructure\nEngineering (Land) programme who\nis currently in her final year, worked on\nimproving processes for the Lee Ah Mooi Old Age Home. Together with\nher classmates, she studied the adult\ndiaper storage and retrieval system,\nas well as the laundry retrieval and\nsorting process. The SIT students\nrecommended the use of a gravity\nflow rack and a diaper dispensing\nsystem to improve the work flow.\nMs Chng said, “Throughout the\ncourse of the project, we achieved\nkey milestones such as increased\nefficiency in store and inventory\nmanagement of essential medical\nconsumables.”\nMr Then Kim Yuan, Administrator of\nthe Lee Ah Mooi Old Age Home, said the walkthrough with the students gave them the opportunity to rethink some of the processes. He added that the students’ inputs have helped the home in making some minor changes and streamlining their work. “The changes will ultimately benefit our residents greatly,” he said.\nDuring his talk, Assoc Prof Steven\nWong, Programme Director, SIT, urged the audience to be more vigilant of the potential dangers and cybersecurity risks they subject themselves to when sharing their information on social media platforms. His parting advice to the audience was to not give away the last four digits of one’s NRIC number as there are hacking tools to crack the code using social engineering of one’s digital footprints.\nAsst Prof Jiow Hee Jhee, Programme\nDirector, SIT, also shared strategies for parents. He suggested regulating their children’s digital exposure by setting rules and boundaries on usage of digital devices, and diverting them from digital use by engaging in outdoor activities and alternative hobbies.“It is important for parents to engage the media with their child, to effectively bridge the digital divide between them, and to cultivate safer Internet habits collectively,” said Asst Prof Jiow.\nSiTIZEN  |  04/16\nGoing Green for Green Mark Challenge\nSITizens Make Facilities Management CoolEco-friendly & sustainable initiatives win first-year students first runner-up spot\nSustainable Infrastructure Engineering (Building Services) undergraduates clinch third\nplace at the World Workplace Asia (WWA) 2019 Student Competition On 23 February 2019, SITizens from the Sustainable\nInfrastructure Engineering (Building Services) degree programme bagged the first runner-up spot in the BCA BiG Club Green Mark Challenge 2019. The Challenge was organised by the Build it Green (BiG) Club, initiated by the Building and Construction Authority (BCA) to promote awareness and knowledge of the green culture in the built environment among youths in Singapore. The team consisting of Mr Justin Seah, Mr Garrett Ong,\nMr Harvest Yosua Purwono and Mr Aaron Wong received $200 shopping vouchers as part of the prize.\nTeams had to propose additional innovative green features\nfor Sim Lim Square’s future building in Jurong, for it to\nA team of third-year students comprising Mr Leow Jun Kai, Mr Chua Lin Feng, Mr Gabryel Gn and Mr Ryan Thio from the Sustainable Infrastructure Engineering (SIE) (Building Services) degree programme made SIT proud with their proposed integrated Facilities Management (FM) ideas at the World Workplace Asia (WWA) 2019 Student Competition.\nHeld on 3 to 5 April 2019 during the WWA Conference,\nthe competition is the first FM-themed contest open to all students from institutes of higher learning and BCA Academy. Participants had to identify potential growth areas encompassing technology within the FM industry, and had to propose an integrated FM model for a hypothetical building. Shortlisted teams then prepared a report and video showcasing their proposals and also presented their proposals to a panel of judges from Surbana Jurong, BCA Academy, and KK Women's and Children's Hospital.\nApplying what they learnt in their FM module, the team\nincorporated Building Information Modelling (BIM) and Facilities Management System (FMS) to enhance tenants’ satisfaction and improve operational efficiency.\nThey proposed creating a data depository system for\nincident reporting and data analytics, using Internet of Things (IoT) for the building’s security surveillance, tapping\nFrom left: Sustainable Infrastructure Engineering (Building Services) students\nMr Gabryel Gn, Mr Ryan Thio, Mr Chua Lin Feng, and Mr Leow Jun Kai pose for a\npicture with Mr Tony Khoo, President, International Facility Management Association\nSingapore Chapter, and CEO, EM Services (third from left), and Dr John Keung, Dean, BCA Academy of the Built Environment (third from right).From left: SITizens Mr Harvest Yosua Purwono, Mr Aaron Wong, Mr Garrett Ong, and Mr Justin Seah gathered for a picture with one of the judges, Mr Tan Szue Hann,\nManaging Director, MINIWIZ Singapore (second from right).\nachieve Green Mark GoldPlus status and above. Participants\ncould choose to redesign the building and green features to\nachieve the goals while keeping in mind feasibility of ideas and site features.\nTeam leader Mr Seah and his teammates came up with\ninitiatives that helped save energy and costs. One of the solutions was to implement an energy management system that emphasises the use of renewable energy. This included the use of regenerative lifts, carbon monoxide sensors and motion sensors, as well as installation of solar panels. The team also looked into improving the water efficiency, environmental protection, and indoor air quality of the building. They suggested ideas such as using NEWater for cooling tower consumption, implementing recycling efforts and ensuring the cleanliness of the building ventilation system.\nMr Seah said, “The competition was tough as we were\nthe only Year One students amidst 15 teams of seniors from other autonomous universities. Thanks to guidance from our mentor, Asst Prof Steve Kardinal Jusuf, we were able to apply what we have learnt in the classroom to this competition.”\n“One of the judges, Mr Tan Szue Hann from MINIWIZ\nSingapore, was not only impressed with our students' presentation, but also by their innovative ideas and Building Information Modelling (BIM) model that they did up for the competition in a short period of time,” commented Asst Prof Steve Kardinal Jusuf, SIT.\non machine learning from CCTV to recognise threats, and\nusing facial recognition for access of commercial floors.\nThe competition was an ideal platform to share their concept\nof incorporating technology to traditional FM practices. “In this digital era, it is important to integrate technology and streamline processes to make FM more attractive to young professionals, and to do it in a more efficient manner,” explained team member Mr Chua. The team clinched third prize and walked away with a plaque and $500 cash.\nSiTIZEN  |  05/16\nInnovative SITizens Help Shipping\nIndustry Go Green Striking Gold\nwith Troll-E\nTwo teams from SIT-NU marine programmes receive\ncommendation awards and S$5,000 cash prizes in a\ncompetition aimed at helping shipping companies adopt\ncleaner fuelsMechanical Design Engineering\nstudent bags two awards with a PMD design that transforms into\na shopping trolley in three steps\nWith their cost-efficient proposals that streamlined retrofitting operations,\ntwo teams of Year 2 students from the SIT-Newcastle University (NU) marine programmes impressed judges at the Low-Cost LNG Retrofit Challenge. Participants had to develop cost-efficient and innovative Liquefied Natural Gas (LNG) fuel gas system designs and installation concepts that could be retrofitted to an existing vessel, allowing shipping companies to embrace cleaner fuels and reduce harmful emissions, including adhering to the International Maritime Organisation’s stringent guidelines on ship emissions that come into effect from 2020.Final-year student Mr Hilsann Yong made SIT proud by winning both the Gold Award of the Design Category and Best Presentation Award at the 7th National Assistive & Rehabilitation Technologies Student Innovation Challenge in April 2019, co-organised by Nanyang Technological University (NTU)’s Rehabilitation Research Institute of Singapore (RRIS) and the Centre for Healthcare Assistive and Robotics Technology (CHART) at Changi General Hospital.\nHeld since 2013, the challenge aims to encourage students to develop\nsolutions that help improve the lives of the elderly and people with disabilities. A total of 24 ITE, polytechnic and university student teams presented their innovations this year.\nMobility is a cause close to Mr Yong’s heart. He began devising a solution\nto aid elderly in their grocery shopping based on the experience of his 64-year-old mother, who often made multiple trips to the supermarket each week with a shortened shopping list as she had difficulty carrying the heavy groceries home herself. It took him eight months to complete his design with input from Assoc Prof Benjamin Soon, Programme Director, SIT, who shared with him the mobility limitations of the elderly. His solution was Troll-E, a Personal Mobility Device (PMD) which converts into a trolley in three easy steps. It can bear up to 30kg of groceries, and also aims to change the negative stigma usually faced by the elderly when using a Personal Mobility Aid (PMA).\nOn his win, Mr Yong revealed, “I feel deeply humbled to have won\namong so many other talented individuals. In fact, I am genuinely more inspired than proud to know that there are many others out there sharing the same ambition to make the world a more inclusive place.”\nMr Yong is currently refining his prototype to adjust the height of the seat\nand update the grocery box at the back with an attached grocery bag which the user can easily remove to unload groceries. He will represent Singapore along with two other winning teams in the international Convention on Rehabilitation Engineering and Assistive Technology (i-CREATe) held in Canberra, Australia, in August 2019.\nMembers of the second winning team (from left):\nMr Chiam Yi Sheng, Ms Siti Syafiqah, Mr Mong Jun\nHao, Mr Bryan Low and Mr Mustansir Dohadwala.Members of first winning team (from left): Mr Thian Le Wei,\nMr A Eswaran Reddiar, Mr Mohamed Rizwan, Mr Ang Wei\nSin, and Mr Arvinderpal Singh.Final-year Mechanical Design Engineering student Mr Hilsann Yong,\ndevelops Troll-E, a PMD to aid elderly in their grocery shopping.\nThe first team led by Mr Ang Wei\nSin fashioned a design that adds LNG-ready prefabricated sponson storage at both sides of the ship. Such a retrofit can be done in eight weeks and increases the additional cargo carrying capacity by 8% “It was quite a steep learning curve as LNG concepts are quite new to most of us. Nonetheless it was a very fruitful experience and we are glad that we persevered on,” said Mr Ang.\nThe second team proposed the use\nof manganese-steel as a cheaper and viable alternative to the current nickel-based steels, factoring in the material’s tensile strength and feasibility to store LNG fuel.\n“Through this competition, we\nhave certainly honed our project management skills to produce a report in an extremely tight turnaround time, as well as people management skills in coordinating everyone’s schedule and roles,” said team leader Mr Bryan Low.\nHeld from July to December 2018,\nthe competition attracted over 60 participants from universities in Singapore.\nSiTIZEN  |  06/16\nUplifting Gift Brings Cheer and Goodwill\nSome Breakfast and a Lot of FellowshipNew gift from Loyang Tua Pek Kong Temple makes possible\nbursaries in aid of SIT students\nAt the Rotary Club of Bugis Junction Breakfast Meeting, SIT\nstudents and alumni expressed their appreciation for the\nClub’s supportOn 17 March, SIT recipients of the Loyang Tua Pek Kong Bursary not only\nreceived much-needed financial support, but also got a chance to enjoy the festivities at the 2019 birthday celebration of Loyang Tua Pek Kong Temple.\nRenowned in Singapore as a symbol of religious harmony, Loyang Tua Pek\nKong Temple is a multi-religious place of worship where Taoist, Buddhist and Hindu devotees can worship side by side. The Temple’s gift to SIT has made possible 10 Bursaries annually for students across all five academic clusters.\nThe recipients were treated to performances and also enjoyed local\nsnacks from booths serving refreshments to the public. Mr Koo Jia Wei, a Year 3 Telematics student and Bursary recipient, thought the event was an\nSeven students and alumni from the Singapore Institute of Technology (SIT) were among the attendees of the Rotary Club of Bugis Junction (RCBJ) Breakfast Meeting held on the Saturday morning of 2 March 2019 at the Holiday Inn Singapore Atrium. They are also recipients of the Rotary Club of Bugis Junction Scholarship, Rotary Club of Bugis Junction Bursary and Rotary Club of Bugis Junction Outstanding Student Award – all of which had been made possible by the Club at SIT.\nDuring the breakfast, the recipients engaged in a fruitful discussion with RCBJ\nmembers in attendance led by Mr Chew Ghim Bok, President, Rotary Club of Bugis Junction. In addition to dispensing professional advice to the recipients, the Club’s members offered to mentor the recipients and help them navigate the workforce.\nIn addition to expressing their gratitude, each of the recipients shared how\nthe support from RCBJ has tremendously impacted their lives. Mr Koo Jia Wei (in grey shirt), receiving the Bursary from\nGuest of Honour Mr Ng Chee Meng, Minister in the Prime\nMinister’s Office, and representatives of the Loyang Tua\nPek Kong Temple.The first-ever batch of Loyang Tua Pek Kong Bursary recipients at SIT come from across all five SIT academic clusters.(From left) Prof Tan Thiam Soon, President, SIT, Mr George Peh, Chairman, Loyang Tua Pek Kong Temple, Mr Teo Chee Hean, Senior Minister and Coordinating Minister\nfor National Security, and Prof Yaacob\nIbrahim, Advisor, Office of the President, SIT.\nRecipients presenting a token of appreciation to\nMr Chew Ghim Bok, President, Rotary Club of Bugis Junction (third from left).Recipients with members from the Rotary Club of Bugis Junction as well as SIT staff.\neye-opener. “I had heard of Loyang\nTua Pek Kong before, but this was my first time there,” he said. “The turnout was huge, and I had no idea such large festive events existed other than Chinese New Year.”\nHe also shared how grateful he was for\nthe Temple’s support. “Due to unforeseen circumstances, the money I had initially set aside for my tuition fees was not sufficient. I had to start thinking about whether or not to take up weekend jobs for my expenses. Luckily, with the Loyang Tua Pek Kong Bursary, I am now able to pay off the remaining fees and spare more time for my assignments and projects.”\nMs Kilice Ng, a third-year Hospitality\nBusiness student and recipient of the Rotary Club of Bugis Junction Outstanding Student Award in Academic Year (AY) 2018/19, is currently the president of SIT’s Community Service Club. She shared during the session about how passionate she was about serving the community.\nShe said, “I want to influence people around me to make a difference in the lives of others.”\nAlso present was Mr Wong Kai Xian, the\nvery first recipient of the Outstanding Student Award in AY 2015/16. The 27-year-old graduated in 2016 with a First Class Honours degree in Aerospace Systems. He now works at Pratt & Whitney as a Purchasing & Solutions Lead. Mr Wong thanked RCBJ for their generous gift and shared that it has left an indelible mark on him as an individual – knowing that there are others who believe in his capabilities. He said, “Receiving the award has motivated me to do better and to pay it forward.”\nThe Rotary Club of Bugis Junction\nOutstanding Student Award at SIT was made possible by RCBJ in 2015. In 2016, RCBJ made permanent its support of SIT students through the Rotary Club of Bugis Junction Endowment Fund, which supports the Scholarship, Bursary and Outstanding Student Award.\nSiTIZEN  |  07/16\nBlossoming Young Talents\nEven more women undergraduates are given the opportunity to shine, thanks to the\nincreased support for the Kewalram Chanrai Group Scholarship\nMade possible by an endowed gift from the Kewalram\nChanrai Group in 2015, the Kewalram Chanrai Group Scholarship at the Singapore Institute of Technology (SIT) is unique as it supports promising women undergraduates at the university. Now, thanks to a new gift made by the Group in 2018, up to 10 students will be nurtured by the Scholarship annually, and in perpetuity.\nThe recipients of the Scholarship had the opportunity\nto meet and thank Mr Narain Girdhar Chanrai at an appreciation lunch hosted by Prof Tan Thiam Soon, President, SIT for the Kewalram Chanrai Group on 16 April 2019. Also present at the event were Mrs Chanrai, Ms Annie Toh, Financial Controller, Kewalram Chanrai Group, as well as SIT faculty and staff.\nAmong the recipients was Ms Lim Pei Shan, who was\namong the first students at SIT to receive the Scholarship when it was first established in 2015. She was only a first-year student then, and received the Scholarship for two consecutive years. She will now be graduating in October 2019. Ms Munirah Begum D/O Mohamed Shariff, a first year student in the Criminology & Security programme, shared during the event how receiving the Scholarship in Academic Year 2018/19 has helped her tremendously. She said, “It made me realise that it is possible for me to strive Ms Joscelin Yu (left), one of the recipients of the Kewalram Chanrai Group\nScholarship, greets Mrs Chanrai. Before the appreciation, the recipients had banded together to prepare a special token of appreciation for Mr and Mrs Chanrai – they had spent two afternoons making paper flowers to express their gratitude for the scholarship.\nThe recipients of the Kewalram Chanrai Group Scholarship, together with Prof\nTan Thiam Soon, President, SIT, Mr & Mrs Chanrai, as well as Ms Annie Toh, Financial Controller, Kewalram Chanrai Group.\nKewalram Chanrai Group Scholarship recipients, Ms Munirah Begum D/O Mohamed Shariff (left), and Ms Dawn Emelia Lee Min Ni, sharing with the attendees how much the scholarship has impacted their lives. Prof Tan Thiam Soon, President, SIT (right), showing the model of SIT’s new campus in Punggol to Mr Narain Girdhar Chanrai (left) and Mrs Narain Girdhar Chanrai (middle).\nfurther and debunk the stereotypes that women especially\ncan’t take up further studies.”\nProf Tan Thiam Soon, President, SIT, thanked Mr Chanrai\nand the Group for having made the scholarship possible. He said that through the scholarship, “The Kewalram Chanrai Group is providing opportunities for promising young women to become future leaders so that they can help create a better life for themselves, their families and the community.”\nSiTIZEN  |  08/16 SiTIZEN  |  09/16\nHeeding the Call for Sustainability\nat The Mapletree ChallengeThis unique learning initiative, supported\nby Mapletree Investments, promotes spirit\nof innovation and inculcates job interview\nand presentation skills among SIT students\nThe Mapletree Innovation and Entrepreneurship Forum Nursing Students Win The Mapletree Challenge Grand Final with Practical and Innovative DesignEnthusiastic audience members eagerly participating in a quiz segment\nduring The Mapletree Fest.Mr Lionel Lim (third from right), who had trained the students for the Masterclasses, was also present during The Mapletree Fest to give out prizes to winners of the Professional Pitch\nVodcasts, which were submitted by participants after the Job\nInterview & Presentation Masterclasses.\nThe panel dished out much advice on their experiences and how to survive as an entrepreneur. The speakers for the night were: (from left) Mr Shamir Rahim, Founder and CEO, VersaFleet Pte Ltd, Mr Zach Wilson, Managing Director, AlfaTech & DVUCA, Ms\nNancy Ling, Co-Founder, EcoU, Mr Eugene Wong, Founder &\nManaging Director, Sirius Venture Capital, and moderator, Asst Prof Victor Cole, SIT and Co-Chair of The Mapletree Challenge.Prof Tan Thiam Soon, President, SIT (left), presenting a token of appreciation to Mr Edmund Cheng, Chairman,\nMapletree Investments.\nDr Amy Khor, Senior Minister of State, Ministry of Environment\nand Water Resources & Ministry of Health (third from left in front\nrow) was present at The Mapletree Challenge Grand Final to\nhand out the awards to the winning teams.The judging panel grilled each team after their presentation. From left: Dr Reto Callegari, Entrepreneur-in-Residence, SIT, Prof Yaacob Ibrahim, Advisor, Office\nof the President, SIT, Ms Heng Sue Yuan, Vice President,\nCorporate Communications, Mapletree Investments and Prof Ng Siu Choon, Associate Provost (Students), SIT.\nThe six teams presented to a full house at Mapletree Business City. Assoc Prof Deng Xudong, Director, SIT, gives an overview of The Mapletree Challenge\njourney at SIT since October 2018. Students attending the forum asked many\nquestions about the prospects of being an entrepreneur and delved into topics about their respective industries.Team YARJ Green Insight, one of the finalists, after the\nsemi-finals of The Mapletree Challenge with Mr Brad\nBlackstone, Senior Lecturer, SIT, and Co-Chair of The Mapletree Challenge (middle). Taking place for the first time, The Mapletree Challenge (2018-2019) saw\nthe participation of more than 500 students across various programmes at the Singapore Institute of Technology (SIT). Supported by Mapletree Investments, this is the first such learning programme at SIT and aims to equip students at SIT with job interview and presentation skills, while providing them with a test-bed to pitch their entrepreneurial ideas.\nOver the course of seven months, beginning in October 2018, The\nMapletree Challenge consisted of a series of masterclasses on personal\nbranding, interview and presentation skills, a forum discussion on\nentrepreneurship and sustainable innovation, as well as small group mentorship from industry experts on their entrepreneurial ideas.\nTo drum up buzz for The Mapletree Challenge among their fellow\nSITizens, students from the Hospitality Business programme also took it upon themselves to organise The Mapletree Fest on 15 March 2019 – an evening of fun and games which also featured faculty and guest speakers sharing their take on sustainability.\nThe Mapletree Innovation and Entrepreneurship Forum took place on 20 March\n2019, with over 180 participants attending to hear a distinguished panel discuss their perspectives on entrepreneurship and sustainable solutions for today’s world, moderated by Co-Chair of The Mapletree Challenge, SIT’s Asst Prof Victor Cole from the Centre for Communication Skills.\nThe panel consisted of Mr Shamir Rahim, Founder and CEO, VersaFleet Pte\nLtd, Mr Zach Wilson, Managing Director, AlfaTech & DVUCA, Ms Nancy Ling, Co-Founder, EcoU, and Mr Eugene Wong, Founder & Managing Director, Sirius Venture Capital. The speakers discussed emerging trends for sustainable innovations in their respective industries, and offered valuable insights based on their experiences with their own businesses and their journeys as entrepreneurs.\nThe discussion saw many students coming forward during the Q&A Segment to\nask questions about what it takes to become an entrepreneur.\nMr Aloysius Teo, a second-year Criminology and Security student, said, “I learned\nthat failure is mandatory, before one can achieve success. In entrepreneurship, there may not be an original idea that lasts forever. One must keep evolving to remain ahead of the competition.” He added, “The forum was helpful as it showed that despite everyone coming from different industries, there are core traits, characteristics and attitudes that one must have if one wants to be an entrepreneur.”The Mapletree Challenge Grand Final was held at Mapletree Business City on\n2 May 2019. Six teams presented their ideas for sustainable innovations to a\npanel of distinguished judges, consisting of Dr Reto Callegari, Entrepreneur-\nin-Residence, SIT, Prof Yaacob Ibrahim, Advisor, Office of the President, SIT,\nProf Ng Siu Choon, Associate Provost (Students), SIT, and Ms Heng Sue Yuan, Vice President, Corporate Communications, Mapletree Investments. Prior to\nthe Grand Final, the teams had been mentored by industry experts – who\ngave them suggestions on how best to pitch their ideas.\nEmerging as the inaugural champion was Team Trolley, consisting of a group\nof first year students from the SIT-University of Glasgow Nursing programme. The team impressed the judges with a customisable redesign of a laundry trolley, inspired by their observations that nurses were struggling when handling patients’ laundry during their clinical attachment at a nursing home (for more on their innovation, please see Page 12).\nThe team simply hoped to share their innovation with others, and did not\nhave much confidence in winning initially. “I think it was an eye opener for us in the business world. We are nurses with practically zero background in this field,” said team leader Ms Joanne Chua. “It was an opportunity for us to look into techniques for business and marketing.”\nThe Challenge has also given other teams the opportunity to explore their\nprojects further, despite not winning. Team Scooter Power is currently\nMs Chiam Jia Ying, a Year 2 Hospitality\nBusiness student was part of the student organising committee, which also helped to organise the Forum and the Grand Final. She said that her organising team of nine had prepared one month ahead for the festival and was happy to see the fantastic turnout. She added, “We wanted to organise this roadshow to raise awareness for the upcoming Mapletree Challenge events to get students and faculty\nto show their support for the\ncompeting teams.”\nAll of these activities culminated in\nThe Mapletree Challenge Grand Final on 2 May 2019. Prof Tan Thiam Soon, President, SIT,\nsaid, “The Mapletree Challenge is the first learning initiative of its kind at our young university, and it is a great example of a platform that integrates learning, industry and community.”\nMr Edmund Cheng, Chairman of\nMapletree, said, “Aligned to our support for education, which is one of our four Corporate Social Responsibility pillars, it is our aim for The Mapletree Challenge to provide entrepreneurial students with a platform to test their ideas and showcase innovative solutions which could be adapted into real life scenarios.”\nMapletree is a leading real estate\ndevelopment, investment, capital and property management company headquartered in Singapore. It has also made possible the Mapletree Bursary at SIT, in support of financially disadvantaged students at the university.\ncollaborating with SIT and Mapletree\non their prototype of a pedal-powered scooter. Said team leader Mr Chan Xinyin, who is enrolled in the Mechanical Design Engineering programme (UofG) “Mapletree has engaged us for the development of the scooter, and we are hoping to find use for it in Mapletree properties.”\nThe winning team clinched the\nMapletree Gold Award and a cash prize of $5,000. They were followed by first runner-up Team FX1, represented by Samuel Seah from UofG’s Computing Science programme, and second\nrunner-up Team JNL, consisting of Leslie Woon and Tong Jun Hong, also pursuing Computing Science.\nSiTIZEN  |  10/16 SiTIZEN  |  11/16\nThe speakers discussing how technology is increasingly becoming integrated into daily life, and the unique\nopportunities this presents for people with practical ICT skills such as young SIT graduates.The panellists for the evening (from left), Mr Eddie Chau, Mr Ken Soh and Ms Angela Wu regaled the crowd with colourful quips and anecdotes, as they shared their perspectives on the evolving ICT industry and the journey ahead for young graduates.\nParticipants smiling at lively exchanges between the speakers and a student.Mr Howie Lau (extreme right in left photo) and Ms Shirley Wong, (extreme right in right photo) getting to know SITizens during the networking\nsegment of the evening.Mr Rayson Lim (seated, centre) with students and alumni, enjoying a great night out together during the first mentorship session.SITizens find mentorship and more from Infocomm Technology leaders and veterans at the\nfirst-ever run of The SITuation Room: Dialogue with Leaders for ICT ProfessionalsInside The SITuation Room\nWhen the chance to be mentored by industry veterans came\nin the form of The SITuation Room, SIT alumni and students from the Infocomm Technology (ICT) cluster wasted no time in signing up.\nThe SITuation Room has two main segments. The first was\na dialogue session held on 27 March 2019 with ICT industry leaders who discussed major trends and challenges in the field. The main speakers for the evening were Mr Eddie Chau, Co-founding Partner of tech start-up incubator TNF Ventures; Ms Angela Wu, Threat Intelligence Analyst of virtualisation and cloud computing software provider, VMware; and Mr Ken Soh, Chief Executive Officer of cybersecurity firm Athena Dynamics. There was also a networking session which preceded the dialogue, where SITizens got the chance to mingle with leaders and professionals from organisations such as Amazon Web Services, Dell EMC and Kaspersky Lab Singapore. The discussion was moderated by Prof Yaacob Ibrahim, Advisor, Office of the President, SIT.\nProf Tan Thiam Soon (eighth from left), President, SIT, and representatives of SIT together with the industry mentors. The mentors are:\nMr Howie Lau, Chief Industry Development Officer (Industry Development), Info-communications Media Development Authority (third from left);\nMr Peter Moore, Regional Managing Director, Amazon Web Services Singapore (fourth from left); Mr Leonard Sim, Director/Head of Presales,\nAPAC, Kaspersky Lab Singapore (fifth from left); Ms Shirley Wong, Managing Partner, TNF Ventures (sixth from left); Mr Eddie Chau, Co-founding Partner, TNF Ventures (centre); Ms Angela Wu, Threat Intelligence Analyst, VMware (fifth from right); Mr Ken Soh, Chief Executive Officer, Athena Dynamics (fourth from right); Mr Eric Goh, Vice President & Managing Director, Singapore Enterprise Business, Dell EMC (third from right);\nMr Rayson Lim, Chief Financial Officer, M.Tech Holdings (second from right).\nMr Darren Lim, Year 2 Information and Communications\nTechnology (Software Engineering) student, said he particularly enjoyed an anecdote by Ms Angela Wu during the dialogue. “I really liked how she shared her life story of having close to zero knowledge in cybersecurity, and working hard until she finally became an expert at it,” he said, adding that he felt this spirit of constant improvement could be applied to all domains.\nThe second segment is an ongoing pilot mentorship\nprogramme. Students and alumni are arranged in small groups and mentored by one of the professionals they met during the networking session.\nMs Linette Leow, Year 3 Information and Communications\nTechnology (Information Security) student, is part of a group being mentored by Mr Rayson Lim, Chief Financial Officer of cyber security and network performance solutions company, M.Tech Holdings Pte Ltd. She said: “I think the mentoring sessions have given me a good\nopportunity to mingle with someone from the industry and understand how it’s like to work outside. Talking with Mr Lim was enjoyable; he encouraged us to not just listen to him but talk about our own lives as well. In the end it became a sharing session where we all got to know each other better.”\nOne of the main things Linette learnt\nthrough the session was Mr Lim’s advice on handling one’s own emotions and working relationships. “He shared that sometimes people express anger at you not because of something you did but because they are frustrated with something else. Instead of venting it back at the person, I also have the option to lend them a listening ear instead. I feel such advice is applicable to both work and everyday life.”\nThe next run of The SITuation Room\nwill be planned for alumni and graduating\nstudents from the Engineering cluster.\nLook out for more updates soon!\nSiTIZEN  |  12/16\nModular Wonder\nFlexible trolley design which solves a real-world problem wins at The Mapletree Challenge\nGrand Final\nThe proud members of Team Trolley: Tan Hong Da, Koh Thong Wu, Joanne Chua, Kang Xun, Abdul Rafi Bin Abdul\nRahim, Ang Zi Qing, and Liu Zhi Ting.IMAGINE!\nModular Trolley\nBy Abdul Rafi Bin Abdul Rahim, Ang Zi Qing, Joanne Chua, Kang Xun,\nKoh Thong Wu, Liu Zhi Ting and Tan Hong Da\nBachelor of Science with Honours in Nursing\nDuring a two-week clinical attachment at a nursing home, seven first year students\nfrom the Nursing programme observed how a plastic laundry cart was costing the organisation. Laundry sorting was inefficient due to lack of proper labelling, and added on to the time nurses or volunteers needed to complete a task. It also\ncaused clutter and increased the possibility of infection for the patients.\nTo solve these issues, the group came up with the idea for a modular trolley made\nfrom an antimicrobial copper alloy which would feature customisable, divided sections for clearer segregation of items needed in the nursing home. This practical idea which addressed a real life need led to the group winning The Mapletree Gold at The Mapletree Challenge Grand Final (for more, please see Page 8).\nThe design sketch for the modular trolley with its various compartments and features.\nIn their research, the group found that copper alloy is a sturdier material with antimicrobial properties. These properties are also not reduced even with the use of commercially available disinfectants. They also shifted the waste bin to the bottom segment of the trolley to reduce overall cross-contamination. The group also redesigned the linen bags for the trolley to indicate which bags contained contaminated clothes, and which will be sent to an external vendor for washing.\nAccording to Ms Joanne Chua,\nmost trolleys available in the\nmarket are inflexible or made\nwith other types of material. The\ntrolley’s modular function also\nmeans that it can be used in a\nvariety of other settings and can\nbe customised as needed for a\nparticular organisation. She said\nthat group was elated about their\nwin at The Mapletree Challenge.\nMs Chua added, “We hope that\nthe idea will be picked up by\na manufacturer or a healthcare\norganisation.”\nSiTIZEN  |  13/16\nOn Saturday, 27 April 2019, SIT alumni gathered at Pan Pacific\nSingapore for The Art of Mingling & Networking, an etiquette and networking workshop organised by the SIT Alumni Career Network. Conducted by Ms Agnes Koh of Etiquette & Image International, the participants learned about the importance of making a good first impression, which begins with deportment – the way a person stands, walks and behaves. They were taught how to execute good posture, where to place their hands, and even the right way to sit.\nThe participants also learnt the basic components of mingling,\nfrom how to introduce oneself, the right way to exchange business cards, as well as how to execute a basic handshake. They were encouraged to move around the room and practise with everyone instead of sticking to one partner throughout the whole workshop. Ms Koh also gave the alumni multiple situations that they might experience at a networking event, such as attempting to enter a group or striking up a conversation at a coffee bar.A Pleasure to Mingle With You\nSITizens learn some useful life skills in deportment and etiquette at The Art of Mingling\n& Networking workshopAlumni like Mr Lim Xing Yi (left) practised introducing themselves and the proper way to exchange business cards.\nThe participants practise how to execute good posture and measure where to place their\nhands when standing.Alumni with Ms Agnes Koh, all ready with their new networking skills.\nMr Lim Xing Yi, who graduated from SIT’s\nInformation & Communications Technology (Software Engineering) programme, made use of the tips he learnt at the buffet line of a talk he attended. “I offered a paper plate to the person queueing next to me, after which I followed up on the taste of the food since the person was alone, and not long after, a meaningful conversation kicked off,” he recounted.\nMs Faezah Binte Shahari, an Aerospace Systems\n(SIT-UofG) alumnus, felt that the session allowed her to relearn the basics of business etiquette. “While networking and mingling might seem basic, the workshop allowed us to further polish our skills in order to present ourselves better at the workplace,” she said. “Given the opportunity, I would love to learn more. As I’m in customer support, this will better equip me managing customers and their expectations.”\nSiTIZEN  |  14/16 SiTIZEN  |  15/16\nOn 8 May 2019, SIT alumni gathered at Shaw Lido for the\nhighly-anticipated blockbuster of the year, Avengers: Endgame.\nOrganised by the SIT Alumni Leisure Network, the SIT Alumni Movie Night saw over 230 alumni and various faculty members in attendance, all eager to catch the 22nd film in the Marvel Cinematic Universe.\nTucking into a sumptuous buffet spread before the movie, the\nparticipants wasted no time in reconnecting with fellow SITizens. Mr Gordon Yeo, an alumnus from the Aeronautical Engineering programme (SIT-University of Glasgow), also had the opportunity to chat with Mr Chan Wing Leong, Deputy President (Administration) and Chief Financial Officer, SIT, over a common interest – Ultimate Frisbee and received valuable advice on career building.\n“My takeaway from our conversation was that we should not forget\nthat building a career path is going to take time, and we should remind ourselves not to be consumed by the occasional need to feel instantly gratified by the effort we put in,” shared Mr Yeo.\nSITizens in line, eagerly waiting to collect their movie tickets.\nStudent helpers engaging alumni on what they hope to see at future SIT\nAlumni events.Alumni wondering what will the ending be like for the Avengers.\nIn the queue early to snag good seats for maximum viewing pleasure. Flashing bright smiles before going to enjoy the epic conclusion to a series of\n22 Marvel movies.\nFuelling up with a hearty buffet dinner before the show! Huddling close for a photo with Assoc Prof Jeanette Ng, Cluster Director, SIT (extreme right).(From left) Assoc Prof Alfred Tan, Programme Director, SIT, Assoc Prof Gan Hiong Yap,\nProgramme Director, SIT, Assoc Prof Lee Kwee Hiong, Cluster Director, SIT, caught up with\nalumni Miss Jennifer Wee Zhen Zhen and Mr Ong Shi Ming.Alumni , Assemble!SITizens all ready for the climactic finale of the Avengers film series\nat SIT Alumni Movie Night\nMr Chan Wing Leong, Deputy President (Administration) and Chief Financial Officer,\nsharing career building advice with alumni.\nGleeful SITizens, ready for the movie after scoring choice seats.\nTransfixed to the screen as the story unfolded.\nSIT Alumni Card Benefits\nScan for the latest merchant\ndiscounts available!\nArmed with popcorn and drinks, the participants were all set\nfor the movie. Marvel fan Mr Dominic Ngian, who graduated in 2015 from the Hospitality Management programme (UNLV) had attended all of SIT’s Alumni Movie Nights featuring Marvel movies. He said, “Such movie nights provide us with friends that we may be too busy to meet in our personal lives, while giving us a chance to watch movies that we all enjoy and can discuss about after.”\nAs per SIT Alumni Movie Night tradition, there was a\nnamecard drop lucky draw and several alumni walked away happily with CapitaLand vouchers."
}