{
  "url": "https://alumni.singaporetech.edu.sg/wp-content/uploads/2023/09/sitizenissue-21.pdf",
  "type": "pdf",
  "content": "Once a SiTizen, Always a SiTizen ISSUE NO. 21  |  NOVEMBER 2018\nWHAT’S\nHAPPENING\naround our little\nbig campus\nSITizen is a publication by the\nSIT Advancement & Alumni Division.\nFor enquiries, please e-mail us at\nAlumni@SingaporeTech.edu.sg© Singapore Institute of Technology 2018\nDear SIT Alumni,\nAn Accomplished Year, with Plenty of Good Cheer\n3 New Joint-Degree\nProgrammes with UofG in Engineering and ICT\n2017 GES Results: 92.3%\nOverall Employment Rate\n$2,000 in SITizens\nLearning Credits  for Alumni\nSIT Wins Community\nPartnership Merit Award\nMore than a Recognition\nof Excellence\nRock ‘N’ Roll the Night\nAway at New Alumni Welcome Party\nThe Mapletree\nChallenge Launched; OIP Grant from T T J\nFirst Two SUniG Golds\nin CueSports and TchoukballSITizens have a lot to celebrate as the year draws to a close.\nFor the Class of 2018, they were treated to a rocking good time at the annual New Alumni\nWelcome Party after attending their respective graduation ceremonies. As they step into the working world, they can look forward to good job prospects – as indicated by the findings of the latest Graduate Employment Survey (GES). The survey showed that SIT graduates not only have a high overall employment rate of 92.3% (as compared to 89% in 2016), but also enjoy higher mean starting salaries of $3,350 (as compared to $3,282 in 2016).\nSIT’s more than 8,000 alumni with a Bachelor degree can also continue to develop themselves\nin line with the SIT-DNA of “Learn, Unlearn and Relearn”. SIT has announced that they will receive $2,000 worth of SITizens Learning Credits, which they can use to take up courses offered by SITLEARN Professional Development, SIT’s Lifelong Learning division.\nIn the year past, SIT’s philanthropic partners have continued to give SITizens their firm\nsupport through performance awards, scholarships as well as other gifts to nurture student excellence, and also financial aid instruments such as bursaries.\nThis year, a total of 81 awards and 134 non-bonded scholarships were presented at the Recognition of Excellence presentation and SIT Graduation ceremonies. There is also The Mapletree Challenge, which will give students a boost in their communication and entrepreneurial skills, as well as the T T J Design and Engineering Overseas Immersion Programme Grant that provides financial support to Civil Engineering students when they head for their compulsory programme in Glasgow.\nThis year also marked the first Singapore University Games (SUniG) Gold Medals for SIT through CueSports and Tchoukball. A group of Telematics students also emerged among the Top 10 finalists at the inaugural Smart Bus Challenge organised by the Land Transport Authority. SIT won a Community Partnership Merit Award from the People’s Association, for its community outreach initiatives in Punggol, well ahead of the university’s scheduled move to its permanent campus there in 2023.\nThere is already something to look forward to in the year ahead: SIT has announced three\nnew joint degrees with the University of Glasgow from Academic Year 2019/20 onwards. These are in Aerospace Engineering, Computing Science and Mechanical Engineering, all of which place emphasis on emerging technologies.\nWe hope you will enjoy reading this issue of SITizen. Should you wish to contribute a story,\ndo drop us a line at Alumni@SingaporeTech.edu.sg.Award and scholarship recipients at the annual\nRecognition of Excellence (see Pages 8 – 9).\nSiTIZEN  |  02/16\nNew Joint-Degree Programmes to Boost Talent Pipelines\nSIT and University of Glasgow to deliver 3 new undergraduate joint-degree programmes in\nEngineering and Infocomm Technology from AY 2019/20 onwards\nSIT-UofG Joint Degree Programmes Curriculum/Description\nBEng (Hons) in\nAerospace Engineering• Application-oriented training in aerospace engineering in Singapore’s context, with an emphasis on unmanned aerial vehicle (UAV) application\n• First aerospace undergraduate programme specialising in unmanned systems, an area of growth in Singapore’s aviation and aerospace sector\nBSc (Hons) in Computing Science• Supports Singapore’s Smart Nation initiative with Internet of Things (IoT) specialisation\n• Encompasses a broad-based curriculum which combines knowledge from IoT, software engineering, data analytics, cyber security and machine learning\nBEng (Hons) in Mechanical Engineering• Two specialisation tracks\n- Design specialisation focuses on concepts of digital manufacturing and design\n- Mechatronics specialisation focuses on Industrial Internet of Things (IIoT) used for automation\nand robotics, unmanned systems and co-bot design\nThese three-year joint degrees\nplace an emphasis on emerging technologies and will feature the Integrated Work Study Programme (IWSP), where students will work and train in companies related to their specialisation. In addition, students will also be required to complete the compulsory Overseas Immersion Programme in Glasgow.\nProf Tan Thiam Soon, President, SIT,\nsaid that these new joint degree\nprogrammes bring together the best of both institutions. He said, “Building on the success of our existing collaboration with the University of Glasgow, we are pleased to offer niche, specialised programmes focusing on emerging technologies, such as unmanned aerial vehicles, Internet of Things and digital manufacturing.”\nProf Sir Anton Muscatelli, Principal and Vice-Chancellor, UofG, said, “This event\nmarks an important milestone in the development of the University of Glasgow’s long-standing partnership with SIT. Despite the geographical distance between our two institutions, I feel we have developed a very close relationship through our fruitful and successful partnership.”\nIn addition to the three new programmes, SIT and UofG currently offer two other\njoint degree programmes in Civil Engineering and Nursing. SIT’s collaboration with UofG started in 2011, with just two degree programmes and around 100 students.\nSIT and the Energy Market Authority (EMA) are\ncollaborating on a $20-million research programme known as Exploiting Distributed Generation (EDGE) to focus on distributed energy technologies to prepare Singapore for an increasingly decentralised energy landscape. Mr Chan Chun Sing, Minister for Trade and Industry, announced this at the Singapore International Energy Week 2018 on\n30 October (see photo).\nUnder EDGE, companies and researchers from all Institutes\nof Higher Learning (IHLs) will have the opportunity to participate in grant calls and develop new technologies in the areas of micro-grid design, distributed energy optimisation and management, and differentiated power-quality systems. Grant awardees can implement their projects in a realistic and controlled environment such as the Pulau Ubin Micro-grid and SIT’s micro-grid at its upcoming campus in Punggol.\nThe five-year programme is co-funded by the National Giving an EDGE to Singapore’s\nPower Engineering Capabilities\n(photo credit: Energy Market Authority)At the annual People’s Association (PA) Community Spirit\nAwards 2018 presentation ceremony, SIT was awarded the Community Partnership Merit Award for its community outreach initiatives in the Punggol community.\nSince 2016, with the launch of the S.A.F.E. (Solar-Powered\nAnti-theft Free and Easy) Box (for users of outdoor spaces in Punggol), SIT has been involved in several tie-ups with PA in the area. These include initiatives such as the twice-yearly Punggol Science Camp for primary school students and the Pasir Ris-Punggol National Day Dinner. More recently, SIT’s Allied Health and Nursing students have promoted health awareness among residents by conducting population health surveys and talks.\nEarlier this year, SIT also set up SkillsCraft, a community\nmakerspace at Punggol21 Community Club. SkillsCraft provides resources for residents to innovate with SIT faculty and students by designing and building prototypes that help solve issues within their homes and living environments (see photo above).\nCommunity Partnership Merit Award for SIT\nResearch Foundation’s\nResearch Innovation and Enterprise 2020 Plan, SIT, as well as industry players from the power sector. The first grant call will close on 23 January 2019.\nSiTIZEN  |  03/16\nSIT Graduates Continue to Have Good Employment Outcomes\nAlumni to Receive $2,000\nWorth of Credits for CoursesLatest GES findings show increase in Overall and Full-Time Permanent Employment rates\nMore than 8,000 SITizens will be able to\nenrol in courses as part of SIT’s lifelong learning initiative\nStarting from 2019, SIT alumni will be receiving $2,000\nworth of SITizens Learning Credits, which they can use to take up eligible standalone courses offered by SITLEARN Professional Development, SIT’s Lifelong Learning division. The courses available range from one-day masterclasses to short courses over a few weeks, covering topics such as health sciences, cyber security and data analytics.\nThe initiative was announced by Prof Tan Thiam Soon,\nPresident, SIT, at SIT’s graduation ceremony (for more on the ceremonies, see Page 4) at its Dover campus in October. “We want all SITizens, those in the university today and those out working, to develop a mindset and habit of lifelong learning through continuous professional development so that they will remain adaptable, relevant and nimble. SIT will always be there to cater to their needs,” said Prof Tan.SIT’s pioneer batch of Hospitality Business graduates at their graduation ceremony in October 2017. Since graduation,\nthey secured an overall employment rate of 94.7%.\nSITizens continue to be well-received by the industry, with improved employment\nrates and competitive starting salaries.\nFindings from the 2017 Joint Graduate Employment Survey (GES) survey show\nthat SIT graduates in the labour force achieved a high overall employment rate of 92.3%, a 3.3%-point increase from 89% in 2016. The proportion of graduates in the labour force who secured full-time permanent (FTP) employment increased by 5.8% points from 77.1% in 2016 to 82.9% in 2017. The mean gross monthly salary among fresh graduates employed in FTP employment was also higher at $3,350, compared to $3,282 in 2016.\nThe GES took place from March to May 2018, with 85.6% of SIT‘s 1,530 graduates\nparticipating. These graduates completed their studies between October 2016 and September 2017.\nThis is also the first time graduates from SIT-conferred degree programmes\nparticipated in the survey. Graduates from the Accountancy, Hospitality Business and Engineering programmes all secured overall employment rates over 90%. Employment rates for Healthcare-related programmes remain strong, with 97.4% of Allied Health graduates and 96.5% of Nursing graduates in FTP employment.\nThe credits will have a validity period of five years, and can\nbe used for courses starting from 1 April 2019 to 31 March 2024, with registration beginning in January next year. The credits can also be used to offset eligible subsidised courses offered by SkillsFuture Singapore. All SIT alumni are eligible to receive the credits as long as they have been conferred with a degree or joint degree from any of the undergraduate programmes offered by SIT and its Overseas University (OU) partners.\nAssoc Prof Ivan Lee, Vice-President\n(Industry & Community), SIT, was heartened that SIT students continue to enjoy high employability and competitive salaries, despite SIT being a young university. He stated that over 80% of graduates from SIT’s Accountancy and Hospitality Business programmes received job offers from the Integrated Work Study Programme (IWSP) companies they worked in even before graduation. “At SIT, our focus on empowering students with an applied learning experience both within and outside the classroom, as well as our strong symbiotic relationship with industry partners, allow our students to gain much valued work experience and exposure,” he said.\nA flagship programme of SIT,\nthe IWSP provides students with industry experience by immersing them in a real work environment for eight to 12 months, longer than traditional internships. These extended attachments allow employers to assign meaningful tasks and challenging projects to students to assess their suitability as full-time hires. Since its inception in 2014, the IWSP has expanded to cover 16 SIT and joint degree programmes, with over 1,000 students going out into the industry for their work-study attachments in the Academic Year 2018.\nTo find out more about SITLEARN Professional\nDevelopment and the SITizens Learning Credits, head over to https://www.singaporetech.edu.sg/sitlearn/\nSiTIZEN  |  04/16 SiTIZEN  |  05/16\nTheir Moment to ShineCelebrating the Class of 2018\nMore than 400 students graduated from SIT-conferred and SIT joint degree programmes\nin ceremonies that took place over three days from 17 – 19 October\nThis year, Singapore Institute of Technology (SIT)\ncelebrated the graduation of pioneer graduates from the Sustainable Infrastructure Engineering (SIE) (Land) and Information and Communications Technology (ICT) programmes as well as those from the Nursing joint degree programme with University of Glasgow (UofG). SIT also conferred its first Master degrees to students from the SIE (Land) programme. The ceremonies were held from 17 – 19 October at the SIT@Dover Auditorium.\nGuests of Honour for the ceremonies included Mr Chan\nChun Sing, Minister for Trade and Industry; Assoc Prof Big smiles all around from the (clockwise) Hospitality, Accountancy and Sustainable Infrastructure Engineering (Land) graduates.The very first batch of students to graduate from the Nursing programme, offered\njointly by SIT and UofG.Graduates of the ICT programme all ready to make their mark.\nCPA Australia Book Prize in Fraud, Ethics and Forensic Accounting\nJasmine Tan Jie NingB (Hons) in Accountancy\nFairmont Singapore and Swissôtel The Stamford Book Prize\nin Hotel Project ManagementAng Guo ZhongB (Hons) in Hospitality Business\nFurama Hotels Book Prize in Capstone Project\nKoo Han Tong & Kwan Xiang You, Elijah\nB (Hons) in Hospitality Business\nGrand Hyatt Book Prize in Revenue Management\nLim Jia Qi HazelB (Hons) in Hospitality Business\nPKF Book Prize in Change Management\nAlicia Ng Xin Ping\nB (Hons) in Accountancy\nSingapore Computer Society Prize for Final Year Best Capstone Project\nin Software EngineeringNicholas See Wee KiatBEng (Hons) in Information and Communications Technology (Software Engineering)\nThe Park Hotel Group Book Prize in Hospitality Interactive Marketing\nFoo Tee Hao Melvin & Jenson Seah Guo LongB (Hons) in Hospitality Business\nBaker Tilly TFW Outstanding Student Award in Accountancy\nOng Lek Kiang\nB (Hons) in Accountancy\nCSIT Outstanding Student Award in Information and Communications\nTechnology (Software Engineering) Elson Ho Wei ShengBEng (Hons) in Information and Communications Technology (Software Engineering)\nEPS Computer Systems Outstanding Student Award in Information\nand Communications Technology (Information Security)Wong Zhi Yuan ChristopherBEng (Hons) in Information and Communications Technology (Information Security)\nEY Outstanding Student Award in IWSP\nLeon Gerk Beng Siong\nB (Hons) in AccountancyFullerton Health Outstanding Student Award in Nursing\nSabrina Tan Chen YinBSc (Hons) in Nursing\nKaspersky Cybersecurity Award\nAng Guo GenBEng (Hons) in Information and Communications Technology (Information Security)\nLand Transport Authority Best Final Year Sustainable Infrastructure\nEngineering (Land) Student Award\nJennifer Wee Zhen Zhen\nBEng (Hons) in Sustainable Infrastructure Engineering (Land)\nLoh Chia Heng Accountancy Award\nTeo Jun Wei DennisB (Hons) in Accountancy\nSBS Transit Outstanding Student Award in IWSP\nin Sustainable Infrastructure Engineering (Land)\nOng Fang See Christopher\nBEng (Hons) in Sustainable Infrastructure Engineering (Land)\nSingapore Accountancy Commission Outstanding\nStudent Leader AwardLau Chee Guan\nB (Hons) in Accountancy\nSMRT Outstanding Student Award\nin Sustainable Infrastructure Engineering (Land)\nOng Shi Ming\nBEng (Hons) in Sustainable Infrastructure Engineering (Land)\nPwC’s Final Year Accountancy Student Award\nTeo Jun Wei Dennis\nB (Hons) in Accountancy\nThomson Medical Final Year Nursing Student Award\nGao MengshiBSc (Hons) in Nursing\nIMDA Gold Medal\nNicholas See Wee KiatBEng (Hons) in Information and Communications Technology (Software Engineering)\nThe Ngee Ann Kongsi Gold Medal\n(For The Most Outstanding Graduating Student)Sabrina Tan Chen Yin\nBSc (Hons) in NursingDr Muhammad Faishal Ibrahim, Senior Parliamentary\nSecretary, Ministry of Social and Family Development, and Ministry of Education; Dr Richard Helfer, Member, Board of Trustees, SIT; and Mr Ng Cher Pong, Deputy Secretary (SkillsFuture), Ministry of Education and Chief Executive Officer, SkillsFuture Singapore.\nMr Nicholas See Wee Kiat from the ICT (Software\nEngineering) programme, Mr Ong Lek Kiang from the Accountancy programme and Mr Tan Wei Qin from the Hospitality programme were all lauded as valedictorians for their respective ceremonies.Mr See recounted fondly his SIT admissions interview and thanked his professors and loved ones for the support he had received in his university journey. “Even though we will always meet new challenges, I believe that every one of us here, whether an engineer or an IT professional, is well equipped with the right toolsets and mindset to overcome them,” he said.\nAmong the award winners during the graduation ceremony\n(see box for the full list) was Ms Sabrina Tan Chen Yin who graduated with a Nursing degree. She received The Ngee Ann Kongsi Gold Medal (For the Most Outstanding\nSIT-Conferred Degree Programmes No. of graduates Date of Ceremony\nBEng (Hons) in Sustainable Infrastructure Engineering (Land)  67\n17 October 2018MEngTech in Sustainable Infrastructure Engineering (Land)  13\nBEng (Hons) in Information and Communications Technology\n(Software Engineering)  55\nBEng (Hons) in Information and Communications Technology\n(Information Security) 10\nB (Hons) in Accountancy  106\nB (Hons) in Hospitality Business  90 18 October 2018\nJoint Degree Programmes\nBSc (Diagnostic Radiography)\n(SIT-Trinity College Dublin)27 18 October 2018\nBSc (Hons) in Nursing\n(SIT-University of Glasgow)52 19 October 2018Congratulations to the Award Winners!\nAt the graduation ceremonies, awards for graduating students, which were made possible by donors, were presented to the\nfollowing recipients:\nGraduating Student) as well as the Fullerton Health Outstanding Student Award.\n“I am immensely thankful and honoured to receive these\nawards, made possible by The Ngee Ann Kongsi and Fullerton Health. Their recognition had intensified my belief and passion in choosing nursing as a career path,” said Ms Tan. “It is true that the definite way to produce great results is to do what you love.” She has since commenced a full-time position as a Staff Nurse at the Emergency Department of Khoo Teck Puat Hospital.\nSiTIZEN  |  06/16\nA New Adventure Beckons\nFrom September to October, more than 1,000 SITizens graduated from programmes\noffered by SIT’s Overseas University Partners\nThe Culinary Institute of America\nGraduation Ceremony\n12 September 2018\nThe Bachelor of Business Administration in Food Business\nManagement (Culinary Arts) degree offered by The Culinary Institute of America (CIA) at SIT was presented to 37 graduands. Held at the Temasek Polytechnic Auditorium, the reception after the ceremony was prepared by current students from the CIA programme.\nThe Guest of Honour for the ceremony was Chef Eric Teo,\na celebrity chef with 30 years of experience, who was also appointed Ambassador of The Culinary Institute of America, during the same ceremony.\nReceiving the Frances Roth Leadership Award was Mr\nChan Wei Peng. Ms Chan Munn Yi was the recipient of the Julius Wile Academic Achievement Award and the Culinary Award. Also receiving the Culinary Award was Mr Bryan Tan.\nMs Mandeep Kaur Sidhu, was the Student Speaker for the\nceremony and is currently a cook at Cheek by Jowl. She said, “I had no idea what a roller coaster ride I was about embark on, full of twists and turns that I never saw coming, and I am so happy to be able to stand here and say that we’ve all made it here together.”\nTrinity College Dublin\nGraduation Ceremony\n18 October 2018University of Glasgow Graduation Ceremony\n19 October 2018\nHeld over three separate sessions on the same day, the University of Glasgow Graduation Ceremony saw the graduation of 323 students from six degree programmes: Bachelor of Engineering with Honours in Aeronautical Engineering, Bachelor of Engineering with Honours in Aerospace Systems, Bachelor of Engineering with Honours in Mechanical Design Engineering and Bachelor of Engineering with Honours in Mechatronics, Bachelor of Science with Honours in Computing Science as well as the Bachelor of Science with Honours in Nursing (jointly offered by SIT and UofG).\nMr Ong Mu En Wayne from the Aeronautical Engineering\nprogramme was awarded the Project Prize for Engineering and Ms Varnica Jain from the Mechatronics programme was awarded the Professor Wu Dao Quan (\n吴道全教授 )\nOutstanding Engineering Student Award. The Secura Group Limited Project Prize for Computing Science and the Secura Group Limited Top Computing Science Student Award were presented to Mr Arvind S/O Kalai Silvan and Mr Goh Jie Xiang respectively.\nNewcastle University\nCongregation Ceremony\n24 October 2018\nHeld at Nanyang Polytechnic, the Newcastle University\nCongregation Ceremony saw the graduation of 352 students from seven programmes offered by NU at SIT. The ceremony was held over two sessions with Dr Bicky Bhangu, President of Rolls Royce Singapore and His Excellency Scott Wightman, British High Commissioner to Singapore as Guests of Honour for the morning and afternoon sessions, respectively.\nMr Raihan Bin Yacob from the Food and Human Nutrition\nprogramme was the student speaker for the morning session and Mr Aizad Bin Mohamed Norahim from the Marine Engineering programme spoke at the afternoon session.\nIn his speech, Mr Raihan Bin Yacob encouraged his\nfellow graduands to try everything and spoke about how thankful he was for the Overseas Immersion Programme. He said, “The experience that I had in the United Kingdom was life-changing. It opened our eyes to see what the world had to offer if we choose to explore and expand our wings.”DigiPen Institute of Technology  Commencement Ceremony\n27 October 2018\nThe 126 graduands from DigiPen Institute of Technology were especially delighted to not only receive their degrees but to also watch a special video made by the faculty to congratulate them on their graduation during their commencement ceremony.\nThe Commencement Speaker for the ceremony was Mr\nLo Kien Foh, Managing Director, Continental Automotive Singapore Pte Ltd.\nMr Ang Wee Kiat Clarence from the Bachelor of Science in\nComputer Science in Real-Time Interactive Simulation, Mr Choo Jing Lin Christopher from the Bachelor of Science in Computer Science and Game Design Programme, and Mr Xie Yuancai from the Bachelor of Arts in Game Design were the Class Valedictorians for their respective programmes.\nMr Ang also spoke at the ceremony and compared the\nfour years at SIT-DigiPen to a “trial by fire”. He said, “These past four years have been a never-ending slog of projects and assignments, all to make sure that we are prepared and well learnt.”University of Liverpool\nGraduation Celebration\n29 September 2018\nAt a ceremony held at the SIT@Dover Auditorium, 81\nstudents received their degree scrolls for the Bachelor of Arts with Honours in Criminology and Security from the University of Liverpool at SIT.\nThe valedictorian from the Class of 2018 was Mr Ting\nPin Yeng, James, who spoke about how the programme challenged him and his fellow classmates to think differently about the world around them. He said, “To have such firmly held views disrupted is like having cold water splashed onto your face... it has sharpened our ability to critically appraise the status quo, to break down the normative ways of thinking, to phrase the right questions, and constantly find ways to improve our society.”\nReceiving the award for Top Dissertation were Mr Ahmad\nSalehin Bin Mohd Saleh and Ms Suhaila Binte Zainal Shah. Ms Han Huimin, Vincentia received the honours for the Top Work Project.\nSaid Ms Jain who is currently an engineer, “I am honoured\nand grateful to receive the Professor Wu Dao Quan\n(吴道全教授 ) Outstanding Engineering Student Award.\nRecognising my efforts, this award is an encouragement that I will always cherish.”\nSiTIZEN  |  07/16\nCelebrating the Class of 2018\nThe SIT-TCD Graduation Ceremony at the SIT@Dover\nauditorium saw 152 students receiving their degree scrolls for the Bachelor in Science (Diagnostic Radiography) (jointly offered by SIT and TCD), Bachelor in Science (Occupational Therapy), Bachelor in Science (Physiotherapy) and Bachelor in Science (Radiation Therapy) programmes.\nThe Ambassador of Ireland to Singapore, His Excellency\nPatrick Bourne, was the Guest of Honour for the ceremony.\nMs Tan Chin Mei, receiving her degree in Physiotherapy, went\non stage to give her speech as the valedictorian. “These past four years have presented us with a lot of ups and downs, and it is always comforting to know that there is always someone there in our corner, supporting us along the way,” she said. “In the same way all of you have supported and helped one another through these years, I hope that you will continue to keep that friendship going, providing support and encouragement for each other in our future endeavours.”\nSiTIZEN  |  08/16 SiTIZEN  |  09/16\nMore Than A Recognition of Excellence\nThe message to close to 540 attendees at the annual Recognition of Excellence presentation: an award doesn’t just recognise great student performance – it is also a token of the faith that\nphilanthropic partners have placed in SIT’s young SITizens\nScholarship recipients and members of SIT Senior Management pose together at the Recognition of\nExcellence ceremony.\nThe Ngee Ann Kongsi Scholarship recipients with Mr Yeo Boon Hon (back row, third from left), Vice Chairman, Education Sub Committee,\nThe Ngee Ann Kongsi.\nProf Loh Han Tong, Deputy President (Academic)\n& Provost, SIT, presenting the RSA Book Prize in\nOperations Security & Incident Management to\nMs Tan Li Ying.EnGro Scholarship recipients with Mr Vincent Loh, Manager, Knowledge Management, EnGro Corporation Ltd (extreme left), Mr Soon Sze Meng, Member, Board of Trustees, SIT (third from left), Prof Tan Thiam Soon, President, SIT and Mr Tan Cheng Gay, Chairman, EnGro Corporation Ltd (fifth and sixth from left respectively).A proud moment for the Tan Sri (Dr) Tan Chin Tuan Scholarship recipients with Ms Yap\nSu-Yin, CEO (extreme right), and Ms Angeline Kwong, Manager (extreme left), of the\nTan Chin Tuan Foundation.Close to 540 guests and recipients attended the ROE presentation this year.Scholarship and book prize recipients (from left) Ms Evangeline\nTan Si Hui, Ms Janelle Tan Jia En and Mr Lewis Tan Ping Jin\nsharing memorable moments in their ongoing SIT journey to the\ndonors, and how the awards they received have motivated them in their pursuits.\nDr Reto Callegari (left), Treasurer, Rotary Club of Bugis Junction (RCBJ) and\nMs Vanisa Lee (third from left), together with Rotary Club of Bugis Junction\nOutstanding Student Award recipient, Ms Kilice Ng, and Rotary Club of Bugis Junction Scholarship recipient Mr Lee Jung Wei.\nBaker Tilly TFW Scholarship recipient, Mr Muhammad Danial Hadi Bin Zainuddin (second from right) with his family members and Prof Yaacob Ibrahim, Advisor, SIT (extreme right). The year 2018 has been especially good\nfor SIT’s students, who have received overwhelming support and encouragement from SIT’s donors.\nSIT’s Recognition of Excellence (ROE)\npresentation celebrates the achievements of high-performing students. At this year’s ROE, which was held at the SIT@Dover\nAuditorium on 1 November 2018, these\nSITizens received their donor-supported\nawards and scholarships in the presence of their loved ones, faculty and staff, SIT’s\nfriends from the industry as well as the\ndonors themselves. A total of 59 Book\nPrizes, Awards and Gold Medals, and 134\nThe Four Seasons Hotel Book Prize in Fundamentals of Hospitality Business recipient,\nMr Sky Quah (left), enjoying the post-ceremony reception with guests from Four Seasons\nHotel Singapore (from left): Ms Audrey Chin, Director of People and Culture; Ms Karene\nLim, Learning Manager; and Mr Richmond Kok, Asst Director of People and Culture.\nMr Sam Chew, Senior Manager, Centre for Strategic Infocomm Technologies, viewing a special sensory exhibit at the ceremony. The exhibit contained\nheartfelt thank you videos and messages from the award recipients.\nMr Tay Thiam Peng, Head, Special Projects, Wilmar International, (third from\nright) speak to recipients of both the KKH and Wilmar Scholarships together\nwith Mr Chan Wing Leong, Deputy President (Administration) & CFO (third\nfrom left).\nnon-bonded scholarships were presented, more than twice the\nnumber presented at last year’s ROE.\nIn his welcoming remarks, Prof Loh Han Tong, Deputy President\n(Academic) & Provost, SIT, said to the recipients, “When you go on stage today, you will be receiving more than a prize or a scholarship; you will also become the custodian of our donors’ shared hopes – that from being excellent yourself, you will then go on to become a multiplier of ability and excellence in the community. Hence,\nI hope you will treasure what you receive today, and aspire to paying it forward in whichever way you can – with your know-how, your influence, or your resources.”\nProf Tan Thiam Soon, President, SIT, talked about how the gifts of\nSIT donors have helped to build a cycle of positive relationships.\n“For our award and scholarship recipients who are here today, their\nrelationship with the community begins sweetly with them being\nat the receiving end of generous support from you – our donors.\nI know they are all looking forward to meeting and thanking you in just a little while.”\nHe said he hoped that this recognition would inspire the recipients\n“to seek excellence throughout life”, adding, “Whether you are a first-year student receiving a scholarship or an award recipient who has just completed your studies, you will remain a SITizen Mr Lewis Tan, second-year Sustainable Infrastructure Engineering\n(Land) student who received the Tan Sri (Dr) Tan Chin Tuan Scholarship, is one of the first students from SIT to win a medal at the WorldSkills Singapore Competition. He said the scholarship has inspired him to achieve more than he ever thought he could. “I would like to express my sincere gratitude to my donors from the Tan Chin Tuan Foundation. Your generosity has inspired me to go even further from my current point in SIT. The reason why I am here today is not because of my success but because of my countless failures I had to go through and the support I had received from the people around me. I’d also like to express my thanks to all the donors whose encouragement has helped inspire students in SIT to reach greater heights in future.”\nfor life and it is my hope\nthat you continue to do us proud.”\nSiTIZEN  |  10/16\nSIT student athletes secured the university‘s first gold\nmedals at the Singapore University Games (SUniG), which took place from September to mid-October 2018. There was much pride and jubilation on display when both SIT CueSports and Tchoukball (Women) teams emerged champions in their respective tournaments.\nOverall, SIT emerged as second runner-up among\nparticipating institutions – another first for SIT. Other impressive wins by SIT student athletes include three silver First Golds at Singapore University Games 2018\nSIT CueSports and Tchoukball team victories bring jubilation\nThe CueSports (9-Ball Pool) team (top) and the Tchoukball (Women) team (right) successfully clinched the university‘s first\ngold medals at SUniG.\nParticipants took to the hot seat and were taught how to quickly and easily identify the best colours of\nclothing to match their skin tone and features.\nThe hours passed quickly for the students who\nsoaked up every fun moment of the class.Improving communication, personal branding and entrepreneurial skills have\nbecome possible in a big way for SIT students with The Mapletree Challenge. The new three-part Challenge will include job interview and presentation masterclasses conducted by leading corporate trainers, as well as an innovation and entrepreneurship forum where participants can share ideas with top industry leaders. These will culminate in The Mapletree Challenge Grand Final, where student teams can pitch impactful ideas for sustainable innovations to win attractive prizes.\nThe Mapletree Challenge is the first programme of its kind at SIT, and was\nsupported by a gift from Mapletree Investments Pte Ltd. Mapletree has also nurtured SIT undergraduates across all degree programmes through the endowed Mapletree Bursary since 2014.\nA total of 237 students across SIT campuses took part in the first round of Job\nInterview & Presentation Masterclasses on 31 October 2018. The classes were conducted by award-winning branding consultancy and lifeskills training academy, Lionel Lim Lifestyle Works. Students were taught the fundamental concepts of personal grooming and presentation, building their personal brand, and how to convey their own unique story of personal transformation and success to others.\nMs Sun Yiwen, Year 1 undergraduate from the Sustainable Infrastructure\nEngineering (Building Services) programme, said: “Nowadays, good presentation is needed everywhere, and even daily conversations with people can be counted as an informal presentation.” She added that she had committed to memory the three steps she had learnt from the masterclass: knowing who her target audience is, thinking of what solution she can provide to them, and giving evidence to support her presentation.SIT students get transformative lessons in personal branding\nand communication to create the perfect business pitch\nthrough a new three-part challenge, supported by Mapletree\nInvestments Pte LtdThe Call of The Mapletree Challenge\nmedals for the Bowling Singles (solo) Category, Bowling\nMaster (solo) Category and Handball Men‘s Category; and two bronze medals for the Tchoukball Men‘s Category and Floorball Men‘s Category.\n“We are elated that our months of practice have paid off. It\nwas an exhilarating experience being part of SUniG, and the icing on the cake is that we have etched ourselves into the university‘s milestones,“ said Mr Htut Elnaam, President, SIT CueSports and Year 2 Physiotherapy student.The next run of the masterclass is scheduled for January 2019 whereas the innovation and entrepreneurship forum will take place in March 2019. The Mapletree Challenge Grand Final is scheduled to take place in May 2019.\nA team of five SITizens flew the SIT flag high by\nbagging a Commendation Award at the inaugural Smart Bus Challenge organised by the Land Transport Authority (LTA).\nFrom left: Assoc Prof Zheng Jianxin, Mr Kenny Quah, Ms Kwek Yi Huay,\nMr Donovan Koh, Ms Chong Ya Ting, Ms Audrey Lim, and Senior Lecturer\nDan Chia Wei Ming.Prize in Sight\nAn SIT student team makes their mark\nat an inaugural Land Transport Authority\ncompetition with sensors for bus drivers\nto view their blind spots\nThe team‘s proposal earned them a cash prize of $1,000,\nbeating over 90 entrants from post-secondary institutes of learning and emerging amongst the Top 10 Finalists.\nEntitled, ‘Safe Sight System‘, the idea uses smart technology\nlight-display sensors for bus drivers to view their blind spots, increasing their sense of spatial awareness. It is designed for use on buses, given their manoeuvring difficulties due to their large sizes. In addition, the system is able to provide precise visual cues to warn drivers of hazards from all blind spots, which in turn, would significantly reduce driving stress and increase safety on the roads.\nThe team of Year 3 Telematics (Intelligent Transportation\nSystems Engineering) students comprised Ms Audrey Lim Xin Hui, Ms Chong Ya Ting, Mr Donovan Koh Cheng Huang, Mr Kenny Quah Kok Siong and Ms Kwek Yi Huay.\n“Our aim was to put forward an idea that is practical and\neasy to implement, without the need to radically change the existing framework of buses,“ said team leader, Donovan.\nAssoc Prof Zheng Jianxin, who supervised the team together\nwith Senior Lecturer Dan Chia Wei Ming, said, “I am excited that our students were able to apply smart technology and create an innovative idea to minimise risks of accidents for LTA. As Singapore continues to look into introducing autonomous vehicles and smart technology on the road, we have to constantly look into upgrading safety measures.“Mr Teo Hock Chwee, Managing Director, T T J Design and Engineering\nPte Ltd (left) and Prof Tan Thiam Soon, President, SIT, at the Technical\nSeminar on 23 October 2018.Thanks to an endowed gift from T T J Design and Engineering\nPte Ltd, financially disadvantaged students from the Civil Engineering degree programme (offered jointly by Singapore Institute of Technology and University of Glasgow) can count on financial support when they head for their compulsory Overseas Immersion Programme (OIP) in Glasgow.\nThe structural steel specialist with businesses in Singapore,\nMalaysia and the Middle East has made possible the T T J Design and Engineering Overseas Immersion Programme Grant at SIT. Valued at $4,000 each, at least five grants will be awarded annually and in perpetuity. The OIP Grant will help recipients with part of their expenses for the compulsory programme, which is expected to cost between $4,500 and $5,500. The intensive three-week OIP will include workshops to prepare the students for their final-year dissertation projects as well as group project-based subjects covering both conceptual and detailed aspects of design.\nMr Teo Hock Chwee, Managing Director of T T J Design and\nEngineering, said that the company is “very pleased to be able to support SIT.” He added, “It is important to us that young talents are nurtured for the industry so that they can build on our collective experience to bring in new perspectives and new ideas.”\nMr Teo presented the cheque from the company to Prof Tan\nThiam Soon, President, SIT, at the Civil Engineering Technical Seminar on Innovative Design and Construction of Composite Steel-Concrete Structures held at SIT on 23 October 2018. T T J Endowed gift from T T J Design and Engineering Pte Ltd makes possible an Overseas\nImmersion Programme Grant for Civil Engineering studentsTicket to Overseas Learning in Glasgow\nhas also collaborated with SIT on applied research\nto develop a design handbook on HISTEEL, which was launched during the seminar. The half-day seminar, attended by more than 300 industry practitioners, was co-organised by SITLEARN Professional Development and T T J Design and Engineering Pte Ltd.SiTIZEN  |  11/16\nSiTIZEN  |  12/16 SiTIZEN  |  13/16\nAfter the gruelling years of\nsleepless nights and back-to-back assignments, they had finally reached the long-awaited milestone of graduation, and the time had come for the Class of 2018 to celebrate at the New Alumni Welcome Party on 9 November 2018.\nThis year marks SIT’s seventh New\nAlumni Welcome Party, held at the Hard Rock Café in Orchard. Over 260 brand new alumni, SIT Senior Management, faculty and staff, as well as representatives from SIT’s Overseas University Partners came down to party the night away. Prof Ng Siu Choon, Associate Provost (Students), welcomed the alumni with a celebratory toast. The buffet lines opened at 8pm, and as the attendees indulged in the food, they were entertained Rock ‘n’ Rollin’ The Night AwayThe Class of 2018 brought the house down with some\nclassic rock tunes at the New Alumni Welcome Party 2018\nThe Class of 2018 can’t wait to kick off the party!\nWith food, drinks, and friends, SITizens are ready for a great night out.\nHungry SITizens loaded up their plates with delicious food as soon as the buffet lines\nwere open. Among the prizes that SITizens won during ice-breaking games were useful household items. The party was a chance for these alumni to make some new memories.\nIt’s not a party without a party train on the dancefloor. Muzeka, SIT's student band, makes their appearance with popular hits.\nMr Skye Tan and Ms Denise Lim let loose with some impressive moves to Jive Talking.The three big winners of the night; First Prize (top): Ms Wong Wen Qi, winning an Apple Watch Series 4, Second Prize (left): Mr Khoo Wei Chin, winning a Dyson Supersonic Hair Dryer, and Third\nPrize: Ms Jade Tan, winning a GoPro Hero 7 Silver. Mr Khoo swapped his prize with Ms Tan for\nobvious reasons.With classic rock hits performed by Jive Talking, the alumni just had to get to their feet and headbang along to the beat.\nby SIT’s student band Muzeka, livening up the party\natmosphere with popular hits such as “This is Gospel” by Panic! At The Disco and “It’s My Life” by Bon Jovi. The fun continued with comedian Rishi Budhrani, who engaged the crowd with his stand-up comedy act and pulled some volunteers to do a “traditional” Bollywood dance with him.\nBefore announcing the lucky draw winners, it was time\nto hit the dancefloor as Hard Rock’s popular resident band Jive Talking took the stage. Mr Skye Tan, who graduated from the Hospitality Business programme and is also a member of Dancesport, was the first to show off some impressive moves. “I think most people are shy to dance because they don’t know how, so I just grabbed another dancer to dance!” he said. In what appears to be becoming Alumni Party tradition, SITizens formed a dancing human train, travelling all over the dancefloor and even joining Jive Talking on stage.\nMr Khoo Wei Chin, who graduated with an Accountancy\ndegree, was one of the Grand Draw winners, walking away with a Dyson Supersonic Hair Dryer. “I felt really lucky as that was actually the first time I have won any top lucky draw prizes,” he said. However, having very short hair, he ended up trading his prize with Ms Jade Tan, who won a GoPro Hero 7.\nThe hype was never-ending as Jive Talking returned to\nthe stage and brought the crowd on a trip back to the 80s with classic hits such as “Living On A Prayer” and “I Love Rock ‘n’ Roll”. Said Mr Khairul Anshar Bin Ibrahim, a Mechatronics alumnus, “Everybody was having lots of fun, including me and my mates. Hard Rock has one of the best ambience and the bands were great!”\nSiTIZEN  |  14/16\nMore than 1,000 new students attended the two SIT Student\nOrientation Camps which were held from 20-21 July 2018 and from 23-25 August 2018. Both camps were held at SIT@Dover with freshmen across all degree programmes taking part and learning more about SIT.\nMs Tan Lee Ann Nastassha, from the Criminology and\nSecurity programme, was happy to have found new friends through Orientation. “I was really impressed with the effectiveness of the games in allowing me to make new friends, despite only having 54 hours together!” she said. A highlight of both camps was the inaugural Amazing Race, where the freshmen competed with each other in a series of challenges across four SIT campuses.\nOrientation concluded with the annual Student Club Fair\non 25 August, bringing all freshmen together to discover the vibrant student community at SIT, and the wide\nFour alumni SITizens came back to SIT@Dover on\n25 August to specially engage with new SITizens at the Advancement & Alumni Division booth at the Student Club Fair. As they had previously volunteered as Student Hosts when they were undergraduates, they helped to recruit new Student Hosts to help out at SIT’s advancement and alumni events. They also answered queries about the additional funding available for student projects or events involving alumni.\nThe funding, which is available to Student Clubs, and\nStudent Management Committees (SMCs) is meant to\nhelp supplement funds for selected student-organised events and projects, as long as they involve alumni participation. Successful application will receive funding of up to $1,000 per event or project.\nAt the Student Club Fair, part of SIT’s Orientation activities, alumnus Ms Ong\nWen Hui (in white polo tee) fields questions about the additional funding\navailable for student activities involving alumni participation.At Day Zero, SITizens had the chance to bond with their fellow course mates and\nfind out more about what they can expect during their academic life at SIT. Campers going all out as they cheered together at Student Orientation.New Year, New SITizens…\nAnd Some Old Ones\nOnce a SITizen…SIT’s 2,660 brand new ‘freshies’ received a fun-filled welcome as they begin their\nuniversity journey\nvariety of clubs and interest groups available. A total of\n80 booths were set up and dance, music, and martial arts performances added to the carnival-like atmosphere. “I like that the seniors approached me and talked to me,” said Mr Filian Lee, a freshmen from the Telematics programme. “It showed that they are welcoming and want me to be part of their club!”\nFor students from both SIT-conferred and joint-degree\nprogrammes, Day Zero on 31 August marked the start of their academic year. They got to meet their professors and seniors to learn more about their respective courses, and enjoy a day of team-bonding activities. The students also had the chance to meet popular Singaporean YouTubers, Night Owl Cinematics (NOC). They shared their experiences about finding one’s passion, achieving their dreams, and sparking innovative ideas.\nTo find out more, contact the Advancement & Alumni\nDivision at Alumni@SingaporeTech.edu.sg\nSIT Alumni Card BenefitsSiTIZEN  |  15/16\nThe SIT Alumni Leisure Network greeted 38 alumni with the\nintoxicating aroma of coffee when they attended the Coffee Appreciation Workshop at Bettr Barista Coffee Academy on 1 September 2018. Led by experienced trainers, the afternoon kicked off with an introduction to the history of coffee and its origins, and the process of how coffee is grown and made. Participants learned about the differences between specialty coffee and ‘Kopi-O‘, including the types and coarseness of beans used such as the difference between Arabica and Robusta beans and equipment required.\nThey were also educated in ‘The Art of Aroma Perception‘,\nwhere they tested their sense of smell by attempting to identify various flavours from bottled scents. These range from familiar scents such as vanilla and dark chocolate to more unconventional ones such as rice, potato and even pepper. The baristas also demonstrated different hand-brew methods such as using Aerobie Aeropress and v60, and how each brought out different flavours.\nSaid Hotel Administration alumnus and coffee lover Ms\nKang Zhi Ting, “Not only did we get to taste the hand-SITizens observe how to brew coffee using the V60.\nMs Purdey Loh tries pouring her own latte as the other alumni eagerly await\ntheir turn.Showing off their very own latte art that they poured with guidance from the instructors!Pouring Their Hearts Into Caffeine\nSITizens learn about the difference between specialty coffee and ‘Kopi-O’ as they take a course\nin coffee appreciation\nScan to check out the latest\nmerchant discounts!\nbrewed coffee, but we also learned about the origins and\nthe end-to-end process of coffee making. I especially enjoyed the interactive sense game, even though we mostly guessed wrong on the different scents.”\nThe highlight of the afternoon was when the participants got\nto try their hand at pouring latte art patterns, from a simple heart to a more complicated tulip with guidance from the baristas. “The instructor guided my hands and controlled my movements, which resulted in a decent looking cup,” said Ms Audrey Leong, who graduated from Newcastle University‘s Food & Nutrition programme. “It allowed me to appreciate the amount of hard work each barista puts into practising the art.”"
}